{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": []
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=186361",
          "author": "Chris Thompson",
          "description": "Simeon Woods Richardson, starting pitcher for the Minnesota Twins, was preparing to throw his 108th pitch of the evening Monday night when something went wrong. Before we get there, I'd just like to say that this was gutsy, heroic shit from Woods Richardson, who had only once before topped 100 pitches in a major-league appearance. He was not having a particularly good time Tuesday night, having allowed 12 base runners and four runs, but the Twins are playing like crap, and their bullpen is pretty well shredded. Baseball tradition sometimes makes it the job of a starting pitcher to climb back up the mound, at or past the best-if-used-by date of their throwing arm, and guile their way to another out or two, not to win a game but simply to bring a game that much closer to completion, while sp…",
          "link": "https://defector.com/stumbling-minnesota-twins-struggle-with-clocks-gizmos-rules-and-authority",
          "publishedOn": "2025-04-08T15:41:17.000Z",
          "wordCount": 9027,
          "title": "Stumbling Minnesota Twins Struggle With Clocks, Gizmos, Rules, And Authority",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2208530373.jpg"
        },
        {
          "id": "https://defector.com/?p=186365",
          "author": "Dan Brooks",
          "description": "On March 26, the official White House Twitter account posted a photo of Vice President JD Vance aiming a military rifle with the caption “Just the Vice President of the United States sending some freedom seeds downrange. Doesn’t get more American than that.” Presumably this image inspired the millions of Americans who love guns and wanted to see a ranking executive shoot them, just as previous administrators inspired Americans who love golf (W. Bush), jogging (Clinton), and coercive sex (Clinton). \n“Freedom seeds,” though, caused at least one American to shrivel up inside. I would call it a euphemism, but a euphemism is supposed to sound better than what it replaces. “Freedom seeds” manages to sound both dumb and effortful at the same time, committing the cardinal sin of written communication by calling attention to the writer’s “cleverness”—here I am making scare quotes so hard that the dog has run out of the room—at the expense of clarity. Readers can understand what the White House is trying to say, but we have to waste a second to supply the shorter and more familiar word “bullets.”",
          "link": "https://defector.com/american-freedom",
          "publishedOn": "2025-04-08T15:23:45.000Z",
          "wordCount": 8832,
          "title": "American Freedom",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2207051862.jpg"
        },
        {
          "id": "https://defector.com/?p=186122",
          "author": "Diana Moskovitz",
          "description": "The U.S. Department of Education announced on Friday that it will be creating what it called a \"Title IX Special Investigations Team\" that would be dedicated to swiftly resolving complaints about trans female athletes in sports. It was the sort of announcement the Trump administration has made nearly every day since taking office months ago—high-flown, vague, aligned with a conservative media fixation, and ominous. Just as telling as anything in the announcement was what was missing from it: facts.\nThe announcement contained no information about exactly how many complaints the department had received about trans athletes. (Two? Five? Twenty?) It did not say who filed these complaints. (Parents? Students? Teachers?) It did not say when those complaints were received. It did not even bother to say what those complaints were about, beyond some extremely ambiguous, predictably overheated language referring to \"pernicious effects of gender ideology in school programs and activities.\" Anyone looking for something as basic to democracy as public accountability from a public agency would have to look elsewhere.",
          "link": "https://defector.com/title-ix-is-now-a-weapon-in-the-trump-administrations-culture-war",
          "publishedOn": "2025-04-08T14:57:00.000Z",
          "wordCount": 8212,
          "title": "Title IX Is Now A Weapon In The Trump Administration’s Culture War",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2206185094-e1743903243619.jpeg"
        },
        {
          "id": "https://defector.com/?p=186092",
          "author": "Billy Haisley",
          "description": "Brazilian funk, at least out on the radical, thrilling, ear-frying, brain-scrambling fringes, is primarily a producer's genre. It's not that the songs are mostly instrumental. Vocals are a critical part of the sound, the defining examples being the endlessly repeated stabs of short words or phrases—\"Vai, vai\"; \"Toma, toma\"; \"Fode, fode\"; \"Pega, pega\"; \"Vuk vuk\" (maybe don't look up what those last few mean in English if you're at work)—that basically are to funk what the hi-hat triplet is to trap. In addition to those stock adlibs and the omnipresent DJ drops, funk tracks typically feature at least one and usually a few vocalists rhythmically croaking out verses beneath the chirps and blares and clangs of the beat, and certain sub-scenes, like funk ostentação, are in fact rapper-centric.\nNevertheless, vocals are primarily a resource for the funk DJ/producer. You can see this even in how the music is made. Listen to enough funk, and you'll inevitably find a verse you first encountered in one song showing up elsewhere, and potentially several different elsewheres. This is because the custom is for rappers to upload a cappellas online for free, which DJs then take and edit as they please. The consistency of funk's rhythmic patterns makes this kind of splicing together of various verses pretty seamless, and there's no stigma to reusing a good a cappella that someone else has gotten to first. But as is their approach to music more generally, funk producers love to deconstruct vocals and play with parts. DJ Ramemes mentioned in an interview once that rappers are sometimes annoyed when they learn he's used one of their verses for a song, as he is prone to snip out all but a couple choice lines, distort them, rearrange them, and weave the frayed strands into his frenzied aural tapestries. And Ramemes is closer to the norm in funk, where the DJ is almost always sovereign.",
          "link": "https://defector.com/mc-ktrines-rapping-is-a-gift-to-brazilian-funk",
          "publishedOn": "2025-04-08T14:17:15.000Z",
          "wordCount": 9347,
          "title": "MC Ktrine’s Rapping Is A Gift To Brazilian Funk",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/Screenshot-2025-04-07-at-9.24.51 AM.jpg"
        },
        {
          "id": "https://defector.com/?p=186358",
          "author": "Ray Ratto",
          "description": "The end of Monday's NCAA National Championship Game between Florida and Houston had brief moments of retrograde brilliance but ended as an entirely justified mess. This can reasonably be said of many if not most college basketball games, but in this last college basketball game of the season there was one reason that superseded all the others. \n\nhttps://bsky.app/profile/houstonchronicle.com/post/3lmbfkxyrh22q",
          "link": "https://defector.com/florida-didnt-lose-the-national-championship",
          "publishedOn": "2025-04-08T13:19:10.000Z",
          "wordCount": 7888,
          "title": "Florida Didn’t Lose The National Championship",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2209103079.jpg"
        },
        {
          "id": "https://defector.com/?p=186337",
          "author": "Alex Sujong Laughlin",
          "description": "The third season of The White Lotus ends with guests speeding away from the resort on a boat while the staff wave at them, placid and obliging. In Season 1, Natasha Rothwell’s Belinda was among the staff charged with sublimating their identities to avoid being “too specific as a presence,” as Murray Bartlett’s Armond explains in the pilot. “It’s a Japanese ethos where we are asked to disappear behind our masks as pleasant, interchangeable helpers.” \nBy the end of the third season, though, it’s Belinda who is on the boat, pockets newly deep, speeding away from a crew of waving staff members stranded on the beach.",
          "link": "https://defector.com/white-lotus-season-3-finale-belinda",
          "publishedOn": "2025-04-07T20:02:37.000Z",
          "wordCount": 7663,
          "title": "It Is Time To Close Down The White Lotus",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/Screen-Shot-2025-04-07-at-3.28.46-PM.png"
        },
        {
          "id": "https://defector.com/?p=186292",
          "author": "Patrick Redford",
          "description": "In the fourth quarter of last Friday's Thunder-Rockets game, Shai Gilgeous-Alexander executed perhaps the NBA's single most-executed action and drove to the basket. One aspect of OKC's double-big lineup that makes defending the group particularly demanding is the unique threat that each of the two bigs presents as a screener; you can see on the following play how Isaiah Hartenstein's ghost screen forces Amen Thompson out to Gilgeous-Alexander's outside hip, and how he and Chet Holmgren arcing down to the block keeps either Alperen Sengun or Jabari Smith Jr. from helping. This action forces one player to defend Gilgeous-Alexander's drive from a disadvantageous position, which has been a death sentence for almost every single defender, all year.\nNot Thompson. He stuck with the slithery Thunder guard, kept him from fully turning the corner or baiting a foul, and rejected his midrange jumper.",
          "link": "https://defector.com/amen-thompson-breaks-the-game",
          "publishedOn": "2025-04-07T18:04:55.000Z",
          "wordCount": 7909,
          "title": "Amen Thompson Breaks The Game",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2198091244.jpg"
        },
        {
          "id": "https://defector.com/?p=186253",
          "author": "Luis Paez-Pumar",
          "description": "PHILADELPHIA - When I was first getting into wrestling, as a wee lad of about nine or ten, I had to beg my parents to let me buy the big pay-per-views in what was then the WWF. The names are still synonymous with Big Wrestling Pay-Per-View: Royal Rumble, SummerSlam, Survivor Series, WrestleMania. These shows felt like the biggest events in my young world, and I was always enraptured for the entire duration. I was too young to discern things like \"match quality\" and \"pacing,\" and too excited to care. I just wanted to see Stone Cold Steve Austin beat the shit out of Vince McMahon. Even with the boundless energy of a kid, my emotions ran so high that I would be exhausted just from watching. After I stayed up somewhat late on a Sunday night for a PPV, the following Monday at school was split evenly between yapping with my friends about the show and wanting to take a nap.\nI bring all this up because it now seems almost quaint that a three-hour WWF/E show used to induce a placid state of overawed sleepiness. As I write this, the morning after I attended to All Elite Wrestling's Dynasty show at Temple University's basketball arena on Sunday night, I am struggling for something like the opposite reason. Dynasty is safely considered a B-show for AEW; it's between two of its own big shows, March's Revolution and Memorial Day Weekend's Double or Nothing, and as such it should be okay for Dynasty to serve more as an exhibition than an all-time great show. That clearly wasn't the aim from wrestling's no. 2 company, and the over-stuffed, near-endless show that we got on Sunday delivered exhausting proof of that.",
          "link": "https://defector.com/wrestling-shows-dont-all-have-to-aim-for-epic",
          "publishedOn": "2025-04-07T17:49:13.000Z",
          "wordCount": 12054,
          "title": "Wrestling Shows Don’t All Have To Aim For “Epic”",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/IMG_3564.png"
        },
        {
          "id": "https://defector.com/?p=185908",
          "author": "Dave McKenna",
          "description": "I'm not much of a TV guy. Sure, I’ll grab the remote and a seat on the couch for any live sports broadcast. But the last scripted series I watched was Derry Girls, and only because I had a pending work trip to Ireland and hoped it would prepare me for the brogues I’d encounter. (Not much. But, what a show!)\nBut I broke my fast to watch Zero Day, the prestige TV poli-sci-fi thriller starring Robert DeNiro and Angela Bassett. Nothing against the Oscar winners, but they weren’t what drew me. I was only there for the return of Dave McKenna. Or, rather, \"Dave McKenna.\"",
          "link": "https://defector.com/my-friend-has-been-naming-shitty-tv-characters-after-me-for-20-years",
          "publishedOn": "2025-04-07T16:55:50.000Z",
          "wordCount": 9592,
          "title": "My Friend Has Been Naming Shitty TV Characters After Me For 20 Years",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/Screenshot-2025-04-04-at-11.53.47 AM.png"
        },
        {
          "id": "https://defector.com/?p=186290",
          "author": "Chris Thompson",
          "description": "Victor Robles of the Seattle Mariners was carted off in the ninth inning of Sunday's game against the San Francisco Giants. Robles tracked a fly ball off the bat of Patrick Bailey deep into the right-field corner, sprinting 113 feet in just over six seconds and then laying out into the netting over the wall in foul territory. Incredibly, Robles somehow came down with the ball, although the catch had to survive a replay challenge from the Giants. This was an amazing feat of athleticism, to say nothing of bravery and hustle and all the rest.\nRobles's catch did not make MLB's daily top plays compilation, and I can think of two possible reasons why: For one, by crashing into the netting to haul down a foul ball, Robles made it possible for San Francisco's Luis Matos to tag and advance on what would've otherwise been a dead ball. This wound up mattering a lot one pitch later, when Wilmer Flores chopped a grounder through the right side of the infield and Matos trotted home to score what would be the game-winning run. For another, and more importantly, Robles fucked himself up pretty bad on the catch and had to be carted off the field; it was everything he could do after coming down to flip the ball in the direction of the infield and prevent Matos from coming all the way around to score on the fly-out. Perhaps MLB's clip editors aren't very comfortable adding to a celebratory highlight compilation a play that ends with a guy writhing in agony:",
          "link": "https://defector.com/victor-robles-demonstrates-what-trying-can-get-you",
          "publishedOn": "2025-04-07T16:31:09.000Z",
          "wordCount": 7472,
          "title": "Victor Robles Demonstrates What Trying Can Get You",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2208353801.jpg"
        },
        {
          "id": "https://defector.com/?p=186171",
          "author": "Maitreyi Anantharaman",
          "description": "Buckle up: It's time for the Monday crossword. This week's puzzle was constructed by Brian Callahan and edited by Hoang-Kim Vu. Brian (he/him) is a pub trivia fan and dog dad from Chicago. In addition to editing and mentoring for AVCX’s midi arm, Lil AVCX, he occasionally posts puzzles on his blog, oliogrids.com\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE. Note that we're pausing open submissions until April 18.",
          "link": "https://defector.com/the-crossword-april-7-block-by-block",
          "publishedOn": "2025-04-07T15:40:40.000Z",
          "wordCount": 4858,
          "title": "The Crossword, April 7: Block By Block",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2190651919.jpg"
        },
        {
          "id": "https://defector.com/?p=186240",
          "author": "Barry Petchesky",
          "description": "You could tell he wanted this. Not that he ever made much secret of that—he's got a goalscorer's heart, and the logical conclusion of scoring goals, if you're great and prolific and ageless, is that you end up with more goals than anyone else has ever scored. But as Alexander Ovechkin finally passed Wayne Gretzky in the marathon chase that never stopped being a sprint, he let his desire and pleasure say it all. There was a little extra oomph in his wrister, from his office in the top of the left circle, off a cross-ice feed to beat Ilya Sorokin through traffic. A little extra violence as he uncoiled, a little extra body English on the follow-through, because an extra mile per hour or two can be the difference between a score and a save, and he smelled blood, and he wanted to finish it there and then. Then, when goal 895 was safely in the twine, Ovechkin allowed himself to take his eyes off goal, turned back up ice, and sprawled on his stomach as the Capitals swarmed him at center ice.\n\nhttps://www.youtube.com/watch?v=9xd8pB72yMQ",
          "link": "https://defector.com/alex-ovechkin-scores",
          "publishedOn": "2025-04-07T14:14:06.000Z",
          "wordCount": 7031,
          "title": "Alex Ovechkin Scores",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2208915297-1.jpg"
        },
        {
          "id": "https://defector.com/?p=186232",
          "author": "Maitreyi Anantharaman",
          "description": "TAMPA, Fla. — On the keen, soulful UConn women’s basketball internet, Azzi Fudd is “the people’s princess.” She carries herself with regal grace. She’s kind to her young superfans. By teammates’ accounts, she can do no wrong in the eyes of Geno Auriemma. But even fairytales have dark beginnings. A poison apple (or poison Brussels sprouts) marred Fudd’s first trip to the national championship game in her freshman season. As a junior, she was cursed with a second ACL tear in five years, this one right after teammate Paige Bueckers tore hers. “To say that these four years have not gone according to plan or according to how we thought it would go, I would say, is to put it lightly,” Fudd said with a chuckle on Saturday afternoon, calm but hungry before the national championship game. \nOn Sunday, the princess rescued herself and brought some peace to the kingdom. Fudd logged 24 points, five rebounds and three steals in an 82-59 win over South Carolina that gave UConn the program’s 12th NCAA championship and its first in nine years. For her vital two-way play in Sunday’s game and in Friday’s game against UCLA, the redshirt junior was voted the Final Four’s Most Outstanding Player.",
          "link": "https://defector.com/azzi-fudd-and-the-huskies-finally-got-their-crowning-moment",
          "publishedOn": "2025-04-07T13:39:08.000Z",
          "wordCount": 7335,
          "title": "Azzi Fudd And The Huskies Finally Got Their Crowning Moment",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2208882369.jpg"
        },
        {
          "id": "https://defector.com/?p=186170",
          "author": "Kathryn Xu",
          "description": "The focus would have been on the Red Bulls no matter the outcome of the Japanese Grand Prix, but thankfully for Christian Horner and company, Max Verstappen at least dragged the attention, however briefly, away from the mess made in the second seat. His weekend was an instant classic on a track that the commentators repeatedly referred to as \"historic\" and \"old-school.\" You could almost forget that Red Bull had dumped Liam Lawson for Yuki Tsunoda just two races into the season. For just one moment, this weekend wasn't about that.\nVerstappen had some help along the way. Suzuka made it easy; his McLaren competitors behind him made it easier. The earlier sessions of the weekend were marked by constant red flags due to grass fires, but on the day of the race, rain poured heavily. The rain didn't stick around long enough for a wet weather race, but it did cool track temperatures until tire degradation was barely a concern—as an added bonus, the cars were running the three hardest compounds of tire available to them—and the probability of grass fires was down to zero. The historic nature of the track was evident in its lone DRS zone and narrow breadth. Both made it difficult for drivers to overtake and turned the race into an exceedingly polite formality; there wasn't much race to go around.",
          "link": "https://defector.com/no-matter-the-car-max-verstappen-is-inevitable",
          "publishedOn": "2025-04-07T13:10:37.000Z",
          "wordCount": 9551,
          "title": "No Matter The Car, Max Verstappen Is Inevitable",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/maxVerstappenSuzuka.jpg"
        },
        {
          "id": "https://defector.com/?p=186167",
          "author": "Sabrina Imbler",
          "description": "The two-lined hooktip moth lays its eggs in even rows on twigs and leaves of birch and alder trees. When the eggs hatch, almost inscrutably small larvae emerge, some as short as half a millimeter. But the newborns, called warty birch caterpillars, have a serious task at hand. Despite not even being snack-sized, the caterpillars are easy pickings. Unlike other caterpillars, they do not build shelters, live in groups, or live inside leaves like the extremely flat larvae or some other fliers. Instead, newborn warty birch caterpillars march their itty-bitty bodies to a leaf of their own, which they will defend against any intruder, adult or baby, who happens to wander by.\nAt least, this is what Jayne Yack, a neuroethologist at Carleton University in Ottowa, suspected. In a 2008 paper, Yack and colleagues observed that freshly hatched warty birch caterpillars lived alone on leaves and produced two kinds of vibrations, which they employed in minutes-long duels with other caterpillars. Now, in a paper recently published in the Journal of Experimental Biology, Yack and a team of researchers have confirmed the unusually territorial nature of the caterpillars and described their vibrational defense mechanisms, which are surprisingly feisty for a creature smaller than a grain of rice.",
          "link": "https://defector.com/this-leaf-tip-aint-big-enough-for-the-two-of-us",
          "publishedOn": "2025-04-06T22:30:00.000Z",
          "wordCount": 6974,
          "title": "This Leaf Tip Ain’t Big Enough For The Two Of Us",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/ezgif.com-optimize.gif"
        },
        {
          "id": "https://defector.com/?p=186151",
          "author": "Justin Ellis",
          "description": "There was no question it would be Cooper Flagg's shot. How could it not be? In a season where the Duke freshman was celebrated as one of the best players in the country, a prospect with boyish charm and a monster on both ends of the court, there was no question who would have the ball in his hands as Duke's national title hopes were on the line with less than 18 seconds left in the semifinal.\nFlagg came off a screen and took the pass from Kon Knueppel just above the three point line, but Houston's J'Wan Roberts was with him step for step. Fighting his way into the paint, Flagg rose for a jumper from the elbow that met its end at the front of the rim, another Cougars defensive rebound on the night.",
          "link": "https://defector.com/houston-showed-why-you-play-to-the-final-buzzer",
          "publishedOn": "2025-04-06T21:54:14.000Z",
          "wordCount": 7891,
          "title": "Houston Showed Why You Play To The Final Buzzer",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2208749145.jpg"
        },
        {
          "id": "https://defector.com/?p=186143",
          "author": "Sabrina Imbler",
          "description": "After a month of dismantling more than $180 million in national research on trans health, meaning research in support of the health of trans people, the White House has reportedly directed the National Institutes of Health to conduct \"research\" on the \"regret\" people may feel after transitioning, Max Kozlov reported Friday in Nature. I say \"research\" because this directive will not actually fund any research, but rather spawn propaganda. Matthew Memoli, an infectious diseases researcher who served as acting director of the NIH, who, incredibly, at one point refused to be vaccinated against COVID-19, wrote an email to the NIH directing that new research be funded in \"a few specific areas,\" including the “chemical and surgical mutilation” of children and adults—the conservative colloquialism for gender-affirming care and surgery—and social transition, in which a person transitions with no medical intervention.\nIt feels almost stupid to state the obvious—which feels increasingly less like a risk, as no major national publication has covered this new directive after Nature's scoop—this is not how research is done. This is not bad science; it's not science. Science is driven by open inquiry, not fixed outcomes. Funneling money into \"research\" to find evidence of a predetermined belief will not result in any actual science, but rather disinformation disguised as science. It feels equally stupid to point out the irony that the Department of Health and Human Services told Kozlov that, \"NIH is prioritizing research that serves the best interests of public health, not ideological agendas, and will continue to support studies that provide clear, objective data — particularly regarding the long-term effects of gender transitions.\" The ongoing research on trans health was not ideological, as HHS claims, but rather driven by curiosity and a fundamental belief that all people deserve to live healthy lives. Whatever results emerge from this directive will not only be ideological, it will be a sham.",
          "link": "https://defector.com/what-it-means-to-fund-studies-in-transition-regret",
          "publishedOn": "2025-04-06T19:56:04.000Z",
          "wordCount": 8872,
          "title": "What It Means To Fund Studies in Transition “Regret”",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2207393558.jpg"
        },
        {
          "id": "https://defector.com/?p=186140",
          "author": "Maitreyi Anantharaman",
          "description": "TAMPA, Fla. — Sarah Strong is so over it. She floats above the Final Four action with just the smallest hint of facial expression, a wry quarter-smile like she’s trying to hold in a laugh. And when the freshman big drives past a defender for an easy scoop layup or slips in the perfect spot for a rebound, it really can feel like that’s what’s happening: Sarah Strong is in on this joke and you’re not. \nTo retake their place at the top of women’s basketball in Sunday afternoon’s national championship game against South Carolina, the UConn Huskies are turning to a young star but an old soul. UConn’s rout of No. 1 overall seed UCLA on Friday night was the team at its best and deadliest. Azzi Fudd found her shooting form after a rough offensive first half in the Elite Eight. Paige Bueckers got to her midrange spots. Jana El Alfy, a redshirt freshman center, poked entry passes away from Lauren Betts. Geno Auriemma has called this a less-balanced team than he’s used to coaching. “We rely so much on our perimeter game, and not as much on our interior game,” he said. Lucky for him, though, he has the piece to make it work.",
          "link": "https://defector.com/sarah-strong-doesnt-act-her-age",
          "publishedOn": "2025-04-06T15:21:45.000Z",
          "wordCount": 8451,
          "title": "Sarah Strong Doesn’t Act Her Age",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2207986577.jpg"
        },
        {
          "id": "https://defector.com/?p=186100",
          "author": "Barry Petchesky",
          "description": "It might have seemed like excessive prudence to send the traveling party out that early. The full suite of people on hand for the Capitals' game in Carolina on Wednesday, in anticipation of Alexander Ovechkin chasing down Wayne Gretzky's all-time goalscoring record, included Ovechkin's family, Gary Bettman and a host of NHL executives, and Gretzky himself. At the time, Ovechkin was three goals away from tying, four from passing; it raised the specter of an extended chase that would see the traveling party fruitlessly jetting around the country for weeks, waiting for goals. But the prudence was warranted. This is Alex Ovechkin. You don't threaten Gretzky's mark without, you know, scoring a lot of goals.\nOvechkin scored No. 892 on Wednesday, and on Friday at home against the Blackhawks, put up a pair of goals to tie Gretzky at 894. It was his fourth and fifth goals in his last four games; the 39-year-old has looked invigorated by the chase. Which in itself is a tribute to his otherworldliness: energy and desire are all well and good, but it is still very difficult to score a goal, yet in 2025 as in 2005, Ovechkin makes it look like a matter of will.",
          "link": "https://defector.com/ovechkin-skates-down-gretzky",
          "publishedOn": "2025-04-05T14:19:02.000Z",
          "wordCount": 6898,
          "title": "Ovechkin Skates Down Gretzky",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2208640381-e1743862656115.jpg"
        },
        {
          "id": "https://defector.com/?p=185958",
          "author": "Patrick Redford",
          "description": "The time has come to bury the Phoenix Suns, who barely lived and are now dead. When they made the Finals three years ago and then got sold to an aggressive, engaged billionaire, it seemed as if they would perch atop the Western Conference for years to come, a position they attempted to consolidate by moving as aggressively as possible. Instead of winning anything of value, they're drawing dead in a conference that has passed them by and now face one of the bleakest futures in the NBA. They are quite the cautionary tale.\nThis all starts in the summer of 2020, when a Devin Booker–led Suns team ranked 13th in the West got invited to the Orlando pandemic Bubble and—helped along by a good deal of Cam Payne nonsense—won every one of its eight games there. The basic idea that a team built around Booker could win a bunch of games that mattered had been unproven until the Bubble: He'd scored 70 points in a game before, in a meaningless March 2017 loss (only two Suns who played that night are now still in the league, while another two are active assistant coaches), but had never even cracked 30 wins in any of his four pro seasons to that point. That tiny segment of Mickey Mouse pandemic basketball is the strongest case against Bubble hoops being a flimsy, inconsequential construct rather than a real end to a real season, as the Suns did build on the foundation by trading for Chris Paul.",
          "link": "https://defector.com/here-lie-the-phoenix-suns-who-did-it-all-wrong",
          "publishedOn": "2025-04-04T19:08:56.000Z",
          "wordCount": 9805,
          "title": "Here Lie The Phoenix Suns, Who Did It All Wrong",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2160669341.jpg"
        },
        {
          "id": "https://defector.com/?p=186068",
          "author": "Kelsey McKinney",
          "description": "In late February, I caught wind of a salacious rumor involving students at Ole Miss. Obviously, since I do not make a habit of keeping apprised of the sex lives of college students, it came to my attention because it had already garnered a lot of attention online. The rumor was spreading via a photo of a paragraph of text from someone’s Snapchat DMs that had gone viral on YikYak, a social media app primarily used by students. \nWhich makes sense, since this was exactly the sort of rumor that spreads like wildfire on a college campus. It has all the hallmarks: a sorority girl breaking a sexual taboo and being called a slut for it. Anyone who has ever been 18 has heard some version of a rumor like this, they rival crypto as the favored currency among those too young to legally drink. There is not a fully-formed pre-frontal cortex to be found in these situations. Most people that age haven’t seen the damage that kind of rumor can do, or they don’t care, and so off it goes into the ether, to live as a vaguely remembered story you once heard about someone.",
          "link": "https://defector.com/patrick-mcafee-you-are-37-years-old",
          "publishedOn": "2025-04-04T18:37:14.000Z",
          "wordCount": 8739,
          "title": "Patrick McAfee You Are 37 Years Old",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2193089812.jpg"
        },
        {
          "id": "https://defector.com/?p=186066",
          "author": "Tom Ley",
          "description": "It is not ridiculous to say that one of Ja Morant's professional goals should be trying to end his association with firearms. Whether or not you agree that an NBA player should be suspended multiple times for being eager to show people his gun, it cannot be denied that this man's affinity for guns has had negative consequences on his career. \"Stop being the gun guy\" perhaps does not belong at the very top of a list of Morant's aspirations, but it shouldn't be at the bottom, either.\nThe NBA is hoping a $75,000 fine will encourage Morant to find something other than guns to be interested in. Morant was hit with that fine this morning because during Thursday night's nationally televised game against the Heat—which Morant won at the buzzer—he celebrated a made three-pointer by pretending to shoot a gun. This is objectively a strange thing for a player to fined for; NBA players pretend to shoot stuff after hitting a big shot every night, and this is something that Morant had done several times already throughout the season. The reason he got fined today is that he also did the gun gesture during Tuesday's game against the Warriors, to the great annoyance of Steph Curry, and the NBA warned him to knock it off.",
          "link": "https://defector.com/ja-morant-will-not-stop-doing-his-little-gun-thing",
          "publishedOn": "2025-04-04T18:16:49.000Z",
          "wordCount": 6126,
          "title": "Ja Morant Will Not Stop Doing His Little Gun Thing",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2208407065.jpg"
        },
        {
          "id": "https://defector.com/?p=186011",
          "author": "Marc Normandin",
          "description": "Defector has partnered with Baseball Prospectus to bring you a taste of their work. They write good shit that we think you’ll like. If you do like it, we encourage you to check out their site and subscribe.\nThis story was originally published at Baseball Prospectus on March 26.",
          "link": "https://defector.com/are-the-pittsburgh-pirates-really-in-dire-straits",
          "publishedOn": "2025-04-04T18:11:39.000Z",
          "wordCount": 10086,
          "title": "Are The Pittsburgh Pirates Really In Dire Straits?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2167439376.jpg"
        },
        {
          "id": "https://defector.com/?p=186060",
          "author": "Ray Ratto",
          "description": "The West Sacramento Athletics have been in existence as a viewing experience for three days and one full home stand, and already they have accomplished something of note. It’s this: They have already made 2,800 people disappear.\nBeginning their indeterminate layover in Yolo County with a three-game series against the Chicago Cubs, they announced consecutive attendance figures of 12,119, 10,095, and 9,345. Those people were entertained by defeats of 18-3, 7-4, and 10-2. The baseball part of all this, we can presume, will take care of itself; the crowds, on the other hand, offer hints of just how aggressively unmoved the A’s new town seems to be by the presence of an actual Major League Baseball team in their midst.",
          "link": "https://defector.com/west-sacramento-has-the-as-whether-they-want-them-or-not",
          "publishedOn": "2025-04-04T17:18:49.000Z",
          "wordCount": 8057,
          "title": "West Sacramento Has The A’s, Whether They Want Them Or Not",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2207403545.jpg"
        },
        {
          "id": "https://defector.com/?p=186036",
          "author": "Tom Ley",
          "description": "The city of Baltimore filed a lawsuit against FanDuel and DraftKings on Thursday, alleging that both companies have violated city's consumer protection ordinance by targeting and exploiting gamblers. \nThe specific allegations made in the suit—that these sports books hook gamblers with misleading promotions, use proprietary data to profile and target problem gamblers for further exploitation, and seek only to extract as much lifetime revenue as possible from each customer—are all allegations that have been made before in other lawsuits and by people whose problem gambling has been exacerbated by access to online sports books.",
          "link": "https://defector.com/baltimore-sues-draftkings-and-fanduel-for-exploiting-gamblers",
          "publishedOn": "2025-04-04T14:55:17.000Z",
          "wordCount": 6678,
          "title": "Baltimore Sues DraftKings And FanDuel For Exploiting Gamblers",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2202150840.jpg"
        },
        {
          "id": "https://defector.com/?p=185597",
          "author": "Sabrina Imbler",
          "description": "The Trump administration is going full steam ahead on its terrifying project of dismantling the country's defenses against HIV. In February, it gutted the U.S. Agency for International Development, which plays a crucial role in supplying other countries with HIV treatments. On March 21, the U.S. Department of Health and Human Services terminated the Adolescent Trials Network, or ATN, which is the only national research network focused on adolescents and young adults who live with, or are at risk for, HIV. The National Institutes of Health terminated grants related to PrEP, medications that can prevent HIV infection. And this week, the administration laid off scores of workers at the Centers for Disease Control and Prevention who focused on HIV prevention.\nSince its formation in 2001, ATN has enrolled more than 30,000 people in over 150 studies, many of which focus on the ongoing HIV epidemic, and expanded access to PrEP. But it has a more expansive remit, also studying the rising incidence of STIs, and mental health and substance abuse disorders in young people. Nevertheless, the network's termination letter used the same language seen in letters from the National Institutes of Health that intend to eradicate \"diversity, equity, and inclusion\" in scientific research.",
          "link": "https://defector.com/an-interview-with-an-epidemiologist-who-lost-her-job-because-of-the-doge-layoffs",
          "publishedOn": "2025-04-04T14:35:50.000Z",
          "wordCount": 15050,
          "title": "An Interview With An Epidemiologist Who Lost Her Job Because Of The DOGE Layoffs",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/20250403_suzsteiner_9929-e1743772725544.jpg"
        },
        {
          "id": "https://defector.com/?p=185777",
          "author": "Israel Daramola",
          "description": "Welcome to Listening Habits, a column where I share the music I’ve been fixated on recently.\nWe are currently in a moment of 2000s nostalgia. I suppose it was inevitable. After spending 20 years stuck in the '90s, it's about time the culture finally moved on to the next decade. This may have brought us an even worse version of George W. Bush era politics and the #RETVRN of white male angst content, but it has also given us something good: a revival of the mixtape DJ. The most prominent recent example of this type of call back to the DatPiff era of DJ-hosted records is Playboi Carti's new album Music, where Swamp Izzo goes around shouting his name all over the place as if it were 2011 again.",
          "link": "https://defector.com/gangsta-grillz-is-forever",
          "publishedOn": "2025-04-04T14:11:49.000Z",
          "wordCount": 11213,
          "title": "Gangsta Grillz Is Forever",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-53053999.png"
        },
        {
          "id": "https://defector.com/?p=185120",
          "author": "Diana Moskovitz",
          "description": "Sedona Prince's college basketball career ended quietly, and with a loss. The TCU center put up four points, an assist, and nine rebounds before fouling out in the fourth quarter of a 58-47 defeat in the Elite Eight against one-seed Texas. Prince didn't shine much in the prior game, either, a TCU victory that mostly belonged to teammate Hailey Van Lith. Prince had been one of the faces of the push for women's equality in college sports, and then became the subject of accusations from women who said Prince had assaulted or abused them.\nIn total, five women have either talked to reporters, or to law enforcement, or filed documents with a court describing some form of sexual assault or physical violence by Prince. The first woman spoke out on TikTok several years ago; the most recent was in police reports filed earlier this year. Back in August, Prince said on TikTok \"I have never abused anybody in my life.\" In response to recent police reports in Texas, her lawyer, A. Boone Almanza, said Prince herself was an assault victim that day, kicked and hit in the head repeatedly \"when a former friend entered her house uninvited.\" What happened, Almanza said, \"was a traumatic event for Sedona.\"",
          "link": "https://defector.com/the-silence-surrounding-sedona-prince-is-a-look-into-sports-future",
          "publishedOn": "2025-04-04T13:49:11.000Z",
          "wordCount": 13366,
          "title": "The Silence Surrounding Sedona Prince Is A Look Into Sports’ Future",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2196367868-e1742935785544.jpg"
        },
        {
          "id": "https://defector.com/?p=185965",
          "author": "Paola Rosa-Aquino",
          "description": "Alizee Zimmermann and her husband were rinsing off their dive gear on a relatively muggy January evening when the sky exploded with a dozen shimmering fireballs. “We saw the trails as it started to lose control,” Zimmermann told me. “Then we heard the booms.”\n\nhttps://www.youtube.com/watch?v=NIe5Ao6R39s",
          "link": "https://defector.com/were-littering-the-earth-with-space-trash",
          "publishedOn": "2025-04-04T13:01:11.000Z",
          "wordCount": 9624,
          "title": "We’re Littering The Earth With Space Trash",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2185019139.jpg"
        },
        {
          "id": "https://defector.com/?p=185865",
          "author": "David Roth",
          "description": "It is a fact that seven of the eight teams in the men's and women's Final Four were the top seeds in their respective brackets, but what that means is a different and much more debatable thing. (That the sole exception is two-seed UConn in the women's bracket is less debatable, that one is just funny.) Is it bad, or even a letdown, that the good teams are pretty much exactly as good as advertised? Does the ideal state of March Madness depend upon a certain baseline level of chaos, or is it just enough to watch a bunch of college basketball played with the appropriate balance of mastery and freaked-out teenage overage over a couple of manic weeks? Also, what did Drew's dad get into it with a waiter in Ypsilanti, Michigan years ago? Surprisingly or not, only the last question is not given a decently comprehensive answer in this week's episode.",
          "link": "https://defector.com/whered-she-go-to-college-with-maitreyi-anantharaman",
          "publishedOn": "2025-04-03T20:49:06.000Z",
          "wordCount": 7052,
          "title": "Where’d She Go To College? With Maitreyi Anantharaman",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2207407406.jpg"
        },
        {
          "id": "https://defector.com/?p=185722",
          "author": "Alex Sujong Laughlin",
          "description": "My friend Sasha was banned for life from the Providence Place Mall when she was 20. She and her friends would sneak into movies at the mall’s theater through the maze of back hallways and tunnels. They climbed onto the mall’s roof. I imagine them like the subterranean ants in an ant farm: constantly scurrying, unseen and underfoot. \nThe only thing deterring people from entering these halls was social convention. We live in a society. We don’t walk through doors with signs that say “authorized personnel only.” That is, unless you’re a young person with a palpable disregard for authority and the social conventions upon which our society is built.",
          "link": "https://defector.com/watching-secret-mall-apartment-in-the-secret-apartment-mall",
          "publishedOn": "2025-04-03T17:34:43.000Z",
          "wordCount": 10629,
          "title": "Watching ‘Secret Mall Apartment’ In The Secret Apartment Mall",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2206202164.jpg"
        },
        {
          "id": "https://defector.com/?p=185926",
          "author": "Chris Thompson",
          "description": "Rafael Devers of the Boston Red Sox struck out not at all—not even one time—in Wednesday's victory over the Baltimore Orioles. In the fifth inning, with teammate Cedanne Rafaela on first base, Devers timed up a 2–1 curveball from Zach Eflin and socked it down the right field line for a double! So his first hit of the campaign came in his team's sixth game: Big deal! The point is that he is now in the hit column. Even better: The O's sort of borked the relay, allowing Rafaela to come all the way around and score, giving Devers his second run batted in of the season (the other came on a bases-loaded walk). This was a nice moment: The relief was evident on our hero's face as he grinned from second base. Three cheers for Rafael Devers!\n\nhttps://www.youtube.com/watch?v=vR-uKjJJWps",
          "link": "https://defector.com/with-two-hits-rafael-devers-makes-dylan-crews-mayor-of-bozo-town",
          "publishedOn": "2025-04-03T15:38:23.000Z",
          "wordCount": 6426,
          "title": "With Two Hits, Rafael Devers Makes Dylan Crews Mayor Of Bozo Town",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2206564388.jpg"
        },
        {
          "id": "https://defector.com/?p=185883",
          "author": "Patrick Redford",
          "description": "Losing, a permanent condition in bike racing, comes in many forms. On Wednesday at Dwars door Vlaanderen, Wout van Aert's Visma team plumbed new depths and suffered one of the more embarrassing defeats you'll see all season. They only could lose this big, this greedily, because they tried to win this big, this defiantly, which I think is something like admirable.\nIt all started after they'd rode themselves into a theoretically unloseable position. They led the peloton in reeling back the day's early breakaway with 90 kilometers left, which sparked a frenzy of attacks. Mads Pedersen tried something and failed, a small group of riders tried something and succeeded and then failed, as Van Aert and three teammates broke clear from the peloton and leapt up to join and then shred that front group. It was an impressive display of team strength from a team whose capacity for such moves wasn't as certain as it once had been. The trio unlatched everyone save for the young American rider Neilson Powless, and they raced on with nothing but 55 kilometers of clear pasture ahead of them. Who was going to catch them? Intermarché? Groupama? The chase had talent, but never organization. Also, the three Jumbo guys were all known cobble-eaters, only liable to be followed by especially rugged riders.",
          "link": "https://defector.com/wout-van-aert-tried-so-hard-to-win-he-forgot-not-to-lose",
          "publishedOn": "2025-04-03T14:47:34.000Z",
          "wordCount": 8469,
          "title": "Wout van Aert Tried So Hard To Win, He Forgot Not To Lose",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2207553933.jpg"
        },
        {
          "id": "https://defector.com/?p=185917",
          "author": "Drew Magary",
          "description": "Pleasure to meet you, son! Come on in and take a seat. We’re really grateful you agreed to a private workout with us prior to the draft. Pro days are useful to some extent, but when you’re cooking up a meal, you wanna get a REAL close look at the ingredients. Touch ‘em. Feel ‘em. Smell ‘em. I can smell you right now kid, and I have to say: I like what I’m smellin’. But I want more.\n[I get up, turn both chair and hat backwards, and then sit back down]",
          "link": "https://defector.com/you-say-youre-a-dawg-but-are-you-a-motherfucker",
          "publishedOn": "2025-04-03T14:28:42.000Z",
          "wordCount": 6845,
          "title": "You Say You’re A Dawg, But Are You A Motherfucker?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2022/09/dan-campbell-lions.jpg"
        },
        {
          "id": "https://defector.com/?p=185879",
          "author": "Mark Asch",
          "description": "On Sep. 19, 1994, a week before Senate Majority Leader George Mitchell declared that there was no legislative path forward in the current Congress for the Clinton administration's healthcare reform agenda, NBC aired \"24 Hours,\" the pilot episode of ER. Set across a single day in an urban emergency room, the episode introduced a cast of medical professionals including John Carter, a medical student on his first day at Cook County General, played by a fresh-faced Noah Wyle. Wyle would be the last original cast member to leave the show, at the end of Season 11 in 2005, by which point ER's status as the anchor of \"Must-See TV,\" the most watched night on television's most watched network, meant less than it used to. \nThe Pitt, which premiered in January and has its Season 1 finale coming up in a couple weeks, also begins as a new rotation of med students arrive at an urban hospital's emergency room, and are shown around the ER by Wyle, now playing the senior attending physician, Dr. Robinovitch—\"Dr. Robby\" to his colleagues, and to us, a great TV name, the soothing childlike nickname of a competent, twinkly doctor crouching down to eye level to build rapport with a nervous young patient. Created by ER vet R. Scott Gemmill, the show also unfolds across a single day—an hour per episode, in subtly compressed real time—with numerous callbacks to the NBC drama, including a much-teased fakeout on the hospital's helipad, and an emergency-room childbirth with complications which Dr. Robby is able to navigate more deftly than Carter's old ER mentor did in that show's most acclaimed episode. But The Pitt, unlike ER, is a streaming-only show, developed for Max, the Warner Bros. Discovery platform that evolved out of HBO's on-demand service.",
          "link": "https://defector.com/in-praise-of-the-pitt-the-most-normal-show-on-television",
          "publishedOn": "2025-04-03T13:16:19.000Z",
          "wordCount": 11391,
          "title": "In Praise Of ‘The Pitt,’ The Most Normal Show On Television",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/noah-wyle_0.jpg"
        },
        {
          "id": "https://defector.com/?p=185816",
          "author": "Israel Daramola",
          "description": "Val Kilmer died on Tuesday, April 1. He had been diagnosed with throat cancer years ago, and early reports are that he died after a bout with pneumonia. Too beautiful to be a character actor and too much of a weirdo to be the Hollywood leading man his beauty seemed destined for, Kilmer was nonetheless one of the greats. He saw himself as an artist, in all the messy and pretentious ways that term implies. But no matter what, you couldn't look away from him. He's been in a lot of great movies, and some bad ones too. In his honor, here are five movies I think best exemplify what made him such an exceptional star.\nTombstone (1993) Dir. George Cosmatos - \"Doc Holliday\"",
          "link": "https://defector.com/remembering-val-kilmer-in-five-movies",
          "publishedOn": "2025-04-02T19:33:22.000Z",
          "wordCount": 8173,
          "title": "Remembering Val Kilmer In Five Movies",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-1149915854.jpg"
        },
        {
          "id": "https://defector.com/?p=185757",
          "author": "Alex Sujong Laughlin",
          "description": "We did it. We completed 12 weeks of morning pages, artist dates, media deprivation, and affirmations. We have walked The Artist's Way! Are we artists now? That is yet to be determined. For our very last check-in, we're reflecting on what these last three months brought us, from the carpal tunnel to the breakthroughs, to see if it was all worth it. \nWhat did you enjoy and loathe most about doing The Artist's Way?",
          "link": "https://defector.com/the-artists-way-week-12-is-julia-cameron-wrong",
          "publishedOn": "2025-04-02T19:01:22.000Z",
          "wordCount": 16186,
          "title": "‘The Artist’s Way’ Week 12: Is Julia Cameron Wrong?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/Copy-of-my-food-e1743619540959.png"
        },
        {
          "id": "https://defector.com/?p=185827",
          "author": "Kathryn Xu",
          "description": "The assumption, looking at the corpse of the Atlanta Braves in September, was that it could not possibly happen again. Bad luck doesn't come around that often, and certainly never strikes twice. Projected standings may be able to hold firm, but early April is the season for baseball mortals to conduct their favorite activity: small sample-size thinking. Fifteen homers in three games means that the New York Yankees' torpedo bats need to be torpedoed into the moon; Mike Trout is starting to stink; 15 strikeouts in 19 at-bats is, well, admittedly pretty awful, there's no getting around that. And, now, looking at a .000 win percentage over six games, simple math says that the Braves may not win another game this season.\nIt isn't just the record. On Monday, MLB suspended Jurickson Profar for 80 games, after he tested positive for human chorionic gonadotropin. Sealing the suspension, Profar didn't even file the customary appeal out of obligation. As pitchers' sudden resurgences could once be explained by \"He got into the special jam,\" a PED suspension provides a neat and tidy explanation as to how Profar had such an out-of-character season as a hitter last year, though it may lessen the charm of the story. It also explains the relatively slow offseason Profar had as a free agent, before the Braves handed him a three-year, $42 million contract in January—the only multi-year contract they handed out over the offseason. (According to David O'Brien at The Athletic, the Braves ascribed his performance to mechanical adjustments \"made with his lower body in his batting stance, after working out with Fernando Tatis Jr. and his dad the previous winter.\")",
          "link": "https://defector.com/the-braves-may-never-win-a-game",
          "publishedOn": "2025-04-02T18:11:02.000Z",
          "wordCount": 7699,
          "title": "The Braves May Never Win A Game",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/kelenicBravesDodgers.jpg"
        },
        {
          "id": "https://defector.com/?p=185840",
          "author": "Ray Ratto",
          "description": "On its face there was nothing unusually spectacular about Stephen Curry's 52-point game last night at Memphis. He had 56 in Orlando 33 days ago, after all, and put up 60 a year ago in Atlanta. For all the references to his 54-point resumé-maker in New York twelve years ago, Curry’s best games have seemed to come south of the Mason-Dixon and east of the Mississippi. His last triple double—he went for a mere 52, 10 and 8 in Tuesday’s win over the Grizzlies—happened three years ago in Miami, just three days after his penultimate triple double in Charlotte.\nAnd the spectacle of Curry's latest attention-grabbing triumph lasted only a couple of hours; Nikola Jokic had 61, 10, and 10 later in the evening in Denver's Russ-tainted double-overtime loss to Minnesota, a performance  outlandish enough to steer some of the shine away from yet another Curry fiftyburger. Some 40 players have scored half a hundred in a game 96 times in the last five years; Curry himself has done it nine times during that period. That’s more than any other player, so by these preposterous standards, Curry was...well, quite good but not necessarily OMG-able. It is a strange thing on the merits to be on the receiving end of merely a polite “that’s nice” after scoring 52 points on 31 shots, including going 12-for-20 from three, but Steph Curry does not get discussed on the merits. He gets discussed in relation to himself, which while meritorious enough still is a ridiculous yardstick. By those standards, this had all the feeling of, \"Oh, he did that, did he? Cool.\"",
          "link": "https://defector.com/steph-curry-went-off-again",
          "publishedOn": "2025-04-02T17:14:19.000Z",
          "wordCount": 6959,
          "title": "Steph Curry Went Off, Again",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2208035120.jpg"
        },
        {
          "id": "https://defector.com/?p=185810",
          "author": "Albert Burneko",
          "description": "Some things, no one can tell you. No one can tell you that you are in love; you simply know it. No one can tell you your calling in life; you have to find it. No one can tell you that you were not chased through San Francisco by a pistol-shooting madman on Saturday night. It's just one of those things a man knows for himself.\nDeep Prasad, CEO of a Texas-based artificial intelligence company named GenMat, had this experience over the weekend. Not just that of fleeing a murderer's gunfire through the witching-hour streets of San Francisco ...",
          "link": "https://defector.com/tech-ceo-do-not-say-to-me-that-i-was-not-just-assassinated-by-the-jackal",
          "publishedOn": "2025-04-02T16:47:18.000Z",
          "wordCount": 7594,
          "title": "Tech CEO: Do Not Say To Me That I Was Not Just Assassinated By The Jackal",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2197483278.jpg"
        },
        {
          "id": "https://defector.com/?p=185809",
          "author": "Lauren Theisen",
          "description": "The way I see it, these are the top five moments in St. Louis Blues history:\n1. Bobby Orr dives as his iconic goal sweeps the Blues out of the 1970 Stanley Cup Final, which St. Louis was only in because the NHL put all of the expansion teams in one half of the bracket.",
          "link": "https://defector.com/what-the-heck-got-into-the-blues",
          "publishedOn": "2025-04-02T15:14:00.000Z",
          "wordCount": 6413,
          "title": "What The Heck Got Into The Blues?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2207525788.jpg"
        },
        {
          "id": "https://defector.com/?p=185806",
          "author": "Tom Ley",
          "description": "It is a shame Russell Westbrook must be the first player mentioned in a blog about a 140-139 Minnesota victory over Denver that went to double-overtime and was perhaps the single most entertaining game of the season. That is what must happen, however, when such a game ends with one guy delivering the worst 17-second sequence of individual basketball anyone can imagine.\nSo let's just start at the end: With 17.7 seconds left in the second overtime, the Timberwolves were preparing to inbound the ball while trailing 139-138. Anthony Edwards got the ball in the corner, and after being double-teamed made a hesitant pass that found nobody. Westbrook jumped on the loose ball and initiated a 2-on-1 fast break going the other way. He passed the ball to Christian Braun, who passed it back to Westbrook, who then completely duffed a wide-open layup. The Timberwolves grabbed the rebound with 10 seconds left, and after a wild scramble the ball found Nickeil Alexander-Walker in the corner. Alexander-Walker's shot banged off the side of the rim as the buzzer sounded, but not before Westbrook, flying back into the play to contest the shot, fouled him. The refs put 0.1 seconds on the clock, Alexander-Walker went to the line for three shots, sank two, and the game was over.",
          "link": "https://defector.com/noooo-russell-westbrook-dont-do-that-nooooo-dont-do-that-either",
          "publishedOn": "2025-04-02T14:42:17.000Z",
          "wordCount": 6691,
          "title": "Noooo, Russell Westbrook, Don’t Do That! Nooooo, Don’t Do That Either!",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2207530848.jpg"
        },
        {
          "id": "https://defector.com/?p=185411",
          "author": "John Loeppky",
          "description": "Anything with the label of diversity, equity, or inclusion is under attack. Few arenas so closely tie DEI initiatives and athletics than parasports, for people with disabilities. From military-focused projects like the Invictus Games, to collegiate programs across the U.S., to the major funding disparities among international teams, the pursuits and careers of disabled athletes are just as much sociology and history lessons as they are athletics.\nIn the current, deeply destructive political moment, how are things going? I spoke to leaders at collegiate parasport programs and got the sense that they are in a holding pattern, hoping—perhaps vainly—that their sports will be insulated, while also being aware that their athletes stand to be affected off the court as well.",
          "link": "https://defector.com/university-parasports-brace-for-trumps-anti-dei-crusade",
          "publishedOn": "2025-04-02T12:58:10.000Z",
          "wordCount": 8420,
          "title": "University Parasports Brace For Trump’s Anti-DEI Crusade",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2146993231.jpg"
        },
        {
          "id": "https://defector.com/?p=185761",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about life before eyeglasses, cup storage, maximally dumbed down sports reporting, and more.\nYour letters:",
          "link": "https://defector.com/banning-the-tush-push-is-a-chickenshit-idea",
          "publishedOn": "2025-04-01T19:26:04.000Z",
          "wordCount": 16581,
          "title": "Banning The Tush Push Is A Chickenshit Idea",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-1740225815.jpg"
        },
        {
          "id": "https://defector.com/?p=185751",
          "author": "Soraya Roberts",
          "description": "In the modest new British detective series Ludwig, comedian David Mitchell—who you will likely know as uptight office drone Mark Corrigan from Jesse Armstrong’s very pre-Succession cult hit Peep Show—plays the shut-in twin of what appears to have been a much livelier detective who goes missing. John Taylor, whose literal job it is to make puzzles (for which he uses the titular pen name), gets a call from his sister-in-law (a delightful Anna Maxwell Martin), whom he has known since they were kids, who therefore also knows she has to send a cab hundreds of miles to pick him up and bring him to the university town of Cambridge where she lives, because otherwise he will not leave the house (she vows to match the exact meal she knows he’s having to make it up to him). \nShe enlists John to pose as his brother, James, in order to infiltrate his detective agency and solve the mystery of how he went missing, but in the meantime, John keeps getting waylaid. Turns out his puzzle skills make him incredibly adept at solving crimes—of which there are a surprising number in such a small town—through swift deductive reasoning (and a lot of confusing number crunching), if not at entirely convincing his coworkers this new socially inept personality in fact belongs to the twin he is claiming to be. At one point in the second episode, James’s son has to be reassured by his mother that John is up to the job. “Your uncle is the most brilliant person I’ve ever known, there’s nothing he can’t do,” she says. A beat. “Actually that’s a lie, there’s a lot of things he can’t do, but he CAN do this.”",
          "link": "https://defector.com/ludwig-gets-cozy-with-david-mitchells-limits",
          "publishedOn": "2025-04-01T18:41:30.000Z",
          "wordCount": 8241,
          "title": "‘Ludwig’ Gets Cozy With David Mitchell’s Limits",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/Ludwig-3-Final.jpg"
        },
        {
          "id": "https://defector.com/?p=185721",
          "author": "Dan McQuade",
          "description": "My Uncle Dave was at the game with his friend Donald. The Phillies were losing. Dave and Donald were walking around a lower-level concourse in the Veterans Stadium outfield. Bullpens at the Vet were behind the outfield wall in left and right. Fans were pretty high up, but they could lean over from the walkway above and get an overhead view of warmup tosses. Or do other things.\nDave and Donald were at a game in the early 2000s when they began doing one of the most popular of those other things, which was bugging Phillies pitchers. Donald wanted a ball or two for his kids, D.J. and Jack. I have attended dozens of baseball games with my uncle; I am sure the pair was annoying the heck out of Phillies relievers after a while. Right from the start, probably.",
          "link": "https://defector.com/philly-fan-hecklers-thwarted-by-doors",
          "publishedOn": "2025-04-01T17:49:19.000Z",
          "wordCount": 8386,
          "title": "Philly Fan Hecklers Thwarted By Doors",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/phillies-outfield-bullpen-doors.jpg"
        },
        {
          "id": "https://defector.com/?p=185356",
          "author": "Patrick Redford",
          "description": "Touchstone Climbing is a behemoth of a gym network, spanning 16 gyms across California. Two of those opened within the past year with another currently under construction, as Touchstone seeks to consolidate its position as the premier place to climb indoors in the most populous state in the country, and surf various cultural and economic waves: the post-Free Solo climbing boom, the trend of younger people buying gym memberships at higher rates, and the increasing number of remote workers in search of some sort of third space.\nIt's a smart bet, though quite a capital-intensive one, and all that levering-up is not without its pressure points. As Touchstone grows, so does the cost of a membership, which people have been happy to pay so far because the experience is worth it. But if multiple simultaneous construction projects and an expanded suite of offerings can be scaled up quickly, that speed only exacerbates the tension around the attribute that truly distinguishes Touchstone: the high-quality route-setting.",
          "link": "https://defector.com/theres-no-climbing-without-route-setters-and-theyre-on-strike",
          "publishedOn": "2025-04-01T15:57:18.000Z",
          "wordCount": 8463,
          "title": "There’s No Climbing Without Route Setters, And They’re On Strike",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/routesetter-union.jpeg"
        },
        {
          "id": "https://defector.com/?p=185730",
          "author": "Owen Lewis",
          "description": "Aryna Sabalenka did something unusual in her Miami Open semifinal with Jasmine Paolini: She visibly acknowledged an error while a point was still live. Between points, anything goes in tennis. Players eviscerate their rackets, scream at umpires, spew abuse at their support team, or send tennis balls caroming around stadiums. But live rallies themselves are treated like a sacred space, free of even an eye-roll as long as a chance to win the point remains. \nIt happened when Sabalenka, the best player in the world, was leading the first set 4-1 and nearing another break point. She had Paolini scampering with a forehand missile but put a little too much air under a drop shot, which Paolini spun into a lob over Sabalenka’s head. On replay, as Sabalenka sprinted to retrieve it and saw the ball land in, she was already grimacing at surrendering control of the point.",
          "link": "https://defector.com/aryna-sabalenka-is-thrillingly-imperfect",
          "publishedOn": "2025-04-01T15:07:00.000Z",
          "wordCount": 9624,
          "title": "Aryna Sabalenka Is Thrillingly Imperfect",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2206984190.jpg"
        },
        {
          "id": "https://defector.com/?p=185192",
          "author": "Drew Magary",
          "description": "A look at the awful playtime trinkets you’re forced to keep in your house until you can finally buy your kid a phone.\nThe Toy",
          "link": "https://defector.com/why-your-childrens-toy-sucks-playhut",
          "publishedOn": "2025-04-01T14:36:38.000Z",
          "wordCount": 7244,
          "title": "Why Your Children’s Toy Sucks: Playhut",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/Screenshot-2025-04-01-at-10.26.31 AM.png"
        },
        {
          "id": "https://defector.com/?p=185708",
          "author": "Maitreyi Anantharaman",
          "description": "For three early minutes of Monday night’s Texas-TCU Elite Eight game, Texas led 2-1, and that might as well have been the final score. Certainly it was the game’s realest, most honest scoreline. Bothered by a tight, physical Texas defense, TCU could only reliably score at the free-throw line. The Horned Frogs would finish their 58-47 loss with just 12 made field goals on 45 attempts. A one-point difference felt both tiny and substantial. If Texas was playing twice as well on offense, that still wasn’t saying much. Against one of the better outside shooting teams in the country, the Longhorns were as loath to take threes as they have been all season, taking only three shots (and making two) from behind the arc. Things stayed close and nervy late into the third quarter—a 2-1 game, through and through.\nTexas will appear in the Final Four for the first time since 2003. They’re set to play South Carolina, a staple of the Final Four by contrast and a conference rival the Longhorns have come to know well in the SEC regular season. The deep, shapeshifting Gamecocks present a slightly different challenge than TCU did. “If you cut that piece off, the rest of it dies,” Texas head coach Vic Schaefer said, referring to Hailey Van Lith, the glue of the Horned Frogs offense. To cut that piece off, Texas defended in layers: pressing up the floor and hard hedging the TCU pick-and-roll so that getting the ball even remotely close to the basket just seemed like a real chore. “Even if we didn't get a turnover, we really made ‘em work hard to get it in. Then when they got it in, they had to try to figure out how to run some offense. I think we had ‘em pushed out on the floor quite well,” Schaefer said. Hailey Van Lith turned the ball over seven times and finished with just two assists. TCU’s 6-foot-7, seventh-year center Sedona Prince fouled out with six minutes to play in the fourth quarter, leaving the game with more fouls than points—and, a mark of how few paint touches Texas allowed her, more fouls than field goal attempts, too.",
          "link": "https://defector.com/texas-cut-tcu-to-pieces",
          "publishedOn": "2025-04-01T13:30:43.000Z",
          "wordCount": 6877,
          "title": "Texas Cut TCU To Pieces",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2207878742.jpg"
        },
        {
          "id": "https://defector.com/?p=185592",
          "author": "Maitreyi Anantharaman",
          "description": "Asked if she ever imagined she’d reach her fourth Final Four in four years, Sania Feagin didn’t bother with pretense. “Yes, I did,” the South Carolina senior forward said. “I did because all they do is win here.” In Feagin's four years as a Gamecock, the team has taken many shapes, winning with different players at the helm. Through it all, they’ve played with the easy, understated confidence of a favorite. More often than not, a favorite is what they’ve been. \nThe Gamecocks head to Tampa later this week to play the winner of Monday night’s No. 1 Texas-No. 2 TCU meeting, for a trip to the national championship game. To get to this familiar place, they’ve had to spend some time in unfamiliar places. They’ve trailed with a couple minutes to play; they’ve traded big fourth-quarter buckets; they’ve made game-saving stops and clutched up late at the free-throw line. Last season's title-winning South Carolina team came in waves, slowly but surely overwhelming opponents until the game was out of reach. Suspense expired at halftime. But with close wins over Duke in the Elite Eight on Sunday and Maryland in the Sweet 16 before that, the Gamecocks have shown they can also thrive on the ropes.",
          "link": "https://defector.com/dawn-staley-gamecocks-are-escape-artists",
          "publishedOn": "2025-03-31T20:24:10.000Z",
          "wordCount": 6916,
          "title": "Dawn Staley’s Gamecocks Are Escape Artists",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2207680655.jpg"
        },
        {
          "id": "https://defector.com/?p=185531",
          "author": "David Roth",
          "description": "When Willson Contreras showed up for his first spring training as a full-time first baseman, he knew the learning curve would be steep. A year after he'd made over his catching mechanics entirely, a massive effort that earned some vinegary grousing from his co-workers and led to him getting his forearm broken on a catcher's interference, Contreras arrived at camp ready to start all over again. He was notably bulked up, and spent hours throughout the first weeks of camp having Cardinals infield coach Stubby Clapp fire grounders at him out of a machine called The Red Rocket; Contreras's brother William, a star catcher on the Brewers, \"told me when I told him I was switching positions...that I couldn’t be mean anymore and that I had to start saying ‘Hi’ to people.\"\nMost of what Contreras was looking forward to about the move, though, came down to the fact that his new job would be less all-consuming than his previous one, which required him to go over scouting reports and work with his team's pitchers. “I have plenty of time to do everything now,” Contreras told MLB.com's John Denton in February. \"One of the biggest keys to being a good hitter is having time to reflect on an at-bat or watch video to make adjustments. Now I can talk about hitting, and it feels relaxing to have time to talk to other hitters and ask them questions.\"",
          "link": "https://defector.com/willson-contreras-on-eating-grip-tape-it-was-disgusting-it-was-a-bad-taste",
          "publishedOn": "2025-03-31T20:11:47.000Z",
          "wordCount": 6838,
          "title": "Willson Contreras On Eating Grip Tape: “It Was Disgusting. It Was A Bad Taste.”",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/Screenshot-2025-03-31-at-4.02.50 PM.png"
        },
        {
          "id": "https://defector.com/?p=185566",
          "author": "Lauren Theisen",
          "description": "In the bottom of the fifth of Sunday's Braves-Padres contest, Atlanta pitcher José Suarez and his catcher Chadwick Tromp combined for a sneaky strikeout of San Diego shortstop Xander Bogaerts. After falling to a 3-1 count on a very low changeup, Suarez earned a called strike with a fastball that just barely caught the bottom of the zone. As his follow-up, he threw nearly the exact same pitch, just a tad lower. Bogaerts, again, didn't swing, and fans crediting the virtual strike zone on TV would've seen that he made the correct choice to take the walk. But Tromp's frame job, and Suarez's ability to hit his spot, fooled the umpire into calling for a strikeout that ESPN's machines informed us should never have happened.",
          "link": "https://defector.com/life-isnt-fair-why-should-the-strike-zone-be",
          "publishedOn": "2025-03-31T18:21:40.000Z",
          "wordCount": 6407,
          "title": "Life Isn’t Fair. Why Should The Strike Zone Be?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2173721064.jpg"
        },
        {
          "id": "https://defector.com/?p=185539",
          "author": "Kathryn Xu",
          "description": "If the Yankees hadn't hit a record-matching 15 home runs in three games to start their season, the discourse around their torpedo-shaped bats would look very different. As it stands, the bats have spurred accusations of cheating and stories that contain the dreaded figure of a former MIT physicist, who is nicknamed Lenny and is \"the man.\" (Aaron \"Lenny\" Leanhardt, credited as one of the original evangelists of the bat, left the Yankees in the offseason and is now a coach with the Miami Marlins.)\nTo get it out of the way, the bats are entirely legal. If MLB's confirmation of such wasn't enough, official rule 3.02 states that a bat \"shall be a smooth, round stick not more than 2.61 inches in diameter at the thickest part and not more than 42 inches in length\" and \"shall be one piece of solid wood.\" What is different about the torpedo bat is not necessarily its barrel diameter, but how the wood on the barrel is distributed: Rather than the even taper that most bats have on the barrel, the torpedo bat moves weight from the top of the bat, where hitters do not want to make contact, to the sweet spot of the bat, which players gesture to as the best place to hit a baseball.",
          "link": "https://defector.com/what-is-the-deal-with-the-yankees-weird-bats",
          "publishedOn": "2025-03-31T18:02:48.000Z",
          "wordCount": 7479,
          "title": "What Is The Deal With The Yankees’ Weird Bats?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/torpedo-bat.jpeg"
        },
        {
          "id": "https://defector.com/?p=185553",
          "author": "Chris Thompson",
          "description": "Rafael Devers is having a time. In Sunday's loss to the Texas Rangers, Devers struck out twice and walked once in five plate appearances. First, the good news: The free pass raised his on-base percentage on the season. The bad news: His on-base percentage on the season is .111. The worse news: Through four games, Devers has not yet collected a hit. The heart-breakingly awful news: Devers has struck out in two-thirds of his 18 plate appearances on the season, making him the first major-league hitter in history to strike out 12 times in his team's first four games.\nIt's as bad as it sounds. Prior to this putrid, horrendous start, only five players since 1901 had even struck out 11 times through their teams' first four games, per the Boston Globe. Rob Bradford of WEEI culled some genuinely appalling metrics from Baseball Savant Monday morning, highlighting the depth of Devers's struggles. The veteran has whiffed on a gut-churning 67.4 percent of his swings so far. No, he is not being particularly selective: Already, through four games, Devers has swung and missed at 31 pitches, 13 more than the next closest player in all of baseball, and that player (Teoscar Hernandez) has played an entire additional series. An unbearable 75 percent of the times that Devers has swung at a fastball, he has failed to make contact. I'm looking at Devers's Statcast page right now and openly weeping: Pitchers have thrown him 48 pitches in the strike zone, and he has swung at 36 of these pitches, and those swings have resulted in three (3) batted balls. Someone needs to drape an arm over this man's shoulder and just let him sob for a while. Be a friend!",
          "link": "https://defector.com/spare-a-thought-for-baseballs-poor-flailing-bozos",
          "publishedOn": "2025-03-31T17:25:59.000Z",
          "wordCount": 7467,
          "title": "Spare A Thought For Baseball’s Poor Flailing Bozos",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2207201000.jpg"
        },
        {
          "id": "https://defector.com/?p=185541",
          "author": "Dan McQuade",
          "description": "Michigan State was going to lose, but 6-foot-5 Coen Carr was still hustling. He rushed through the lane, passing three Auburn players to fight for a rebound. Auburn’s Miles Kelly slapped the ball out of his hands, and the two ended up on the ground fighting for it. Eventually, Kelly and MSU’s Jase Richardson had dual possession. The referees signaled for a jump ball.\nBecause this was college basketball, that did not lead to an actual jump ball. Auburn got the ball because the possession arrow was in their favor, something the Tigers had because they won the opening tip. The possession arrow wasn’t needed in the first half, and so Michigan State inbounded the ball to begin the second. Auburn then had the possession arrow in its favor for the entire second half. Nearly 20 minutes later, that meant they got the ball after that late tie-up.",
          "link": "https://defector.com/eliminate-the-possession-arrow",
          "publishedOn": "2025-03-31T17:13:42.000Z",
          "wordCount": 7635,
          "title": "Eliminate The Possession Arrow",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/jump-ball-2001-coaches-vs-cancer.jpg"
        },
        {
          "id": "https://defector.com/?p=185545",
          "author": "Luis Paez-Pumar",
          "description": "There's not much to be excited about when it comes to the 2025 Miami Marlins. I wrote about this in the Defector season preview, but these Fish stink. Sure, they have Sandy Alcantara back, and there are some prospects worth keeping an eye on, but a dour season appears to be on the books, along with yet another last-place finish in the brutal NL East. And yet, at the end of the first weekend of baseball's new season, it is the Marlins, mighty and effervescent, sitting at the top of the division standings. They're 3-1, an extremely temporary juggernaut of clutch hitting and historic walk-off wins.\n\nhttps://www.youtube.com/watch?v=2YQK-UDIuYM",
          "link": "https://defector.com/the-marlins-walk-it-off-again-and-again-and-again",
          "publishedOn": "2025-03-31T16:22:29.000Z",
          "wordCount": 7423,
          "title": "The Marlins Walk It Off, Again And Again And Again",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2207252133.jpg"
        },
        {
          "id": "https://defector.com/?p=185442",
          "author": "Vivian Blaxell",
          "description": "In Vivian Blaxell’s Worthy Of The Event, out Tuesday, a trans essayist with a checkered past takes on the big questions of human existence. The book includes philosophical investigations of the nature of transcendence and beauty, historical disquisitions on violence and domination, and searching appraisals of the events of her own life. This excerpt considers an episode from the early days of Blaxell's own transition in 1970s Australia.",
          "link": "https://defector.com/get-the-fuck-off-this-corner-its-mine",
          "publishedOn": "2025-03-31T16:05:00.000Z",
          "wordCount": 8793,
          "title": "“Get The Fuck Off This Corner. It’s Mine.”",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GET-THE-FUCK-OFF-THIS-CORNER.jpg"
        },
        {
          "id": "https://defector.com/?p=185516",
          "author": "Maitreyi Anantharaman",
          "description": "It's time to wrap up the month with a challenging themeless. Keep an eye out for tricky clues and fun wordplay. This week's puzzle was constructed by Rachel Fabi and edited by Hoang-Kim Vu. Rachel (she/her) is a crossword constructor and a professor of bioethics. She is the founder and co-editor of the crossword puzzle fundraiser \"These Puzzles Fund Abortion,\" which raises money for five abortion funds across the country, so if you like crossword puzzles with a progressive bent and helping people afford necessary healthcare, you can donate here through the end of May to receive the puzzle pack!\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE. Note that we're pausing open submissions until April 18.",
          "link": "https://defector.com/the-crossword-march-31-rules-lawyer-themeless",
          "publishedOn": "2025-03-31T14:59:49.000Z",
          "wordCount": 5251,
          "title": "The Crossword, March 31: Rules Lawyer (Themeless)",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2199670592.jpg"
        },
        {
          "id": "https://defector.com/?p=185408",
          "author": "Veronica de Souza",
          "description": "You’ve seen those picture-perfect spaces on Instagram and in design magazines—beautiful but often too styled to feel real. Don’t get me wrong, I love seeing a rich person’s house, but it can be hard to feel like they have any bearing on your own life. How can a multi-million dollar renovation inspire you to make changes in your space? How can you make your apartment beautiful while still having money left over to pay the rent?\nThat’s where I come in! I’m a design enthusiast … but also a (mostly) normal person with a normal budget. Consider this column a source for approachable interior advice. Whether you’re looking for a specific piece of furniture, struggling with a room layout that feels “off,” or just need a fresh perspective, I’m here to help. I already have a shopping addiction, so let me put it to good use—for you!",
          "link": "https://defector.com/introducing-make-it-nice",
          "publishedOn": "2025-03-31T14:52:26.000Z",
          "wordCount": 6617,
          "title": "Introducing: Make It Nice",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/make-it-nice-2.jpg"
        },
        {
          "id": "https://defector.com/?p=185513",
          "author": "Dan McQuade",
          "description": "Cooper Flagg got the ball at his own free-throw line with 4.6 seconds left. He looked up at the clock and sped down the court. Arizona was out of sorts in transition defense, and Flagg stopped behind the three-point line with a ton of space around him. He beat the buzzer easily. He’d hit a three on the previous possession, too. “We talk about inflection points,” said Kon Knueppel, who had 20 points in Duke’s 100-93 win over Arizona in the Sweet 16 last Thursday, “and the end of the half is a really big inflection point. So it was tie ballgame, and hit two threes gives us a bunch of momentum coming into the second half.” Flagg finished with 30 points, 6 rebounds, and 7 assists.\nFlagg didn’t do as much in the Elite 8 win over Alabama on Saturday, but he also didn’t have to. Alabama-Duke had the look of a classic beforehand, and then the Blue Devils jumped out to a 15-5 lead five minutes in and were never really challenged in a 85-65 win. They put it away with a 13-0 stretch over five minutes late in the game. Flagg opened that run with an impressive one-hander after backing down AP All-American Mark Sears. He beat Sears again a few minutes later with a layup he basically shot sideways.",
          "link": "https://defector.com/oh-no-they-made-a-likable-duke-basketball-team",
          "publishedOn": "2025-03-31T14:14:37.000Z",
          "wordCount": 10454,
          "title": "Oh, No! They Made A Likable Duke Basketball Team",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/duke-celebration-final-four-2025.jpg"
        },
        {
          "id": "https://defector.com/?p=185507",
          "author": "Ray Ratto",
          "description": "Becoming A Contender is difficult business, filled with missteps, false starts, cul-de-sacs and distractions, and it is never more difficult than when a team that has been on power suck for most of the last decade and a half suddenly finds itself in other people's late-season business.\nHence, the Detroit Pistons in this, the beginning of their latest renaissance, having to relearn everything here at the hinder end of the regular season. Since their last trip to the Eastern Conference Final in 2008, they have had the worst record in the NBA, their worst record in team history, the longest losing streak in league history, lost their last 12 playoff games, and in general been easy to dismiss—hence their persistent dismissal.",
          "link": "https://defector.com/the-season-is-too-long-and-everybody-is-cranky",
          "publishedOn": "2025-03-31T03:29:46.000Z",
          "wordCount": 6922,
          "title": "The Season Is Too Long, And Everybody Is Cranky",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2207705604-e1743391127520.jpeg"
        },
        {
          "id": "https://defector.com/?p=185500",
          "author": "Ray Ratto",
          "description": "UCLA chose an odd way to muscle itself into its first women's Final Four—by seeing its muscle get into early foul trouble and having her sit out the entire second quarter. This would surely be LSU's moment as the very live and historically imposing three-seed in a tournament full of chalk.\nInstead, the Bruins somehow managed to be better without center Lauren Betts than they were with her, as counterintuitive as that seems, building themselves a workable lead that they could then safely defend through the second half, when Betts returned to re-establish her place in the game's highlight reel. In all, it was a structurally odd way for the Bruins to finally break through the bracket ceiling, but the final score of 72-65 was an accurate portrayal of the difference between the two teams.",
          "link": "https://defector.com/ucla-finally-finds-its-place",
          "publishedOn": "2025-03-30T23:54:40.000Z",
          "wordCount": 6666,
          "title": "UCLA Finally Finds Its Place",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2207700202-e1743377901598.jpg"
        },
        {
          "id": "https://defector.com/?p=185469",
          "author": "Diana Moskovitz",
          "description": "Perhaps it was not a coincidence that on Friday night Alysa Liu wore gold. That's when the 19-year-old took to the ice in Boston for this year's figure skating world championships and made it all look so easy, like she never left figure skating (which she did), as if her victory had been assured all season (it was not). Skating to Donna Summer's \"MacArthur Park,\" Liu didn't just land her jumps, she seemed to float. Her entire performance exuded ease and joy, without a stumble or slip to be found. When Liu neared the end of her routine with a gorgeous layback slide across the ice, the crowd roared. You know it's a powerful performance when former Olympians Tara Lipinski and Johnny Weir stop talking and just let the skating speak for itself. At one point, broadcaster Terry Gannon asked Lipinski if she believed what she was seeing. The Olympic gold medalist replied, \"I am not!\"\nEven Liu herself was surprised, telling her coaches as she walked off the ice into a giant group hug, \"What the hell?!?\"",
          "link": "https://defector.com/alysa-lius-world-title-is-more-than-just-a-comeback",
          "publishedOn": "2025-03-30T21:13:55.000Z",
          "wordCount": 7050,
          "title": "Alysa Liu’s World Title Is More Than Just A Comeback",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2207425649-e1743350776524.jpg"
        },
        {
          "id": "https://defector.com/?p=185479",
          "author": "Ray Ratto",
          "description": "The AFC South has always been kind of a meh-stival—four under-noticed teams (just one media market inside the top 25) all doing relatively dull things (having the worst cumulative record since the division became an actual thing) and only very occasionally getting our attention for anything other than draft position. Thus it is with admiration as well as curiosity that we gaze upon the escalating uniform war between the Houston Texans and Tennessee Titans over the use of what the rest of us would just call light blue.\nOr as the Titans call it, Titans blue. Or as the Texans call it, H-Town blue. Or as the rest of us call it, \"The Nothing Else To Do Battle Royal.\"",
          "link": "https://defector.com/you-cant-say-baby-blue-without-baby",
          "publishedOn": "2025-03-30T19:33:22.000Z",
          "wordCount": 7344,
          "title": "You Can’t Say Baby Blue Without ‘Baby’",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-1863295367-e1743360980117.jpg"
        },
        {
          "id": "https://defector.com/?p=185459",
          "author": "Ray Ratto",
          "description": "Jake Bauers looked history right in the eye and spat dead on its cornea. But that's what great non-pitcher pitchers do. And when they do it on a late-model recreation of the biggest stage of all, it is all the more, well, more.\nBauers, the Milwaukee Brewers' backup first baseman, was looking Saturday morning at a relatively relaxing afternoon in Yankee Stadium. He wasn't in the starting lineup and, if things went well, he wouldn't be needed. Instead, it went galactically not. The Yankees started the game with three consecutive first-pitch homers off Nestor Cortes, a major league record for instantaneous pitcher abuse, and even then it seemed fair to assume that Bauers wouldn't be needed for defensive or pinch-hitting reasons in a close game. But by the third inning, when 3-0 became 13-3, Bauers' availability became inevitability. As the Brewers' designated lost-cause pitcher, he has the responsibility of saving relievers' arms when a game is declared beyond redemption, and the Yankees had delivered the necessary conditions in near-record time.",
          "link": "https://defector.com/aaron-judge-destroys-pitchers-so-dont-be-a-pitcher-and-youll-be-fine",
          "publishedOn": "2025-03-30T15:53:38.000Z",
          "wordCount": 7477,
          "title": "Aaron Judge Destroys Pitchers, So Don’t Be A Pitcher And You’ll Be Fine",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2207244782-e1743349091392.jpg"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=847409",
          "author": "Mark Polishuk",
          "description": "The Royals have acquired Nick Gordon from the Orioles, FanSided’s Robert Murray reports.  Baltimore’s end of the trade return isn’t yet known.  Gordon signed a minor league deal with the O’s last winter, and he’ll now join the team that his father Tom pitched with from 1988-95. Drafted fifth overall by the Twins in 2014,…",
          "link": "https://www.mlbtraderumors.com/2025/04/royals-acquire-nick-gordon.html",
          "publishedOn": "2025-04-05T17:28:28.000Z",
          "wordCount": 3371,
          "title": "Royals Acquire Nick Gordon",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/08/nick-gordon-marlins-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=847094",
          "author": "Nick Deeds",
          "description": "Opening Day has finally arrived, and teams all around the league are gearing up for another pennant chase in hopes of being crowned this year’s World Series champion. Of course, there’s still another seven months to go before someone raises the Commissioner’s Trophy. Until the playoffs begin, teams will be focused on a smaller goal:…",
          "link": "https://www.mlbtraderumors.com/2025/04/poll-who-will-win-the-al-central-3.html",
          "publishedOn": "2025-04-02T20:10:03.000Z",
          "wordCount": 4907,
          "title": "Poll: Who Will Win The AL Central?",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/04/USATSI_24475213-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=846822",
          "author": "Steve Adams",
          "description": "The Royals announced Monday that they’ve selected the contract of infielder/outfielder Tyler Tolbert from Triple-A Omaha. They had an open 40-man spot already and only needed to clear an active roster spot, which they did by placing outfielder Dairon Blanco on the 10-day IL due to right Achilles tendinopathy. More to come.",
          "link": "https://www.mlbtraderumors.com/2025/03/royals-select-tyler-tolbert.html",
          "publishedOn": "2025-03-31T16:10:14.000Z",
          "wordCount": 3345,
          "title": "Royals Select Tyler Tolbert",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/03/tyler-tolbert-royals-1024x683.jpg"
        }
      ]
    },
    {
      "title": "Flaming Hydra",
      "feedUrl": "https://flaminghydra.com/rss/",
      "siteUrl": "https://flaminghydra.com/",
      "articles": [
        {
          "id": "67f3e8ae5aa1bd00010c0562",
          "author": "The Editors",
          "description": "Jack Pendarvis on Tinseltown; flash fictions by Luke O’Neil",
          "link": "https://flaminghydra.com/issue-293/",
          "publishedOn": "2025-04-07T22:36:25.000Z",
          "wordCount": 640,
          "title": "The Diceman cometh / Bunny business",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/bignight-1.jpg"
        },
        {
          "id": "67f442645aa1bd00010c065f",
          "author": "Luke O'Neil",
          "description": "Updates from my backyard March 2005 \nTechnically speaking it wasn’t quite spring just yet but this little rabbit didn’t know that. It was running undisciplined routes across the yard like a rookie slot receiver and now came back around for another sniff of the dead",
          "link": "https://flaminghydra.com/easy-to-do/",
          "publishedOn": "2025-04-07T22:24:08.000Z",
          "wordCount": 820,
          "title": "Easy to do",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/rabbit.jpg"
        },
        {
          "id": "67f433b95aa1bd00010c05bb",
          "author": "Jack Pendarvis",
          "description": "Ace Goes to Hollywood is a continuing transcript of a ride from Oxford, Mississippi, to Memphis, Tennessee, during which Jack Pendarvis interviewed Ace Atkins about his work on the Pauly Shore film Jury Duty.\n\nEpisode 3: Ace’s Big Break!\nJACK: Let’s talk about some of the",
          "link": "https://flaminghydra.com/ace-goes-to-hollywood-episode-3/",
          "publishedOn": "2025-04-07T22:21:51.000Z",
          "wordCount": 667,
          "title": "Ace Goes to Hollywood: Episode 3",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/bignight.jpg"
        },
        {
          "id": "67f0599304f5080001bae87b",
          "author": "The Editors",
          "description": "John Saward at home in Chicago; A.J. Daulerio looks back in disbelief at 2005",
          "link": "https://flaminghydra.com/issue-292/",
          "publishedOn": "2025-04-04T23:21:01.000Z",
          "wordCount": 653,
          "title": "New warmth / Old hotness",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/johnsaw-1.jpg"
        },
        {
          "id": "67f04dc604f5080001bae7cb",
          "author": "A.J. Daulerio",
          "description": "A few months ago, a friend sent me several boxes of god-knows-what he’d been storing for me in a relative’s basement for almost seven years after I left my Brooklyn apartment. The boxes were expensive to send, and my friend didn’t have enough money",
          "link": "https://flaminghydra.com/some-like-it-hot-100/",
          "publishedOn": "2025-04-04T23:18:30.000Z",
          "wordCount": 745,
          "title": "Some Like It HOT 100",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/HOT-crop-16x9.jpg"
        },
        {
          "id": "67f060b204f5080001bae8b2",
          "author": "John Saward",
          "description": "winter in Chicago leaves town",
          "link": "https://flaminghydra.com/where-im-thawing-from/",
          "publishedOn": "2025-04-04T23:17:39.000Z",
          "wordCount": 602,
          "title": "Where I’m Thawing From",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/johnsaw.jpg"
        },
        {
          "id": "67eeff0f04f5080001bad3eb",
          "author": "The Editors",
          "description": "Jídé Salawu’s reflections on the film ‘October 1’; Tom Scocca inspects a ticker symbol",
          "link": "https://flaminghydra.com/issue-291/",
          "publishedOn": "2025-04-03T22:31:06.000Z",
          "wordCount": 328,
          "title": "Mob mentality / Windblown trash",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/oct1-1.jpg"
        },
        {
          "id": "67eefe3d04f5080001bad3d8",
          "author": "Jídé Salawu",
          "description": "a collective of 60 writers, on fire and hard to kill",
          "link": "https://flaminghydra.com/the-low-trust-society/",
          "publishedOn": "2025-04-03T22:28:38.000Z",
          "wordCount": 299,
          "title": "The Low-Trust Society",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/oct1.jpg"
        },
        {
          "id": "67eef75504f5080001bad3b2",
          "author": "Tom Scocca",
          "description": "a collective of 60 writers, on fire and hard to kill",
          "link": "https://flaminghydra.com/tsla-goes-up-and-down/",
          "publishedOn": "2025-04-03T22:28:08.000Z",
          "wordCount": 303,
          "title": "TSLA Goes Up and Down",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/tsla.jpg"
        },
        {
          "id": "67ed792504f5080001babdcf",
          "author": "The Editors",
          "description": "Joe Macleod writes by hand; Laurie Woolever gives out cash",
          "link": "https://flaminghydra.com/issue-290/",
          "publishedOn": "2025-04-03T00:13:28.000Z",
          "wordCount": 811,
          "title": "Scanty writing / Generous attitude",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/GOLF-PENCILS-EBAY-s-l1600-1.png"
        },
        {
          "id": "67edc8af04f5080001babf09",
          "author": "Joe MacLeod",
          "description": "I worry about tiny pencils sometimes. Not regular-sized pencils, I think they have lots of users, like artists, and schoolchildren, learning to write, but no more cursive, right? That’s too bad. I don’t know what tools children have in school, do they still use pencils or",
          "link": "https://flaminghydra.com/the-last-marks-of-the-tiny-pencil/",
          "publishedOn": "2025-04-03T00:12:45.000Z",
          "wordCount": 853,
          "title": "The Last Marks of the Tiny Pencil",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/GOLF-PENCILS-EBAY-s-l1600.png"
        },
        {
          "id": "67eda43304f5080001babe29",
          "author": "Laurie Woolever",
          "description": "Millicent Souris is a writer whose work often stops me in my tracks. Or rather, her newsletter comes out on Monday mornings and I often read it before I get out of bed, so really Millicent’s writing keeps me prone, agog. She writes about scrapple (“That crispy",
          "link": "https://flaminghydra.com/people-in-need/",
          "publishedOn": "2025-04-03T00:12:08.000Z",
          "wordCount": 617,
          "title": "People in Need",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/flames-edit658-16x9-flat-really-16x9.png"
        },
        {
          "id": "67ec2999dbbca9000163ef64",
          "author": "The Editors",
          "description": "Nathan Munn, reporting from Canada",
          "link": "https://flaminghydra.com/issue-289/",
          "publishedOn": "2025-04-01T23:14:48.000Z",
          "wordCount": 2360,
          "title": "On guard",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/bear-2-000612-0004-000370-2.jpg"
        },
        {
          "id": "67ec3391dbbca9000163f017",
          "author": "Nathan Munn",
          "description": "A dispatch from Canada",
          "link": "https://flaminghydra.com/at-the-edge-of-empire/",
          "publishedOn": "2025-04-01T23:13:48.000Z",
          "wordCount": 2314,
          "title": "At the Edge of Empire",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/bear-2-000612-0004-000370.jpg"
        },
        {
          "id": "67eade3a7248c5000160b9f8",
          "author": "The Editors",
          "description": "That's just the way Rax King talks; Colin McGowan trips out on the sofa",
          "link": "https://flaminghydra.com/issue-288/",
          "publishedOn": "2025-03-31T21:55:16.000Z",
          "wordCount": 779,
          "title": "Crowded vowels / Lonesome heroes",
          "imageUrl": "https://flaminghydra.com/content/images/2025/03/hunger-games-catching-fire-justice-16x9-1.jpg"
        },
        {
          "id": "67eada2c7248c5000160b9cc",
          "author": "Rax King",
          "description": "Like the D.C. native herself, the D.C. accent is rarely even named, much less considered and discussed. Linguists have a hard time nailing it down because the city’s population is so transient, changing over with every new congressional and presidential term. A minority of the adults",
          "link": "https://flaminghydra.com/the-d-c-accent/",
          "publishedOn": "2025-03-31T21:54:48.000Z",
          "wordCount": 791,
          "title": "The D.C. Accent",
          "imageUrl": "https://flaminghydra.com/content/images/2025/03/hunger-games-catching-fire-justice-16x9.jpg"
        },
        {
          "id": "67eadb037248c5000160b9e2",
          "author": "Colin McGowan",
          "description": "Lieutenant Columbo pulls up to the home of this week’s murderer in a shitty car, emerging in a raincoat that suggests he knows something we don’t about the coming weather. We’re in sunny Los Angeles, aren’t we? But this is part of",
          "link": "https://flaminghydra.com/troub/",
          "publishedOn": "2025-03-31T21:54:23.000Z",
          "wordCount": 797,
          "title": "Troubles in the Dark",
          "imageUrl": "https://flaminghydra.com/content/images/2025/03/Peter_Falk_-_1973-hero.jpg"
        }
      ]
    },
    {
      "title": "Today in Tabs",
      "feedUrl": "https://rss.beehiiv.com/feeds/ZRiesnGI0u.xml",
      "siteUrl": "https://www.todayintabs.com/",
      "articles": []
    },
    {
      "title": "Bad Faith Times",
      "feedUrl": "https://bad-faith-times.ghost.io/rss/",
      "siteUrl": "https://bad-faith-times.ghost.io/",
      "articles": [
        {
          "id": "67f3e17e8b52b30001dc9a83",
          "author": "Denny Carter",
          "description": "How did Americans vote for a man who pledged to collapse the global economy? The algorithm told us to.",
          "link": "https://bad-faith-times.ghost.io/the-algorithms-economic-unreality/",
          "publishedOn": "2025-04-07T15:06:17.000Z",
          "wordCount": 1940,
          "title": "The Algorithm's Economic Unreality",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/04/economic-damage-Advantus-Media-768x576.jpg"
        },
        {
          "id": "67f012c46edde70001bb554c",
          "author": "Denny Carter",
          "description": "Why we have to break free from a right-wing, individualistic interpretation of free speech",
          "link": "https://bad-faith-times.ghost.io/good-news-the-eu-wants-to-censor-elon-musk/",
          "publishedOn": "2025-04-04T17:52:36.000Z",
          "wordCount": 758,
          "title": "Good News: The EU Wants To Censor Elon Musk",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/04/Screenshot-2025-04-04-at-1.49.36-PM.png"
        },
        {
          "id": "67ed58976edde70001bb4e18",
          "author": "Denny Carter",
          "description": "This week brought a shift in strategy and mindset for those who oppose the authoritarian takeover of the US. Just don't call it momentum.",
          "link": "https://bad-faith-times.ghost.io/dont-call-it-momentum/",
          "publishedOn": "2025-04-03T14:14:45.000Z",
          "wordCount": 2223,
          "title": "Don't Call It Momentum",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/04/Screenshot-2025-04-02-at-11.32.31-AM.png"
        },
        {
          "id": "67ebe54e9df7290001a3ee81",
          "author": "Denny Carter",
          "description": "Elon Musk and DOGE are deleting American history that runs afoul of a fascist worldview. Their success is hardly a foregone conclusion.",
          "link": "https://bad-faith-times.ghost.io/doge-is-editing-american-history-it-might-not-work/",
          "publishedOn": "2025-04-01T15:01:34.000Z",
          "wordCount": 2771,
          "title": "DOGE Is Editing American History. It Might Not Work.",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/size/w1200/2025/04/Screenshot-2025-04-01-at-10.57.58-AM.png"
        },
        {
          "id": "67e9868149390f0001501eef",
          "author": "Denny Carter",
          "description": "Musk again ran to Fox News to whine about a politician saying mean things about him",
          "link": "https://bad-faith-times.ghost.io/i-am-begging-elon-musk-to-cry-more-2/",
          "publishedOn": "2025-03-31T11:07:42.000Z",
          "wordCount": 936,
          "title": "I Am Begging Elon Musk To Cry More",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/size/w1200/2025/03/Screenshot-2025-03-31-at-7.07.13-AM.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}