{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": []
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=192457",
          "author": "Lucy Bloom",
          "description": "The 2025 Angels have been startlingly okay thus far. Mike Trout hasn't looked himself and is currently the everyday DH, but he's been doing better lately. The various castoffs that make up the rotation are mostly pitching acceptably, and the franchise's strategy of immediately calling up their '22 and '23 first rounders has looked real smart. Continuing this philosophy, on Friday the club called up their 2024 first rounder, second baseman Christian Moore.\nNormally, when a team brings a highly touted 22-year-old to the show, you can write something about him like \"this guy's been tearing up the minors.\" But Moore's stats are actually pretty startling. He's striking out 27 percent of the time down there. And his defense has been terrible. What is Perry Minasian thinking? Well, when he looks at his infield, what he's probably thinking is Oh no. Here's a rundown of the Angels' non-Moore infielders this season. They've been, well, unique. In order of plate appearances:",
          "link": "https://defector.com/angels-call-up-christian-moore-as-infield-crisis-counselor",
          "publishedOn": "2025-06-13T21:23:51.000Z",
          "wordCount": 7554,
          "title": "Angels Call Up Christian Moore As Infield Crisis Counselor",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2203971799.jpg"
        },
        {
          "id": "https://defector.com/?p=192468",
          "author": "Soraya Roberts",
          "description": "There’s been this ongoing concern, I mean like in the air, for a while now, about people’s attention spans. I find it even creeping into my conversations. \"Is this boring?\" I'll ask a few minutes into a story. \"Am I boring you?\" People usually laugh and say something like, You'll know if I'm bored. But I never used to do that. I never used to be self-conscious about, I don't know, wasting time? I was listening to a podcast recently and Loyle Carner, this British musician, mentioned how grateful he was that this author he had read had basically summarized her whole book in the first chapter, because even when he has every good intention, he won't always finish the entire thing. He sounded sheepish about it. I don't know why. The fact that he reads is rare enough, right? \n\"Stick with it,\" my brother said when I started watching Dept. Q. \"It's a slow burn.\" I mean, that's one way to put it. The first episode of Dept. Q is a SLOG. I was really excited going in—a Scottish show about a basement-dwelling trio of cold-case detectives starring a scruffy Matthew Goode and the amazing-faced actress Kate Dickie as his long-suffering boss? Yes, it sounds a little like Slow Horses, but how is that a bad thing? But then I started watching it and thought: Is this an assignment? This show looks like no one wants to be here, down to the set designer. Goode is phoning it in, the flashbacks are excessive, the pacing is so glacial it's basically stagnant. It was all so ... uninspiring, so generic, like someone fed \"dark uk detective series\" into an AI model. I couldn't figure out why this was happening: Did they not have much money? Was this Netflix's fault? I texted my brother midway through that first episode: \"Are you using slow burn as a euphemism for boring?\" He texted back: \"Stick with it.\"",
          "link": "https://defector.com/stick-with-dept-q",
          "publishedOn": "2025-06-13T17:29:32.000Z",
          "wordCount": 8959,
          "title": "Stick With ‘Dept. Q’",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/Dept_q.png"
        },
        {
          "id": "https://defector.com/?p=191536",
          "author": "Sabrina Imbler",
          "description": "When Mary Giovagnoli was in law school, she spent a year working as a junior public defender representing people accused of misdemeanors. \"I really liked the work, but it was emotionally devastating, because you got very wrapped up in your clients' cases,\" Giovagnoli said. She felt that only the prosecutors held real power; Giovagnoli would make her clients' cases, but the final decision was out of her hands. Then something clicked. \"I realized that public service for me probably meant trying to be within the government to improve things,\" she said.\nWith this in mind, Giovagnoli became an attorney for the U.S. Immigration and Naturalization Service and spent the next two decades switching between jobs with the government and nonprofits, eventually focusing on the welfare of unaccompanied children, meaning any child under 18 who arrives in the United States without a parent or guardian. Since 1997, a legal settlement called the Flores agreement has enshrined basic rights and protections for children held in federal immigration custody. \"The agreement acknowledged that children have unique needs and response and we have a unique responsibility to them,\" Giovagnoli said. \"That the goal should not be to keep children in detention, but to release them to a family member as quickly and as safely as possible, keep them in as least restrictive a setting as possible.\"",
          "link": "https://defector.com/an-interview-with-a-fired-unaccompanied-children-ombuds",
          "publishedOn": "2025-06-13T16:38:56.000Z",
          "wordCount": 14869,
          "title": "An Interview With A Fired Unaccompanied Children Ombuds",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/IMG_5135-rotated.jpeg"
        },
        {
          "id": "https://defector.com/?p=192463",
          "author": "Patrick Redford",
          "description": "Brandy: Let me start by saying thank you, Patrick, for picking this book. I enjoyed it enormously. I will also now immediately display ingratitude by ignoring what you said in your lovely introductory essay and say that I read this book as a metaphor. Specifically, it felt to me of a piece with another genre of slim, semi-autobiographical volume from a European writer: an account of a woman being driven to madness by an obsession for which she is willing to suffer, by which I mean, of course, being catastrophically in love with some guy. The way Krabbé is alternately so clear-eyed and willing to lie to himself, the debasement followed by the self-aggrandizement, the devotion unto despair… these all felt quite familiar to me as a fan of that other genre of book!\nKathryn: It’s funny, Brandy, because I also experienced it as a semi–psychological horror, though for the same reasons that Patrick mentions in his essay, in terms of how narrow the focus of the novel is on the act of competition. Absent projection or meaning-making, the emotional extremes of competitiveness wind up being so petty and ugly and ignoble—which is useful to be reminded of as I’ve gotten into more of the fucked up, suffering-based sports out there (tennis, the concept of Marc Márquez in MotoGP). Though I am also beginning to believe that cycling is just psychological horror.",
          "link": "https://defector.com/tim-krabbes-the-rider-won-us-over-by-losing",
          "publishedOn": "2025-06-13T15:48:21.000Z",
          "wordCount": 13108,
          "title": "Tim Krabbe’s ‘The Rider’ Won Us Over By Losing",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/tim-krabbe-the-rider.jpg"
        },
        {
          "id": "https://defector.com/?p=192447",
          "author": "Abigail Segel",
          "description": "Michelle Cooper took her time. When Temwa Chawinga sent a slow ball to the space in front of her—a ball Chawinga only had because of a turnover Cooper had caused—she moved laterally with it, waiting for it to come across her body. She timed her steps and her shot perfectly. The moment she arrived to the ball was when she had maximum space from both Emily Sonnett and Ann-Katrin Berger, who were moving toward her from opposite directions. But once each piece was aligned—Berger and Sonnett out of the way, the ball on her preferred right foot, and her body faced up toward the net—she pounced. Without any superfluous touches, she slotted the ball inside the far post, past Berger’s desperate reach. \nShe could afford to be patient. It was only the third minute of the match.",
          "link": "https://defector.com/michelle-cooper-is-always-ready-to-pounce",
          "publishedOn": "2025-06-13T15:22:28.000Z",
          "wordCount": 8934,
          "title": "Michelle Cooper Is Always Ready To Pounce",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2219376645.jpg"
        },
        {
          "id": "https://defector.com/?p=192305",
          "author": "Kelsey McKinney",
          "description": "Welcome to Ask The Book Doctor, a recurring series about books and reading them.\nIt's natural to fall out of reading simply because of circumstance. Every time I am on vacation, I devour books—put me on a plane, any plane, and I'll finish a book. But plop me back in my normal life where the shelves are dusty and the groceries need to be bought and my friends are going to a bar after work, and the appeal of picking up a book diminishes. It is easy to allow yourself to build a world in your mind when you have space there. It is much harder to make the words on the page into pictures when your mind is far too busy with other obligations.",
          "link": "https://defector.com/i-had-a-baby-and-now-i-cant-read-what-do-i-do",
          "publishedOn": "2025-06-13T14:30:02.000Z",
          "wordCount": 8606,
          "title": "I Had A Baby And Now I Can’t Read! What Do I Do?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/book-doctor-example.jpg"
        },
        {
          "id": "https://defector.com/?p=192412",
          "author": "Barry Petchesky",
          "description": "The Edmonton Oilers' maddening, decade-long goalie controversy is over ... for the next week, anyway. As that next week contains the entirety of what is now a best-of-three Stanley Cup Final, it feels like a mercy. Calvin Pickard, after two periods and most of an overtime of effective relief in Thursday's absurd 5–4 win, will be the man between the pipes, as there is simply not enough time left to survive any sort of disaster that might tempt head coach Kris Knoblauch to go back to Stuart Skinner.\nThis is not necessarily the ideal situation. (Say what you will about Sergei Bobrovsky and his contract and his very good but not elite play—there's something to be said for just not having to ever worry about the position.) It's certainly not a normal one for a team two wins from a Cup, to be still figuring out its best netminder. But nothing these Oilers do is normal. They became just the seventh team in NHL history, and the first since 2006 to come back from three goals down to win a Cup Final game. They became the first team ever to do it after digging that three-goal deficit in the first period. They couldn't have squirmed (clawing is for Panthers) back into it without Pickard. They might not have made it out of the first damn round.",
          "link": "https://defector.com/calvin-pickard-saved-the-day",
          "publishedOn": "2025-06-13T13:57:32.000Z",
          "wordCount": 8488,
          "title": "Calvin Pickard Saved The Day",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2219874989.jpg"
        },
        {
          "id": "https://defector.com/?p=192435",
          "author": "Ray Ratto",
          "description": "Trying to figure out how Leon Draisaitl's game-winning goal found glory when it barely found 30 mph is a waste of your time. What you should be noticing instead in the wake of Edmonton's wonderfully absurdist 5–4 overtime victory over Florida in Game 4 of the Stanley Cup Final is how delightfully it fits into the broader theme these two teams have crafted over two seasons. Namely, that they are the perfectly weighted rivalry for our time: two teams that when they attempt to be their own best selves adhere to each other, separated only when one team or the other loses its way and tries to be the other team's opponent rather than the idealized version of itself.\nSo ignore for a moment the sheer dumb luck of Draisaitl's rush that resulted in a modest backhand that ever so slightly deflected off Florida defenseman Niko Mikkola and past Florida goaltender Bob. The result, which evened the series at two wins apiece, and the time, 11:36 p.m. Eastern Daylight Time, are the explanation. Well, unless you think Taylor Swift had something to do with it.",
          "link": "https://defector.com/oilers-panthers-isnt-a-rivalry-its-a-saga",
          "publishedOn": "2025-06-13T13:35:29.000Z",
          "wordCount": 7852,
          "title": "Oilers-Panthers Isn’t A Rivalry, It’s A Saga",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2219887914.jpg"
        },
        {
          "id": "https://defector.com/?p=192192",
          "author": "Maitreyi Anantharaman",
          "description": "Watch basketball games for a living and you develop a certain tolerance for garbage—a fondness, even. Bad teams make visible all the neat and complicated parts of the sport. In an “I can fix them” sort of way, these teams are sometimes the most endearing. It's hard to look at even the WNBA’s worst without finding something to grasp, some little thread of hope. \nAlas, I’m drawing a blank with the Chicago Sky, who are 2-6, both of those wins over the league-worst 1-10 Dallas Wings. In retrospect, the Sky’s disastrous start to the season makes perfect sense. An offense that ranked near the bottom of the league in 2024 lost its leading scorer in the offseason. At the trade deadline last year, it also lost its second-best scorer. The Sky locker room might be more functional for the absence of Chennedy Carter and Marina Mabrey, but the two of them did score points! It is also a team theoretically built to feature two non-shooting bigs, one of whom is currently the league’s worst finisher.",
          "link": "https://defector.com/yes-the-sky-is-falling-for-the-sky",
          "publishedOn": "2025-06-12T21:40:43.000Z",
          "wordCount": 8076,
          "title": "Yes, The Sky Is Falling For The Sky",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2219567450.jpg"
        },
        {
          "id": "https://defector.com/?p=192322",
          "author": "Defector Staff",
          "description": "Last fall, Defector R&D announced another paradigm-disrupting plan for Year 5. We would once again run a Tip Jar drive to top off our Pay Forward A Subscription fund, but this time we’d give one lucky entrant the opportunity to have Drew Magary come cook them a meal. We drew that winner in early December, […]",
          "link": "https://defector.com/we-let-drew-cook",
          "publishedOn": "2025-06-12T19:56:51.000Z",
          "wordCount": 5659,
          "title": "We Let Drew Cook",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/Drew_Cooking.png"
        },
        {
          "id": "https://defector.com/?p=192270",
          "author": "David Roth",
          "description": "It is not a boast and not an apology, but simply an assertion of fact: I could be awakened from a deep sleep, abducted from public transit, or otherwise put under extreme duress and still happily be able to talk about The Simpsons for a solid hour. I am fortunate, I think, that my youth overlapped with a period of time during which The Simpsons was basically the wildest and most innovative television programming that anyone had ever seen. I write \"I think,\" there, because I am aware that all those bits and songs and in-jokes are taking up space in my brain that might otherwise be occupied by, say, \"things I learned in college.\" Still, I can't say I really regret it. If you have to fill your brain up with anything, it might as well be the funniest stuff that's ever been on TV.",
          "link": "https://defector.com/monorail-origins-with-alan-siegel",
          "publishedOn": "2025-06-12T19:33:20.000Z",
          "wordCount": 7545,
          "title": "Monorail: Origins, With Alan Siegel",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/Steamed-Hams-YouTube-06-11-2025_11_56_PM.png"
        },
        {
          "id": "https://defector.com/?p=192313",
          "author": "Drew Magary",
          "description": "There was a time in my youth where the anticipation of a concert was better than the concert itself. I saw a whole lot of incredible acts back then, but my memories of those shows are largely confined to their buildup. I remember waiting for hours—in a line that wrapped around the local Dayton’s department store—to score tickets to Van Halen, feeling like a prince when I reached the window and they still had seats left. I remember the giant, Hysteria-themed scrim that shielded Def Leppard’s in-the-round stage, and the band, from view before they went on. I remember standing on the main floor before a Poison concert with my friend Tony, gawking at all the women in attendance who had dressed themselves with the intent to score an invite backstage. Great moment to be a ninth grader.\nAbove all else, I remember the excitement. The electrical current inside of my body, growing to a crescendo as showtime drew nearer and nearer. The energy I intuited from everyone else in the arena as we endured the wait for the headliner to take the stage. The music blasting through the PA that kept getting louder and louder, to prime everyone for the real thing. And finally, the lights going off and all of us breaking into a spontaneous roar, a roar so loud that I couldn’t hear my own screams through it. I remember all of that, and in some ways that’s enough.",
          "link": "https://defector.com/metallica-is-forever",
          "publishedOn": "2025-06-12T17:55:04.000Z",
          "wordCount": 15264,
          "title": "Metallica Is Forever",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2218534209.jpg"
        },
        {
          "id": "https://defector.com/?p=192337",
          "author": "Ray Ratto",
          "description": "What is visible in most coaching searches is largely iceberg-ish in nature, in that we see 10 percent of the process and then, mostly out of self-aggrandizement, measure it at 90 percent from there. But let's play the game anyway and laugh the fit of our trousers off at the number of teams that have received requests from the New York Knicks to talk to their coaches about a new job and responded with an emphatic \"Shove off, Guitar Boy.\"\nTo date, Dallas, Minnesota, Houston, and Atlanta have all refused Knicks chief ball guy Leon Rose and owner Jimmy Dolan permission to discuss their vacancy with, in order, Jason Kidd, Chris Finch, Ime Udoka, and Quin Snyder. Of those four, Atlanta's refusal was described as \"emphatic.\" One presumes that is code for \"shove off,\" but it could have been “no way,” “get bent,” or something more profane. Possibly much more profane. Again, there’s just so much about this process that is invisible to the public.",
          "link": "https://defector.com/the-whole-nba-is-telling-james-dolan-to-piss-off",
          "publishedOn": "2025-06-12T17:22:34.000Z",
          "wordCount": 7778,
          "title": "The Whole NBA Is Telling James Dolan To Piss Off",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-1943614045.jpg"
        },
        {
          "id": "https://defector.com/?p=191857",
          "author": "Patrick Redford",
          "description": "Sports are simple. That is perhaps their most crucial property, the attribute that makes sports interesting to write and read about yet simultaneously makes doing so depend, to greater or lesser degrees, on mistranslation. The French Open final, an afternoon Golden State Valkyries game, Stage 20 of the Giro d'Italia: These are all rich texts that can be mined for pathos, meaning, and critical perspectives on gender, pan-European identity in the 21st century, or whatever, but at their core, none of them are \"about\" anything larger than their competitive structure. The games happen on their own terms and are projected outward for us, the non-competing public, to contextualize them as we see fit. But what is lost in any such act of projection?\nThat's one of the questions raised and dealt with in Tim Krabbe's The Rider, a work that achieves transcendence via fidelity. Krabbe's semi-autobiographical novel, translated from the Dutch by Sam Garrett, is extremely simple. He tells the story of the Tour de Mount Aigoual, \"the sweetest, toughest race of the season,\" taking the reader kilometer-by-kilometer through the race, using its climbs, weather systems, and intrapeloton dynamics as entry points to write about the theory, practice, and what could fairly be characterized as the esoteric mysticism of road cycling. Krabbe is a somewhat tragic figure, a chess player who only became a rider in his early 30s, someone who had the talent to win more frequently and at a higher level than he ever was able to but started too late to be anything more than a very good amateur.",
          "link": "https://defector.com/why-the-rider-is-the-best-sports-book-ive-ever-read",
          "publishedOn": "2025-06-12T16:59:37.000Z",
          "wordCount": 9967,
          "title": "Why ‘The Rider’ Is The Best Sports Book I’ve Ever Read",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/tim-krabbe-the-rider.jpg"
        },
        {
          "id": "https://defector.com/?p=192296",
          "author": "Lauren Theisen",
          "description": "It's impossible for me to think about Brian Wilson, who died on Wednesday, without picturing myself awake in my teenage bedroom at some sort of goblin hour. I still have very late nights, but they look a lot different—healthier, more organized. If I lose sleep now, it's because I'm so busy. If I lost a lot of sleep then, it was ... well, I guess you'd just call it anxiety. I wouldn't be able to sit still, or relax my brain, because my body just didn't want to shut off. I'd write jittery little poetry in my notebook, and pace around what little space I had, and listen to the Beach Boys.\nI don't remember a specific moment where I was introduced to them, but at some point in my teen years, as I developed both taste in music and an interest in drugs, I got a burned-CD copy of Pet Sounds. Rounding out the collection soon after was the download of a sprawling Beach Boys greatest hits album from the library, and a more questionably obtained digital copy of The Smile Sessions, a big set devoted to the almost mythical, partially failed studio work that followed up the band's arrival on the absolute cutting edge of modern pop. That was my Beach Boys canon, and there were a few tracks in particular that I'd cycle through again and again when it felt like nobody else was awake. \"Surf's Up,\" a delicate piano ballad that flips the whole fun-loving simplicity of the group's signature tunes on its head. \"Caroline, No,\" a plaintive longing for eternal love. And of course, \"God Only Knows,\" this divine wind that blows into your ears and leaves you (or at least me) forever changed, stunned by the possibility of melody and arrangement. I'd listen to these and write, but maybe more often I'd listen and just focus intently on them, my unslowing brain wrapping itself around every note. Hearing Wilson's songs, I felt separate from the world I knew.",
          "link": "https://defector.com/brian-wilson-was-the-sound-of-something-just-out-of-reach",
          "publishedOn": "2025-06-12T15:29:07.000Z",
          "wordCount": 8285,
          "title": "Brian Wilson Was The Sound of Something Just Out Of Reach",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-13886529361.jpg"
        },
        {
          "id": "https://defector.com/?p=192266",
          "author": "Dave McKenna",
          "description": "Brian Wilson, the guy behind some of the happiest sad songs in pop history, is dead. \nTake “Wouldn’t It Be Nice,” which I’d say is my favorite Beach Boys tune if you asked me right now, the day after Wilson died at 82 years old. The song, the first track from Pet Sounds, the band's peerless 1966 album which Wilson produced, arranged, and wrote most of, finds a young man wanting more out of life and love than he’s getting, and hoping a day comes when he gets it.  Wouldn’t it be nice to be happy?",
          "link": "https://defector.com/brian-wilson-was-a-sad-genius-who-brought-joy-to-the-world",
          "publishedOn": "2025-06-12T13:39:34.000Z",
          "wordCount": 8206,
          "title": "Brian Wilson Was A Sad Genius Who Brought Joy To The World",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-74301080.jpg"
        },
        {
          "id": "https://defector.com/?p=192283",
          "author": "Tom Ley",
          "description": "The Indiana Pacers left the devil at home on Wednesday night. They didn't need him to beat the Oklahoma City Thunder, 116–107, and take a 2-1 lead in the NBA Finals.\nThroughout these playoffs, the Thunder have always felt like the constant in the equation that makes up any one game. We could head into every game assured that the Thunder were A) going to apply immense pressure on the other team through physical and aggressive defensive play, and B) make plenty of room for Shai Gilgeous-Alexander to turn the screws at the other end with his shotmaking, driving, and foul-drawing. Those things always happening didn't necessarily mean that the Thunder would always win, but if they lost it was because an unexpected variable showed up somewhere else. Maybe the other team managed not to turn the ball over, or got unsustainably hot from three; maybe Mark Daigneault overthought his rotations or his late-game strategy; maybe someone hit a miracle shot at the buzzer.",
          "link": "https://defector.com/not-so-funny-when-someones-doing-that-shit-to-you-is-it",
          "publishedOn": "2025-06-12T13:17:07.000Z",
          "wordCount": 8590,
          "title": "Not So Funny When Someone’s Doing That Shit To You, Is It?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2219718202.jpg"
        },
        {
          "id": "https://defector.com/?p=191779",
          "author": "Sabrina Imbler",
          "description": "Laura Mata López was born and raised in a low-income community in San José, Costa Rica. Some of her earliest memories were of the impact poverty and a lack of support for mental health had on her neighbors. Mata López's mother and grandmother had migrated to Costa Rica from Colombia during the Colombian civil war, severing them from their roots and family. For a period of time, Mata López's family was undocumented in Costa Rica, although their route to citizenship there was fairly easy. \"Even then, I always had this identity of being a migrant and being an other,\" Mata López said.\nWhen Mata López was 12 years old, she immigrated to New York City, where her mother cleaned houses. When she started school, Mata López became selectively mute, a condition she could not name at the time. She was overcome with a knot in her throat when her mom dropped her off at school, only regaining the ability to speak when she returned home and spoke with her family in Spanish.",
          "link": "https://defector.com/an-interview-with-a-psychiatric-nurse-whose-research-funding-was-cut-by-the-trump-administration",
          "publishedOn": "2025-06-11T19:05:16.000Z",
          "wordCount": 15218,
          "title": "An Interview With A Psychiatric Nurse Whose Research Funding Was Cut By The Trump Administration",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/Laura-Mata-Feb-2025-15-e1749655330740.jpeg"
        },
        {
          "id": "https://defector.com/?p=192237",
          "author": "Barry Petchesky",
          "description": "Pope Leo XIV celebrated his weekly general audience in St. Peter's Square this morning, so you might assume he donned a White Sox ballcap at the request of one of his parishioners. I think it much more likely he just wears this around all the time, even to formal events where it's entirely inappropriate. Have you met people from Chicago? He probably sold his mitre to buy a sandwich.\nThis fairly definitively puts to bed any lingering debate about which accursed Chicago franchise gets to claim the Pope, though the Cardinals and Padres could still make a case. In any event, the former Robert Prevost surely claims the White Sox—that is the face of a man who just heard that Jerry Reinsdorf might not sell the team until 2034.",
          "link": "https://defector.com/chicago-man-pope-leo-xiv-wears-white-sox-cap-to-work",
          "publishedOn": "2025-06-11T18:33:51.000Z",
          "wordCount": 5983,
          "title": "Chicago Man Wears White Sox Cap To Work",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2219033106.jpg"
        },
        {
          "id": "https://defector.com/?p=192184",
          "author": "Tom Ley",
          "description": "On Tuesday, the Wall Street Journal published an op-ed by Arkansas Senator Tom Cotton under the headline \"Tom Cotton: Send In The Troops, For Real.\" The piece was ostensibly written in response to the protests against the Trump administration's anti-immigrant crackdowns currently taking place in Los Angeles, and it argues that the administration should use an \"overwhelming show of force\" to put an end to the protests.\nIt's an odd piece of writing. For one thing, the troops have already been sent in—President Trump has sent National Guard troops and U.S. Marines to Los Angeles to guard federal buildings and ICE agents, against the wishes of California Governor Gavin Newsom. For another, the \"show of force\" has already happened—protestors have spent the last five days being beaten, arrested, tear-gassed, and shot with debilitating \"less lethal\" munitions. Taken on its own, it's hard to imagine what the editors of the WSJ opinion page might have expected moderately informed readers to gain from Cotton's piece, other than a vague sense of confusion and the less-vague sense that a United States Senator was upset.",
          "link": "https://defector.com/this-party-sucks",
          "publishedOn": "2025-06-11T15:31:08.000Z",
          "wordCount": 8374,
          "title": "This Party Sucks",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2162343537.jpg"
        },
        {
          "id": "https://defector.com/?p=192196",
          "author": "Jae Towle Vieira",
          "description": "I’ve made my fair share of terrible relationship decisions. There was the time my college sweetheart and I decided we would break up at the end of the semester, but stay together for the ensuing four months. There was the time I decided to date an ex of my nemesis. There was the time I decided it would be appropriate second-date behavior to light candles in every room my rental—in Tucson, in July, at 2:00 p.m. And then there was the time I agreed to an open relationship for the wrong reasons. \nThis feels like something of a rite of passage for those of us on the dating scene in the last few decades. In this case, however, our friend-of-a-friend makes a similar decision under much stranger conditions: she’s the tag-along girlfriend of a guy doing a six-month apprenticeship at an internet-famous bee farm, which happens to be thrumming with socialism and polyamory. We’re thrilled to bring you this tale of sex and chaos as our season finale!",
          "link": "https://defector.com/everyone-will-be-abuzz-about-the-season-8-finale",
          "publishedOn": "2025-06-11T15:07:14.000Z",
          "wordCount": 6759,
          "title": "Everyone Will Be Abuzz About The Season 8 Finale",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2023/03/Normal_Gossip_16-9_V2.png"
        },
        {
          "id": "https://defector.com/?p=192124",
          "author": "Chris Thompson",
          "description": "By at least one measure, the Boston Red Sox of 2025 are doing just fine. They've outscored their opponents on the season, modestly, but at a better clip than that of, say, the Philadelphia Phillies, who are presently nine games over .500 and slotted into the final National League wild card spot. Their lineup has been impressive, notwithstanding the lingering hurt feelings of a thoroughly jerked-around Rafael Devers: Boston ranks in the top six among all teams in batting average, on-base percentage, and slugging, yes with certain indications of batted-ball luck but nothing that would cause a Bostonian to assert any more than their usual dispensation of God's particular favor. Devers has been excellent; Carlos Narváez, Jarren Duran, and Ceddanne Rafaela have been productive; Kristian Campbell, a rookie, has cooled off some but has still performed pretty admirably for one who appears to be a lanky child. Alex Bregman has been an absolute stud.\nBy other measures, the Sox are feeling some mid-summer pressure. They're presently three games below .500, and are nine games back of the New York Yankees in their division, and are eighth in the wild card race, closer to the bottom than to the promised land. If the Baltimore Orioles were not cursed dog-doo, the Red Sox would almost certainly be last in the American League East, which incidentally is where they finished in consecutive seasons before seeming to take a step forward with 81 wins in 2024. This is not really a roster constructed to contend for a World Series, but the Red Sox have now hit a point in their rebuilding project where they will need to show some definite signs of seriousness in order to prove that they are not just settled into a condition of mediocrity, or worse. A fourth-place finish and 76-odd wins will be hard to explain as anything other than a stall.",
          "link": "https://defector.com/bwoop-bwoop-bwoop-now-the-red-sox-have-summoned-a-mighty-lad",
          "publishedOn": "2025-06-11T13:55:44.000Z",
          "wordCount": 9476,
          "title": "BWOOP BWOOP BWOOP! Now The Red Sox Have Summoned A Mighty Lad",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2219500778-1.jpg"
        },
        {
          "id": "https://defector.com/?p=191932",
          "author": "Kathryn Xu",
          "description": "Cal \"Big Dumper\" Raleigh is an outlier in the obvious sense—he is the current MLB home run leader—but pile on the descriptive adjectives, and you wind up with an amalgam of three truths, all theoretically past their prime: Cal Raleigh is a switch-hitting catcher who plays for the Mariners. Somehow, he is still the current MLB home run leader by a not-insignificant margin of two, his 26 homers beating out names like Aaron Judge and Shohei Ohtani. Per traditional standards, he is slashing a very respectable .264/.370/.632. Throw in some adjusted metrics, and he has a 182 wRC+, which is to say 82-percent better than the average MLB hitter, which is to say, the second-best player in baseball, beating out names like Freddie Freeman and Shohei Ohtani. Raleigh has, so far, cared not for the underpinnings of modern baseball. Where to even start? Perhaps in iambic tetrameter.\nPART I: THE CONCEPT OF BEING A GOOD CATCHER",
          "link": "https://defector.com/the-rime-of-the-big-dumper-or-how-and-in-what-manner-cal-raleigh-became-a-bonafide-slugger",
          "publishedOn": "2025-06-11T13:02:17.000Z",
          "wordCount": 12770,
          "title": "The Rime Of The Big Dumper, Or How And In What Manner Cal Raleigh Became A Bonafide Slugger",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/calRaleighBigDumperEtc.jpg"
        },
        {
          "id": "https://defector.com/?p=192126",
          "author": "David Roth",
          "description": "It is the nature of a really good catch to make you feel like what you've just seen is the coolest thing ever to happen. That is how you know that what you've just seen is really good, and you can tell that you have seen something sufficiently cool if, for a moment, you find yourself reconsidering everything else you've seen. A great play should disorient you; a really great one will feel as if it was dropped on you from a great height.\nThere is a whole disordered way of being a sports fan that is built around following that natural instinct to reconsider everything all the way out, and into recursive madness; at every game you attend, there will be thousands of other people there whose relationship with sports amounts to constantly rearranging the faces on their own personal Mounts Rushmore and updating and itemizing a detailed personal taxonomy of Signature Moments. As a general rule, I think it is better not to be like that, and to just let the awe overtake you when and where it finds you. Not because it is smarter or more reasonable; no one cares about sports to become smarter or more reasonable. Just because it is more fun.",
          "link": "https://defector.com/i-think-this-is-the-best-catch-ive-ever-seen",
          "publishedOn": "2025-06-10T22:14:19.000Z",
          "wordCount": 9662,
          "title": "I Think This Is The Best Catch I’ve Ever Seen",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2218855670.jpg"
        },
        {
          "id": "https://defector.com/?p=192046",
          "author": "David Roth",
          "description": "The fact that you are never quite as safe as you should be is one of the facts of contemporary American life, although the nature of that hazard varies from one American to the next. An unreasoning horror at and fear of the unknown is at the heart of the nation's dominant political movement, and while much of that is bullshit—think of the seething, car-brained fear of The Cities And Their Crime that animates so much conservative media and agitates so many conservatives into full-spectrum derangement—there is also some truth to all that perceived hazard. That social anxiety generally tends to be directed towards big, cinematic threats, both because that sort of thing makes for better TV and because the actual forces that make American life precarious do that work much more quietly.\nFew of those forces have done more damage, in relative secret, than the private equity firms that have spent the last few decades busily buying up and chewing through various American industries in relative secret are kind of abstract in comparison. What they have done, and what they do as a matter of course, is plenty brutal. It just isn't quite violent enough to rate.",
          "link": "https://defector.com/megan-greenwell-on-living-under-and-outside-of-private-equity-the-invasive-species-eating-american-life",
          "publishedOn": "2025-06-10T19:27:14.000Z",
          "wordCount": 16915,
          "title": "Megan Greenwell On Living Under And Outside Of Private Equity, The Invasive Species Eating American Life",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-1151373510.jpg"
        },
        {
          "id": "https://defector.com/?p=192077",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about the NBA, dogs, Los Angeles, and more.\nKurt:",
          "link": "https://defector.com/in-this-house-we-believe-faith-no-more-is-one-of-the-most-important-bands-in-history",
          "publishedOn": "2025-06-10T18:50:31.000Z",
          "wordCount": 17063,
          "title": "In This House We Believe Faith No More Is One Of The Most Important Bands In History",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-490059640.jpg"
        },
        {
          "id": "https://defector.com/?p=192058",
          "author": "Patrick Redford",
          "description": "When Golden State Valkyries coach Natalie Nakase sat down with ESPN for an interview shortly after her team's inaugural season began, the first question she fielded was an obvious one. What were her expectations? Her answer was honest, relatively optimistic, and riddled with coded ways to softly say the unavoidable: The Valks were probably going to lose a lot.\nI was with her when she said, \"It's going to take time,\" \"Let's just get one percent better every single day,\" and \"I just want them to play with joy,\" because expansion teams never win. Not in basketball, anyway, where individual star talent tends to be the one thing that matters. The last two teams to join the WNBA, Atlanta and Chicago, won four and five games, respectively, in their inaugural efforts. These Valkyries were all but explicitly constructed as a team of seat-warmers, here to give the front office an up-close look before this offseason's forthcoming free-agent apocalypse. They selected Lithuanian wing Juste Jocyte with their first-ever draft pick, yet she won't even play until next season. The roster is young, undersized, and extremely European (\"I have to learn French is what I’ve learned,\" Nakase recently quipped to the Athletic.)",
          "link": "https://defector.com/the-golden-state-valkyries-are-beloved-and-ahead-of-schedule",
          "publishedOn": "2025-06-10T17:36:43.000Z",
          "wordCount": 8437,
          "title": "The Golden State Valkyries Are Beloved And Ahead Of Schedule",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2216376042.jpg"
        },
        {
          "id": "https://defector.com/?p=192048",
          "author": "Lauren Theisen",
          "description": "When the Panthers acquired Brad Marchand at the trade deadline, it kind of felt like putting a hat on a hat. Or a rat on a rat. This was a team already known and feared and hated for the way they relentlessly antagonized their opponents, and the division-leading defending champs had returned their top eight players by points from the previous campaign. It was unclear if Marchand, who'd just suffered an injury, would make all that much of a difference in his first stop outside of Boston. But even if he didn't, Florida could taunt the rest of the league with just his presence. Oh, you called us dirty before? What will you think when we join up with the Mad Licker Of The West End?\nAs a regular-season Panther, Marchand did indeed contribute little of note, getting two meaningless goals in the last three games before the playoffs. But in the postseason, the 37-year-old has proven a nuisance, a playmaker, and a devastating scorer. Across what might turn out to be the most important stretch of the Stanley Cup Final, from the end of Game 2 to the start of Game 3, Marchand seized the spotlight.",
          "link": "https://defector.com/brad-marchand-is-still-a-royal-pain-in-the-ass",
          "publishedOn": "2025-06-10T17:03:00.000Z",
          "wordCount": 8332,
          "title": "Brad Marchand Is Still A Royal Pain In The Ass",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2219410609_cfe196.jpg"
        },
        {
          "id": "https://defector.com/?p=191831",
          "author": "Israel Daramola",
          "description": "Welcome to Listening Habits, a column where I share the music I’ve been fixated on recently.\nThere’s a profile of the Clipse in the latest issue of GQ. Timed to the imminent release of their long-awaited reunion album, Let God Sort Em Out—executive produced by Pharrell but no Chad Hugo—it’s full of little tidbits about Pusha T’s label drama and Malice’s long break from rap and all the things you might expect.",
          "link": "https://defector.com/is-this-an-era-of-cultural-stagnation",
          "publishedOn": "2025-06-10T16:35:39.000Z",
          "wordCount": 11288,
          "title": "Is This An Era Of Cultural Stagnation?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2158145760.png"
        },
        {
          "id": "https://defector.com/?p=191534",
          "author": "Diana Moskovitz",
          "description": "I heard Marc Maron announce he was ending his podcast the way that I imagine he'd've wanted me to—while walking through my neighborhood in Los Angeles, through wired headphones, just a little too hopped up on caffeine. A younger version of Maron would have given an \"Oh, come on!\" to my caffeine source, a matcha latte, as opposed to Maron's preference, the strongest coffee possible. But longtime listeners know Maron also went through a tea phase (episode 949), so I like to think that the current version of Maron would let it slide.\nI first listened to WTF with Marc Maron in October of 2010 (episode 117) because I heard This American Life host Ira Glass say that he had appeared on it. I was immediately hooked. I had simply never heard an interview like that one, with a host so engaged and a guest so honestly and openly themself. I binged as many as I could the following weekend while cleaning my apartment and told my long-distance boyfriend he had to start listening, too.",
          "link": "https://defector.com/there-will-never-be-another-wtf-with-marc-maron",
          "publishedOn": "2025-06-10T15:20:44.000Z",
          "wordCount": 25336,
          "title": "There Will Never Be Another ‘WTF With Marc Maron’",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2201393423-e1749147042631.jpeg"
        },
        {
          "id": "https://defector.com/?p=192004",
          "author": "Barry Petchesky",
          "description": "\"Well, definitely, the third period is an unraveling,\" Oilers coach Kris Knoblauch said, and he was underselling it in a nice little piece of dry coachspeak. Edmonton seized the opportunity of getting blown out to take out all their collected frustrations toward the Panthers, and they had plenty of those. That's sort of what the Panthers do. They make you very, very mad, and then you blow up, and then they mock you, because they're winning 6-1 and have a 2-1 lead in the Stanley Cup Final. Because Florida's means, mean as they are, have an end beyond agitation for its own sake. They want you to play their game. And they're better at it than you are.\nThis was the quintessential Florida Panthers playoff game. A true ass-kicking from 56 seconds on, when Brad Marchand punched home a loose puck after an offensive-zone faceoff. Panthers physicality led directly to Panthers goals, with no better illustration than Sam Bennett basically body-checking himself to a breakaway the other way, and the fourth Florida goal that gave this one official rout status.",
          "link": "https://defector.com/the-panthers-are-having-a-laugh",
          "publishedOn": "2025-06-10T12:59:52.000Z",
          "wordCount": 7391,
          "title": "The Panthers Are Having A Laugh",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2219409525-e1749560492676.jpg"
        },
        {
          "id": "https://defector.com/?p=191990",
          "author": "Dave McKenna",
          "description": "Cork upset dynastic host Limerick at a sold-out Gaelic Grounds on Saturday on penalty shots to take the 2025 Munster hurling championship in the first final decided on penalty shots in the 147-year history of the annual provincial competition. With the win, Cork booked a spot in the semifinals of this year’s All-Ireland tournament. \nThe match, a non-stop affair full of lead changes and roughhousing, was the latest in a string of instant classic playoff tilts the ancient Gaelic game has delivered fans in the last few years. After regulation and two overtimes, the score stood at Limerick 2-27, Cork 1-30, or 33 points apiece.",
          "link": "https://defector.com/cork-whoops-limerick-proving-hurling-shootouts-arent-ass",
          "publishedOn": "2025-06-09T21:08:00.000Z",
          "wordCount": 8545,
          "title": "Cork Whoops Limerick, Proving Hurling Shootouts Aren’t Ass",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2218812270.jpg"
        },
        {
          "id": "https://defector.com/?p=191951",
          "author": "Patrick Redford",
          "description": "One of the fun, mildly disorienting experiences inherent to watching the Oklahoma City Thunder is having to remember just how many guys they have. Were you aware that they traded five second-round picks last summer for a rookie from Weber State named Dillon Jones, and that Jones played 10 minutes a game this year? One would assume that the quality and level of OKC's depth would matter less as the playoffs progressed. While that is true in the sense that Jones and his cohort of deep bench-mates have been marginalized in the postseason, OKC is still dominating with their depth. Consider: Aaron Wiggins.\nThe fourth-year guard was critical for the Thunder off the bench in Game 2 of the Finals, logging 18 points in 21 minutes and finishing a team-high plus-24. Somewhat strangely for a bench player, the stuff Wiggins is good at is best-player stuff. His best and most important skill is three-point shooting, though he's far more than a shooter. He is 6-foot-6 with a plus wingspan; he's extremely athletic, if a little bit slight. Wiggins can drive, handle the rock in traffic, read scrambling defenses, and kick the ball out to open shooters. He has moves, and he uses them at the rim to make all sorts of impressive and impressively tough shots. Wiggins is a decent rebounder, never turns the ball over, and an active, pesky on-ball defender. The most important thing about Wiggins is that he doesn't have a weakness, not one that is all that damaging anyway. He dropped 41 and 14 on the Kings this year!",
          "link": "https://defector.com/aaron-wiggins-is-the-key-to-understanding-okcs-revolutionary-depth",
          "publishedOn": "2025-06-09T19:23:02.000Z",
          "wordCount": 8324,
          "title": "Aaron Wiggins Is The Key To Understanding OKC’s Revolutionary Depth",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2208776720.jpg"
        },
        {
          "id": "https://defector.com/?p=191934",
          "author": "Kelsey McKinney",
          "description": "Mia Scott is a menace to every team unlucky enough to face her. At third base, she's an immovable object and a nightmare for all right-handed batters. In the batter's box, she demonizes opposing pitching. Over the three games of the NCAA Softball World Series last week, Scott hit a whopping .529 with two home runs.\nIn the third game of the WCWS, Scott came up to bat with the bases loaded and no outs, her Texas Longhorns already up 6-0. The Texas Tech pitcher whipped the ball toward her without enough rise or movement. It just sat there above the plate, and Scott's hands flew at it so fast you could barely see the bat make contact in real time. She dropped the bat behind her and trotted to first base, because that gorgeous highlighter-yellow ball was soaring way out to center field, past the 220 sign, and into the stands: a grand slam, in what might have been the very last game of her career.",
          "link": "https://defector.com/my-queen-mia-scott-is-a-national-champion",
          "publishedOn": "2025-06-09T18:58:00.000Z",
          "wordCount": 7139,
          "title": "My Queen Mia Scott Is A National Champion",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2218993595.jpg"
        },
        {
          "id": "https://defector.com/?p=191905",
          "author": "Luis Paez-Pumar",
          "description": "The Nations League is, at its core, a money grab. Replacing international friendlies with an ostensibly meaningful tournament is a sensible idea on paper, but UEFA's (and later CONCACAF's) main motivation for it was to wring more money out of the previously low-stakes, low-interest midseason international breaks. When taken in that context, it's easy to dismiss the tournament as yet another monument to soccer's ruling powers' insatiable greed.\nSince the competition itself has no historical relevance and little actual prestige, the attempts to juice these matches with Significance scan as pretty silly. An example: The Nations League semifinal between France and Spain was billed as a head-to-head showdown between Ousmane Dembélé and Lamine Yamal, two of last season's most outstanding players, for no less than the Ballon d'Or itself. This is the type of pre-match hype that the Nations League, by its very existence, demands. It's not important enough on its own, so there must be a manufactured narrative to make it matter.",
          "link": "https://defector.com/nuno-mendes-made-the-nations-league-worth-the-hassle",
          "publishedOn": "2025-06-09T18:31:21.000Z",
          "wordCount": 8998,
          "title": "Nuno Mendes Made The Nations League Worth The Hassle",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2218714806.jpg"
        },
        {
          "id": "https://defector.com/?p=191538",
          "author": "Sabrina Imbler",
          "description": "Joy Binion learned that she had lost her job as a social science analyst at the Substance Abuse and Mental Health Services Administration, or SAMHSA, on April 1. So she posted on Facebook that she had been affected by a reduction in force, or RIF. A month later in a conversation with a friend, Binion mentioned the fact that she had lost her job. He reacted in total shock. \"I thought that was an April Fool's joke,\" Binion's friend said of her Facebook post.\nSAMHSA (pronounced sam-sah), which is housed under the Department of Health and Human Services, might not be a familiar acronym to most people. The agency supports Americans who suffer from mental health conditions and who experience addiction. SAMHSA operates the 988 Suicide & Crisis Lifeline, which has received more than 14.5 million calls, texts, and messages since it launched in July 2022. The agency also assists communities with grants for treatment and recovery centers, especially in rural areas where long distances from treatment centers act as a barrier to recovery.",
          "link": "https://defector.com/an-interview-with-a-terminated-analyst-at-the-substance-abuse-and-mental-health-administration",
          "publishedOn": "2025-06-09T17:36:50.000Z",
          "wordCount": 13300,
          "title": "An Interview With A Terminated Analyst At The Substance Abuse And Mental Health Administration",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/20240903_165540-e1749485236366.jpg"
        },
        {
          "id": "https://defector.com/?p=191901",
          "author": "Rose Eveleth",
          "description": "Megan Courtney-Lush was ready to retire. She played four years of college volleyball at Penn State and then went on to play professionally in Puerto Rico, Poland, Turkey, and Italy. After 10 years, she had decided that it was time to come home and move on to the next stage of her life. She bought a house in Columbus, Ohio and was several months pregnant in 2023 when she got an unexpected phone call. Someone was starting a professional women's volleyball league in the U.S., and they wanted her to play. \"I said 'No thanks, I'm out,'\" she told me, laughing.\nBut the calls kept coming. Columbus would have a team, they told her, coached by Ángel Pérez, former captain of the Puerto Rican men's national team. Pérez called Courtney-Lush himself, trying to see if he could get her on the court, and she kept looking for excuses to stay home: \"I played hardball. I kept coming up with all these random things I would need and they kept saying yes.\" Four months after having her first child, Courtney-Lush found herself back on the volleyball court, playing in the first active professional women's volleyball league in the United States since 1989.",
          "link": "https://defector.com/the-battle-for-professional-volleyball-has-officially-begun",
          "publishedOn": "2025-06-09T15:52:03.000Z",
          "wordCount": 17743,
          "title": "The Battle For Professional Volleyball Has Officially Begun",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/Orlando-Trophy-WIN-34.jpg"
        },
        {
          "id": "https://defector.com/?p=191918",
          "author": "Maitreyi Anantharaman",
          "description": "If you can't handle the heat, don't try our Monday crossword. This week’s puzzle was constructed by Rebecca Goldstein and edited by Hoang-Kim Vu. Rebecca is a research scientist and crossword constructor in the Bay Area. She is also a co-director of Westwords, a crossword tournament taking place in Berkeley, Calif., and online on June 22.\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE.",
          "link": "https://defector.com/the-crossword-june-9-yes-chef",
          "publishedOn": "2025-06-09T15:00:00.000Z",
          "wordCount": 5895,
          "title": "The Crossword, June 9: Yes, Chef!",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2218160163.jpg"
        },
        {
          "id": "https://defector.com/?p=191891",
          "author": "Barry Petchesky",
          "description": "I have spent all weekend replaying and marveling over Connor McDavid's assist. Between me and McDavid, that makes one of us who spent any time thinking about it.\nThe Oilers star was at practice yesterday, two days after his absurd first-period carve-up was relegated from pivotal play to mere highlight-reel staple by the Panthers' eventual double-overtime victory. The unwritten rules of postgame press conferences dictate that questions won't dwell on a play that ended up not affecting the game's outcome, especially for the losing team, and McDavid wouldn't have wanted to talk about it on Friday anyway—the usual blank-faced captain's deflections would'n't have made good copy. But I was hopeful, at Sunday's skate and media availability, that McDavid might've moved on from the loss and been willing to walk us through exactly what was in his mind when he did this:",
          "link": "https://defector.com/we-dont-speak-connor-mcdavid",
          "publishedOn": "2025-06-09T14:29:18.000Z",
          "wordCount": 8295,
          "title": "We Don’t Speak Connor McDavid",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2218321866.jpg"
        },
        {
          "id": "https://defector.com/?p=191874",
          "author": "Tom Scocca",
          "description": "Welcome to Margin of Error, a politics column from Tom Scocca, editor of the Indignity newsletter.\nAs a voter in the New York City mayoral race, I keep thinking about the rats and the garbage cans. The story of the election, as generally framed, is that Andrew Cuomo has come down to New York from the suburbs and back from political exile to offer his own hard-nosed, practical experience as an alternative to a field of candidates who are some combination of too idealistic, too leftist, or too unseasoned to handle the serious business of running a great and difficult metropolis. The city, he declared in Wednesday's mayoral debate, is in a \"management crisis\"—as well as a \"fiscal crisis\" and a \"societal crisis\"—and he is the one person who is prepared and willing to take on \"dysfunctional city management.\"",
          "link": "https://defector.com/andrew-cuomo-is-garbage",
          "publishedOn": "2025-06-09T13:37:55.000Z",
          "wordCount": 12386,
          "title": "Andrew Cuomo Is Garbage",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/cuomo.jpeg"
        },
        {
          "id": "https://defector.com/?p=191871",
          "author": "Chris Thompson",
          "description": "Shai Gilgeous-Alexander was, during the competitive portion of a not-very-competitive Game 2, about as good as it is possible to be at the sport of basketball. There was an insanely cool sequence in the first half where he seemed to take a horse-hair bow and go fiddle mode on the superstrings of reality. It started with a glaring mismatch. The Thunder were up a point inside the final minute of the first quarter, and the floor was out of shape, with Andrew Nembhard switched onto Isaiah Hartenstein, Aaron Nesmith sagging off of Alex Caruso in the corner, and Gilgeous-Alexander guarded up near the arc by Thomas Bryant, a backup center. An appalling 16 seconds were left on the shot clock, an eternity for a bumbling big guy like Bryant to spend isolated against the game's very best shot creator…",
          "link": "https://defector.com/shai-gilgeous-alexander-can-make-anyone-look-bad",
          "publishedOn": "2025-06-09T12:59:26.000Z",
          "wordCount": 13255,
          "title": "Shai Gilgeous-Alexander Can Make Anyone Look Bad",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2219237532.jpg"
        },
        {
          "id": "https://defector.com/?p=191809",
          "author": "Patrick Redford",
          "description": "A match that perfect deserves no restraint, so: Carlos Alcaraz's 4–6, 6–7 (4), 6–4, 7–6 (3), 7–6 (10–2) French Open final victory over Jannik Sinner is the best tennis match I've ever watched, and one of the greatest sporting events you or I will probably ever have the privilege of witnessing. You do not have to know or care about tennis or either of these players or even sports to find something to love about this match. All you need is a body, to appreciate the limits each player overcame out there on the red clay, and a spirit, to appreciate how deep they each had to dig to reach a place no pair has ever gone at Roland Garros.\nThe five-hour, 29-minute marathon saw the duo break all manner of records. Alcaraz saved three match points, the first time anyone's ever done so en route to the title. The final was nearly 45 minutes longer than the previous longest French Open final and 24 minutes short of the 2012 Australian Open decider for the longest major final in the open era. Alcaraz had never come back from two sets down, and Sinner had never lost a major final. Neither player had, for that matter. The 12th meeting between Sinner and Alcaraz was comfortably the best, clearing the lofty bar they set three years ago at the U.S. Open.",
          "link": "https://defector.com/carlos-alcaraz-wins-the-match-of-a-lifetime",
          "publishedOn": "2025-06-08T21:25:19.000Z",
          "wordCount": 10428,
          "title": "Carlos Alcaraz Wins The Match Of A Lifetime",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2218654014.jpg"
        },
        {
          "id": "https://defector.com/?p=191816",
          "author": "Albert Burneko",
          "description": "Oklahoma City led for all but scant moments of Game 1 of the NBA Finals. For around 39 seconds of the first quarter, the score sat at 10–10, between an Andrew Nembhard three-pointer that tied it for Indiana and a floater from Shai Gilgeous-Alexander that untied it and put the Thunder ahead. Oklahoma City kept that lead until Tyrese Haliburton's game-winning jumper with 0.3 seconds left to play. For much of that time, the Thunder led by double digits, or at least by a handful of possessions' worth of baskets.\nLikewise, for much of that time, particularly in the first half, Oklahoma City's half-court offense just kind of didn't matter: Between the advantages the Thunder got by running off of Indiana's copious turnovers and misses, and Gilgeous-Alexander's ability to create points and free-throw attempts off the dribble, they didn't really need to calm down and manufacture a series of baskets. Then they did need to do that, and couldn't. As Indiana scrambled to wipe away a nine-point deficit over the game's final three minutes or so, the Thunder, perhaps just tuned this way by a season of playing at a full sprint, repeatedly let themselves get baited into early shots.",
          "link": "https://defector.com/if-i-were-the-oklahoma-city-thunder-i-would-simply-sustain-a-lead-all-the-way-to-the-end-of-game-2",
          "publishedOn": "2025-06-08T20:35:39.000Z",
          "wordCount": 9195,
          "title": "If I Were The Oklahoma City Thunder, I Would Simply Sustain A Lead All The Way To The End Of Game 2",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/thunder-pacers_bc45a7.jpeg"
        },
        {
          "id": "https://defector.com/?p=191806",
          "author": "Patrick Redford",
          "description": "The aspect from Coco Gauff's altogether impressive French Open final win that I find myself most impressed by is, oddly, something that didn't go her way. Gauff is now a two-time Grand Slam champion, and though are several parallels between her two upsets of Aryna Sabalenka, her most recent triumph was the more thorough of the two. Consider how things started for her on Saturday.\nGauff lost a heartbreaker of a first set to Sabalenka at Roland Garros, a 6–7 (5) odyssey that lasted longer than an hour and cost her a tremendous amount of effort to get back into, go ahead in, and eventually lose. Sabalenka raced out to a 4–1, 40–love lead in the set in the first 20 minutes, and the final seemed like it might go the way Gauff's first French Open final did, when she barely bothered to give Iga Swiatek anything to do in 2022. But Sabalenka faltered and allowed Gauff to break her serve and then hold, kicking off a gnarly run of five straight breaks that led into a tiebreak. Gauff finally got ahold of her serve and seized a 4–1 in that tiebreak before Sabalenka ripped it away from her.",
          "link": "https://defector.com/coco-gauff-wont-be-rattled",
          "publishedOn": "2025-06-08T17:49:40.000Z",
          "wordCount": 9139,
          "title": "Coco Gauff Won’t Be Rattled",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2218571436.jpg"
        },
        {
          "id": "https://defector.com/?p=191602",
          "author": "Lucy Bloom",
          "description": "For four years now I have been informing every Dillon (or Dylan) I meet of the existence of a Tigers catching prospect called Dillon Dingler. If you know too much about baseball, you have to talk to the well-adjusted about it at least occasionally. Even if you have perfect self control, and never annoy people with the stupid shit they don't care about (couldn't be me), people still sometimes just want to know what it is you're spending all that time learning about, and you have to have something ready for them. Fun facts are good, but there are only so many that are actually understandable by agnostics. Dillon Dingler, on the other hand, is worth knowing about on every level.\nDingler is a 26-year-old playing his first full season for a shockingly good Tigers squad that's winning more than anyone else in the Majors. To begin, his name is very funny. And, by the way, Dillon is his middle name! He chose to aliterate with the last name Dingler! But he has a signature quirk beyond his literal signature: He is allergic to taking a walk. In 27 games last year, his incessant swinging was a liability at the plate for the Tigers. But 2025, though it's still early, is looking like a breakout for Dingler. Scouts have always loved his defense, and now he's rocking a nice 126 WRC+ to go with that glove.",
          "link": "https://defector.com/dillon-dingler-demonstrates-delightful-distinction",
          "publishedOn": "2025-06-06T22:03:39.000Z",
          "wordCount": 8496,
          "title": "Dillon Dingler Demonstrates Delightful Distinction",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2218118821.jpg"
        },
        {
          "id": "https://defector.com/?p=191753",
          "author": "Lauren Theisen",
          "description": "The Tony Awards are on Sunday, and that's as good an excuse as any for me to chat with you all about Broadway. Ask any questions you want about theater, or live performance more generally. Alternatively, if you don't have a question from that field, some other folks might drop in to answer any queries related to people named Tony.\nPlease stay on topic in Tony Chat.",
          "link": "https://defector.com/an-experimental-staff-chat-lets-talk-tonys",
          "publishedOn": "2025-06-06T18:00:41.000Z",
          "wordCount": 5387,
          "title": "An Experimental Staff Chat: Let’s Talk Tonys",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-971264910.jpg"
        },
        {
          "id": "https://defector.com/?p=191712",
          "author": "Albert Burneko",
          "description": "Other than every interaction either of them has had with another living being in their entire lives, as well as every single thing that is true about either of their personalities, and everything that either of them believes about themselves and each other and all others and life and the world, and their being the absolute two worst people presently alive, there was no reason to think, or even to fear, that Donald Trump and Elon Musk would not remain loyal allies and strategic partners forever. Alas, the dream of lifelong friendship died on Thursday, in a cascade of insults and threats posted to their respective embarrassing social media platforms. I don't know about you, but I'll never trust again.\nThings had been getting testier between the two for some time, as the Trump administration pursues certain policies—the ridiculous tariffs, for one thing, and \"I am not going to dignify this shit by digging too deep into what else it might be\" for another—at odds with Musk's business interests. Musk's reckless DOGE hacking spree both failed on its own terms and also left the administration at risk of actually delivering the crippled administrative state its supporters pretend to want or think they want but definitely do not want. Musk is known to be an opponent of Trump's One Big Beautiful Bill Act (sigh); he thinks it doesn't do enough to shred the federal government, or anyway that's been his public-facing complaint about it. More credibly he is upset that the bill eliminates certain tax deductions and credits associated with electric vehicle (EV) purchases. Anything that is bad for Tesla, his car company, is bad for Musk personally, as a huge portion of his wealth is tied up in company stock, and he used that stock as collateral when he borrowed tens of billions of dollars for his foolish purchase of Twitter in 2022.",
          "link": "https://defector.com/donald-trump-and-elon-musk-throw-day-long-tantrums-at-each-other",
          "publishedOn": "2025-06-06T17:59:08.000Z",
          "wordCount": 10572,
          "title": "Donald Trump And Elon Musk Throw Day-Long Tantrums At Each Other",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/trumpmusk.jpeg"
        },
        {
          "id": "https://defector.com/?p=191750",
          "author": "Owen Lewis",
          "description": "The queen is dead. It took three straight titles and 26 consecutive match wins at Roland-Garros for Iga Swiatek to finally lose on the Parisian clay. Aryna Sabalenka deservedly got the scalp, outlasting Swiatek in a Thursday semifinal played at a level so blisteringly high it obliterated any thought that the other semi would take place right afterwards. (Apologies to Coco Gauff, who could absolutely beat Sabalenka in the final, and home hero Lois Boisson.) Swiatek might have surrendered her crown, but not without playing some of the best tennis of the year so far. Rarely should a defeat, especially one by the close-not-close scoreline of 7-6 (1), 4-6, 6-0, inspire this much praise for the loser. \nPart of that is because Swiatek has now gone a full year without winning a title. This isn’t as apocalyptic as it sounds for a player who has won five majors. A single point separated her from the Australian Open final, and how bad can a slump be when you remain in the Top 10? But some of her losses were worrying, as was her demeanor on court. Watch the wrong players and you might not get a full appreciation for how stressful this sport is, in which grueling tournaments yield only one winner and scores of losers every week.",
          "link": "https://defector.com/iga-swiatek-abdicates-her-clay-throne",
          "publishedOn": "2025-06-06T16:31:34.000Z",
          "wordCount": 9018,
          "title": "Iga Swiatek Abdicates Her Clay Throne",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2218772222.jpg"
        },
        {
          "id": "https://defector.com/?p=191198",
          "author": "Sabrina Imbler",
          "description": "Whenever Yara Haridy, a paleontologist at the University of Chicago, shows off the fossils she works with, people are often disappointed. Unlike the statuesque bones of dinosaurs or even the small spirals of ancient seashells, Haridy's fossils \"kind of look like dust, or like the last little bit in your cereal,\" she said, adding that scientists call them \"fish flakes.\" These fossils are too tiny to spot, let alone excavate on site. Instead, geologists take layers of rock and dissolve them in acid, revealing the bones and other organic bits left behind. This is how researchers first discovered the fish flakes, after the mote-like fossils suddenly appeared at a certain point in Cambrian rocks.\nEarth's earliest vertebrates are little more than squishy, wormy critters with no hard parts of their own. But after about a 20-million-year gap, suddenly the record shows vertebrates \"that look like small little armored tanks or Roombas that are swimming around,\" said Karma Nanglu, a paleobiologist at Harvard University's Museum of Comparative Zoology. Haridy hoped that the fish flakes might help fill in the gap: a hypothetical vertebrate somewhere between \"the squishy guys and the fully formed fish.\"",
          "link": "https://defector.com/the-tooth-hurty-joke-has-its-origins-in-ancient-armored-fish",
          "publishedOn": "2025-06-06T16:07:56.000Z",
          "wordCount": 10387,
          "title": "The “Tooth Hurty” Joke Has Its Origins In Ancient, Armored Fish",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/skate-face1.jpg"
        },
        {
          "id": "https://defector.com/?p=191720",
          "author": "Barry Petchesky",
          "description": "Oh, you think Thibs has a gripe? Pete DeBoer has made six out of the last seven conference finals, with three different teams—and been fired by them all, after the Stars announced today that they think they can do better. Perhaps even more impressive than DeBoer's run is that his firing isn't a surprise in the least.\n“After careful consideration, we believe that a new voice is needed in our locker room to push us closer to our goal of winning the Stanley Cup,” Dallas GM Jim Nill said in a statement, a week after the Stars bowed out in a perfunctory five games to the Oilers. It's the rare team statement that says exactly what it means: DeBoer lost the room. Even a well-respected coach's voice stops having an effect when Sisyphus's boulder rolls back down the hill for the third season in a row.",
          "link": "https://defector.com/pete-deboer-just-loves-making-conference-finals-and-getting-fired",
          "publishedOn": "2025-06-06T15:17:13.000Z",
          "wordCount": 6484,
          "title": "Pete DeBoer Just Loves Making Conference Finals And Getting Fired",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2217029665.jpg"
        },
        {
          "id": "https://defector.com/?p=191713",
          "author": "Drew Magary",
          "description": "After months of rather awkward courtship, the Pittsburgh Steelers and free agent quarterback Aaron Rodgers agreed last night to spend 18 weeks together in darkness. Sources tell Defector that the darkness will be “vast” and “impenetrable,” casting “a permanent shadow over Western Pennsylvania” that will “extinguish all traces, all memory, of the lighted world.”\nThis darkness—this total fucking darkness—is scheduled to envelop the Steelers on September 7 of this year and remain in place for 18 weeks thereafter. Earlier this spring, other NFL teams expressed mild interest in having the darkness consume them entirely. But the Steelers, famous for using the color black on their home jerseys, were always a natural match for Rodgers, and for the parasitic void that both parties are now doomed to inhabit.",
          "link": "https://defector.com/steelers-aaron-rodgers-agree-to-18-weeks-of-darkness",
          "publishedOn": "2025-06-06T14:28:26.000Z",
          "wordCount": 6888,
          "title": "Steelers, Aaron Rodgers Agree To 18 Weeks Of Darkness",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2197899490.jpg"
        },
        {
          "id": "https://defector.com/?p=191703",
          "author": "Tom Ley",
          "description": "Here are some relevant statistics from Game 1 of the NBA Finals: The Oklahoma City Thunder had 18 fewer turnovers than the Indiana Pacers; the Thunder attempted 16 more field goals than the Pacers and took exactly half of their shots at the rim; 14 of the Pacers' 24 turnovers were caused by Thunder steals; the Pacers led the game for 0.3 seconds. Here is the most relevant of them all: This morning the Thunder find themselves down 0-1 in the NBA Finals, having fallen to the Pacers, 111–110.\nFor about 47 minutes, this game looked like nothing other than a win for the Thunder. All those pre-series questions about whether the Pacers' chaos-forward offense could somehow undermine the Thunder's brutal attacking defense started to feel very silly, very quickly. The Thunder held the Pacers to 20 points in the first quarter and ripped away 12 steals in the first half, setting a record for most steals in a half during the play-by-play era. OKC's defense was doing exactly what it did to the Timberwolves and Nuggets, and it was doing to Tyrese Haliburton exactly what it did to Nikola Jokic and Anthony Edwards—shoving him into the margins of the game as a bully shoves a victim into a locker. Haliburton finished the first half with three turnovers and six points on four field goal attempts.",
          "link": "https://defector.com/we-must-consider-whether-the-pacers-have-a-pact-with-beelzebub-himself",
          "publishedOn": "2025-06-06T12:55:18.000Z",
          "wordCount": 8494,
          "title": "We Must Consider Whether The Pacers Have A Pact With Beelzebub Himself",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2218852239.jpg"
        },
        {
          "id": "https://defector.com/?p=191560",
          "author": "David Roth",
          "description": "There are some podcast guests who need a little bit of drawing out, or just some guidance into and through the experience of being on this podcast. This is natural enough, given how unnatural it is to be on a podcast in the first place, and the specific unnatural/unholy attributes of ours. But Will Leitch is not one of those guests. He has known Drew forever, and worked with him for only slightly less time than that, and that surely helped. I myself have only met the man a few times, although I have read his writing for many years, but again—that does not matter. Will Leitch comes on a podcast ready to be the guest on that podcast, and buddy was he ever the guest this week.",
          "link": "https://defector.com/a-residence-at-one-cardinal-way-with-will-leitch",
          "publishedOn": "2025-06-05T20:43:03.000Z",
          "wordCount": 8263,
          "title": "A Residence At One Cardinal Way, With Will Leitch",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2215470433.jpg"
        },
        {
          "id": "https://defector.com/?p=191645",
          "author": "Kathryn Xu",
          "description": "VARIOUS CITIES (SOME ARGUABLY TOWNS), France — The first time I visited France, I was on the subway when a woman and a group of elementary school–aged girls rushed into the car. It was midday; I was confused, but assumed nothing. Everyone in the seats stood, which is the usual habit for making space in a train car; the chairs by the door fold up, making room on busier trains.\nAn East Asian woman who was sitting in one of those chairs, whom I noticed because she spent much of the ride engaging in French-style PDA with her partner, leaned back over to me and said, in Mandarin, \"Tell your friends to be careful.\" By friends, she meant my sisters, who were a bit squished to the back of the train car but otherwise untouched. Be careful about what? I told her that I thought they were doing fine, and then she elaborated: \"They are trying to trick them.\"",
          "link": "https://defector.com/all-the-trains-i-rode-in-france",
          "publishedOn": "2025-06-05T19:09:38.000Z",
          "wordCount": 15941,
          "title": "All The Trains I Rode In France",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/tgv1.jpeg"
        },
        {
          "id": "https://defector.com/?p=191243",
          "author": "Sabrina Imbler",
          "description": "In a third-grade classroom exercise, Patrick Kelly wrote that he wanted to become a scientist when he grew up. With that interest came an attention to the people that science can help. \"I've just always been super-curious about human nature, our interactions with one another,\" he said.\nIn college, Kelly pivoted to public health, which is no doubt a science deeply interested in the interactions people have with one another. After working in a series of labs in Philadelphia, Kelly joined the Brown University School of Public Health as a doctoral student, where he researches how social and structural influences, like laws, affect people's medical decision-making, with a focus on people who use drugs, LGBTQ communities, and the intersection between the two. \"So all things from stigma to sociopolitical climate,\" he explained. \"How people navigate the healthcare environment and how we're able to provide healthcare resources to people.\"",
          "link": "https://defector.com/an-interview-with-a-public-health-researcher-whose-funding-was-terminated-by-the-trump-administration",
          "publishedOn": "2025-06-05T18:26:11.000Z",
          "wordCount": 14379,
          "title": "An Interview With A Public Health Researcher Whose Funding Was Terminated By The Trump Administration",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/Headshot_Patrick-Kelly-Copy.jpg"
        },
        {
          "id": "https://defector.com/?p=191463",
          "author": "Albert Burneko",
          "description": "Twenty-eight NBA teams lay crumpled and destroyed at the foot of the mountain, defeated for all time, never to rise again from their shame. The Oklahoma City Thunder and Indiana Pacers snarl at each other across the bald summit, beneath the darkening sky. One shall feast upon the other! The NBA Finals are here, and absolutely none of this is metaphorical.\nFor the Thunder, this is their first appearance in the Finals since 2012, when the hotshot young core of Kevin Durant, Russell Westbrook, and James Harden fell in five games to the hotter-shot medium core of LeBron James, Dwyane Wade, and Chris Bosh. At the time that series, though crappy and disappointing as an actual basketball contest, seemed like it was going to be the beginning of a long rivalry between two great teams, but, well ... for the favored Thunder, this is their first appearance in the Finals since 2012. The franchise kept that core going for a while before briefly dipping into the toilet, which allowed them to accumulate the hotshot young core—MVP Shai Gilgeous-Alexander, Jalen Williams, Chet Holmgren—that carried the team to a league-best 68 regular-season wins this season, and which has stormed all but unimpeded through the West playoffs. They're the huge favorites in this series. Probably in betting terms or whatever, but more importantly in our estimation of how this thing is likely to go.",
          "link": "https://defector.com/before-you-is-the-defector-mega-preview-of-the-2025-nba-finals-kneel",
          "publishedOn": "2025-06-05T16:58:26.000Z",
          "wordCount": 19212,
          "title": "Before You Is The Defector Mega-Preview Of The 2025 NBA Finals. Kneel!",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/thunder-pacers.jpeg"
        },
        {
          "id": "https://defector.com/?p=191614",
          "author": "Tom Ley",
          "description": "As the barrier between NBA players and NBA media dissolves, so too does the illusion that any amount of fame and success can prevent athletes from giving into the media's lamest impulses. It should not be the case that LeBron James and Steve Nash, two universally respected and accomplished world-class athletes with more money than they could ever possibly spend, care about how many people are listening to and enjoying their podcast. That is something that podcasters should worry about, not athletes. And yet here we are, in a media environment in which even these two greats cannot prevent themselves from thinking and acting like podcasters.\n\nhttps://www.instagram.com/p/DKcq_33p77C/?hl=en",
          "link": "https://defector.com/lebron-james-mind-the-game",
          "publishedOn": "2025-06-05T15:37:23.000Z",
          "wordCount": 7158,
          "title": "Curious, I’m No Longer Hearing Much Chatter From The Many Haters Who Claimed That LeBron James’s Podcast Would Never Become “#8 On Trending” And “#9 On Trending”",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2212828294.jpg"
        },
        {
          "id": "https://defector.com/?p=191592",
          "author": "Lauren Theisen",
          "description": "After Viktor Arvidsson's slapshot beat Panthers goalie Sergei Bobrovsky in the second period, cutting the Oilers' deficit to 3-2, the on-screen shots-on-goal counter had Edmonton leading 16-8. In any situation where you're doubling up a team in that category while still losing, it's natural to look to the goalie for blame. And Oiler netminder Stuart Skinner is a ready-made scapegoat.\nA career subpar goalie in the playoffs coming off a career-worst third full season in the NHL, the 26-year-old Skinner symbolizes the Oilers' struggle to find a permanent stopper in net worthy of the skaters in front of him. Kings fans relished picking on Skinner early in the first round, and he lost his starting job when his team lost the opening two games. Since he regained his place due to injury, Skinner's been something miraculous, putting up a 7-2 record with the victory on Wednesday. Still, given the way Bobrovsky played in Florida's four wins during the Cup Final last year, and the fairly consistent performances the Panther vet had delivered in these playoffs so far, it was reasonable to single out Skinner as the shaky foundation. Guys like McDavid and Draisaitl have earned the highest level of trust; Stuart Skinner has not.",
          "link": "https://defector.com/stuart-skinner-was-good-enough",
          "publishedOn": "2025-06-05T15:20:53.000Z",
          "wordCount": 7756,
          "title": "Stuart Skinner Was Good Enough",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2218005084.jpg"
        },
        {
          "id": "https://defector.com/?p=191567",
          "author": "Barry Petchesky",
          "description": "It's not about throwing a punch. We know both these teams can land a haymaker. No team gets this far without that skill, even if each comes at it from a slightly different angle—the Oilers, more straightforward, windmilling their arms as they close the gap on you, daring you to stop it even when you know it's coming; the Panthers, maybe taking you off-guard with a knee to the groin or some pocket sand in the eyes before striking.\nInstead, the Stanley Cup Final is about taking a punch. Can you suffer blows to the body and psyche, and keep playing your brand of hockey? Can you take the fight to an opponent who smells your blood, and likes the smell? These Oilers and Panthers would seem uniquely suited to counterpunching. Edmonton, who set an NHL playoff record last month with six straight comeback wins. Florida, who went down two games to Toronto, then flipped a switch and haven't looked back since. But could the Oilers take the Panthers' best thump?",
          "link": "https://defector.com/these-oilers-can-take-a-punch",
          "publishedOn": "2025-06-05T13:00:01.000Z",
          "wordCount": 8944,
          "title": "These Oilers Can Take A Punch",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2218696770.jpg"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=855554",
          "author": "Anthony Franco",
          "description": "It seems the Royals will be without Cole Ragans for a while. Manager Matt Quatraro tells Anne Rogers of MLB.com that the lefty will go for a second opinion on his ailing shoulder next week. Kansas City placed Ragans on the 15-day injured list with a rotator cuff strain yesterday. Quatraro indicated that the team does…",
          "link": "https://www.mlbtraderumors.com/2025/06/cole-ragans-to-go-for-second-opinion-on-injured-shoulder.html",
          "publishedOn": "2025-06-13T02:59:46.000Z",
          "wordCount": 3545,
          "title": "Cole Ragans To Go For Second Opinion On Injured Shoulder",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/06/USATSI_26100547-1024x639.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=855374",
          "author": "Darragh McDonald",
          "description": "The Royals announced a series of roster moves today. Right-hander Lucas Erceg has been reinstated from the 15-day injured list and righty Jonathan Bowlan has been recalled from Triple-A Omaha. In corresponding moves, right-hander Trevor Richards has been designated for assignment while lefty Cole Ragans has been placed on the 15-day IL due to a…",
          "link": "https://www.mlbtraderumors.com/2025/06/royals-place-cole-ragans-on-il-with-rotator-cuff-strain.html",
          "publishedOn": "2025-06-11T20:10:28.000Z",
          "wordCount": 4046,
          "title": "Royals Place Cole Ragans On IL With Rotator Cuff Strain",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/ColeRagans-2025-1024x615.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=855042",
          "author": "Darragh McDonald",
          "description": "Veteran left-hander Rich Hill signed a minor league deal last month. It appears the club will soon have to make a decision on whether or not to call him up. Robert Murray of FanSided reports that there’s a June 15th opt-out in that deal. Since signing that pact, Hill has made four minor league starts,…",
          "link": "https://www.mlbtraderumors.com/2025/06/rich-hill-has-june-15-opt-out-in-royals-deal.html",
          "publishedOn": "2025-06-09T18:57:28.000Z",
          "wordCount": 4204,
          "title": "Rich Hill Has June 15 Opt-Out In Royals Deal",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/01/rich-hill-pitching-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=854857",
          "author": "Mark Polishuk",
          "description": "The Royals announced that right-hander Trevor Richards’ minor league contract has been selected to the 26-man roster.  Right-hander Jonathan Bowlan was optioned to Triple-A Omaha in the corresponding move. It was almost exactly a month ago K.C. signed Richards, shortly after the reliever had been released from a previous minors deal with the Cubs.  Since…",
          "link": "https://www.mlbtraderumors.com/2025/06/royals-select-trevor-richards.html",
          "publishedOn": "2025-06-07T16:54:30.000Z",
          "wordCount": 3425,
          "title": "Royals Select Trevor Richards",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/08/Trevor_Richards_Twins-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=854666",
          "author": "Anthony Franco",
          "description": "The Royals are in agreement with righty Justin Dunn on a minor league contract, reports Jaylon Thompson of The Kansas City Star. The former first-round pick had been pitching in Triple-A with the White Sox but was released last week. Dunn signed an offseason minor league deal with Chicago. He had a tough run in Triple-A,…",
          "link": "https://www.mlbtraderumors.com/2025/06/royals-justin-dunn-agree-to-minor-league-deal.html",
          "publishedOn": "2025-06-06T03:57:41.000Z",
          "wordCount": 3338,
          "title": "Royals, Justin Dunn Agree To Minor League Deal",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/06/USATSI_25474882-1024x819.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=854609",
          "author": "Steve Adams",
          "description": "Between games of today’s doubleheader, the Royals made a roster move. Left-hander Cole Ragans, the scheduled starter for the second game, has been reinstated from the 15-day injured list. Right-hander Thomas Hatch has been designated for assignment as the corresponding move. The club’s 40-man roster count drops from 40 to 39. Hatch was only added…",
          "link": "https://www.mlbtraderumors.com/2025/06/royals-designate-thomas-hatch-for-assignment.html",
          "publishedOn": "2025-06-05T21:33:17.000Z",
          "wordCount": 3553,
          "title": "Royals Designate Thomas Hatch For Assignment",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/06/thomas-hatch-pitcher-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=854518",
          "author": "Steve Adams",
          "description": "The Royals announced Thursday morning that they’ve selected the contract of righty Thomas Hatch from Triple-A Omaha. Injured reliever Hunter Harvey moves from the 15-day IL to the 60-day IL to open a spot on the 40-man roster. Kansas City also technically optioned righty Andrew Hoffmann to Omaha but immediately re-added him to the roster…",
          "link": "https://www.mlbtraderumors.com/2025/06/royals-select-thomas-hatch-hunter-harvey-60-day-il.html",
          "publishedOn": "2025-06-05T14:43:26.000Z",
          "wordCount": 3947,
          "title": "Royals Select Thomas Hatch",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/06/thomas-hatch-pitcher-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=854391",
          "author": "Darragh McDonald",
          "description": "The latest episode of the MLB Trade Rumors Podcast is now live on Spotify, Apple Podcasts, and wherever you get your podcasts! Make sure you subscribe as well! You can also use the player at this link to listen, if you don’t use Spotify or Apple for podcasts. This week, host Darragh McDonald is joined by Steve Adams of…",
          "link": "https://www.mlbtraderumors.com/2025/06/mlbtr-podcast-jarren-duran-rumors-caglianone-and-young-promoted-and-pitching-injuries.html",
          "publishedOn": "2025-06-05T04:57:59.000Z",
          "wordCount": 5571,
          "title": "MLBTR Podcast: Jarren Duran Rumors, Caglianone And Young Promoted, And Pitching Injuries",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/06/Jarren_Duran_Red_Sox-copy-1024x683.jpg"
        }
      ]
    },
    {
      "title": "Flaming Hydra",
      "feedUrl": "https://flaminghydra.com/rss/",
      "siteUrl": "https://flaminghydra.com/",
      "articles": [
        {
          "id": "684c48fb475bb700010ae600",
          "author": "The Editors",
          "description": "Misha Angrist on the allure of AI; Sam Thielman and Joe MacLeod nerd out on Superman",
          "link": "https://flaminghydra.com/issue-340/",
          "publishedOn": "2025-06-13T23:56:59.000Z",
          "wordCount": 644,
          "title": "Mechanical learning / Man of Steel",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/Velazquez_Sibyl_Meadows_Museum-16x9-crop-1.jpg"
        },
        {
          "id": "684cac65475bb700010ae763",
          "author": "Misha Angrist",
          "description": "Fifteen years ago I taught a freshman seminar entitled “The Secret of Life: DNA, Property Rights, and Human Identity.” We read What is Life? by Erwin Schrödinger, The Double Helix, and a brand-new book called The Immortal Life of Henrietta Lacks. We watched Jeff Goldblum portray",
          "link": "https://flaminghydra.com/suspended-sentence/",
          "publishedOn": "2025-06-13T23:56:21.000Z",
          "wordCount": 599,
          "title": "Suspended Sentence",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/Velazquez_Sibyl_Meadows_Museum-16x9-crop.jpg"
        },
        {
          "id": "684c982d475bb700010ae6e1",
          "author": "Sam Thielman",
          "description": "Sam Thielman flies in to the podcast studio to discuss his recent Flaming Hydra post My Ten Favorite Superman Stories with Joe MacLeod.\nListen on Apple/Spotify/RSS/plus more options at pod.link\n\nEpisode 10: Supernerds\nJoe MacLeod and Sam Thielman discuss Sam’s Flaming Hydra",
          "link": "https://flaminghydra.com/podcast-round-table-episode-10-supernerds/",
          "publishedOn": "2025-06-13T23:55:48.000Z",
          "wordCount": 507,
          "title": "PODCAST Round Table! Episode 10: Supernerds",
          "imageUrl": "https://flaminghydra.com/content/images/2025/06/superman-ali-back-16x9-IMG_1021.jpg"
        },
        {
          "id": "684af4ece36b2c0001a46c39",
          "author": "The Editors",
          "description": "Amy Chu on the Linda Lindas, and zoological conjectures with Jack Pendarvis. Plus HYDRANYM voting!",
          "link": "https://flaminghydra.com/issue-339/",
          "publishedOn": "2025-06-12T22:03:59.000Z",
          "wordCount": 547,
          "title": "Young and free / Baby chimps",
          "imageUrl": "https://flaminghydra.com/content/images/2025/06/girling-inda-lindas-16w-1.jpg"
        },
        {
          "id": "684ae424e36b2c0001a46c03",
          "author": "The Editors",
          "description": "THE VICTOR OF HYDRANYM NO. 3 will ascend from this flock of the 21 most scintillating entries received this week, as judged by the editors. Consider well, and make your choice.\nIt won’t be easy! these are superexcellent entries.\nHYDRANYM is a word game for Flaming Hydra subscribers.",
          "link": "https://flaminghydra.com/hydranym-no-3-vote/",
          "publishedOn": "2025-06-12T21:35:13.000Z",
          "wordCount": 459,
          "title": "Hydranym No. 3: Vote!",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/HYDRANYM-7.jpg"
        },
        {
          "id": "684ae685e36b2c0001a46c0f",
          "author": "Jack Pendarvis",
          "description": "Ace Goes to Hollywood is a continuing transcript of a ride from Oxford, Mississippi, to Memphis, Tennessee, during which Jack Pendarvis interviewed Ace Atkins about his work on the Pauly Shore film Jury Duty.\nEpisode 7: Tortoises and Chimps\nJACK: Oh! The reason I mentioned earlier, when I was, like,",
          "link": "https://flaminghydra.com/ace-goes-to-hollywood-episode-7/",
          "publishedOn": "2025-06-12T21:34:30.000Z",
          "wordCount": 553,
          "title": "Ace Goes to Hollywood: Episode 7",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/chimp-teeth-000802_c049_0034_clhs.sup.png"
        },
        {
          "id": "684b2c62e36b2c0001a46d08",
          "author": "Amy Chu",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/girling-and-growing-up/",
          "publishedOn": "2025-06-12T21:32:44.000Z",
          "wordCount": 330,
          "title": "Girling and Growing Up",
          "imageUrl": "https://flaminghydra.com/content/images/2025/06/girling-inda-lindas-16w.jpg"
        },
        {
          "id": "6849fe08e36b2c0001a45676",
          "author": "The Editors",
          "description": "Tommy Craggs on foxhole solidarity, and Rax King at the Dew Drop Inn",
          "link": "https://flaminghydra.com/issue-338/",
          "publishedOn": "2025-06-12T00:32:24.000Z",
          "wordCount": 618,
          "title": "Get together / Play a show",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/Screenshot-2025-06-11-at-4.55.49-PM.jpg"
        },
        {
          "id": "6849f6f4e36b2c0001a4562e",
          "author": "Tommy Craggs",
          "description": "The first hour or so of Ryan Coogler’s Sinners is a classic of that unnamed but easily recognized film genre which we’ll call “the Squad Assembles.” We follow the Moore twins, both played by Michael B. Jordan, in and around Clarksdale, Mississippi, as they",
          "link": "https://flaminghydra.com/all-hands/",
          "publishedOn": "2025-06-12T00:31:47.000Z",
          "wordCount": 624,
          "title": "All Hands",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/Telly-Savalas-and-Don-Rickles-in-Kellys-Heroes-crop-16x9.jpg"
        },
        {
          "id": "6849f7f0e36b2c0001a45646",
          "author": "Rax King",
          "description": "From the sticky floor of Washington D.C.’s Dew Drop Inn, Sexfaces’ drummer/vocalist Jacky Cougar paused between songs to pay a touching tribute to Pere Ubu’s recently departed frontman David Thomas. “I hear he was kind of a prick,” Cougar said affably.",
          "link": "https://flaminghydra.com/sexfaces-live-in-d-c/",
          "publishedOn": "2025-06-12T00:31:27.000Z",
          "wordCount": 744,
          "title": "Sexfaces Live in D.C.",
          "imageUrl": "https://flaminghydra.com/content/images/2025/06/sexfaces-edit-16x9.jpg"
        },
        {
          "id": "6848a5823897ec0001cddea0",
          "author": "The Editors",
          "description": "Nathan Munn trips the balls fantastic; a new HYDRANYM",
          "link": "https://flaminghydra.com/issue-337/",
          "publishedOn": "2025-06-10T23:30:37.000Z",
          "wordCount": 652,
          "title": "High fly",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/toilet-1001851635.sas-1.jpg"
        },
        {
          "id": "6848b0b33897ec0001cddf52",
          "author": "Maria Bustillos",
          "description": "A word game just for Flaming Hydra subscribers.\nSubscribe to Flaming Hydra to play! It's bizarrely fun, plus you get to read the newsletter each weekday AND participate in the Comments Section?! A STEAL for just $3/month, or $36/year.\nRULES\nPlease create an ENTERTAINING and APT",
          "link": "https://flaminghydra.com/hydranym-no-3/",
          "publishedOn": "2025-06-10T23:29:44.000Z",
          "wordCount": 560,
          "title": "HYDRANYM No. 3",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/HYDRANYM-3.jpg"
        },
        {
          "id": "684892783897ec0001cdde56",
          "author": "Nathan Munn",
          "description": "Nick and I were sitting in the basement of his parents’ house, waiting for Tim. Amid the storage boxes, pairs of skis, and miscellaneous furniture, an area had been cleared for a TV, a coffee table and a couple of couches, all anchored together on a thick rug. Tonight,",
          "link": "https://flaminghydra.com/my-first-acid-trip/",
          "publishedOn": "2025-06-10T23:29:17.000Z",
          "wordCount": 714,
          "title": "My First Acid Trip",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/toilet-1001851635.sas.jpg"
        },
        {
          "id": "6846ddecbb23340001442d6f",
          "author": "The Editors",
          "description": "Talia Lavin ventures into the cold! HYDRANYM victors... and Nathan Schneider on where true hope begins",
          "link": "https://flaminghydra.com/issue-336/",
          "publishedOn": "2025-06-09T22:32:25.000Z",
          "wordCount": 617,
          "title": "Bold explorers / Dangerous arguments",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/polar-1.jpg"
        },
        {
          "id": "6846d245bb23340001442d3e",
          "author": "Talia Lavin",
          "description": "Agoraphobia comes in waves for me. When it’s better I can leave my house, even take car trips by myself. Sometimes I can be places alone—even, on occasion, crowded or large ones. \nWhen it’s bad, I can’t… do any of",
          "link": "https://flaminghydra.com/none-but-cowards/",
          "publishedOn": "2025-06-09T22:31:20.000Z",
          "wordCount": 647,
          "title": "None but Cowards",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/polar.jpg"
        },
        {
          "id": "6846f749bb23340001442da9",
          "author": "Nathan Schneider",
          "description": "On September 12, 2001, Ward Churchill, a professor at the University of Colorado Boulder (where I now teach) published an essay about the terrorist attack that had taken place in New York the day before. With the subtitle “On the Justice of Roosting Chickens,” Churchill compared the 9/",
          "link": "https://flaminghydra.com/antisemitism-and-the-unspeakable/",
          "publishedOn": "2025-06-09T22:30:42.000Z",
          "wordCount": 696,
          "title": "Antisemitism and the Unspeakable",
          "imageUrl": "https://flaminghydra.com/content/images/2025/06/WTC-Fireman_requests_10_more_colleagues-16x9.jpg"
        },
        {
          "id": "6842e9d430ca9b0001103e2c",
          "author": "The Editors",
          "description": "Bug out with Carrie Frye, and decline to sell out with Ben Ehrenreich",
          "link": "https://flaminghydra.com/issue-335/",
          "publishedOn": "2025-06-06T19:03:16.000Z",
          "wordCount": 575,
          "title": "Insect abundance / Dogged pursuit",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/big-1.jpg"
        },
        {
          "id": "6842e47330ca9b0001103e03",
          "author": "Ben Ehrenreich",
          "description": "When my father was five years old, his father was diagnosed with tuberculosis. At the time this was very nearly a death sentence. Treatment with antibiotics was still experimental and the going remedy was what it had been for decades: bed rest and fresh air. So in 1947, Joseph Ehrenreich",
          "link": "https://flaminghydra.com/the-fox-that-changed/",
          "publishedOn": "2025-06-06T19:02:08.000Z",
          "wordCount": 824,
          "title": "The Fox That Changed",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/fox2-1.jpg"
        },
        {
          "id": "6842ed1430ca9b0001103e43",
          "author": "Carrie Frye",
          "description": "The ground has boiled up with cicadas: Brood XIV, which comes out in Asheville every 17 years. I’ve been here for two other emergences—1991 and 2008—but I don’t remember ever feeling so fond of these bugs. They’re all over the",
          "link": "https://flaminghydra.com/we-welcome-our-alien-overlords/",
          "publishedOn": "2025-06-06T19:00:58.000Z",
          "wordCount": 594,
          "title": "We Welcome Our Alien Overlords",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/big.jpg"
        },
        {
          "id": "6842234a30ca9b0001102a8d",
          "author": "The Editors",
          "description": "S.I. Rosenbaum on conscience, animals, and the right to be; we invite you to vote in Hydranym No. 2",
          "link": "https://flaminghydra.com/issue-334/",
          "publishedOn": "2025-06-06T00:30:03.000Z",
          "wordCount": 490,
          "title": "Beast mode",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/balthus-1.png"
        },
        {
          "id": "6842280030ca9b0001102b13",
          "author": "The Editors",
          "description": "We are gathered to determine the victor of the Hydranym.\nIt’s a word game for Flaming Hydra subscribers. Please join us! It’s fun, and you will also get to read our glorious newsletter each weekday.",
          "link": "https://flaminghydra.com/hydranym-no-2-vote/",
          "publishedOn": "2025-06-06T00:27:58.000Z",
          "wordCount": 393,
          "title": "Hydranym No. 2: Vote!",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/HYDRANYM-1.jpg"
        },
        {
          "id": "6841fa8130ca9b0001102a02",
          "author": "S.I. Rosenbaum",
          "description": "CK was ten when they realized they were more than just human. \nThey were that too—a nonbinary human child—but there were parts of their nature that felt like they belonged to another species. A lot of the time they felt like a cat. Sometimes, when",
          "link": "https://flaminghydra.com/the-outlawing-of-imagination/",
          "publishedOn": "2025-06-06T00:27:31.000Z",
          "wordCount": 523,
          "title": "The Outlawing of Imagination",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/balthus.png"
        },
        {
          "id": "6840ddfe30ca9b00011027d5",
          "author": "The Editors",
          "description": "Sam Thielman on Superman, and new fiction from Luke O’Neil",
          "link": "https://flaminghydra.com/issue-333/",
          "publishedOn": "2025-06-05T11:43:31.000Z",
          "wordCount": 352,
          "title": "Timeless hero / Modern ruins",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/supali-1.jpg"
        },
        {
          "id": "6840ddfe30ca9b00011027d5",
          "author": "The Editors",
          "description": "Sam Thielman on Superman, and new fiction from Luke O’Neil",
          "link": "https://flaminghydra.com/issue-333-2/",
          "publishedOn": "2025-06-05T11:43:31.000Z",
          "wordCount": 346,
          "title": "Timeless hero / Modern ruins",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/supali-1.jpg"
        },
        {
          "id": "6840af0130ca9b00011014b3",
          "author": "Sam Thielman",
          "description": "I love Superman. He was originally conceived as a vagrant corrupted by ultimate power in a short story by Jerry Siegel called “The Reign of the Superman.” Siegel was scared of girls and introverted with other boys, too. He didn’t do well in school. His buddy",
          "link": "https://flaminghydra.com/my-ten-favorite-superman-stories/",
          "publishedOn": "2025-06-04T23:36:51.000Z",
          "wordCount": 973,
          "title": "My Ten Favorite Superman Stories",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/IMG_1020.JPG"
        },
        {
          "id": "6840b7e030ca9b000110154c",
          "author": "Luke O'Neil",
          "description": "The hunger\nWell we just got back from stringing up our weakest friend in the middle of the town square for the vampires to feast on overnight. No one liked the doing of it when it came to actually doing it I’ll admit that. But the past is",
          "link": "https://flaminghydra.com/what-the-window-showed-them/",
          "publishedOn": "2025-06-04T23:25:21.000Z",
          "wordCount": 491,
          "title": "What the window showed them",
          "imageUrl": "https://flaminghydra.com/content/images/2025/06/IMG_6444.jpg"
        }
      ]
    },
    {
      "title": "Today in Tabs",
      "feedUrl": "https://rss.beehiiv.com/feeds/ZRiesnGI0u.xml",
      "siteUrl": "https://www.todayintabs.com/",
      "articles": [
        {
          "id": "https://www.todayintabs.com/p/everyone-s-changing-so-much-8fb9",
          "author": "Rusty Foster",
          "description": "Intrigued AND demure? ¿En esta economia?",
          "link": "https://www.todayintabs.com/p/everyone-s-changing-so-much-8fb9",
          "publishedOn": "2025-06-12T21:29:14.000Z",
          "wordCount": 10658,
          "title": "Everyone’s Changing So Much",
          "enclosure": {
            "url": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/405e5184-58c8-4994-bab7-ede2a5554868/GsqLTcSbQAENx6F.jpeg",
            "length": "56216",
            "type": "image/jpeg"
          },
          "imageUrl": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/405e5184-58c8-4994-bab7-ede2a5554868/GsqLTcSbQAENx6F.jpeg"
        },
        {
          "id": "https://www.todayintabs.com/p/friends-forever-5c48",
          "author": "Rusty Foster",
          "description": "But how do you feel on the inside?",
          "link": "https://www.todayintabs.com/p/friends-forever-5c48",
          "publishedOn": "2025-06-09T22:03:27.000Z",
          "wordCount": 11879,
          "title": "Friends Forever",
          "enclosure": {
            "url": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/28384ac9-d016-4d83-92b7-9d5ed58a92c7/61SMCc99YbL._SL1500_.jpg",
            "length": "234788",
            "type": "image/jpeg"
          },
          "imageUrl": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/28384ac9-d016-4d83-92b7-9d5ed58a92c7/61SMCc99YbL._SL1500_.jpg"
        }
      ]
    },
    {
      "title": "Bad Faith Times",
      "feedUrl": "https://bad-faith-times.ghost.io/rss/",
      "siteUrl": "https://badfaithtimes.com/",
      "articles": [
        {
          "id": "684c3175c602f50001a82ba0",
          "author": "Denny Carter",
          "description": "We faced terrible choices in the early days of the Great Redo. I was in charge of picking the least terrible.",
          "link": "https://badfaithtimes.com/blog-posts-from-the-glorious-future-how-texas-was-won/",
          "publishedOn": "2025-06-13T14:34:01.000Z",
          "wordCount": 2174,
          "title": "Blog Posts From The Glorious Future: How Texas Was Won",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/06/flag-of-texas.jpg"
        },
        {
          "id": "68498fd6d75ada00010709c9",
          "author": "Denny Carter",
          "description": "There is no easy path to a free country.",
          "link": "https://badfaithtimes.com/democrats-should-simply-remove-the-stumbling-block/",
          "publishedOn": "2025-06-11T15:35:48.000Z",
          "wordCount": 1172,
          "title": "Democrats Should Simply Remove The Stumbling Block",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/06/1372cfa289896cfc827e595b9601374b21d9e505___06084948746.webp"
        },
        {
          "id": "684721fcf28b5e0001e312ee",
          "author": "Denny Carter",
          "description": "The devourer of hate is now in charge of creating the conditions for a military crackdown on the American public.",
          "link": "https://badfaithtimes.com/the-nourishing-hate-of-stephen-miller/",
          "publishedOn": "2025-06-10T11:26:15.000Z",
          "wordCount": 2218,
          "title": "The Nourishing Hate Of Stephen Miller",
          "imageUrl": "https://badfaithtimes.com/content/images/size/w1200/2025/06/Screenshot-2025-06-09-at-10.05.17---PM.png"
        },
        {
          "id": "683f0ee902af5d00015f2462",
          "author": "Denny Carter",
          "description": "People are thirsty for an activist government that's on their side.",
          "link": "https://badfaithtimes.com/for-the-first-time-i-americans-want-the-government-to-do-stuff/",
          "publishedOn": "2025-06-05T18:10:03.000Z",
          "wordCount": 1740,
          "title": "For The First Time In Our Lifetimes, Americans Want The Government To Do Stuff",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/06/Screenshot-2025-06-05-at-2.01.09---PM.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}