{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": [
        {
          "id": "https://blogs.fangraphs.com/?p=468993",
          "author": "Michael Baumann",
          "description": "Immaculate Grid just got slightly easier because of the Randall Grichuk, Gregory Soto, and Erick Fedde trades, so enjoy that while you can.",
          "link": "https://blogs.fangraphs.com/welcome-to-the-5-dvd-bin-at-walmart-of-the-trade-deadline/",
          "publishedOn": "2025-07-28T16:45:12.000Z",
          "wordCount": null,
          "title": "Welcome to the $5 DVD Bin at Walmart of the Trade Deadline",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://blogs.fangraphs.com/?p=468662",
          "author": "Davy Andrews",
          "description": "With songs he has sung for a thousand years.",
          "link": "https://blogs.fangraphs.com/rich-hill-is-alive-with-the-sound-of-scream-grunts/",
          "publishedOn": "2025-07-24T15:00:37.000Z",
          "wordCount": null,
          "title": "Rich Hill Is Alive With the Sound of Scream-Grunts",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=197104",
          "author": "Samer Kalaf",
          "description": "This week, Luka Doncic took part in a time-honored tradition employed by many athletes before him: a news cycle about how he's in the best shape of his life. As the Lakers star made a trip to New York, showing up at Yankee Stadium and Dyckman Park to promote a shoe or whatever, Men's Health published a feature on his summer training regimen. One specific detail about his physique sounded incredible, in the literal sense of the word.\nThe feature, co-written by Andrew Heffernan and Ebenezer Samuel, presents an inside look at how Doncic is getting lean and strong with his trainer in Croatia. You can probably guess where this is going. He's not just getting up shots—he's lifting weights. He's working on his conditioning. He's doing something with a resistance band. He's eating better:",
          "link": "https://defector.com/mens-health-article-hallucinates-luka-doncic-with-a-42-inch-vertical",
          "publishedOn": "2025-07-30T18:18:46.000Z",
          "wordCount": 8580,
          "title": "Men’s Health Article Hallucinates Luka Doncic With A 42-Inch Vertical",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1396970456.jpg"
        },
        {
          "id": "https://defector.com/?p=197169",
          "author": "Barry Petchesky",
          "description": "Perhaps you have given yourself over to Cucumber Season and are not paying attention to the dog days of the baseball season. It may then come as news to you that they're touching it. They're all touching it, all the time, and it is working. \nAfter losing 12 of 13, Tigers outfielder Riley Greene shaved off his beard but left his mustache, and since then Detroit has won three straight. Are these two things related? Is the mustache winning baseball games? Who can say. One thing we can say with absolute certainty is that they are touching it, early and often.",
          "link": "https://defector.com/have-you-heard-theyre-touching-it",
          "publishedOn": "2025-07-30T17:59:31.000Z",
          "wordCount": 6459,
          "title": "Have You Heard? They’re Touching It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2226984923.jpg"
        },
        {
          "id": "https://defector.com/?p=197120",
          "author": "Chris Thompson",
          "description": "The Boston Red Sox encountered significant turbulence on a team flight to Minneapolis Sunday night. Big deal, you are saying, from the comfort of your office chair. It is at least a moderate deal. We are not talking about the zippy little Space Mountain stuff that makes passengers giggle during approach. Passengers in this case were lifted from their seats and bounced around violently, and several people barfed all over the place. The flight had to make an unscheduled landing in Detroit, so unstable was the weather, and did not finally land in Minneapolis until around 1:00 a.m. Several Red Sox players were still feeling sick and beat up the following day, and reliever Garrett Whitlock had to miss the series opener due to lingering aftereffects. Two Red Sox players and one broadcaster called it the worst turbulence they'd ever experienced, per MassLive, and these are people who do a lot of flying.\n\"Forty-five minutes straight of left, right, dropping down,\" recalled Lucas Giolito, who compared the experience unfavorably to a roller coaster. \"Sitting on a plane, it was like, oh boy. At one point, I kind of flew up out of my seat. I was like, 'OK, it’s time to put the seatbelt on.'\" Giolito says he was comforted by the knowledge that \"commercial airline jets never crash from turbulence,\" information that he picked up from watching The Rehearsal, a show that I have never watched and that from my experience entirely defies explanation.",
          "link": "https://defector.com/red-sox-dance-to-commemorate-the-flight-from-hell",
          "publishedOn": "2025-07-30T17:35:17.000Z",
          "wordCount": 8503,
          "title": "Red Sox Dance To Commemorate The Flight From Hell",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2227627578.jpg"
        },
        {
          "id": "https://defector.com/?p=197129",
          "author": "Drew Magary",
          "description": "Some people are fans of the New York Jets. But many, many more people are NOT fans of the New York Jets. This 2025 Defector NFL team preview is for those in the latter group. Read all the previews so far here.\nYour team: THEY’RE A BRICK! HOUSE!/THEY’RE NEVER RIGHTY/THEY’RE LETTIN’ IT ALLLLL HANG OUT",
          "link": "https://defector.com/why-your-team-sucks-2025-new-york-jets",
          "publishedOn": "2025-07-30T16:53:51.000Z",
          "wordCount": 14196,
          "title": "Why Your Team Sucks 2025: New York Jets",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2173243593.jpg"
        },
        {
          "id": "https://defector.com/?p=197117",
          "author": "Lauren Theisen",
          "description": "I just read Leo Tolstoy's 1870s novel Anna Karenina for the first time, and I am treating it like a real accomplishment. For basically all of my life, whenever I've heard reference to Tolstoy—OK, mostly War And Peace specifically, but whatever—it's felt like he's been hanging high above my head, his essence incomprehensible to my less-developed brain. He's so revered and so synonymous with supersized, challenging literature that he felt, basically, like the final boss of reading. \nWhat surprised me about Anna Karenina, however, is that on a sentence level, it isn't tough at all. It was listed under \"YA\" at my library, sure, but I kind of thought that was some sort of trick to lure young people into giving a classic a shot. The language in my copy was so basic and so direct about what was happening that I actually looked up the translation to make sure I hadn't accidentally grabbed some sort of \"No Fear Shakespeare\" version of the novel. (Apparently, Louise and Aylmer Maude were pals of Leo's back in the day, so I trust that they were faithful.)",
          "link": "https://defector.com/my-favorite-part-of-anna-karenina-is-the-guy-who-cant-stop-himself-from-talking-about-mushrooms",
          "publishedOn": "2025-07-30T16:18:42.000Z",
          "wordCount": 9365,
          "title": "My Favorite Part Of ‘Anna Karenina’ Is The Guy Who Can’t Stop Himself From Talking About Mushrooms",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-544994131.jpg"
        },
        {
          "id": "https://defector.com/?p=196842",
          "author": "Tom Ley",
          "description": "I can still remember the sound of the dull thud, and the scream that came after. It was a tournament game, and our pitcher, Paul, was dealing. He always did, because he could throw 80 mph as a 13-year-old, and he never missed the catcher's mitt. Games with Paul on the mound were easy; I'd just stand at my position at second or first base and watch the strikeouts accumulate while feeling sorry for the kids on the other team who had to quiver through each at-bat. Paul was the best player any of us had ever seen. During this game, though, a fastball got away from him and sailed directly into the cheekbone of the batter, Josh, a kid we all knew and were friends with. There was a sound like a mallet hitting meat, followed by the muffled ping of the bat hitting the ground just before Josh's body, and then the most upsetting scream I've ever heard.\nAn ambulance came for Josh (he ended up being fine, I'm not sure if he even broke a bone), and the game continued without him. Paul spent most of the delay crouched between home plate and the mound, his hat pulled down as far as it would go. Somehow he stayed in the game, and got through the next few innings while soft-tossing balls over the plate. Paul, who up until that point I could only perceive as a mythically good ballplayer, was scared. He didn't want to hurt anyone else.",
          "link": "https://defector.com/the-art-of-fielding-knows-whats-scary-about-baseball",
          "publishedOn": "2025-07-30T15:23:17.000Z",
          "wordCount": 8408,
          "title": "‘The Art Of Fielding’ Knows What’s Scary About Baseball",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-516509074.jpg"
        },
        {
          "id": "https://defector.com/?p=196877",
          "author": "Eva Holland",
          "description": "If you’re not a particular kind of mountain sports nerd, you might not be familiar with the Banff Centre Mountain Film Festival World Tour. But for people who live their lives in the overlapping circles of outdoor and adventure sports, environmental and conservation sciences, and nonfiction storytelling, it’s a touchstone. The parent festival has been held in Banff, Alberta, for decades—it will celebrate its 50th anniversary later this year—and the tour brings a tight selection of the featured films to more than 40 countries every year. \nBarring a true outlier like Free Solo, which made it all the way to the Oscars, getting on the Banff world tour is about as big as it gets in this corner of the filmmaking world. So it meant a lot when 600 people packed into the largest theater at the Banff Centre for Arts and Creativity on a Thursday evening last October to watch the world premiere of For Winter, a feature-length documentary from the National Geographic Society’s acclaimed Impact Story Lab.",
          "link": "https://defector.com/why-did-national-geographic-disappear-its-own-documentary-about-a-queer-climate-scientist",
          "publishedOn": "2025-07-30T13:01:32.000Z",
          "wordCount": 16412,
          "title": "Why Did National Geographic Disappear Its Own Documentary About A Queer Climate Scientist?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1186681909_a1d08c.jpg"
        },
        {
          "id": "https://defector.com/?p=196895",
          "author": "David Roth",
          "description": "A Hall of Fame case does not get built in the same way, or out of the same things, as a legend. There are plenty of Hall of Famers who managed to build compelling cases, in the methodical and accumulative way that such cases are built, without throwing off much in the way of mythos along the way. They get plaques, too, and deserve them. They also accrue the same, inevitable sort of legend that every big leaguer attracts on the way up; everyone who ever faced Scott Rolen in high school could and probably will tell you about the experience, just as my former coworker who once served up a 450-foot homer to Orlando Hudson in a college game would invariably bring it up when even a narrow window of opportunity opened. I should be clear that I think this is absolutely the right thing to do. Even …",
          "link": "https://defector.com/ichiro-saved-one-last-surprise-for-cooperstown",
          "publishedOn": "2025-07-29T21:33:15.000Z",
          "wordCount": 10852,
          "title": "Ichiro Saved One Last Surprise For Cooperstown",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2227290883.jpg"
        },
        {
          "id": "https://defector.com/?p=196816",
          "author": "Ray Ratto",
          "description": "Some people are fans of the Las Vegas Raiders. But many, many more people are NOT fans of the Las Vegas Raiders. This 2025 Defector NFL team preview is for those in the latter group. Read all the previews so far here.\nYour team: Las Vegas, nee Oakland, nee Los Angeles, nee Oakland Raiders.",
          "link": "https://defector.com/why-your-team-sucks-las-vegas-raiders",
          "publishedOn": "2025-07-29T18:47:48.000Z",
          "wordCount": 14376,
          "title": "Why Your Team Sucks: Las Vegas Raiders",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2227464585.jpg"
        },
        {
          "id": "https://defector.com/?p=196640",
          "author": "Sabrina Imbler",
          "description": "When scientists discover new prehistoric species, the fossils alone fail to conjure the creature in the flesh. It's impossible to summon the entirety ancient shark from a single tooth, or some weird old rodent from a fragment of a jaw. This is where paleoart comes in, with illustrations that help you imagine how such an animal might have looked in its heyday. But very few of these visualizations dare to take one step further and help you imagine what it would be like to be caught, swallowed, and digested by that animal—until now.\nImagine you are a small living creature or a scrap of a dead one, drifting in the shallows over an innocuous patch of sand. But what is that? Suddenly that dimple in the sand has unfurled into a daunting pillar of a worm. But it this is not just any worm; it is Kraytdraco spectatus, an ancient penis worm that lurked in the sludge of the shallow seas swathing the Grand Canyon during the Cambrian. And K. specatus is about to eat you.",
          "link": "https://defector.com/behold-a-surprisingly-beautiful-depiction-of-being-swallowed-by-a-toothy-penis-worm",
          "publishedOn": "2025-07-29T17:32:29.000Z",
          "wordCount": 10528,
          "title": "Behold: A Surprisingly Beautiful Depiction Of Being Swallowed By A Toothy Penis Worm",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/insidetheworm.jpg"
        },
        {
          "id": "https://defector.com/?p=196914",
          "author": "Albert Burneko",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about lead singers, cooking screwups, whining children, and more.\nDrew is off! I am your Dread Funbag Lord for today.",
          "link": "https://defector.com/ok-but-what-if-the-billionaire-is-a-cool-guy",
          "publishedOn": "2025-07-29T16:46:27.000Z",
          "wordCount": 18273,
          "title": "OK But What If The Billionaire Is A Cool Guy?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/wembus1.jpeg"
        },
        {
          "id": "https://defector.com/?p=196991",
          "author": "Lauren Theisen",
          "description": "Folks with fancy degrees will tell you that kleptomania is a mental illness, but I bet those doctors never watched a San Diego Padres game. On a couple of occasions already this month, Kelsey has covered how the outfielders of the Robbin' Padres so spectacularly take away would-be dingers from their opponents, almost like they have a compulsion to steal. And yet their victims persist in hitting balls to that area just above the top of the fence. The latest of these poor marks was the New York Mets, who traveled all the way to Southern California only to discover that their hosts were thieves who like nothing more than swiping taters while thousands of locals cheer them on.\nSan Diego's big heist came in the fourth inning of Monday's series opener—thankfully, well after any impressionable children on the east coast would have already gone to bed. Mark Vientos went the other way on some high cheese from Dylan Cease, smacking it way out to right center. But Fernando Tatis Jr. owns that territory, and if you want to do business, you gotta go through him. The SD star gathered, leaped high off the warning track, and stretched his glove over the top of the fence to reel back what had seemed like a sure-thing four-bagger. Tatis was such a stealthy, athletic robber in this instance that even Padres play-by-play man Don Orsillo had no idea what he did. First, he called it as a home run, and then when Tatis fumbled the ball on the transfer into his glove, Orsillo assumed Vientos had hit it off the wall. That's the sneakiness of all the best bandits: They stay two steps ahead of whatever you're thinking.",
          "link": "https://defector.com/the-robbin-padres-took-away-a-home-run-before-anyone-knew-what-happened",
          "publishedOn": "2025-07-29T15:29:52.000Z",
          "wordCount": 7140,
          "title": "The Robbin’ Padres Took Away A Home Run Before Anyone Knew What Happened",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2226851316-e1753795671439.jpg"
        },
        {
          "id": "https://defector.com/?p=196760",
          "author": "Patrick Redford",
          "description": "VARIOUS CITIES (SOME ARGUABLY TOWNS), France — The Tour de France is over. I hope you enjoyed the racing and the 11 dispatches I was able to bring you from the race, on topics such as how language works in the peloton, a day in the life of a neutral service mechanic, and Tadej Pogacar's stultifying dominance. This is the last one before I go on vacation.\nAs I hope to have illustrated, the Tour is less a bike race than a rollicking circus that happens to have a bike race at its center. The bike race and the circus both matter, and I've tried to highlight both, though there were so many strange and delightful things that I saw, heard, and experienced that could not fit into otherwise wieldy blogposts. Instead they will fit here.",
          "link": "https://defector.com/some-more-stuff-i-saw-at-the-tour-de-france",
          "publishedOn": "2025-07-29T14:19:54.000Z",
          "wordCount": 9719,
          "title": "Some More Stuff I Saw At The Tour de France",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/tdf-notebook-dump.jpeg"
        },
        {
          "id": "https://defector.com/?p=196979",
          "author": "Tom Ley",
          "description": "Defensive tackle Christian Wilkins was released by the Raiders last week, which immediately scanned as just another instance of the franchise deploying its \"trip over your own feet\" philosophy of roster construction. Yes, it's strange to release a guy who you just signed to a four-year deal with $84 million guaranteed last offseason, but that's how bad teams do business. \nConscious of how a move like this would look, the Raiders had an explanation ready to be disseminated through various league insiders: Wilkins, who suffered a Jones fracture in his foot last October, was refusing to follow the team's recommendation to have a second surgery on his foot, and therefore the Raiders were not only releasing him but seeking to recoup $35.2 million of guaranteed money that remains on his contract.",
          "link": "https://defector.com/christian-wilkins-saga-gains-smooch-based-dimension",
          "publishedOn": "2025-07-29T13:34:04.000Z",
          "wordCount": 7188,
          "title": "Christian Wilkins Saga Gains Smooch-Based Dimension",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2177528527.jpg"
        },
        {
          "id": "https://defector.com/?p=194568",
          "author": "Lucy Bloom",
          "description": "I am sitting on a dock in the Wisconsin sun. About 15 feet away, Livi Pappadopoulos and Aini Anderson are walking on water. The first and (now) second-ranked women in logrolling are sharing a No. 3 log (13 inches in diameter, No. 3 because it is third-widest) and a full conversation. \"Can I flex for a second?\" Livi asks. Aini says sure. \"The other day I came out here alone and got a little roll in on the No. 5, probably half an hour, and then brought it back to the dock and pulled it up onto the dock all without getting wet.\" Though the No. 5 is the smallest, not even used by pros in competition, it would still be about 270 pounds (when dry), round, and in the situation Livi is describing, also wet and slippery. None of that seems remotely possible. It does not even occur to me to doubt her.\nI got into logrolling the same way everyone does: I was hanging out in the Midwest looking for a way to kill a Saturday. On this particular weekend, the La Crosse Open was happening, so I just showed up. It was a pretty low-key, casual affair. The spectators were mostly locals who knew someone in the event, or people who didn't really know what they were looking at but were quite happy to have a beer and a brat while watching something cool for free.",
          "link": "https://defector.com/earths-best-logroller-has-created-her-own-greatest-rival",
          "publishedOn": "2025-07-29T13:09:23.000Z",
          "wordCount": 14666,
          "title": "Earth’s Best Logroller Has Created Her Own Greatest Rival",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/Midwest-Open-1.jpg"
        },
        {
          "id": "https://defector.com/?p=196885",
          "author": "Maitreyi Anantharaman",
          "description": "A 32-point, eight-rebound, seven-assist, four-steal, two-block performance is just the kind of thing you can expect from Napheesa Collier these days. She began the year favored to win MVP, and halfway through the WNBA season, she’s done nothing to sway voters in any another direction. Her Minnesota Lynx sit comfortably in first place; their biggest challengers will have to weather some time without Breanna Stewart, who left a recent Liberty game with a lower leg injury. The Lynx are still a model of steadiness, able to overwhelm opponents with sheer precision on both ends of the floor. \nWhich is why a 32-point, eight-rebound, seven-assist, four-steal, two-block Napheesa Collier performance in a loss at home is just not the kind of thing you’d expect from them. Before last weekend (and excluding the Commissioner’s Cup Final), Minnesota was 14-0 in their own building this season, a franchise-record home win streak for a franchise whose records are tough to break. But it came to an end Sunday in a 90-86 loss to the Atlanta Dream, who are finally, after many years, interesting.",
          "link": "https://defector.com/at-the-very-least-the-atlanta-dream-are-worth-watching",
          "publishedOn": "2025-07-28T20:53:41.000Z",
          "wordCount": 7525,
          "title": "At The Very Least, The Atlanta Dream Are Worth Watching",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2226691406-e1753737538585.jpg"
        },
        {
          "id": "https://defector.com/?p=196929",
          "author": "Dave McKenna",
          "description": "A Gaelic football season of massive upheaval ended just like so many others had: With Kerry winning another All-Ireland championship. The recognized all-time kings of the game, now led by David Clifford, who at 26 years old is already hailed as history’s greatest Gael footballer, blitzed Donegal early and then fairly coasted to a 10-point win, 1-26 to 0-19. The triumph, coming in front of more than 82,000 manic green-and-gold clad fans who packed Dublin’s legendary Croke Park, gave Kerry their 39th title in a competition that dates back to 1887. No other county comes close.\nThe 2025 tournament was the first held since the sport’s sanctioning body, the Gaelic Athletic Association, installed several momentous rule changes in hopes of opening up offenses. The alterations included forbidding back passes to goalies, and also short kickouts from goalies. But the most radical of the new edicts, and likely the most radical rule change ever foisted upon Irish football (and one which indicates Steph Curry’s sporting influence transcends the USA and basketball), came with the addition of a two-point arc 40 meters from the center of the goal line. The new line, according to the godfathers of the nationalistic pastime, would prevent coaches from stuffing the area in front of the goal with defenders, and thereby lead to both goal-scoring opportunities and long, majestic shots from play.",
          "link": "https://defector.com/the-new-era-of-gaelic-football-suits-david-clifford-and-kerry-just-fine",
          "publishedOn": "2025-07-28T20:03:18.000Z",
          "wordCount": 8661,
          "title": "The New Era Of Gaelic Football Suits David Clifford And Kerry Just Fine",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2226604856.jpg"
        },
        {
          "id": "https://defector.com/?p=196903",
          "author": "Kathryn Xu",
          "description": "On Monday, ESPN's Jeff Passan reported, and the Cleveland Guardians confirmed with an official statement, that Guardians closer Emmanuel Clase has been placed on \"non-disciplinary paid leave as part of MLB's sports-betting investigation\" until Aug. 31. This leave comes as part of the investigation into Clase's teammate, Luis L. Ortiz, who was placed on leave earlier in the month after a betting-integrity firm flagged abnormal betting activity on two specific pitches he threw.\nClase, an All-Star and three-time American League leader in saves, has a much higher profile than Ortiz. His name has been floating around trade talks this year; as Bob Nightengale has helpfully noted, his administrative leave means he is presumably no longer on the trade block. A note on language: While being placed on leave resembles a suspension—the player is not permitted to play—it is, in the language Passan uses, explicitly non-disciplinary before the conclusion of the investigation. This is the same language used in league investigations into domestic violence cases.",
          "link": "https://defector.com/emmanuel-clase-placed-on-leave-while-mlb-conducts-gambling-investigation",
          "publishedOn": "2025-07-28T19:21:01.000Z",
          "wordCount": 6855,
          "title": "Emmanuel Clase Placed On Leave While MLB Conducts Gambling Investigation",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/claseGamba.jpg"
        },
        {
          "id": "https://defector.com/?p=196910",
          "author": "Ray Ratto",
          "description": "In the current my-truth era everyone is not just permitted but encouraged to pretend they're right whether or not they actually are. The deranged and deranging downsides of this are obvious and everywhere, but one of the smaller of those is that heroes are by now pretty much an eye-of-the-beholder thing. For instance, our Philadelphia Bureau is pretty in on Bryce Harper because, well, because he's Bryce Harper. Even now, in a comparatively meh season—various injuries have led him to put up some fine if not quite Harperian numbers—he's pretty much whatever you make of him, as athletic golden boys in their 32-year tend to be.\nUnless of course he does something like offer to throw the commissioner of baseball out of the Phillies clubhouse skidding down the hallway face first, in which case Harper becomes not a hero or even a golden boy, but a full-on god. And we say that while being fully cognizant that the baseline for godhood does not usually involve bumrushing a 66-year-old lawyer out of a room as though he were just another loud and obnoxious drunk at a corner bar. Bryce Harper is a god, period, full stop, and we are not accepting countervailing views. You want to argue? Go get in a fight with your neighbor. He's been tardy on the rosebush trimming all summer.",
          "link": "https://defector.com/bryce-harper-opens-negotiations-on-mlbs-salary-cap-proposal-by-telling-rob-manfred-to-get-the-fuck-out",
          "publishedOn": "2025-07-28T18:09:18.000Z",
          "wordCount": 8188,
          "title": "Bryce Harper Opens Negotiations On MLB’s Salary Cap Proposal By Telling Rob Manfred To “Get The Fuck Out”",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2208821689.jpg"
        },
        {
          "id": "https://defector.com/?p=196853",
          "author": "Drew Magary",
          "description": "Some people are fans of the Jacksonville Jaguars. But many, many more people are NOT fans of the Jacksonville Jaguars. This 2025 Defector NFL team preview is for those in the latter group. Read all the previews so far here.\nYour team: Jacksonville Jaguars.",
          "link": "https://defector.com/why-your-team-sucks-2025-jacksonville-jaguars",
          "publishedOn": "2025-07-28T17:31:39.000Z",
          "wordCount": 13451,
          "title": "Why Your Team Sucks 2025: Jacksonville Jaguars",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2196271569.jpg"
        },
        {
          "id": "https://defector.com/?p=196535",
          "author": "Alex Sujong Laughlin",
          "description": "The first time I did yoga was in a beachside studio in Ewa Beach, Hawaii in 2010. I was visiting my family there for the summer and my mom had recently become a regular at the studio. I remember the smell of incense in the stifling room and the shapes of other womens' bodies prone on their multicolored mats, completely locked into whatever physio-spiritual ritual I had stumbled into. \nI felt uncomfortable with the amount of chanting we did, but I liked the movement in the class enough to come back the next week. In the 15 years since I took that class, I've introduced several friends and romantic partners to yoga and I recognize the look of intimidation in their eyes when they first enter a studio with low light and lofi beats playing.",
          "link": "https://defector.com/mattie-goes-to-a-yoga-class",
          "publishedOn": "2025-07-28T16:35:18.000Z",
          "wordCount": 6781,
          "title": "Mattie Goes To A Yoga Class",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/TRYHARD_ShowArtwork-1.png"
        },
        {
          "id": "https://defector.com/?p=196834",
          "author": "Barry Petchesky",
          "description": "CC Sabathia became a star in Cleveland, and became a champion in New York, and this weekend became a Hall of Famer in Cooperstown—but I will always think of Milwaukee. Possibly the greatest midseason rental of all time, Sabathia's 17 starts that carried the 2008 Brewers to their first postseason in 26 years remains my byword for dominance. I will go to my grave swearing that his stretch was the greatest I've ever seen by a pitcher; I will brook no arguments to the contrary. Perhaps this is hagiography over historiography. Don't care! It's the Hall of Fame, not the Hall of Objectivity. Sabathia was a warhorse.\nIt wasn't just, or even, about being unhittable. It was about Sabathia's tirelessness—his sheer, sustained ability to take the ball and not give it up. He threw on short rest. He threw to the 27th out. He threw and threw and threw, as many as 130 pitches in one start, and then he threw some more. He strapped a big honking icepack to his left shoulder (Atlas might've envied its sturdiness) and then he threw again. He made it seem like dominance was a matter of willpower.",
          "link": "https://defector.com/no-ones-ever-been-better-than-cc-sabathia-on-the-brewers",
          "publishedOn": "2025-07-28T15:41:55.000Z",
          "wordCount": 8426,
          "title": "No One’s Ever Been Better Than CC Sabathia On The Brewers",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-83042088.jpg"
        },
        {
          "id": "https://defector.com/?p=196848",
          "author": "Maitreyi Anantharaman",
          "description": "It's time to to wrap up the month with a challenging themeless. Keep an eye out for tricky clues and fun wordplay. This week’s puzzle was constructed by Willa Angel Chen Miller and edited by Hoang-Kim Vu.\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE. Note that our submissions are closed through July 31.",
          "link": "https://defector.com/the-crossword-july-28-when-you-win-say-nothing-themeless",
          "publishedOn": "2025-07-28T15:01:23.000Z",
          "wordCount": 5679,
          "title": "The Crossword, July 28: When You Win, Say Nothing (Themeless)",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2218658598.jpg"
        },
        {
          "id": "https://defector.com/?p=196809",
          "author": "Patrick Redford",
          "description": "PARIS — Four hours before the final stage of the Tour de France begins, I walk the length of the last, newest climb on the race parcours. This is only possible on the course itself, as thousands of fans have packed themselves dense against the barriers, the lucky few enjoying cafe tables or spots inside second-floor apartments, the vast majority simply standing and waiting to see how the riders would contend with a Paris novelty: difficult racing. Two thirds of the way up, a group of singing French lads build to a crescendo before launching a baguette across the course. A corresponding lad on the far side takes a honking bite from the loaf, and ritually hurls it back, on and on until the baguette disappears to rapturous peals of joy. This is the Col de la Butte Montmartre.\nParis is always the end of the Tour, unless it's an Olympic year, and it's almost always a parade. Three weeks in, and every rider, mechanic, and sleep scientist with the Tour, not to mention its cheese-addled press corps, is exhausted and wants nothing more than to sleep for 36 straight hours. The final stage is usually a champagne toast on wheels, with the winners of various classifications taking turns riding to the front of the pack for photo-ops before the peloton arrives in the city and turns a few leisurely laps around the Champs-Élysées; then the sprinters duke it out one last time.",
          "link": "https://defector.com/the-tour-de-frances-new-hardcore-paris-finale-was-one-for-the-ages",
          "publishedOn": "2025-07-28T13:40:37.000Z",
          "wordCount": 10163,
          "title": "The Tour de France’s New, Hardcore Paris Finale Was One For The Ages",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/tdf-montmartre.jpeg"
        },
        {
          "id": "https://defector.com/?p=196775",
          "author": "Kathryn Xu",
          "description": "Before this year's rendition of the Belgian Grand Prix, it was all feeling a little bit 2021. The Circuit de Spa-Francorchamps that year was wet and untenable. With race direction unwilling to cancel the event, the cars paraded about for two laps under the safety car before the race was red flagged and never restarted. Officially, the race was logged as lasting one lap and under seven kilometers. The points finishers, led by Max Verstappen, George Russell (in a Williams), and Lewis Hamilton, received half of the regularly allotted points. In a sport and season with no shortage of farces, the 2021 Belgian GP still managed to stand out as noticeable clown show—yet more history for one of the most beautiful, legendary, cruel tracks on the calendar.\nFour years later, and spectators were getting some unfortunate flashbacks. Rain was aggressively forecast throughout the weekend, which it is wont to do in Stavelot, Belgium. On Sunday, the Formula 3 feature race was canceled. Uh-oh. Then the Formula 2 feature race managed to run in wet conditions. Joyous days! Then race control repeatedly punted the start of the Formula 1 feature race. Uh-oh, again. Then the rain petered out, and then stopped. Out of an abundance of caution, the race started under a safety car, which led for four laps. By the time it pulled in, the track was already drying.",
          "link": "https://defector.com/simply-invent-rain-control-to-ensure-a-thrilling-belgian-grand-prix",
          "publishedOn": "2025-07-28T13:03:02.000Z",
          "wordCount": 9581,
          "title": "Simply Invent Rain Control To Ensure A Thrilling Belgian Grand Prix",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/lewisHamiltonSpa2025.jpg"
        },
        {
          "id": "https://defector.com/?p=196779",
          "author": "Luis Paez-Pumar",
          "description": "After 360 minutes of knockout play, two penalty shootouts, and three comebacks, England is the back-to-back champion of Europe. Despite losing its first game of Euro 2025 against France, and despite an arduous run to the final that further extended into extra time and penalties, England held off the reigning World Cup winner Spain to lift the trophy thanks to a 3-1 penalty shootout win. It was the last gutsy victory in a line of gutsy victories, each seeing England down and out but never completely lost. The Lionesses are worthy champions, even if they only led for a total of four minutes in the knockout rounds.\n\nhttps://www.youtube.com/watch?v=99bgTARgKD8",
          "link": "https://defector.com/chloe-kelly-carried-england-to-the-promised-land",
          "publishedOn": "2025-07-27T20:20:10.000Z",
          "wordCount": 9747,
          "title": "Chloe Kelly Carried England To The Promised Land",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2227268687.jpg"
        },
        {
          "id": "https://defector.com/?p=196770",
          "author": "Lauren Theisen",
          "description": "The new Fantastic Four movie came out this weekend, and both Luis Paez-Pumar and Lauren Theisen went to theaters to see it. Here are four thoughts that they shared about the reboot of Marvel’s first family.\n1. This is yet another superhero blockbuster, but it’s nice that it’s more about space explorers than crime fighters.",
          "link": "https://defector.com/four-thoughts-about-the-fantastic-four-first-steps",
          "publishedOn": "2025-07-27T17:19:52.000Z",
          "wordCount": 14259,
          "title": "Four Thoughts About ‘The Fantastic Four: First Steps’",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1081004084.jpg"
        },
        {
          "id": "https://defector.com/?p=196530",
          "author": "Patrick Redford",
          "description": "PARIS — Tadej Pogacar rolled across the line atop La Plagne wet and miserable. The yellow jersey appeared to weigh him down, like a suit of armor worn to guard against heavy blows which couldn't reach him anyway. His expression never shifted out of bland disgruntlement the entire way up the final summit finish of the Tour de France. With Thymen Arensman all but bleeding out a couple of seconds in front of a small group composed of this year's podium, and a stage win hanging in the balance, the sport's greediest winner sat there, indifferent. He had won four stages and built his Tour-winning margin a week ago, so what was the point of extra suffering? The race was over. What could have been gained from punishing his rivals even further? Why win more than necessary?\nThese are not questions Pogacar has even entertained before. Pogacar's defining trait as a competitor—the aspect that's made him not only a champion but the most feared rider on the road—is his insatiability. For the second time in his illustrious career, Pogacar has won two Tour de Frances in a row. But for the first time, the prospect of winning seems to bore him. \"I'm at a point where I wonder why I'm still here,\" he said after La Plagne. \"It's been three very long weeks. You're counting down the kilometers to Paris. I can't wait until it's over so I can have some fun things in my life again.\"",
          "link": "https://defector.com/tadej-pogacar-and-the-boredom-of-perfection",
          "publishedOn": "2025-07-27T14:19:57.000Z",
          "wordCount": 9399,
          "title": "Tadej Pogacar And The Boredom Of Perfection",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2226361745-min-e1753625224326.jpg"
        },
        {
          "id": "https://defector.com/?p=196725",
          "author": "Maitreyi Anantharaman",
          "description": "Dominique Malonga is an unusual player in unusual circumstances for a rookie. Most lottery picks are consigned to at least one year of joker teammates, demoralizing blowouts, and moral victories only. “Being bad” is generally the reason teams end up in the lottery at all. First-overall pick Paige Bueckers, for instance, will almost surely lose more games with the Dallas Wings this year than she did in her entire UConn career. To the extent that there’s any silver lining in playing on a loser, it’s the chance to get lots of low-stakes reps in different roles and alongside different people. Bueckers is also averaging nearly 35 minutes a game, fourth-most in the league, more than the likes of Napheesa Collier, Breanna Stewart, Alyssa Thomas and A’ja Wilson, the usual workhorse suspects.\nMalonga, who went second-overall to the Seattle Storm, is not quite averaging 10 minutes a game this year. That’s no huge surprise. Bueckers entered her rookie season as a polished plug-and-play guard four years Malonga’s senior. And from draft night, it was pretty clear that the timelines of the 19-year-old Malonga and of the Seattle core—Nneka Ogwumike, Skylar Diggins, Gabby Williams, and Ezi Magbegor—might be slightly misaligned. But this isn’t a terrible fit for a raw young player who’s evoked some “baby giraffe” comparisons as she gets used to the pace and intensity of WNBA basketball.",
          "link": "https://defector.com/dominique-malonga-gets-it-done-in-small-doses",
          "publishedOn": "2025-07-25T19:58:10.000Z",
          "wordCount": 7311,
          "title": "Dominique Malonga Gets It Done In Small Doses",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2226892688.jpg"
        },
        {
          "id": "https://defector.com/?p=196729",
          "author": "Soraya Roberts",
          "description": "If there’s a line that sums up Such Brave Girls, it might be this one: \"Remember the family crest: Ignore, Repress, Forget.\" The extremely British show, now in its second season on Hulu, isn’t one to let subtlety get in the way of its satire.\nSuch Brave Girls follows the all-girl Johnson family in the aftermath of the man of the house abandoning them after popping out for some tea bags. There’s single mom Deb (Louise Brealey), left in debt, who can't stand her cheap, moronic boyfriend but suffers through it with an eye on his huge house. There’s older sister Josie (show creator Kat Sadler) who is a lesbian with a case of clinical depression/anxiety and a simpering, actively oblivious boyfriend. And there’s younger, hyper-femme sister Billie (Lizzie Davidson), the real-life sister of Sadler and an unhinged highlight, who is chasing after her own useless drug-dealing boyfriend. “Ultimately the show is a family sitcom about trauma,\" Sadler has said, \"but it’s more about us being narcissistic losers who are pathetically obsessed with what people think about us.” The second season opens with Josie in an art theory lecture as her mother and sister burst in, throw a hood over her head, and abduct her, only to remove the hood when they arrive at ... her wedding day. \"This is the happiest day of your life, Josie,\" her mother says, holding up a white dress like it's a threat.",
          "link": "https://defector.com/such-brave-girls-wants-to-trauma-bond-with-you",
          "publishedOn": "2025-07-25T17:58:19.000Z",
          "wordCount": 8045,
          "title": "‘Such Brave Girls’ Wants To Trauma Bond With You",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/such-brave-girls.png"
        },
        {
          "id": "https://defector.com/?p=196720",
          "author": "Patrick Redford",
          "description": "ALBERTVILLE, France — Hours before the start of Stage 19 of the Tour de France, the day's real competition is already well underway. Civilians and workers alike stalk the caravan, seeking goodies. A gendarme engages in barter with a representative from La Vache Qui Rit (the Laughing Cow). Each side wants what the other has: merch. \nUltimately, the cop trades two official Tour de France police patches and two bananas for a dozen cycling caps adorned with the beautiful laughing cow logo and as many t-shirts. I have been trying to secure a shirt for a week, but when we beg for some, the representative offers a chagrined smile and tells us he is out, as he hands us hat after hat. On the hats is the eponymous laughing cow, wearing earrings of the brand's trademark cheese wheels, each featuring a laughing cow of their own, who is wearing the earrings as well—an infinitely recursive abyss of bovine mirth.",
          "link": "https://defector.com/there-is-no-tour-de-france-without-the-tour-de-brands",
          "publishedOn": "2025-07-25T17:17:43.000Z",
          "wordCount": 10040,
          "title": "There Is No Tour de France Without The Tour de Brands",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/tdf-cochounou-float.jpeg"
        },
        {
          "id": "https://defector.com/?p=196473",
          "author": "Israel Daramola",
          "description": "Welcome to Listening Habits, a column where I share the music I’ve been fixated on recently.\nLike everything else in 2025, algorithms and social media deeply influence how people experience the arts, music most of all. In light of these invisible hands that more or less dictate online music exploration, and the growing desire to rebel against them as seen in the comeback of physical media, it is worth thinking about what \"personal taste\" really means today.",
          "link": "https://defector.com/in-pursuit-of-personal-taste",
          "publishedOn": "2025-07-25T16:51:16.000Z",
          "wordCount": 9813,
          "title": "In Pursuit Of Personal Taste",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1502539392-1.png"
        },
        {
          "id": "https://defector.com/?p=196618",
          "author": "Albert Burneko",
          "description": "On Thursday, longtime Barcelona goalkeeper Marc-André ter Stegen announced via an open letter to the club's fans that he will undergo back surgery, and that as a result he will miss \"about three months.\" A short while later, the club reportedly leaked through Catalonian radio station RAC1 that, contrary to ter Stegen's announcement, it regards his recovery time as \"between 4–5 months.\"\nAn athlete announcing their own surgical recovery timetable isn't unheard of, but it is slightly unusual; typically that sort of thing goes through an organization's official communications shop. An athlete and an organization publicly disagreeing on a player's surgical recovery timetable, likewise, is pretty rare relative to the total number of pro athlete surgeries, but not really remarkable. What's interesting and worth examining in this instance is indicated by the fact that Barcelona's projected recovery timetable for ter Stegen is longer than ter Stegen's. Usually, you'd expect it to be the other way around, for easily legible reasons: The club would like its worker back at the revenue-generating part of their job as soon as possible rather than collecting paychecks for physical therapy, and the worker—the one of the parties, after all, who endures the pain and surgery and recovery, and whose career prospects are affected by injury—would like maximum security against having to go through it all again. In this case it's the player saying he'll be back in three months, and the club saying no, it'll be more like four or five. What's this all about?",
          "link": "https://defector.com/what-the-hell-is-going-on-with-marc-andre-ter-stegen",
          "publishedOn": "2025-07-25T16:27:48.000Z",
          "wordCount": 13019,
          "title": "What The Hell Is Going On With Marc-André ter Stegen?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/mats.jpeg"
        },
        {
          "id": "https://defector.com/?p=196676",
          "author": "Nate Jackson",
          "description": "Gene Upshaw would come to town once a year, usually in the middle of the week. There we were, the Denver Broncos, an NFL football team going through the routine of our football preparation, speaking football language, watching football film, taking football hits, and training our football bodies. But on this one day each year, after all the football things were done, we stayed in our seats in the team meeting room for a different type of discussion. \nUpshaw was an imposing presence. He had been a shit-kicking lineman for the Raiders for 15 seasons, and upon retirement, became the NFLPA’s shit-kicking executive director. He held the post for 25 years. We trusted him. After all, he was one of us. And yet, there he’d be, standing in front of us on a Thursday, explaining in detail some of the very important issues we had to face, including the emergence of withheld data about concussions and the impending CBA negotiations, and no one in the room was listening.",
          "link": "https://defector.com/who-does-the-nflpa-represent",
          "publishedOn": "2025-07-25T16:07:05.000Z",
          "wordCount": 8503,
          "title": "Who Does The NFLPA Represent?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2197819315-e1753459559383.jpg"
        },
        {
          "id": "https://defector.com/?p=196378",
          "author": "Sabrina Imbler",
          "description": "Fifteen years ago in a sanctuary in Zambia, inspiration struck a chimpanzee named Julie. She plucked a stiff blade of grass, stuck it inside her ear, and left it there. There the grass dangled as Julie played, groomed, and rested. The behavior soon spread to most of the other chimpanzees in Julie's group, called Group 4, and was adopted by her son Jack and chimps Kathy, Miracle, and Val. In the span of just one year, Julie was observed with grass in her ear 168 times; by comparison, the next most frequent observer was Kathy, with 36 grass-in-ear sightings. After Julie died in 2013, her invention lived on, with Kathy and Val carrying the torch.\nVal, on trend.",
          "link": "https://defector.com/innovation-strikes-in-the-field-of-chimpanzee-rectum-adornment",
          "publishedOn": "2025-07-25T14:23:41.000Z",
          "wordCount": 9935,
          "title": "Innovation Strikes In The Field Of Chimpanzee Rectum Adornment",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/Juma-30_08_23-GIRB.jpg"
        },
        {
          "id": "https://defector.com/?p=196390",
          "author": "Samer Kalaf",
          "description": "Some people are fans of the New England Patriots. But many, many more people are NOT fans of the New England Patriots. This 2025 Defector NFL team preview is for those in the latter group. Read all the previews so far here.\nYour team: New England Patriots.",
          "link": "https://defector.com/why-your-team-sucks-2025-new-england-patriots",
          "publishedOn": "2025-07-25T14:06:27.000Z",
          "wordCount": 14006,
          "title": "Why Your Team Sucks 2025: New England Patriots",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2184792215.jpg"
        },
        {
          "id": "https://defector.com/?p=196623",
          "author": "Annie Berke",
          "description": "In the mid-to-late '90s, I was part of a girl gang that invaded suburban homes across the top half of New Jersey. We left our clothes strewn across various surfaces in your carpeted basements, ate your Snackwells in the wee hours, and wrote weird notes to your awkward eldest sons. Some of us stayed up all night, laughing and plotting, and some of us, inexplicably, wanted to go to bed at 9:00 p.m. For days afterwards, you would catch the faint smell of Bath & Body Works warm vanilla sugar.\nIt was the age of the pre-teen slumber party, and you could hear us coming from the synth riff of Kim Wilde’s “Kids in America.” It’s the song that opens Clueless, which was the preferred VHS rental for the coolest sleepovers I attended. We were the kids of America, even if we were closer to Nickelodeon’s definition than MTV’s, and Clueless offered a hopeful glimpse into life beyond middle school. We all wanted to be Cher Horowitz—beautiful, popular, rich, and, yes, even kind—and we weren’t the only ones.",
          "link": "https://defector.com/ugh-as-if-takes-on-the-enduring-appeal-of-clueless",
          "publishedOn": "2025-07-25T13:01:29.000Z",
          "wordCount": 10151,
          "title": "‘Ugh! As If!’ Takes On The Enduring Appeal Of ‘Clueless’",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/Clueless.jpg"
        },
        {
          "id": "https://defector.com/?p=196575",
          "author": "Chris Thompson",
          "description": "Terry Bollea died on Thursday. The former professional wrestler was 71 years old. According to his longtime manager, Bollea died at his home in Clearwater, Fla.; different reports say that paramedics responded at dawn to an emergency call reporting that Bollea was suffering from cardiac arrest. He'd had some sort of recent neck surgery, and was rumored to be in failing health. Bollea's wife, Sky, recently batted away rumors that he was in a coma. Fellow washed-up wrestling luminary Jimmy Hart insisted Tuesday afternoon that Bollea was \"doing phenomenal.\" That turned out to be not the case.\nReports of Bollea's poor health were first circulated by the radio personality Bubba the Love Sponge Clem. Followers of Bollea's post-wrestling career will recall that Clem and Bollea were once good friends and sometimes appeared together on Clem's Tampa-area radio show. In 2012, the two made headlines when Gawker reported that Clem had recorded a clandestine video of his wife, Heather, having sex with Bollea. A separate recording that became public years later captured Bollea making vile and racist remarks while in conversation with Heather.",
          "link": "https://defector.com/hulk-hogan-is-dead",
          "publishedOn": "2025-07-24T20:47:47.000Z",
          "wordCount": 6483,
          "title": "Hulk Hogan Is Dead",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2180748354.jpg"
        },
        {
          "id": "https://defector.com/?p=196525",
          "author": "David Roth",
          "description": "It's just a lot to walk around with. You still have to walk around, naturally, there's stuff that needs doing and nothing is really gained by sitting around thinking about how stupid and crooked and venal everything is, and about the confluence of cultural forces conspiring to make it all dumber and nastier and worse, or about the erosion of the institutions and mores that ideally would stem that degradation. And yet, if you're the someone who thinks about that sort of thing—and if you are aware of it, it does tend to clatter around in your brain even if just as highly intrusive background noise—you can't just not think about it. The challenge, if you are aiming to remain sane, is in how you spin it.",
          "link": "https://defector.com/who-can-you-trust-with-pablo-torre",
          "publishedOn": "2025-07-24T19:51:59.000Z",
          "wordCount": 6807,
          "title": "Who Can You Trust? With Pablo Torre",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2197819437.jpg"
        },
        {
          "id": "https://defector.com/?p=196573",
          "author": "Patrick Redford",
          "description": "COURCHEVEL, France — Lunch: indisputably one of the top-three meals of the day, but at the Tour de France, not always something the intrepid reporter can afford to prioritize. Most days involve some degree of frantic scurrying between the start and finish, hitting the road early to go stand around the team buses and ask as many people as possible, \"What's going to happen today?\" (this often works, somehow) before scrambling to beat the peloton to the finish and ask them what happened today. Breakfast is typically one pastry, eaten in the car, and dinner is something to be taken seriously here in France, so it is good. In between, there is not much time.\nHowever! The Amaury Sport Organization (ASO), the Tour's organizing body, provides a press room for journalists to in theory write and in practice annoy each other in like seven different languages, and the press room usually has food. I am not in the press room every day, especially on mountainous days, because it is quite often far from the finish line, which is where the interesting stuff happens. Those days, I eat either the world's driest sandwich from a French gas station or the world's least flavorful salad from a French gas station. Other days, I eat in the press room.",
          "link": "https://defector.com/my-tour-de-france-lunches-reviewed",
          "publishedOn": "2025-07-24T19:30:54.000Z",
          "wordCount": 11101,
          "title": "My Tour de France Lunches, Reviewed",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/IMG_3452.jpg"
        },
        {
          "id": "https://defector.com/?p=196539",
          "author": "Barry Petchesky",
          "description": "Five former NHL players and members of Hockey Canada's 2018 World Juniors championship team were found not guilty of sexual assault in a London, Ontario, courtroom Thursday, with the presiding judge stating, \"I do not find the evidence of [the accuser] to be either credible or reliable.\" Dillon Dubé, Cal Foote, Michael McLeod, Alex Formenton, and Carter Hart had been accused of assaulting a 20-year-old woman in a hotel room while celebrating their tournament win on June 18, 2018.\n\"Having found that I cannot rely upon the evidence from [the accuser] and considering the evidence in this trial as a whole, I conclude that the Crown cannot meet its onus on any of the counts before me,\" Justice Maria Carroccia said.",
          "link": "https://defector.com/five-players-found-not-guilty-in-hockey-canada-sexual-assault-trial",
          "publishedOn": "2025-07-24T19:11:44.000Z",
          "wordCount": 7573,
          "title": "Five Players Found Not Guilty In Hockey Canada Sexual Assault Trial",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1980544284.jpg"
        },
        {
          "id": "https://defector.com/?p=196442",
          "author": "Drew Magary",
          "description": "Some people are fans of the New York Giants. But many, many more people are NOT fans of the New York Giants. This 2025 Defector NFL team preview is for those in the latter group. Read all the previews so far here.\nYour team: New York Giants.",
          "link": "https://defector.com/why-your-team-sucks-2025-new-york-giants",
          "publishedOn": "2025-07-24T17:00:48.000Z",
          "wordCount": 17037,
          "title": "Why Your Team Sucks 2025: New York Giants",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2226681866.jpg"
        },
        {
          "id": "https://defector.com/?p=196547",
          "author": "Luis Paez-Pumar",
          "description": "It's exceedingly rare to see a side enter an international tournament and manage to play its best, most aesthetically pleasing soccer for the entire month-long affair. It does happen—the Spanish men absolutely steamrolled Euro 2012, and the USWNT did the same at the 2019 World Cup—but more often than not, exhaustion, nerves, and tough matchups will force a team to win ugly on the way to the trophy. In Wednesday's Euro 2025 semifinal against Germany, Spain won ugly, as ugly as I've seen during the team's ongoing run of dominance, though La Roja did manage to sneak some real transcendence into a long and draining night in Zurich.\n\nhttps://www.youtube.com/watch?v=-Q3G9BW0Ba0",
          "link": "https://defector.com/spain-won-an-ugly-game-thanks-to-moments-of-splendor",
          "publishedOn": "2025-07-24T16:31:37.000Z",
          "wordCount": 9290,
          "title": "Spain Won An Ugly Game Thanks To Moments Of Splendor",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2226704391.jpg"
        },
        {
          "id": "https://defector.com/?p=196334",
          "author": "Kelsey McKinney",
          "description": "Welcome to Ask The Book Doctor, a recurring series about books and reading them.\nIt can be nice to have a solid brand. For example, I always order the same drinks at the bar, so if I am running late, and I ask someone to order for me, I always get what I want, because I always want the same thing. But because I am consistent, people sometimes freak out when I choose something else. A week or so ago, I ordered a different drink at the bar, and everyone acted like I had two heads! The expectations people have of what I like, then, are determining the kinds of recommendations and information people give to me. No one told me the fancy little whiskey cocktail was so good, because no one thought I would want it!",
          "link": "https://defector.com/how-do-i-find-a-non-fiction-book-i-wont-hate",
          "publishedOn": "2025-07-24T15:47:54.000Z",
          "wordCount": 8049,
          "title": "How Do I Find A Non-Fiction Book I Won’t Hate?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-526244596.jpg"
        },
        {
          "id": "https://defector.com/?p=196528",
          "author": "Tom Ley",
          "description": "Pat McAfee ended his daily ESPN show on Wednesday by finally addressing the role he played in ruining a college student's reputation. To nobody's surprise, he was extremely annoying about it.\nBack in February, McAfee used his show to amplify a rumor about Ole Miss student Mary Kate Cornett having an affair with her boyfriend's dad. The rumor had already gone viral on social media, with Cornett's name attached, and McAfee's decision to discuss it on air—during an interview with NFL insider Adam Schefter, of all people—made things much worse for her. Cornett's phone number was posted online, her mother's house was swatted, and she received so many threats that she had to switch to online courses and move into emergency housing.",
          "link": "https://defector.com/pat-mcafee-declares-himself-a-girl-dad-in-apology-to-harassed-college-student",
          "publishedOn": "2025-07-24T13:27:56.000Z",
          "wordCount": 6928,
          "title": "Pat McAfee Declares Himself A “Girl Dad” In Apology To Harassed College Student",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/pat-mcafee-apology.jpg"
        },
        {
          "id": "https://defector.com/?p=196498",
          "author": "Kathryn Xu",
          "description": "On May 21, Defector's Ray Ratto informed you that it was time to start the \"Rich Hill is BACK\" countdown. A little over three months later, on July 23, I am happy to inform you that the Rich Hill is BACK countdown has officially ended, because Rich Hill is BACK, and this time with the Kansas City Royals!\nSince signing his Minor League deal, the 45-year-old Hill has put up a 5.22 ERA over 11 starts in the minors. Two of those starts came at the Rookie ball level—where, according to Baseball-Reference, he is 23.9 years older than the weighted average age of players in Rookie ball—while the remaining nine came in Triple-A, where he is a mere 17.5 years older than the average. While the ERA is less than ideal, Hill averaged a little less than six strikeouts per start.",
          "link": "https://defector.com/rich-hill-is-back",
          "publishedOn": "2025-07-23T19:48:08.000Z",
          "wordCount": 6777,
          "title": "Rich Hill Is BACK",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/richHillRoyalsBACK.jpg"
        },
        {
          "id": "https://defector.com/?p=196496",
          "author": "Abigail Segel",
          "description": "GENEVA — If it weren’t for the crystal-blue lake and rugged mountains that sandwich the city, I’d have thought I was in London. In the 36 hours before England’s Women’s Euro semifinal match against Italy, downtown Geneva was crawling with English accents and white kits with leonine crests. The only thing more prevalent than England fans was the ample signage around the city promoting the tournament.\nAs I walked around, I began to wonder if, come match time, the stadium would be a sea of white, with nary an Italian fan in sight. I kept an eagle eye out for blue Italy jerseys, and found only enough to count on one hand. In fact, I spotted more German and Spanish kits than those for the Azzurre, and that semifinal is across the country. Even on game day, as I merged into the mass of fans streaming into the stadium, only specks of blue shone through the white.",
          "link": "https://defector.com/in-the-face-of-chaos-england-kept-calm-and-carried-on-into-the-euros-final",
          "publishedOn": "2025-07-23T18:07:41.000Z",
          "wordCount": 11490,
          "title": "In The Face Of Chaos, England Kept Calm And Carried On Into The Euros Final",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2226547184.jpg"
        },
        {
          "id": "https://defector.com/?p=196455",
          "author": "Lauren Theisen",
          "description": "Tuesday night brought another rough loss for the Los Angeles Dodgers—one of a whopping 43 they've already suffered so far this year. Facing the Minnesota Twins at home, the defending champions got absolutely blown out of the ballpark in a three-run loss. Surely no team has ever faced adversity like this.\nOn Teoscar Hernández's bobblehead night (he was benched), the score was even at 3-3 through five, with starter Yoshinobu Yamamoto getting tagged for a couple of unearned runs in a tricky second inning. Once he exited, however, L.A. completely lost the plot. Ben Casparius, the first reliever out of the pen, looked hurt as he failed to get any of his four batters out, and he'll get an MRI. Alexis Díaz was unable to strand two of the runners he inherited. And after Will Klein walked three straight in the seventh, Edgardo Henriquez entered the game and generously turned a Royce Lewis check-swing chopper into a three-bagger with a wild throw into the right-field corner.",
          "link": "https://defector.com/the-first-place-dodgers-are-in-relative-trouble",
          "publishedOn": "2025-07-23T17:07:38.000Z",
          "wordCount": 7122,
          "title": "The First-Place Dodgers Are In Relative Trouble",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2225691174.jpg"
        },
        {
          "id": "https://defector.com/?p=196428",
          "author": "Drew Magary",
          "description": "Some people are fans of the Cleveland Browns. But many, many more people are NOT fans of the Cleveland Browns. This 2025 Defector NFL team preview is for those in the latter group. Read all the previews so far here.\nYour team: Cleveland Browns.",
          "link": "https://defector.com/why-your-team-sucks-2025-cleveland-browns",
          "publishedOn": "2025-07-23T16:48:49.000Z",
          "wordCount": 15124,
          "title": "Why Your Team Sucks 2025: Cleveland Browns",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2223947750.jpg"
        },
        {
          "id": "https://defector.com/?p=196467",
          "author": "Ray Ratto",
          "description": "As the NFL's loudest, goofiest, and by far richest general manager, Dallas Cowboys owner Jerry Jones is always positioned for the camera, any camera. His singular and long-running M.O.—the tough-talking soft touch in contract negotiations—has always been a comedic staple. It allows him to be a hawk and a kitten on player deals simultaneously.\nAs a result, his circumnavigations regarding super-de-duperstar defensive end Micah Parsons are made more interesting by the way that Jones gave in most recently, which was on Dak Prescott's $240 million deal, which guaranteed $231 million in salary, a year ago. On the one hand, Parsons not yet having a contract is not yet officially a pressing matter; Dallas' first loss of the season, at Philadelphia in the first game of the season, is still six weeks away. On the other, Jones sounds like he is taking the NFL's not-so-secret aggression against guaranteed money to spleen, if not necessarily to heart.",
          "link": "https://defector.com/jerry-jones-is-negotiating-with-himself-as-usual",
          "publishedOn": "2025-07-23T16:14:10.000Z",
          "wordCount": 8512,
          "title": "Jerry Jones Is Negotiating With Himself, As Usual",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2189270765.jpg"
        },
        {
          "id": "https://defector.com/?p=196414",
          "author": "Dave McKenna",
          "description": "No record ever spoke to me more than Southern Rock Opera by the Drive-By Truckers. It’s a concept album released in 2001 that has lots of songs about growing up in the South in the late '70s and not having much going on besides power drinking and rock and roll. That record could be my life. And of all the period-piece vignettes, none hit me where I live more than a verse in \"Let There Be Rock\" where frontman Patterson Hood bragged about a concert the rock gods blessed upon him back in the day: “I sure saw Ozzy Osbourne,” Hood warbled, “with Randy Rhoads in ‘82 right before that plane crash.”\nWell, me too: On February 24, 1982, I caught Ozzy’s Diary of a Madman tour when it stopped in Lubbock, Texas. Ozzy wielded an oversized crucifix while doddering around a stage that had been tarted up to look like a medieval castle. Headbangers heaven.",
          "link": "https://defector.com/ill-never-stop-bragging-about-seeing-ozzy-on-the-most-metal-tour-of-all-time",
          "publishedOn": "2025-07-23T15:20:00.000Z",
          "wordCount": 8284,
          "title": "I’ll Never Stop Bragging About Seeing Ozzy On The Most Metal Tour Of All Time",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1413685812.jpg"
        },
        {
          "id": "https://defector.com/?p=196344",
          "author": "Patrick Redford",
          "description": "MONT VENTOUX, France — \"I had goosebumps in the moment, it was so incredible,\" Soudal-QuickStep team photographer Wout Beel said the morning of Stage 17. \"I am getting goosebumps again just talking about it, look!\" he said, showing me his arm. It's true, he was. One day earlier, one of his team's riders had won the stage—but not just any rider, and not just any stage. Finally, the French had gotten on the board.\nWith each dominant Tadej Pogacar win and each successive anonymous performances from the hometown teams, you could feel the anxiety building. Heading into a punishing third week of the Tour, a French rider had not won a stage at the 2025 Tour de France. Marc Madiot's considerable eyebrows scrunched together with extra verve, the man who dresses as a king in the fan zone looked slightly less vainglorious, and the French press seemed somehow even more dour with each passing day. The French have only failed to win a stage three times, and a fruitless Tour on the 40th anniversary of the last time a French rider won the yellow jersey would have prompted a fresh round of French hysterics. That gnawing anxiety is partially what made Julian Alaphilippe's premature celebration so painful, and partially what made Valentin Paret-Peintre's victory on Mont Ventoux one stage later so cathartic.",
          "link": "https://defector.com/france-finally-has-something-to-smile-about-at-the-tour",
          "publishedOn": "2025-07-23T14:35:54.000Z",
          "wordCount": 11037,
          "title": "France Finally Has Something To Smile About At The Tour",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/vpp-tdf.jpeg"
        },
        {
          "id": "https://defector.com/?p=196258",
          "author": "Maitreyi Anantharaman",
          "description": "What money are WNBA players owed? The league’s biggest names got people asking this question Saturday night, when they all wore “Pay Us What You Owe Us” warmup T-shirts before the All-Star Game in Indianapolis. Two days earlier, the players and the league met for their first in-person collective bargaining session, which players generally left feeling frustrated.\n“Based on their most recent proposal, we just aren’t able to get to a place where we’re actually even talking about the same thing,” Breanna Stewart said the day after the meeting. The stakes are big. The labor deal will govern what WNBA commissioner Cathy Engelbert called the league’s “hypergrowth,” a moment of huge new valuations, a $2.2 billion media rights deal set to kick in next year, and a round of expansion that will seriously change the league’s scope. Negotiations for the last CBA lasted into the winter, but the current agreement technically expires at the end of October. Ahead of a big free-agency period in February and the upcoming Toronto and Portland expansion drafts, there's some pressure to get this done before then.",
          "link": "https://defector.com/wnba-players-want-to-share-in-the-leagues-hypergrowth",
          "publishedOn": "2025-07-23T13:13:16.000Z",
          "wordCount": 9961,
          "title": "WNBA Players Want To Share In The League’s “Hypergrowth”",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2226068566.jpg"
        },
        {
          "id": "https://defector.com/?p=196357",
          "author": "Barry Petchesky",
          "description": "Imagine it is December 1970. \"I Think I Love You\" by the Partridge Family was just atop the charts. Billboard would soon name \"Bridge Over Troubled Water\" the most popular song of the year. If you listen to music, that's mostly what you are hearing: flowery pop or earnest folk. Then, you go to a show, and you see this: \n\nhttps://www.youtube.com/watch?v=K3b6SGoN6dA&ab_channel=BlackSabbath",
          "link": "https://defector.com/ozzy-osbourne-was-the-frontman-of-the-future",
          "publishedOn": "2025-07-22T20:03:11.000Z",
          "wordCount": 7652,
          "title": "Ozzy Osbourne Was The Frontman Of The Future",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-73989319.jpg"
        },
        {
          "id": "https://defector.com/?p=196313",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about cleaning up before dying, ketchup, being a new stepdaddy, and more.\nSorry for the abbreviated bag today, but Why Your Team Sucks has begun and I need to stay on point for it. But don’t worry, the bag will return to its normal length soon enough.",
          "link": "https://defector.com/fuck-the-ipad-ordering-kiosk",
          "publishedOn": "2025-07-22T19:04:21.000Z",
          "wordCount": 14972,
          "title": "Fuck The iPad Ordering Kiosk",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-454272690.jpg"
        },
        {
          "id": "https://defector.com/?p=196351",
          "author": "Emily Zhou",
          "description": "On autobiographies of trans female sexuality",
          "link": "https://defector.com/nerves-nerves-nerves",
          "publishedOn": "2025-07-22T18:32:11.000Z",
          "wordCount": 17926,
          "title": "Nerves, Nerves, Nerves",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/nervesnervesnerves1-e1753207235285.jpg"
        },
        {
          "id": "https://defector.com/?p=196319",
          "author": "Kathryn Xu",
          "description": "The advent of the ghost runner made it possible to score a run in baseball without ever getting on base: In extra innings now, a bunt and a sac fly will do the trick. To truncate years-old discourse, this is a clear affront to the principles of baseball. What the Philadelphia Phillies did to the Boston Red Sox in the bottom of the 10th inning of Monday night's game is more old-fashioned than that.\nIt has always been possible to score a run in baseball without ever hitting the ball into play, though it requires so many walks—or so many wild pitches—within an inning that its accomplishment could hardly be credited to the hitting team. To do it requires the full cooperation, intentional or not, of the opposing pitcher. It would be more accurate to place the bulk of the responsibility for what fans had to witness on Monday night not on the Phillies, who were attempting to commit one atrocity and instead committed another, or the ghost runner, though it lowered the difficulty by one walk, but on the Red Sox and relief pitcher Jordan Hicks.",
          "link": "https://defector.com/phillies-implement-forbidden-catchers-interference-strategem-to-walk-off-red-sox",
          "publishedOn": "2025-07-22T16:55:25.000Z",
          "wordCount": 7418,
          "title": "Phillies Implement Forbidden Catcher’s Interference Strategem To Walk Off Red Sox",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/edmundoSosaInterference.jpg"
        },
        {
          "id": "https://defector.com/?p=196303",
          "author": "Patrick Redford",
          "description": "VAISON-LA-ROMAINE, France — On the morning of Stage 15 of the Tour de France, I was strolling the paddock with a colleague when we happened upon the fan who'd had her cardboard signed turned into jersey fluff by Julian Alaphilippe on the top of the Tourmalet. Clara came from Barcelona to watch the Tour, cheer for her favorite rider, and cheekily propose holy matrimony to him via cardboard sign. \"I wanted him to read it quickly, because he is tired,\" she said. Did she think it would work? \"No, I don’t think so, but I have to try.\" Her first language is Spanish, she told me in English, and she wrote her sign in Dutch. Asked in French if she spoke Dutch, she said no, she had to work out the translation. \nAny given exchange at the Tour might involve this amount of translingualism. I have talked to Belgians in Spanish and Norwegians in English, and have tried and failed to talk to anyone in French, often resorting under duress to a dogmouthed combination of the three. Still, I have been surprised at how easy it's been to get around with only English and Spanish. The Tour itself is conducted in French and English, though obviously French takes precedence. Official communiques are issued first in French, race radio is mostly in French, and the English translations have a charming clunkiness.",
          "link": "https://defector.com/the-tour-de-france-is-for-the-polyglots-for-now",
          "publishedOn": "2025-07-22T16:02:13.000Z",
          "wordCount": 9470,
          "title": "The Tour de France Is For The Polyglots, For Now",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/tdf-crowd.jpeg"
        },
        {
          "id": "https://defector.com/?p=194229",
          "author": "Robert Rubsam",
          "description": "Craig Finn is the poet laureate of people who just can’t make it work. His songs are full of burnouts and failures, hard drinkers and rough sleepers, the lagging and the left behind. Their successes evaporate, and their mistakes linger. The narrator of “God in Chicago” has to move a baseball-sized package of heroin left behind by his dead friend Charlie. Every part of the deal—his unemployment, his busted car, the dealer who ruined his chance at college—reminds him of how poorly his life has gone. He makes the trip with Charlie’s sister, they sell the drugs, they get drunk and spend the night together. By the time they get home, she’s sobbing. There is no escape, no solution, no catharsis, and he knows it. “This isn’t the movies.”\nThis unsentimental compassion, with its humanistic care for those making wrong but necessary choices, is maybe my favorite thing about Finn’s music, but then there’s a lot to like. He’s been making music for more than 30 years with the bands Lifter Puller and the Hold Steady, and he’s been putting out a solo record every two or three years since 2012. Deploying a distinctly novelistic irony, he allows his listener to indulge alongside his characters, and then pulls back to survey the wreckage.",
          "link": "https://defector.com/craig-finn-can-write-a-great-song-but-can-he-write-a-good-short-story",
          "publishedOn": "2025-07-22T15:12:30.000Z",
          "wordCount": 10463,
          "title": "Craig Finn Can Write A Great Song, But Can He Write A Good Short Story?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1499095280.jpg"
        },
        {
          "id": "https://defector.com/?p=196233",
          "author": "Drew Magary",
          "description": "Some people are fans of the Tennessee Titans. But many, many more people are NOT fans of the Tennessee Titans. This 2025 Defector NFL team preview is for those in the latter group. Read all the previews so far here.\nYour team: The Tennessee Titans, who are currently attempting to prevent the Houston Texans from using Houston Oilers blue. Jesus Christ Titans, just go back to being the Oilers already. The Houston Oilers’ signature accomplishment, blowing a 35-3 lead in a playoff game, is still a better legacy than anything the “Titans” have “accomplished” in their quarter century-plus as an ongoing NFL concern. The only time the outside world pays attention to these slobs is when Tennessee wears Oilers throwbacks, and you know why? Because it helps them forget that the Titans exist. I’d rather wear a dead skin mask than a Titans jersey.",
          "link": "https://defector.com/why-your-team-sucks-2025-tennessee-titans",
          "publishedOn": "2025-07-22T13:01:49.000Z",
          "wordCount": 13395,
          "title": "Why Your Team Sucks 2025: Tennessee Titans",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2189046725.jpg"
        },
        {
          "id": "https://defector.com/?p=196281",
          "author": "Dave McKenna",
          "description": "Once upon a time, the world heavyweight champ was the most famous man on Earth. But other than hardcore fight fans, nobody can even pick Oleksandr Usyk out of a lineup. And he’s held the belt for nearly four years. But the spotlight could soon shine on the 38-year-old Ukrainian, who remained undefeated and retained his undisputed heavyweight title Saturday night in London with a beautifully brutal defeat of English challenger Daniel Dubois, \nUsyk to this point’s been seen as a fighter’s fighter, far more a technician than a bully. The boxing public prefers that artistry be left to little guys. Whoever wears the heavyweight belt has one job: to knock mofos out. Usyk moved from cruiserweight to heavyweight in 2019, and before this weekend had only knocked out one mofo since moving up. That came in August 2023 in Poland, when he stopped Dubois in a controversial bout tainted by a crucial referee’s decision in Usyk’s favor.",
          "link": "https://defector.com/heavyweight-champ-oleksander-usyk-finally-reveals-hes-a-bad-bad-man",
          "publishedOn": "2025-07-21T19:56:38.000Z",
          "wordCount": 9733,
          "title": "Heavyweight Champ Oleksandr Usyk Finally Reveals He’s A Bad, Bad Man",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2226041983.jpg"
        },
        {
          "id": "https://defector.com/?p=196275",
          "author": "Ray Ratto",
          "description": "For a moment, it almost looked like the current president of our kleptocracy was veering toward a good deed. Fortunately for every American who knows better than to ever get their hopes up regarding this kind of thing, he caught himself and swiftly tied that deed to something retrograde, smallminded, and cheap.\nFirst, Old Squatty said he would interject himself into the potential Washington area football stadium, and do so in a way that was unkind to the owners of the local football factory. As with everything else Trump does or says, it was inevitable that there would be a catch, or just an angle for graft. But in the broadest strokes, it could almost have passed for some fiscal responsibility from the least responsible rich guy of them all.",
          "link": "https://defector.com/donald-trump-is-trying-to-extort-the-washington-commanders-into-making-it-1989-again",
          "publishedOn": "2025-07-21T19:01:11.000Z",
          "wordCount": 10235,
          "title": "Donald Trump Is Trying To Extort The Washington Commanders Into Making It 1989 Again",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2225413799.jpg"
        },
        {
          "id": "https://defector.com/?p=196141",
          "author": "Patrick Redford",
          "description": "MONTPELLIER, France — Fifteen stages and two rest days into the Tour de France, the talk of the press room is not Tadej Pogacar rampaging towards his fourth yellow jersey, brave Kevin Vauquelin trying for an unlikely top-five finish, or Jonas Vingegaard's absurd time-trial helmet. The story that has everyone buzzing concerns events that happened 13 years ago. It is interesting in substance, though its form is the aspect that demands attention. What may seem at first blush like a straightforward story about someone breaking the rules in a different era of cycling is in fact a neat encapsulation of the fraught dynamics between power, media, and performance in cycling; the tension between cycling's dirty past and its supposedly clean present; and the necessity of squaring the two eras.\nThe story begins in Feb. 2019, when Austrian cross-country skier Johannes Dürr blew the whistle on a German physician named Mark Schmidt, accusing the latter of running a systematic blood doping ring. Schmidt had previously worked for the scandal-plagued Milram and Gerolsteiner cycling teams; in 2009 Austrian cyclist Bernard Kohl had accused him of running doping practices for those teams, though he didn't face any consequences until the Dürr revelations. The investigation came to be known as Operation Aderlass, German for \"bloodletting.\"",
          "link": "https://defector.com/an-anatomy-of-the-doping-story-that-has-the-tour-de-france-press-room-buzzing",
          "publishedOn": "2025-07-21T16:58:19.000Z",
          "wordCount": 13097,
          "title": "An Anatomy Of The Doping Story That Has The Tour de France Press Room Buzzing",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/tdfcars.jpeg"
        },
        {
          "id": "https://defector.com/?p=193799",
          "author": "Richard Staff",
          "description": "After Marcus Walden was called up by the Toronto Blue Jays in early 2014, nearly seven years after being drafted by the club, everything went more or less as you might expect for a big league promotion. For Father’s Day, Walden gifted his dad the first jersey he ever wore on a big league field; in his hometown of Fresno, Ca. his spot in history was solidified. “After 2014, when I came home, they put up a sign at my high school, number 67,” Walden told Defector. “And at my college they have a wall with every guy who made it to the big leagues out of Fresno [City College] and I was put up there.” This is how it is supposed to go, and the congratulations and honors that are supposed to be bestowed on a player whose dream is coming true. “It was great,” Walden said, “except the issue was I never played.”\nIn the history recognized by Major League Baseball through to the moment this story is published, 23,522 players have been called up to the highest level of play and participated in at least one game for their team. A little bit deeper in the annals of baseball history, unrecognized by Baseball-Reference, FanGraphs, or Major League Baseball itself are the hundreds of players who were called up to the majors, wore their team’s uniform, had their names written on the lineup card, brought their families to the stadium, and spent at least one full game as an active player on the roster. The one catch, in this case, is that these players were never put into a game before being sent back down to the minors. Because of this, their status as a major leaguer exists in an odd in-between, a limbo of conflicting emotions and almosts. These phantom ballplayers made it to the pinnacle of the sport, but not quite across the threshold.",
          "link": "https://defector.com/the-secret-brotherhood-of-the-phantom-ballplayers",
          "publishedOn": "2025-07-21T16:34:26.000Z",
          "wordCount": 14285,
          "title": "The Secret Brotherhood Of The Phantom Ballplayers",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-1227254725.jpg"
        },
        {
          "id": "https://defector.com/?p=196238",
          "author": "Chris Thompson",
          "description": "The thing that the New York Yankees are doing is not sign-stealing. For one thing, it is entirely independent of the communications of their opponents, which raises it entirely above the board, according to both the rules and the traditions of baseball. For another, professional baseball no longer has signs for the swiping. A team could theoretically hack the PitchCom—the Houston Astros probably have a whole secured campus of evil nerds working on this opportunity—but until someone finally figures out how to bug one of those little suckers it will remain impossible to intercept and decode the signals between a catcher and a pitcher. \nSign-stealing, among fans, was always considered a touchy, somewhat gray area of gamesmanship. Still, what the Yankees are doing would be considered at the honorable end of things even if it did involve decoding signals. They aren't being subtle about it at all: The guy on second base communicating the pitch selection to his teammate in the batter's box is doing everything short of holding up a gigantic poster. Against the Seattle Mariners, back on July 10, Trent Grisham and Cody Bellinger were gesturing so blatantly during New York's late comeback that a baseball non-knower might reasonably have deduced that they were doing aerobics out there. It was a delightfully elaborate system: First the runner on first base had to peek into the glove of Mariners reliever Andrés Muñoz and spot his grip, in the seconds before the pitch was thrown. They were on the lookout for sliders; when Muñoz's slider grip was identified, the runner on first had to then give a clear hand signal to the runner on second base, whose job was to relay this signal to the batter, in many cases as Muñoz was delivering the pitch. In order to pull it off, Grisham and then Bellinger resorted to what I think we can describe as an \"inflated tube man\" gesture, designed to be unmistakable for a batter whose attention is directed elsewhere.",
          "link": "https://defector.com/braves-coach-in-hot-water-over-battle-of-gestures",
          "publishedOn": "2025-07-21T15:49:54.000Z",
          "wordCount": 9454,
          "title": "Braves Coach In Hot Water Over Battle Of Gestures",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2152314818.jpg"
        },
        {
          "id": "https://defector.com/?p=196252",
          "author": "Tom Scocca",
          "description": "Donald Trump was good friends with the notorious sex trafficker Jeffrey Epstein for many years, the New York Times reported over the weekend, a friendship that included Trump hosting Epstein at \"raucous parties with cheerleaders and models.\" The Times wrote that one \"woman has said that Mr. Trump groped her when Mr. Epstein brought her to Trump Tower in Manhattan to meet him.\" Also: \"Another accuser recalled being eyed by Mr. Trump during a brief encounter in Mr. Epstein’s office, and claimed that Mr. Epstein had told Mr. Trump at the time that 'she’s not for you.'\"\nFurthermore, the Times wrote:",
          "link": "https://defector.com/collective-amnesia",
          "publishedOn": "2025-07-21T15:26:05.000Z",
          "wordCount": 12525,
          "title": "Collective Amnesia",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1192977807_6dea5b.jpg"
        },
        {
          "id": "https://defector.com/?p=196225",
          "author": "Maitreyi Anantharaman",
          "description": "Have you been counting down the days until our Monday crossword? This week’s puzzle was constructed by Daniel Hrynick and edited by Hoang-Kim Vu. Dan lives in Winnipeg, where he works as a laborer for Public Works. A commenter on his previous puzzle mentioned that they were disappointed that the clue for MOOG referenced the synthesizers and not Andy Moog. That comment was on his mind when he clued 1-Across in this puzzle.\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE. Note that our submissions are closed through July 31.",
          "link": "https://defector.com/the-crossword-july-21-one-by-one",
          "publishedOn": "2025-07-21T15:05:56.000Z",
          "wordCount": 5941,
          "title": "The Crossword, July 21: One By One",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2191687338.jpg"
        },
        {
          "id": "https://defector.com/?p=196200",
          "author": "Patrick Redford",
          "description": "CARCASSONNE, France — It is hard to know what is going on in the Tour de France, even if your job is to work on the Tour de France. The end of every stage includes a familiar ritual, with team employees and journalists gathering around phones and tablets, squinting into the harsh sunlight to try and figure out what the hell is happening. The team cars on the road are listening to race radio—which, as I learned yesterday, can be imprecise—or watching the race on their phones in the car; I have heard anecdotes about team car drivers getting info relayed to them by colleagues watching the broadcast from home. That information desert enfolds for the riders, too. This truth was most harshly embodied by former French darling Julian Alaphilippe on Stage 15 of the Tour de France.\nThe Tour de France's 15th stage was unremarkable. Everyone was tired from three big days in the Pyrenees, and with a rest day approaching before a Mont Ventoux summit finish, the stage was the most obvious breakaway day in the roadbook. Both Visma and UAE even had riders in the day's big break, as nobody had the energy to spend on chasing them through a hot day in Occitanie. UAE breakaway specialist Tim Wellens, free from a day of Tadej Pogacar duty, slipped away from a small group on a long stretch of rolling road 44 kilometers from the finish and soloed his way in to complete his trilogy of Grand Tour stage wins. Ninety seconds later, Victor Campenaerts crossed the line for second, and he was followed eight seconds later by a large group of breakaway survivors. Watching at the Intermarché bus, we joked about Astana doing a full lead-out to secure maximum UCI points for third, because while it's a result worth sprinting for, it's not one anyone will remember.",
          "link": "https://defector.com/julian-alaphilippe-loses-celebrates-and-learns-to-smile-about-it",
          "publishedOn": "2025-07-21T14:41:38.000Z",
          "wordCount": 9526,
          "title": "Julian Alaphilippe Loses, Celebrates, And Learns To Smile About It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2226148360.jpg"
        },
        {
          "id": "https://defector.com/?p=196218",
          "author": "Ray Ratto",
          "description": "Everything about the NFL Players Association sludgeslide seems so predestined and unavoidable. The usual predicament has been made worse by disgraced former union chief Lloyd Howell getting confused about what side he works for and former president J.C. Tretter misunderstanding how work stoppages are supposed to happen, but for as lurid and goofy as the details have been, and with all due respect to the innovation of holding four-figure team-building exercises at a strip club, none of it quite qualifies as surprising. In the broadest sense, this is just the sort of thing that conflicted and ineffective unions do.\nIf only life in the labor trenches was as easy as the WNBPA makes it seem. They figure out what they want in a negotiation, slap it on a T-shirt, and have every member wear one; at WNBA All-Star Weekend, that message read \"Pay Us What You Owe Us.\" The T-shirt is not the important part, though. The key here is the phrase \"every member.\"",
          "link": "https://defector.com/the-nfl-players-association-is-falling-apart-when-it-needs-solidarity-the-most",
          "publishedOn": "2025-07-21T13:11:47.000Z",
          "wordCount": 8639,
          "title": "The NFL Players Association Is Falling Apart When It Needs Solidarity The Most",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1409717996.jpg"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=861426",
          "author": "Darragh McDonald",
          "description": "The latest episode of the MLB Trade Rumors Podcast is now live on Spotify, Apple Podcasts, and wherever you get your podcasts! Make sure you subscribe as well! You can also use the player at this link to listen, if you don’t use Spotify or Apple for podcasts. This week, host Darragh McDonald is joined by Steve Adams and…",
          "link": "https://www.mlbtraderumors.com/2025/07/mlbtr-podcast-megapod-trade-deadline-preview.html",
          "publishedOn": "2025-07-30T16:08:04.000Z",
          "wordCount": 2439,
          "title": "MLBTR Podcast: Megapod Trade Deadline Preview",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/dylan-cease-padres-san-diego-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=861296",
          "author": "Mark Polishuk",
          "description": "The Royals announced that veteran southpaw Rich Hill has been designated for assignment.  The move opens up roster space for right-hander Thomas Hatch, whose contract has been selected from Triple-A Omaha. More to come…",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-designate-rich-hill-for-assignment.html",
          "publishedOn": "2025-07-29T20:07:28.000Z",
          "wordCount": 2523,
          "title": "Royals Designate Rich Hill For Assignment",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/RichHill-2025Royals-1024x671.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=861224",
          "author": "Mark Polishuk",
          "description": "Here’s the latest on some players who were recently designated for assignment and cleared waivers, with all info coming from each respective player’s MLB.com profile page… Reliever Chris Devenski elected free agency rather than accept an outright assignment to the Mets’ Triple-A team.  New York designated Devenski for assignment last week, and since he has…",
          "link": "https://www.mlbtraderumors.com/2025/07/minor-mlb-transactions-7-29-25.html",
          "publishedOn": "2025-07-29T15:29:27.000Z",
          "wordCount": 2383,
          "title": "Minor MLB Transactions: 7/29/25",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/Chris_Devenski_Mets-copy-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=861048",
          "author": "Leo Morgenstern",
          "description": "Royals left-hander Kris Bubic will be out for the remainder of the 2025 season after suffering a rotator cuff strain in his most recent outing, reports Anne Rogers of MLB.com. The 27-year-old exited his start on Saturday in the third inning, later telling Rogers that “something’s not right.” He noted that he had been pitching…",
          "link": "https://www.mlbtraderumors.com/2025/07/kris-bubic-to-miss-remainder-of-2025-season-with-rotator-cuff-strain.html",
          "publishedOn": "2025-07-28T21:39:50.000Z",
          "wordCount": 2641,
          "title": "Kris Bubic To Miss Remainder Of 2025 Season With Rotator Cuff Strain",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/USATSI_26674706-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=860909",
          "author": "Mark Polishuk",
          "description": "The Royals and Seth Lugo are in the final stages of negotiating a multi-year contract extension, ESPN’s Jeff Passan reports.  Lugo had the ability to opt out of the final season of his previous three-year, $45MM contract, but instead of facing an opt-out decision this winter, the right-hander will be staying put in Kansas City. …",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-finalizing-extension-with-seth-lugo.html",
          "publishedOn": "2025-07-28T01:29:24.000Z",
          "wordCount": 2879,
          "title": "Royals Finalizing Extension With Seth Lugo",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/SethLugo-2025Royals-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=860791",
          "author": "Nick Deeds",
          "description": "The Royals announced this morning that they’ve placed outfielder Jac Caglianone on the 10-day injured list due to a left hamstring strain. His active roster spot will go to outfielder Randal Grichuk, who the club acquired from the Diamondbacks last night. Caglianone, 22, was the sixth overall selection in last year’s draft and entered the…",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-place-jac-caglianone-on-10-day-injured-list.html",
          "publishedOn": "2025-07-27T15:42:35.000Z",
          "wordCount": 2595,
          "title": "Royals Place Jac Caglianone On 10-Day Injured List",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/USATSI_26680654-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=860831",
          "author": "Nick Deeds",
          "description": "The Royals appear to be inching more closely to buying than selling given their recent acquisition of Diamondbacks outfielder Randal Grichuk, but talented southpaw Kris Bubic has been a much speculated-upon trade candidate this summer nonetheless. Recent indications have been that the Royals aren’t inclined to part ways with the lefty, and that may be…",
          "link": "https://www.mlbtraderumors.com/2025/07/kris-bubic-battling-shoulder-stiffness.html",
          "publishedOn": "2025-07-27T15:12:27.000Z",
          "wordCount": 2701,
          "title": "Kris Bubic Battling Shoulder Stiffness",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/USATSI_26087608-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=860783",
          "author": "Nick Deeds",
          "description": "The Diamondbacks’ sell-off continues this evening as they’re trading outfielder Randal Grichuk to the Royals, according to a report from Steve Gilbert of MLB.com. Jon Heyman of the New York Post reports that right-hander Andrew Hoffmann is headed to Arizona in exchange for Grichuk’s services. John Gambadoro of 98.7 FM Phoenix reports that Hoffmann, who…",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-to-acquire-randal-grichuk.html",
          "publishedOn": "2025-07-27T00:31:23.000Z",
          "wordCount": 3989,
          "title": "Royals Acquire Randal Grichuk",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/10/USATSI_24265670-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=860570",
          "author": "Steve Adams",
          "description": "The Royals announced Friday that infielder/outfielder Cavan Biggio has been designated for assignment. His spot on the 40-man roster will go to reliever Hunter Harvey, who has been reinstated from the 60-day injured list. Righty Jonathan Bowlan has been optioned to Triple-A. Biggio, 30, signed a minor league deal with the Royals in the offseason.…",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-dfa-cavan-biggio.html",
          "publishedOn": "2025-07-25T19:45:43.000Z",
          "wordCount": 2562,
          "title": "Royals Designate Cavan Biggio For Assignment",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/cavan-biggio-royals-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=860364",
          "author": "Darragh McDonald",
          "description": "Right-hander Jesse Chavez announced his retirement on Foul Territory today. He was on the Braves’ roster until recently but was designated for assignment a week ago when that club acquired Dane Dunning. Chavez elected free agency after clearing waivers and has apparently decided to hang up his spikes in recent days. “I don’t think we’re…",
          "link": "https://www.mlbtraderumors.com/2025/07/jesse-chavez-announces-retirement.html",
          "publishedOn": "2025-07-24T18:14:39.000Z",
          "wordCount": 2246,
          "title": "Jesse Chavez Announces Retirement",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/02/JesseChavez-2023Braves-1024x732.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=860257",
          "author": "Anthony Franco",
          "description": "Seth Lugo reeled off another productive start this afternoon, tossing six innings of two-run ball to earn the win at Wrigley Field. The veteran right-hander now carries a 2.95 earned run average with a 22% strikeout rate. This was his 11th quality start in 19 appearances. Kansas City took two out of three from the…",
          "link": "https://www.mlbtraderumors.com/2025/07/latest-on-seth-lugos-trade-candidacy.html",
          "publishedOn": "2025-07-24T00:43:11.000Z",
          "wordCount": 3019,
          "title": "Latest On Seth Lugo’s Trade Candidacy",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/USATSI_26692813-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=860169",
          "author": "Steve Adams",
          "description": "10:26am: The Royals are sending cash to the Rays, reports Ken Rosenthal of The Athletic. 10:16am: The Royals are acquiring right-handed reliever Joey Krehbiel from the Rays, reports Marc Topkin of the Tampa Bay Times. The 32-year-old Krehbiel is not on Tampa Bay’s 40-man roster. He’s been pitching with their Triple-A affiliate in Durham after…",
          "link": "https://www.mlbtraderumors.com/2025/07/rays-trade-reliever-joey-krehbiel-royals.html",
          "publishedOn": "2025-07-23T15:26:56.000Z",
          "wordCount": 2579,
          "title": "Royals To Acquire Joey Krehbiel",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/joey-krehbiel-rays-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=860095",
          "author": "Steve Adams",
          "description": "The Royals announced Tuesday that they’ve designated outfielder Tyler Gentry for assignment. His spot on the 40-man roster goes to left-hander Rich Hill, whose previously reported promotion from Triple-A Omaha is now official. Righty Andrew Hoffmann was optioned to Omaha to open an active roster spot for the 45-year-old Hill. Gentry, 26, made his big…",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-designate-tyler-gentry-for-assignment.html",
          "publishedOn": "2025-07-22T20:06:54.000Z",
          "wordCount": 2296,
          "title": "Royals Designate Tyler Gentry For Assignment",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/tyler-gentry-royals-1024x725.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=860017",
          "author": "Anthony Franco",
          "description": "The Royals agreed to deals with first-round selections Sean Gamble and Josh Hammond, reports Jim Callis of MLB Pipeline. Kansas City also has deals with second-rounders Michael Lombardi and Justin Lamkin, Callis adds. Gamble was selected with the 23rd overall pick, K.C.’s standard first-round selection. Hammond went 28th with a supplemental selection that the Royals received under the Prospect…",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-agree-to-deals-with-first-round-picks-sean-gamble-josh-hammond.html",
          "publishedOn": "2025-07-22T04:29:13.000Z",
          "wordCount": 2308,
          "title": "Royals Agree To Deals With First-Round Picks Sean Gamble, Josh Hammond",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/USATSI_26462964-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=859943",
          "author": "Steve Adams",
          "description": "Rich Hill is headed back to the majors for a 21st season. The Royals plan to select Hill’s contract from Triple-A Omaha, Robert Murray of FanSided reports, and he could pitch for them as soon as tomorrow. Hill signed a minor league contract with Kansas City back in May, and he’s been pitching with their…",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-to-select-rich-hill.html",
          "publishedOn": "2025-07-21T18:23:43.000Z",
          "wordCount": 2264,
          "title": "Royals To Select Rich Hill",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/01/rich-hill-pitching-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=859389",
          "author": "Mark Polishuk",
          "description": "The Royals are running out of time.  After starting the second half by losing two of three games to the Marlins, Kansas City is now 48-52, and 5.5 games back of the final AL wild card position.  While the club's recent transactions indicate that they're not ready to wave the white flag just yet, it…",
          "link": "https://www.mlbtraderumors.com/2025/07/trade-deadline-outlook-kansas-city-royals.html",
          "publishedOn": "2025-07-21T15:31:11.000Z",
          "wordCount": 2783,
          "title": "Trade Deadline Outlook: Kansas City Royals",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2021/09/USATSI_16519653-1024x677.jpg"
        }
      ]
    },
    {
      "title": "Flaming Hydra",
      "feedUrl": "https://flaminghydra.com/rss/",
      "siteUrl": "https://flaminghydra.com/",
      "articles": [
        {
          "id": "68892e80be970d000116c56b",
          "author": "The Editors",
          "description": "A city bird reconsidered by Ben Ehrenreich; the Hydra invites readers to choose some fun movies",
          "link": "https://flaminghydra.com/issue-370/",
          "publishedOn": "2025-07-29T22:04:22.000Z",
          "wordCount": 807,
          "title": "Feathered friends / Film fans",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/pigeon_caught_the_seed-1.jpg"
        },
        {
          "id": "6887b93619c0620001dfb253",
          "author": "Ben Ehrenreich",
          "description": "In the second half of the second year of Israel’s genocide in Gaza, as my own country performs an astonishing act of auto-evisceration, midway through the next hottest summer since last year’s hottest summer ever, I would like to talk to you about pigeons. The birds,",
          "link": "https://flaminghydra.com/in-praise-of-pigeons/",
          "publishedOn": "2025-07-29T22:03:01.000Z",
          "wordCount": 838,
          "title": "In Praise of Pigeons",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/pigeon_caught_the_seed.jpg"
        },
        {
          "id": "68893452be970d000116c5e9",
          "author": "The Editors",
          "description": "by The Editors\n\nSubscribe to Flaming Hydra to play HYDRANYM! And tell your friends who love WORD GAMES because this one is fun.\n\n\n[countdown to 2025-07-31 12:00am PDT]\nLet's ride.\nCOME BACK THURSDAY, JULY 31\nTO CHOOSE THE WINNER!!! \n\nTHE RULES\nCreate an ENTERTAINING and APT acronym",
          "link": "https://flaminghydra.com/hydranym-no-10/",
          "publishedOn": "2025-07-29T22:02:18.000Z",
          "wordCount": 542,
          "title": "HYDRANYM No. 10",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/HYDRANYM-5.jpg"
        },
        {
          "id": "68893452be970d000116c5e9",
          "author": "The Editors",
          "description": "by The Editors\n\nSubscribe to Flaming Hydra to play HYDRANYM! And tell your friends who love WORD GAMES because this one is fun.\n\n[countdown to 2025-07-31 12:00am PDT]\nLet's ride.\nCOME BACK THURSDAY, JULY 31\nTO CHOOSE THE WINNER!!! \n\nTHE RULES\nCreate an ENTERTAINING and APT acronym",
          "link": "https://flaminghydra.com/hydranym-no-9-2/",
          "publishedOn": "2025-07-29T22:02:18.000Z",
          "wordCount": 545,
          "title": "HYDRANYM No. 10",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/HYDRANYM-5.jpg"
        },
        {
          "id": "68817aba19c0620001df671e",
          "author": "The Editors",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/the-reader-poll-of-fun-movies/",
          "publishedOn": "2025-07-29T19:53:30.000Z",
          "wordCount": 339,
          "title": "The READER POLL! of Fun Movies",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/popcorn-010625_0819_0209_l__p.hic.png"
        },
        {
          "id": "6887743819c0620001dfb195",
          "author": "The Editors",
          "description": "Sam Thielman on the world changed by Gaza; new poems by Kọ́lá Túbọ̀sún",
          "link": "https://flaminghydra.com/issue-369/",
          "publishedOn": "2025-07-29T00:33:50.000Z",
          "wordCount": 668,
          "title": "Slow burn / Long drive",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/eastward-2.jpg"
        },
        {
          "id": "6887d60919c0620001dfb293",
          "author": "Sam Thielman",
          "description": "The Israeli government treated the attacks on kibbutzim close to the Gaza border on October 7, 2023, like a starter pistol. The fantasy of extermination, it soon became clear, had an unshakable hold on the imaginations that commanded the IDF, and within days, Netanyahu’s cabinet was talking about",
          "link": "https://flaminghydra.com/aversion-therapy/",
          "publishedOn": "2025-07-29T00:33:28.000Z",
          "wordCount": 668,
          "title": "Aversion Therapy",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/eastward-3.jpg"
        },
        {
          "id": "6887cb0619c0620001dfb277",
          "author": "Kọ́lá Túbọ̀sún",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/three-summer-poems/",
          "publishedOn": "2025-07-29T00:32:58.000Z",
          "wordCount": 326,
          "title": "Three Summer Poems",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/PXL_20250709_193713260.jpg"
        },
        {
          "id": "6883cecc19c0620001df97c9",
          "author": "The Editors",
          "description": "by The Editors\n\nIt is your solemn duty to select the victor of Hydranym No. 9, from among the 21 best entries received this week on the theme of\nMEETING\nHYDRANYM is the Creative Writing word game especially for Flaming Hydra subscribers (RULES appear below). Join in by subscribing! It&",
          "link": "https://flaminghydra.com/hydranym-no-9-vote/",
          "publishedOn": "2025-07-26T00:15:24.000Z",
          "wordCount": 517,
          "title": "HYDRANYM No. 9: Vote!",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/HYDRANYM-6.jpg"
        },
        {
          "id": "6883cf6419c0620001df9806",
          "author": "The Editors",
          "description": "George Orwell’s days scrambling for tips, by Diana Moskovitz",
          "link": "https://flaminghydra.com/issue-368/",
          "publishedOn": "2025-07-26T00:10:35.000Z",
          "wordCount": 571,
          "title": "Gratuitous gratuities",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/dishwasher-16w-1.png"
        },
        {
          "id": "68827f4e19c0620001df7c81",
          "author": "Diana Moskovitz",
          "description": "George Orwell was just 26 in 1929, when, the story goes, he had nearly all his money stolen from his digs in Paris. He was a middle-class, well-educated young man who could almost certainly have gotten help from his aunt Nellie, who lived in the French capital. But instead he",
          "link": "https://flaminghydra.com/tipping-george-orwell/",
          "publishedOn": "2025-07-26T00:07:40.000Z",
          "wordCount": 712,
          "title": "Tipping George Orwell",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/dishwasher-16w.png"
        },
        {
          "id": "6882cd8d19c0620001df7df9",
          "author": "The Editors",
          "description": "Ian Williams, Tom Scocca, Josephine Riesman, and Maria Bustillos on the passing of Hulk Hogan",
          "link": "https://flaminghydra.com/issue-367/",
          "publishedOn": "2025-07-25T02:42:44.000Z",
          "wordCount": 625,
          "title": "Heel, down",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/hulks-sat-1-sick-1.jpg"
        },
        {
          "id": "6882c3b419c0620001df7dba",
          "author": "Tom Scocca",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/hulk-hogan-1953-2025/",
          "publishedOn": "2025-07-25T02:39:14.000Z",
          "wordCount": 323,
          "title": "Hulk Hogan, 1953–2025",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/hulk-trump-speech.jpg"
        },
        {
          "id": "6882bd9219c0620001df7d86",
          "author": "Ian Williams",
          "description": "Pro wrestling is, in its structure, in its nature, a haven for thieves, rapists, murderers, con men, and perverts. Kayfabe—the great language and logic of pro wrestling—is, deep in its bones, based on ripping people off and making them like it. \nIn related news, Hulk",
          "link": "https://flaminghydra.com/let-me-tell-you-something-brother/",
          "publishedOn": "2025-07-25T02:23:12.000Z",
          "wordCount": 646,
          "title": "Let me tell you something, brother",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/hulks-sat-1-sick-flop.jpg"
        },
        {
          "id": "6881422919c0620001df650e",
          "author": "The Editors",
          "description": "Philip Bump in conversation with Maria Bustillos, and an announcement from Luke O’Neil",
          "link": "https://flaminghydra.com/issue-366/",
          "publishedOn": "2025-07-24T02:13:01.000Z",
          "wordCount": 358,
          "title": "Get the quote / Read the book",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/pbump-2.jpg"
        },
        {
          "id": "6881680b19c0620001df6642",
          "author": "Maria Bustillos",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/taking-the-measure-of-philip-bump/",
          "publishedOn": "2025-07-24T02:09:41.000Z",
          "wordCount": 343,
          "title": "Taking the Measure of Philip Bump",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/pbump-1.jpg"
        },
        {
          "id": "688160a219c0620001df65fd",
          "author": "Luke O'Neil",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/its-also-quite-funny-to-be-clear/",
          "publishedOn": "2025-07-24T02:04:39.000Z",
          "wordCount": 335,
          "title": "It’s also quite funny to be clear",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/top-16x9-HellWW2-02--2-.png"
        },
        {
          "id": "6880128b19c0620001df4d55",
          "author": "The Editors",
          "description": "Myriam Gurba in conversation with Lindsey Boylan; a new home for S.I. Rosenbaum",
          "link": "https://flaminghydra.com/issue-365/",
          "publishedOn": "2025-07-23T00:54:06.000Z",
          "wordCount": 638,
          "title": "Leave abuse / Take love",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/BOYLAN-ABUSER-16x9-1.png"
        },
        {
          "id": "687fde3c19c0620001df4cbc",
          "author": "Myriam Gurba",
          "description": "An Interview with Lindsey Boylan",
          "link": "https://flaminghydra.com/scaring-all-the-right-people/",
          "publishedOn": "2025-07-23T00:53:11.000Z",
          "wordCount": 583,
          "title": "Scaring All the Right People",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/BOYLAN-ABUSER-16x9.png"
        },
        {
          "id": "6880161619c0620001df4d82",
          "author": "S.I. Rosenbaum",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/transmigrations/",
          "publishedOn": "2025-07-23T00:52:45.000Z",
          "wordCount": 313,
          "title": "TRANSMIGRATIONS",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/01-TOP-16x9.png"
        },
        {
          "id": "6880217119c0620001df4e2b",
          "author": "The Editors",
          "description": "by The Editors\n\nSubscribe to Flaming Hydra to play HYDRANYM! And tell your friends who love WORD GAMES who might, for any number of reasons, be looking out for a new word game to play online. \n\n[countdown to 2025-07-24 12:00am PDT]\nExcelsior!\nCOME BACK THURSDAY, JULY 24\nTO CHOOSE",
          "link": "https://flaminghydra.com/hydranym-no-9/",
          "publishedOn": "2025-07-23T00:50:59.000Z",
          "wordCount": 555,
          "title": "HYDRANYM No. 9",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/HYDRANYM-5.jpg"
        },
        {
          "id": "687ed09f19c0620001df3a60",
          "author": "The Editors",
          "description": "Jídé Salawu investigates a faux-Nigerian literary hoax, and Anna Merlan takes in an art exhibit",
          "link": "https://flaminghydra.com/issue-364/",
          "publishedOn": "2025-07-22T01:33:12.000Z",
          "wordCount": 656,
          "title": "Perverse verse / Creative instinct",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/DO-NOT-LORES-16x9-1.jpg"
        },
        {
          "id": "687eb6ab19c0620001df39aa",
          "author": "Jídé Salawu",
          "description": "On Thursday, July 17, 2025, my friend Hussain Ahmed sent me a Daily Mail article written by Sonya Gugliara headlined, “Straight white author’s career finally takes off after he tells woke publishers he’s gender queer Nigerian.” The piece describes the exploits of literary hoaxer",
          "link": "https://flaminghydra.com/the-poetry-swindler/",
          "publishedOn": "2025-07-22T01:32:34.000Z",
          "wordCount": 667,
          "title": "The Poetry Swindler",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/DO-NOT-LORES-16x9.jpg"
        },
        {
          "id": "687e9d1f19c0620001df392a",
          "author": "Anna Merlan",
          "description": "The artist has embarked on a dazzling constellation of experimental works that stretches the boundaries of genre, performance, and commentary. \n\nPrey \nThe artist endlessly chases a cloth-covered beast through a domestic tableau vivant in a manifestation of the predatory nature of the art world. The quarry is permeated",
          "link": "https://flaminghydra.com/the-artist-is-present/",
          "publishedOn": "2025-07-22T01:32:12.000Z",
          "wordCount": 647,
          "title": "The Artist Is Present",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/IMG_8682-16x9-72.jpg"
        }
      ]
    },
    {
      "title": "Today in Tabs",
      "feedUrl": "https://rss.beehiiv.com/feeds/ZRiesnGI0u.xml",
      "siteUrl": "https://www.todayintabs.com/",
      "articles": [
        {
          "id": "https://www.todayintabs.com/p/my-body-is-a-machine-that-turns-money-into-posts-ca33",
          "author": "Rusty Foster",
          "description": "Zaslav floats on.",
          "link": "https://www.todayintabs.com/p/my-body-is-a-machine-that-turns-money-into-posts-ca33",
          "publishedOn": "2025-07-29T21:21:44.000Z",
          "wordCount": 10284,
          "title": "My Body Is A Machine That Turns Money Into Posts",
          "enclosure": {
            "url": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/a060067b-c74f-495b-8add-87e31636cdd8/Screenshot_2025-07-29_at_4.58.21_PM.png",
            "length": "804704",
            "type": "image/png"
          },
          "imageUrl": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/a060067b-c74f-495b-8add-87e31636cdd8/Screenshot_2025-07-29_at_4.58.21_PM.png"
        },
        {
          "id": "https://www.todayintabs.com/p/we-need-to-talk-about-sloppers-b732",
          "author": "Rusty Foster",
          "description": "The best ever death metal bot out of Denton",
          "link": "https://www.todayintabs.com/p/we-need-to-talk-about-sloppers-b732",
          "publishedOn": "2025-07-25T20:31:09.000Z",
          "wordCount": 13543,
          "title": "We Need To Talk About Sloppers",
          "enclosure": {
            "url": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/b2a2e17e-d2cc-494d-adfd-7bb1bbce8927/image.png",
            "length": "2212130",
            "type": "image/png"
          },
          "imageUrl": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/b2a2e17e-d2cc-494d-adfd-7bb1bbce8927/image.png"
        },
        {
          "id": "https://www.todayintabs.com/p/the-news-305f",
          "author": "Rusty Foster",
          "description": "Mysterious ‘ship goo’ creates everyday painkiller in your sinuses—from yogurt.",
          "link": "https://www.todayintabs.com/p/the-news-305f",
          "publishedOn": "2025-07-22T19:43:06.000Z",
          "wordCount": 10475,
          "title": "The News",
          "enclosure": {
            "url": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/df9f7054-ae4f-41d6-af0c-bf5a8cbd145d/Screenshot_2025-07-22_at_2.29.48_PM.png",
            "length": "98649",
            "type": "image/png"
          },
          "imageUrl": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/df9f7054-ae4f-41d6-af0c-bf5a8cbd145d/Screenshot_2025-07-22_at_2.29.48_PM.png"
        }
      ]
    },
    {
      "title": "Bad Faith Times",
      "feedUrl": "https://bad-faith-times.ghost.io/rss/",
      "siteUrl": "https://badfaithtimes.com/",
      "articles": [
        {
          "id": "688a642ef05bc90001adadc6",
          "author": "Denny Carter",
          "description": "These people do not mean what they say.",
          "link": "https://badfaithtimes.com/when-bad-faith-unreality-crashes-into-reality/",
          "publishedOn": "2025-07-30T19:01:42.000Z",
          "wordCount": 1152,
          "title": "When Bad-Faith Unreality Crashes Into Reality",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/07/Screenshot-2025-07-30-at-2.56.31---PM.png"
        },
        {
          "id": "6883892319f1d000010a3432",
          "author": "Denny Carter",
          "description": "Every facet of American life is being taken over by people who recognize no limits on their power or reach",
          "link": "https://badfaithtimes.com/it-feels-like-an-occupation/",
          "publishedOn": "2025-07-25T14:55:04.000Z",
          "wordCount": 2008,
          "title": "It Feels Like An Occupation",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/07/28263483774_bd8036297e_z-1.jpg"
        },
        {
          "id": "687e942619f1d000010a2c2b",
          "author": "Denny Carter",
          "description": "\"[Fascists] are amusing themselves, for it is their adversary who is obliged to use words responsibly, since he believes in words.\"",
          "link": "https://badfaithtimes.com/its-one-long-joke/",
          "publishedOn": "2025-07-22T11:30:55.000Z",
          "wordCount": 2644,
          "title": "It's One Long Joke",
          "imageUrl": "https://badfaithtimes.com/content/images/size/w1200/2025/07/Screenshot-2025-07-21-at-5.11.03---PM-1.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}