{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": []
    },
    {
      "title": "The Pitch",
      "feedUrl": "https://www.thepitchkc.com/feed/",
      "siteUrl": "https://www.thepitchkc.com/",
      "articles": [
        {
          "id": "https://www.thepitchkc.com/?p=863775",
          "author": "Abby Olcese",
          "description": "Courtesy Hallmark It’s finally here! Holiday Touchdown: A Chiefs Love Story, the long-awaited Chiefs-centric, regionally-shot Hallmark Christmas movie, premiered November 30. In the interest of letting you all draw your own conclusions about this deeply silly bit of holiday entertainment, we decided to wait until after it aired to run our thoughts. So, now that we’ve seen it, what do...",
          "link": "https://www.thepitchkc.com/hallmarks-holiday-touchdown-a-chiefs-love-story-is-less-rom-com-than-literal-love-for-football-merch/",
          "publishedOn": "2024-12-02T22:35:12.000Z",
          "wordCount": 2359,
          "title": "Hallmark’s Holiday Touchdown: A Chiefs Love Story is less rom-com, more literal love for football merch",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/12/c/y/screenshot-2024-12-01-at-101951pm-1024x589.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=863714",
          "author": "Brock Wilbur",
          "description": "Welcome, dearest reader. This is the December 2024 print issue of The Pitch, dispatched regularly from your home hub here in KC.  Due to time constraints for the turnaround on getting these issues through the printing press, today’s ‘Letter from the Editor’ has been typed up too close to the election to possibly unpack all the important, bizarre, and confounding...",
          "link": "https://www.thepitchkc.com/letter-from-the-editor-return-the-gift/",
          "publishedOn": "2024-12-02T22:00:56.000Z",
          "wordCount": 2299,
          "title": "Letter from the Editor: Return the gift",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/p/y/lfe-image-2.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=861771",
          "author": "Pitch Staff",
          "description": "Photo Courtesy of KC Pet Project Earlier this month, we published The Pitch’s annual Best of Kansas City issue. You can take a peek at the results of the readers’ poll here. The issue also included a list, compiled and written by our editorial staff, of some local people, places, and things that we thought clearly won 2024. We’ll be...",
          "link": "https://www.thepitchkc.com/best-of-kc-2024-brat-summer-steers-citywide-celebrations-into-indie-sleaze-fall/",
          "publishedOn": "2024-12-02T20:00:37.000Z",
          "wordCount": 1828,
          "title": "Best of KC 2024: Brat summer steers citywide celebrations into indie sleaze fall",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/08/v/s/brat-puppy-scaled.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=863822",
          "author": "Eli Ralls",
          "description": "Kansas City Mavericks versus Tulsa Oilers on Nov. 30, 2024. // Photo by Eli Ralls On Saturday, Nov. 30, the Kansas Mavericks took a disappointing 4-2 home loss to the Tulsa Oilers, despite having 13 more shots on net. The Oilers got going early with a goal about ten minutes into the first period, and KC answered back with their...",
          "link": "https://www.thepitchkc.com/photos-kansas-city-mavericks-fall-short-to-tulsa-oilers-as-race-for-first-place-heats-up/",
          "publishedOn": "2024-12-02T19:49:33.000Z",
          "wordCount": 1925,
          "title": "Photos: Kansas City Mavericks fall short to Tulsa Oilers as race for first place heats up",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/12/f/h/kc-mavericks-v-tulsa-oilers-11-30-24-41.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=863824",
          "author": "Blaise Mesa",
          "description": "Kansas and Missouri lawmakers could consider voluntary do-not-sell lists for guns. Credit: Scott Canon / The Beacon Donna Nathan loved two-stepping and The Beatles. The radio was always on at her house. That love of music easily translated to dancing in parades. Nathan and her daughter, Katrina Brees, even worked together at a studio making sculptures for Mardi Gras parades....",
          "link": "https://www.thepitchkc.com/is-this-bill-the-key-to-reducing-gun-suicides-in-kansas-and-missouri/",
          "publishedOn": "2024-12-02T19:39:32.000Z",
          "wordCount": 2494,
          "title": "Is this bill the key to reducing gun suicides in Kansas and Missouri?",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/12/x/o/screenshot-2024-12-02-at-13559pm.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=863816",
          "author": "Anna Spoerre",
          "description": "Dr. Betsy Wickstrom, a high-risk obstetrician who works in the Kansas City metro, is a lifelong Republican who was outspoken in her support for Missouri’s Amendment 3, which lifted the state’s near-total abortion ban (Anna Spoerre/Missouri Independent) Dr. Betsy Wickstrom understands where some of the voices opposed to abortion are coming from. She used to be one of them. The...",
          "link": "https://www.thepitchkc.com/care-delayed-and-care-denied-doctor-recalls-30-months-under-missouri-abortion-ban/",
          "publishedOn": "2024-12-02T19:34:58.000Z",
          "wordCount": 2839,
          "title": "‘Care delayed and care denied’: Doctor recalls 30 months under Missouri abortion ban",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/12/g/s/screenshot-2024-12-02-at-13210pm-1024x628.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=861757",
          "author": "Pitch Staff",
          "description": "Tom Mardikes // Photo by Ellen Beshuk Earlier this month, we published The Pitch’s annual Best of Kansas City issue. You can take a peek at the results of the readers’ poll here. The issue also included a list, compiled and written by our editorial staff, of some local people, places, and things that we thought clearly won 2024. We’ll...",
          "link": "https://www.thepitchkc.com/best-of-kc-2024-audio-experiment-sound-mandala-combines-tech-and-tremendous-dreamlike-adventures/",
          "publishedOn": "2024-12-02T17:00:34.000Z",
          "wordCount": 1820,
          "title": "Best of KC 2024: Audio experiment Sound Mandala combines tech and tremendous dreamlike adventures",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/07/y/v/tom-center-in-his-box.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=863567",
          "author": "Brock Wilbur",
          "description": "Photo by Don Ipock Kansas City does not lack for annual holiday traditions. It can probably be said double so for the theater community, where each season brings with it a handful of recurring shows that are consistently excellent. The thing of it is, there’s apparently always space for more. Productions like Milking Christmas and Electric Poe have carved out their high...",
          "link": "https://www.thepitchkc.com/the-unicorn-offers-up-ebenezer-scrooges-big-kc-mo-christmas-show-as-holiday-hooliganism-on-your-way-to-the-bar/",
          "publishedOn": "2024-12-02T14:00:31.000Z",
          "wordCount": 2157,
          "title": "The Unicorn offers up Ebenezer Scrooge’s Big KC MO Christmas Show as holiday hooliganism on your way to the bar",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/11/g/u/screenshot-2024-11-26-at-102950pm-1024x668.png"
        }
      ]
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=174906",
          "author": "Maitreyi Anantharaman",
          "description": "On Friday afternoon, the day after a total clock-management disaster resulted in a three-point loss to Detroit, the team canned Eberflus. He becomes the first-ever Bears head coach fired midseason, and he deserves that distinction.",
          "link": "https://defector.com/matt-eberflus-made-bears-history-in-the-bad-way",
          "publishedOn": "2024-12-02T21:18:51.000Z",
          "wordCount": 7231,
          "title": "Matt Eberflus Made Bears History In The Bad Way",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2186684566.jpg"
        },
        {
          "id": "https://defector.com/?p=174898",
          "author": "Luis Paez-Pumar",
          "description": "At the time of writing, on Dec. 2, 2024, Liverpool is nine points clear at the top of the Premier League table. The Pool Boys have been in torrid form domestically this season: 11 wins, one draw to second-place Arsenal, and one less-shocking-by-the-day loss to sixth-place Nottingham Forest. That run of 13 games includes wins over third-place Chelsea, fourth-place Brighton, and an always-pleasant thrashing of rival Manchester United. As of Sunday, it also includes a quite comfortable 2-0 victory over Manchester City, a club in full-blown crisis, insomuch as the Sky Blues can be in crisis; the loss to Liverpool threw City into fifth place, and the reigning champions have not won in seven matches across all competitions.\n\nhttps://www.youtube.com/watch?v=fNI7qrWFeqI",
          "link": "https://defector.com/liverpool-is-winning-a-battle-of-attrition",
          "publishedOn": "2024-12-02T19:16:17.000Z",
          "wordCount": 8881,
          "title": "Liverpool Is Winning A Battle Of Attrition",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187726227.jpg"
        },
        {
          "id": "https://defector.com/?p=174909",
          "author": "Patrick Redford",
          "description": "The theory of the dribble handoff is sound: The hub, typically a center brutish enough to dislodge trailing defenders with a screen but adept enough with the rock to make quick passing decisions, scrambles typical pick-and-roll coverage by simultaneously acting as both ball-handler and screener. With a live dribble, they have the latitude to punish overzealous help defense and dictate the angle of the screen. The player coming around the DHO can either pop into open space or attack a slightly shifted defense, with the hub either rolling or popping themselves. \nOne NBA team, Sacramento, has made the DHO the foundation of its half-court offense. This made total sense when the Kings implemented the system two seasons ago and won 48 games; it also helps explain why the team is currently drawing dead in a conference that has passed them by.",
          "link": "https://defector.com/this-is-what-getting-left-behind-looks-like",
          "publishedOn": "2024-12-02T18:49:09.000Z",
          "wordCount": 8217,
          "title": "This Is What Getting Left Behind Looks Like",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187779573.jpg"
        },
        {
          "id": "https://defector.com/?p=174901",
          "author": "Samer Kalaf",
          "description": "You'd think it would get old by now, but it really hasn't: It's almost therapeutic to watch Aaron Rodgers eat shit week after week. The preceding months of smugness, sneers, and hack pop-culture references just enhance the results, and in a stroke of serendipity, today is Aaron Rodgers's 41st birthday. Hey—happy birthday, big guy. You don't play a day over 65.",
          "link": "https://defector.com/aaron-rodgers-suffers-further-indignity",
          "publishedOn": "2024-12-02T18:06:19.000Z",
          "wordCount": 6457,
          "title": "Aaron Rodgers Suffers Further Indignity",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187729657.jpg"
        },
        {
          "id": "https://defector.com/?p=174923",
          "author": "Ray Ratto",
          "description": "Justin Tucker sat encased in a sideline cape and hidden under a hood, alone with his thoughts and the millions of other people thinking them. He had just missed a 53-yard field goal that would have put the Baltimore Ravens ahead of the Philadelphia Eagles, and Tucker looked more than just morose. He looked even more than baffled. The most productive NFL kicker of the last decade looked like the living embodiment of a yip.\nPeople speak of the yips often, usually in relation to a golfer with putting issues; for whatever it may be worth, the Oxford English Dictionary pegs the first use of the term as having been in 1935, in American Golfer. Everyone agrees on what it is: the sudden inability to perform a task one has performed many times before because the one performing the task is thinking too hard about the task itself and becoming overwhelmed by the very idea. It’s less that the task becomes more difficult and more that it just slips further and further out of perspective.",
          "link": "https://defector.com/justin-tucker-just-cant-find-the-range",
          "publishedOn": "2024-12-02T17:37:50.000Z",
          "wordCount": 7090,
          "title": "Justin Tucker Just Can’t Find The Range",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187768989.jpg"
        },
        {
          "id": "https://defector.com/?p=174876",
          "author": "Tom Ley",
          "description": "On Saturday, the San Jose State women's volleyball season came to an end, as the Spartans were beaten in four sets by the Colorado State Rams in the Mountain West Conference championship. A top seed comfortably prevailing over a second seed in a small conference tournament final is not a particularly remarkable or noteworthy outcome, but SJSU's tournament run gained national attention thanks to the hard work of people who hate sports almost as much as they hate transgender people.\nLast week, ESPN's Katie Barnes published a long and deeply reported story about SJSU's volleyball season, which I highly recommend you read. The short version is that earlier this year an anti-trans activist group called Independent Council on Women's Sports (ICONS) and professional bigot Riley Gaines trained their sights on SJSU's volleyball team, claiming that the team has a transgender player. (The player in question has not been named in non-reactionary media coverage.) In March, ICONS and Gaines filed a lawsuit against the NCAA seeking to overturn the policies that allow transgender athletes to play sports. In September, SJSU co-captain Brooke Slusser joined the lawsuit, claiming that the presence of a transgender player on her team posed a safety risk to her teammates and opponents.",
          "link": "https://defector.com/bigots-dont-know-ball",
          "publishedOn": "2024-12-02T17:01:48.000Z",
          "wordCount": 7231,
          "title": "Bigots Don’t Know Ball",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2179626452.jpg"
        },
        {
          "id": "https://defector.com/?p=174899",
          "author": "Maitreyi Anantharaman",
          "description": "This week’s puzzle was constructed by Rebecca Goldstein and Rachel Fabi, and edited by Hoang-Kim Vu. Rebecca is a scientist and crossword constructor in the Bay Area. Rachel is a crossword constructor and a professor of bioethics. When she's not professing bioethics or doing crossword things, Rachel enjoys biking, hiking, video games, and baking, and she is currently in third place in her family's 17-team fantasy football keeper league. \nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE.",
          "link": "https://defector.com/the-crossword-dec-2-hot-ones",
          "publishedOn": "2024-12-02T16:19:39.000Z",
          "wordCount": 4944,
          "title": "The Crossword, Dec. 2: Hot Ones",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-528395644.jpg"
        },
        {
          "id": "https://defector.com/?p=174676",
          "author": "Sabrina Imbler",
          "description": "The flame-colored blooms of the Ethiopian red hot poker grow around mountain-rimmed meadows, as high up as 13,000 feet above sea level. The dry season snuffs out the poker's flowers, leaving the plant parched and yellow. But in the rainy season, the plants first regrow their spiky leaves, then their towering stem, and finally their red-hot flowers. \"They look like hundreds of fire torches covering the landscape,\" Sandra Lai, a senior scientist at Oxford University's Ethiopian Wolf Conservation Program, or EWCP, wrote in an email.",
          "link": "https://defector.com/these-beautiful-wolves-are-freaks-for-nectar",
          "publishedOn": "2024-12-02T14:53:05.000Z",
          "wordCount": 7789,
          "title": "These Beautiful Wolves Are Freaks For Nectar",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/Low-Res_1.-Adrien-Lesaffre-e1732728884237.jpg"
        },
        {
          "id": "https://defector.com/?p=174515",
          "author": "Vince Guerrieri",
          "description": "Cleveland loves to immortalize its sports heroes. The street behind the left-field bleachers at the Guardians' ballpark was renamed for Larry Doby in 2012. The Browns' offices in Berea are on Lou Groza Boulevard. There are parks named for Luke Easter, a Negro Leagues slugger who played for the Indians, and Mel Harder, a longtime pitcher and coach. (Harder's park is also his final resting place. His ashes were scattered there following his death in 2002.)\nBut Cleveland immortalizes its sports villains, too. Art Modell has an Ohio law named for him.",
          "link": "https://defector.com/how-the-art-modell-law-could-keep-the-browns-from-leaving-cleveland",
          "publishedOn": "2024-12-02T14:00:41.000Z",
          "wordCount": 12431,
          "title": "How The Art Modell Law Could Keep The Browns From Leaving Cleveland",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/browns.jpg"
        },
        {
          "id": "https://defector.com/?p=174830",
          "author": "Giri Nathan",
          "description": "The Washington Wizards started the season at a plucky 2-2. Perhaps that was pluckier than they intended. They proceeded to lose all 14 games they played in November, settling in the muck at a league-worst 2-16. This would be bleak new territory for most teams, but incredibly, this is not even the franchise's first winless month in the current calendar year. Last season's Wizards went 0-12 in February. That was part of a larger 16-game losing streak, tied for the worst in franchise history. Should the current Wizards lose three more games—and, given that the opponents are the Cavs, Mavs, and Nuggets, they might—they would claim that franchise record instead.\nAnother astonishing aspect is how uncompetitive the games themselves have been. The Wizards lost all 14 games in this streak by a margin of at least nine points, which had never been accomplished in NBA history. In 10 of those games, they were blown out by at least 15 points. The team is omni-directionally bad, with both the league's worst offensive rating and the worst defensive rating and, as such, the worst net rating, a gruesome -14.1.",
          "link": "https://defector.com/the-washington-wizards-won-nothing-in-november",
          "publishedOn": "2024-12-02T00:07:30.000Z",
          "wordCount": 6465,
          "title": "The Washington Wizards Won Nothing In November",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187063898-e1733096249201.jpg"
        },
        {
          "id": "https://defector.com/?p=174809",
          "author": "Diana Moskovitz",
          "description": "Jacksonville Jaguars quarterback Trevor Lawrence left Sunday's game on a medical cart after Houston Texans linebacker Azeez Al-Shaair hit the QB while he was sliding, appearing to lead with his forearm and helmet. The smack of the tackle could be heard on TV.\nLawrence lay motionless on the field in what looked like a fencing response. But it was hard to see all of Lawrence's body because, almost immediately, a fight broke out. After Al-Shaair made the tackle, Jaguars tight end Evan Engram rushed over and shoved him, and players from both teams escalated the clash. At one point, the broadcast showed a huge swath of players on one sideline as the fight wound down while, further away, a handful of personnel tended to Lawrence. ESPN's Michael DiRocco reported that \"an official knelt to protect Lawrence as the skirmish moved toward the Jaguars sideline.\"",
          "link": "https://defector.com/azeez-al-shaair-confronted-and-ejected-after-ugly-hit-that-gave-trevor-lawrence-concussion",
          "publishedOn": "2024-12-01T23:56:15.000Z",
          "wordCount": 5641,
          "title": "Azeez Al-Shaair Confronted And Ejected After Ugly Hit That Gave Trevor Lawrence Concussion",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187737594-e1733083534842.jpg"
        },
        {
          "id": "https://defector.com/?p=174790",
          "author": "Giri Nathan",
          "description": "For the second time in 2024, one of the best tennis players in the world has violated anti-doping rules. The International Tennis Integrity Agency announced Thursday that Iga Swiatek, currently the world No. 2, tested positive for the banned substance trimetazidine, a heart medication used in Europe and Asia to treat angina. It was detected in an out-of-competition test Swiatek provided just ahead of the Cincinnati Open in August, the ITIA said. Swiatek formally admitted to the anti-doping rules violation and accepted a one-month ban from the sport; her three weeks of provisional suspension earlier in the year count toward that ban and she is currently serving the remaining eight days during a meaningless stretch of the tennis calendar. She was also stripped of $158,944 in prize money and 390 ranking points for her semifinal run in Cincinnati.\nSwiatek previously had a provisional suspension as she sought to explain the source of the trimetazidine to the ITIA. While doing so, she missed tournaments in Seoul, Beijing, and Wuhan in September and October. Swiatek was able to have her suite of at least 14 supplements analyzed to identify a possible source of contamination. She concluded that the culprit was her melatonin, which Swiatek has long used, she said, because with \"all my traveling, jet lag and work-related stress mean that sometimes without it, I couldn’t fall asleep.\" She provided both an opened and unopened containers of the melatonin to the ITIA, which had them analyzed and found the contamination consistent with the trace amounts of trimetazidine detected in Swiatek's urine sample. Her provisional suspension was lifted and she was able to continue competing at the WTA's year-end finals, per the ITIA decision.",
          "link": "https://defector.com/iga-swiatek-suspended-after-testing-positive-for-banned-substance",
          "publishedOn": "2024-12-01T19:09:55.000Z",
          "wordCount": 7783,
          "title": "Iga Swiatek Suspended After Testing Positive For Banned Substance",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2166195136-e1733077571226.jpeg"
        },
        {
          "id": "https://defector.com/?p=174796",
          "author": "Diana Moskovitz",
          "description": "Michigan beat Ohio State on Saturday for the fourth season in a row. The win gave this year's senior class at Michigan a clean sweep over their longtime Buckeye rivals, and it was a stunning upset as OSU hosted the game and came into it ranked second in the country. Sure, college players are increasingly transferring between programs and extending their careers into their mid-twenties, but facts like that mean little next to the emotions of a longstanding rivalry that goes back more than a century. The most important fact of all is that Ohio State and Michigan hate each other. When the Wolverines won in Columbus, 13-10, and a player tried to plant a Michigan flag on the field, a brawl unsurprisingly followed.\nReporters were already on the field when the fight broke out, and Nicole Shearin of WBNS got video of what happened. The Michigan player, carrying a Michigan flag on a pole, walked up to an area of the field and motioned as if to plant the flag. He was slowed down, first by what looked like people in Ohio State clothing, followed by someone in Michigan clothing who put his arms around the player. The Michigan player wasn't able to plant the flag, but kept talking as Ohio State athletes filled up the area. Video from another angle by UMGoBlue showed that after the failed flag planting, an Ohio State player grabbed the cloth part of the Michigan flag and ripped it off its pole. In the videos, this is when the fight started. (A different video also showed former Wolverine turned broadcaster Jason Avant securing the loose Michigan flag, but it's hard to tell when that happened relative to everything else.)",
          "link": "https://defector.com/police-pepper-spray-players-during-michigan-ohio-state-postgame-fight",
          "publishedOn": "2024-12-01T18:49:40.000Z",
          "wordCount": 6542,
          "title": "Police Pepper Spray Players During Michigan-Ohio State Postgame Fight",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187064922-e1733062541146.jpeg"
        },
        {
          "id": "https://defector.com/?p=174490",
          "author": "Patrick Redford",
          "description": "The United States Women's National Team is currently in Europe to play a pair of friendlies that will thoroughly stretch the meaning of that designation.\nFirst up is a date with England at Wembley, both a homecoming for USWNT coach Emma Hayes and a fascinating opportunity to consider the dynamics of the transatlantic soccer exchange on both the Olympic champions and the European champions. Hayes, of course, made her name managing Chelsea for over a decade, though she got her start coaching in New York, a bit north of where Three Lionesses manager Sarina Wiegman played college soccer. USWNT vets have enjoyed short stints in England, and so many England players have tussled in the NWSL that The Athletic ran a long story with quotes from each payer about how physical and demanding the standard of play was stateside. The game is not exactly a referendum on whose development environment is better, though it does provide an occasion to think seriously about at the state of the best women's club league and the second-best as it closes the gap. It's also a serious test for both teams with close to their full rosters.",
          "link": "https://defector.com/enjoy-the-lily-yohannes-victory-lap",
          "publishedOn": "2024-11-29T21:23:07.000Z",
          "wordCount": 6769,
          "title": "Enjoy The Lily Yohannes Victory Lap",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2187000462.jpg"
        },
        {
          "id": "https://defector.com/?p=174752",
          "author": "Justin Ellis",
          "description": "Growing up, my grandma lived in a small green house that sat under a towering cottonwood tree on the south side of Minneapolis. She had many old things, or at least things that felt old to my young brain: a cast-iron fireplace that looked like it could forge steel, a massive wooden cabinet TV that hummed and seemed almost radioactive, a whole rainbow's worth of colorful mixing bowls that were sturdy enough to survive in the oven.\nThe bowls are what I remember the most, because I remember the kitchen more vividly than anything else. On holidays like Thanksgiving, Christmas and Easter, work would start in the narrow galley of a kitchen very early and it would go late, until family arrived, until the very minute everyone sat at the table, through the combative games of Uno to decide who would do dishes after no one was foolish enough to eat more.",
          "link": "https://defector.com/when-does-a-recipe-become-your-own",
          "publishedOn": "2024-11-29T18:25:00.000Z",
          "wordCount": 7541,
          "title": "When Does A Recipe Become Your Own?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-566024743.jpg"
        },
        {
          "id": "https://defector.com/?p=174670",
          "author": "Patrick Dubuque",
          "description": "Defector has partnered with Baseball Prospectus to bring you a taste of their work. They write good shit that we think you’ll like. If you do like it, we encourage you to check out their site and subscribe.\nThis story was originally published at Baseball Prospectus on November 22.",
          "link": "https://defector.com/the-last-pitcher",
          "publishedOn": "2024-11-29T17:24:11.000Z",
          "wordCount": 8728,
          "title": "The Last Pitcher",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-1387469914.jpg"
        },
        {
          "id": "https://defector.com/?p=174198",
          "author": "Felix Kent",
          "description": "I recently stayed at a blandly business-oriented hotel in San Jose in order to celebrate my birthday, drink a tall boy, and watch the Sharks lose. You know this type of hotel. There were white duvet covers, white sheets, beige walls, dark wood for the closet and bathroom doors. There was a nice light under a wall bench to help you find your way to the bathroom in the middle of the night. The soundproofing was good.\nThere was also, of course, a picture on the wall. There is always a picture on the wall in hotel rooms. It was a photograph and it showed a cement wall and floor belonging to what seemed to be a warehouse building.",
          "link": "https://defector.com/why-does-hotel-art-look-like-that",
          "publishedOn": "2024-11-29T14:00:40.000Z",
          "wordCount": 10070,
          "title": "Why Does Hotel Art Look Like That?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-1265276272.jpg"
        },
        {
          "id": "https://defector.com/?p=174669",
          "author": "David Roth",
          "description": "It is not important how late I stayed up watching Rutgers defeat Notre Dame on Tuesday night, in one of the many Thanksgiving-season college basketball tournaments happening right now. It is sufficient to say that it was late enough that I felt both tired and stupid the next morning, and arrived at my parents' house the next evening to help with Thanksgiving prep both a little droopy and decently primed for the cascading excesses of this season. Staying up to watch tournaments sponsored by the manufacturers of the orange-shaped chocolate thing my in-laws like, or the early rounds of the Bad Boy Mowers Battle 4 Atlantis, is a kind of gluttony in itself. It's less literal than the kind that generally defines Thanksgiving, but it comes from the same place—the instinct, when presented with an abundance of something/anything, to let yourself have a little treat, and then maybe another after that.",
          "link": "https://defector.com/staying-up-late-and-being-stupid",
          "publishedOn": "2024-11-28T17:21:21.000Z",
          "wordCount": 7074,
          "title": "Staying Up Late And Being Stupid",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2186464399-1.jpg"
        }
      ]
    },
    {
      "title": "Joe's Weather Blog | In-depth Kansas City forecasts | FOX4KC",
      "feedUrl": "http://fox4kc.com/category/weather/weather-blog/feed/",
      "siteUrl": "https://fox4kc.com",
      "articles": [
        {
          "id": "https://fox4kc.com/?p=3745938",
          "author": "Joe Lauria",
          "description": "Well, that was quite the snow on Saturday morning... anywhere from 1-5\" of snow in the Metro with that concentrated area of 3-5\" right near the I-70 corridor, and that was roughly a 5-10 mile wide band that went east to west through parts of eastern Kansas and into the areas east of KC. All [...]",
          "link": "https://fox4kc.com/weather/weather-blog/joes-blog-so-whens-our-next-snow-chance-mon-12-2/",
          "publishedOn": "2024-12-02T14:23:29.000Z",
          "wordCount": null,
          "title": "Joe's Blog: So, when's our next snow chance (MON-12/2)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/12210.png?w=637",
            "type": "image/png",
            "length": "841019"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/12210.png?w=637"
        },
        {
          "id": "https://fox4kc.com/?p=3745938",
          "author": "Joe Lauria",
          "description": "Well that was quite the snow on Saturday morning...anywhere from 1-5\" of snow in the Metro with that concentrated area of 3-5\" right near the I-70 corridor and that was roughly a 5-10 mile wide band that went east to west through parts of eastern KS and into the areas east of KC. All the [...]",
          "link": "https://fox4kc.com/email-alerts/joes-weather-blog-email-alerts/joes-blog-so-whens-our-next-snow-chance-mon-12-2/",
          "publishedOn": "2024-12-02T14:23:29.000Z",
          "wordCount": null,
          "title": "Joe's Blog: So when's our next snow chance (MON-12/2)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/12210.png?w=637",
            "type": "image/png",
            "length": "841019"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/12210.png?w=637"
        },
        {
          "id": "https://fox4kc.com/?p=3744369",
          "author": "Joe Lauria",
          "description": "It's not a wide band, but it's a mighty one. About 10-15 miles from north to south around that band there are little or no impact, and in the band, there are crashes and road closures. This is what I've been concerned about for two days and last night I hit this hard. I had [...]",
          "link": "https://fox4kc.com/weather/weather-blog/joes-blog-band-of-snow-creates-a-mess-in-kc-sat-11-30/",
          "publishedOn": "2024-11-30T15:50:00.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Band of snow creates a mess in KC (SAT-11/30)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11304.png?w=570",
            "type": "image/png",
            "length": "920469"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11304.png?w=570"
        },
        {
          "id": "https://fox4kc.com/?p=3744369",
          "author": "Joe Lauria",
          "description": "It's not a wide band, but it's a mighty one...roughly 10-15 miles from north to south...around that band there is little or no impacts and in the band there are crashes and road closures. This is what I've been concerned about for two days and last night I hit this hard. I had a bad [...]",
          "link": "https://fox4kc.com/email-alerts/joes-weather-blog-email-alerts/joes-blog-band-of-snow-creates-a-mess-in-kc-sat-11-30/",
          "publishedOn": "2024-11-30T15:50:00.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Band of snow creates a mess in KC (SAT-11/30)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11304.png?w=570",
            "type": "image/png",
            "length": "920469"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11304.png?w=570"
        },
        {
          "id": "https://fox4kc.com/?p=3743490",
          "author": "Joe Lauria",
          "description": "As we head toward the last day of November tomorrow, Mother Nature may give us a last day of November snow, and perhaps, it may be more than just a casual amount for parts of the area",
          "link": "https://fox4kc.com/weather/weather-blog/joes-blog-fast-moving-snows-saturday-fri-11-29/",
          "publishedOn": "2024-11-29T16:50:24.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Fast moving snows Saturday (FRI-11/29)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11298.png?w=900",
            "type": "image/png",
            "length": "1885239"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11298.png?w=900"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=832587",
          "author": "Anthony Franco",
          "description": "The Royals already made one move to improve the offense, acquiring Jonathan India from the Reds two weeks ago. India will hit at the top of the lineup. Kansas City is also on the hunt for a middle-of-the-order bat, write Will Sammon, Katie Woo and Ken Rosenthal of the Athletic. As with India, it seems a…",
          "link": "https://www.mlbtraderumors.com/2024/12/royals-evaluating-trade-market-for-middle-of-the-order-bat.html",
          "publishedOn": "2024-12-03T03:21:55.000Z",
          "wordCount": 4379,
          "title": "Royals Evaluating Trade Market For Middle-Of-The-Order Bat",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2023/12/USATSI_21842510-1024x683.jpg"
        }
      ]
    },
    {
      "title": "local food",
      "feedUrl": "https://www.kcur.org/tags/local-food.rss",
      "siteUrl": "https://www.kcur.org/tags/local-food",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}