{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": [
        {
          "id": "https://blogs.fangraphs.com/?p=468274",
          "author": "Jay Jaffe",
          "description": "Closing out the annual series with a look at contenders who could really use an extra bat.",
          "link": "https://blogs.fangraphs.com/the-2025-replacement-level-killers-designated-hitter/",
          "publishedOn": "2025-07-18T16:00:32.000Z",
          "wordCount": null,
          "title": "The 2025 Replacement-Level Killers: Designated Hitter",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://blogs.fangraphs.com/?p=468176",
          "author": "Jay Jaffe",
          "description": "A supersized list of teams struggling for production at one outfield corner — or both.",
          "link": "https://blogs.fangraphs.com/the-2025-replacement-level-killers-left-field-right-field/",
          "publishedOn": "2025-07-17T16:40:10.000Z",
          "wordCount": null,
          "title": "The 2025 Replacement-Level Killers: Left Field & Right Field",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://blogs.fangraphs.com/?p=468145",
          "author": "Michael Baumann",
          "description": "If you're giving up nothing to upgrade a position of weakness, make sure you're actually upgrading the position and actually giving up nothing.",
          "link": "https://blogs.fangraphs.com/trade-season-comes-in-like-a-lamb/",
          "publishedOn": "2025-07-17T13:00:05.000Z",
          "wordCount": null,
          "title": "Trade Season Comes in Like a Lamb",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://blogs.fangraphs.com/?p=467973",
          "author": "Jay Jaffe",
          "description": "Several contending teams are having some trouble up the middle.",
          "link": "https://blogs.fangraphs.com/the-2025-replacement-level-killers-catcher-second-base/",
          "publishedOn": "2025-07-14T15:25:24.000Z",
          "wordCount": null,
          "title": "The 2025 Replacement-Level Killers: Catcher & Second Base",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=196498",
          "author": "Kathryn Xu",
          "description": "On May 21, Defector's Ray Ratto informed you that it was time to start the \"Rich Hill is BACK\" countdown. A little over three months later, on July 23, I am happy to inform you that the Rich Hill is BACK countdown has officially ended, because Rich Hill is BACK, and this time with the Kansas City Royals!\nSince signing his Minor League deal, the 45-year-old Hill has put up a 5.22 ERA over 11 starts in the minors. Two of those starts came at the Rookie ball level—where, according to Baseball-Reference, he is 23.9 years older than the weighted average age of players in Rookie ball—while the remaining nine came in Triple-A, where he is a mere 17.5 years older than the average. While the ERA is less than ideal, Hill averaged a little less than six strikeouts per start.",
          "link": "https://defector.com/rich-hill-is-back",
          "publishedOn": "2025-07-23T19:48:08.000Z",
          "wordCount": 6777,
          "title": "Rich Hill Is BACK",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/richHillRoyalsBACK.jpg"
        },
        {
          "id": "https://defector.com/?p=196496",
          "author": "Abigail Segel",
          "description": "GENEVA — If it weren’t for the crystal-blue lake and rugged mountains that sandwich the city, I’d have thought I was in London. In the 36 hours before England’s Women’s Euro semifinal match against Italy, downtown Geneva was crawling with English accents and white kits with leonine crests. The only thing more prevalent than England fans was the ample signage around the city promoting the tournament.\nAs I walked around, I began to wonder if, come match time, the stadium would be a sea of white, with nary an Italian fan in sight. I kept an eagle eye out for blue Italy jerseys, and found only enough to count on one hand. In fact, I spotted more German and Spanish kits than those for the Azzurre, and that semifinal is across the country. Even on game day, as I merged into the mass of fans streaming into the stadium, only specks of blue shone through the white.",
          "link": "https://defector.com/in-the-face-of-chaos-england-kept-calm-and-carried-on-into-the-euros-final",
          "publishedOn": "2025-07-23T18:07:41.000Z",
          "wordCount": 11490,
          "title": "In The Face Of Chaos, England Kept Calm And Carried On Into The Euros Final",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2226547184.jpg"
        },
        {
          "id": "https://defector.com/?p=196455",
          "author": "Lauren Theisen",
          "description": "Tuesday night brought another rough loss for the Los Angeles Dodgers—one of a whopping 43 they've already suffered so far this year. Facing the Minnesota Twins at home, the defending champions got absolutely blown out of the ballpark in a three-run loss. Surely no team has ever faced adversity like this.\nOn Teoscar Hernández's bobblehead night (he was benched), the score was even at 3-3 through five, with starter Yoshinobu Yamamoto getting tagged for a couple of unearned runs in a tricky second inning. Once he exited, however, L.A. completely lost the plot. Ben Casparius, the first reliever out of the pen, looked hurt as he failed to get any of his four batters out, and he'll get an MRI. Alexis Díaz was unable to strand two of the runners he inherited. And after Will Klein walked three straight in the seventh, Edgardo Henriquez entered the game and generously turned a Royce Lewis check-swing chopper into a three-bagger with a wild throw into the right-field corner.",
          "link": "https://defector.com/the-first-place-dodgers-are-in-relative-trouble",
          "publishedOn": "2025-07-23T17:07:38.000Z",
          "wordCount": 7122,
          "title": "The First-Place Dodgers Are In Relative Trouble",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2225691174.jpg"
        },
        {
          "id": "https://defector.com/?p=196428",
          "author": "Drew Magary",
          "description": "Some people are fans of the Cleveland Browns. But many, many more people are NOT fans of the Cleveland Browns. This 2025 Defector NFL team preview is for those in the latter group. Read all the previews so far here.\nYour team: Cleveland Browns.",
          "link": "https://defector.com/why-your-team-sucks-2025-cleveland-browns",
          "publishedOn": "2025-07-23T16:48:49.000Z",
          "wordCount": 15124,
          "title": "Why Your Team Sucks 2025: Cleveland Browns",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2223947750.jpg"
        },
        {
          "id": "https://defector.com/?p=196467",
          "author": "Ray Ratto",
          "description": "As the NFL's loudest, goofiest, and by far richest general manager, Dallas Cowboys owner Jerry Jones is always positioned for the camera, any camera. His singular and long-running M.O.—the tough-talking soft touch in contract negotiations—has always been a comedic staple. It allows him to be a hawk and a kitten on player deals simultaneously.\nAs a result, his circumnavigations regarding super-de-duperstar defensive end Micah Parsons are made more interesting by the way that Jones gave in most recently, which was on Dak Prescott's $240 million deal, which guaranteed $231 million in salary, a year ago. On the one hand, Parsons not yet having a contract is not yet officially a pressing matter; Dallas' first loss of the season, at Philadelphia in the first game of the season, is still six weeks away. On the other, Jones sounds like he is taking the NFL's not-so-secret aggression against guaranteed money to spleen, if not necessarily to heart.",
          "link": "https://defector.com/jerry-jones-is-negotiating-with-himself-as-usual",
          "publishedOn": "2025-07-23T16:14:10.000Z",
          "wordCount": 8512,
          "title": "Jerry Jones Is Negotiating With Himself, As Usual",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2189270765.jpg"
        },
        {
          "id": "https://defector.com/?p=196414",
          "author": "Dave McKenna",
          "description": "No record ever spoke to me more than Southern Rock Opera by the Drive-By Truckers. It’s a concept album released in 2001 that has lots of songs about growing up in the South in the late '70s and not having much going on besides power drinking and rock and roll. That record could be my life. And of all the period-piece vignettes, none hit me where I live more than a verse in \"Let There Be Rock\" where frontman Patterson Hood bragged about a concert the rock gods blessed upon him back in the day: “I sure saw Ozzy Osbourne,” Hood warbled, “with Randy Rhoads in ‘82 right before that plane crash.”\nWell, me too: On February 24, 1982, I caught Ozzy’s Diary of a Madman tour when it stopped in Lubbock, Texas. Ozzy wielded an oversized crucifix while doddering around a stage that had been tarted up to look like a medieval castle. Headbangers heaven.",
          "link": "https://defector.com/ill-never-stop-bragging-about-seeing-ozzy-on-the-most-metal-tour-of-all-time",
          "publishedOn": "2025-07-23T15:20:00.000Z",
          "wordCount": 8284,
          "title": "I’ll Never Stop Bragging About Seeing Ozzy On The Most Metal Tour Of All Time",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1413685812.jpg"
        },
        {
          "id": "https://defector.com/?p=196344",
          "author": "Patrick Redford",
          "description": "MONT VENTOUX, France — \"I had goosebumps in the moment, it was so incredible,\" Soudal-QuickStep team photographer Wout Beel said the morning of Stage 17. \"I am getting goosebumps again just talking about it, look!\" he said, showing me his arm. It's true, he was. One day earlier, one of his team's riders had won the stage—but not just any rider, and not just any stage. Finally, the French had gotten on the board.\nWith each dominant Tadej Pogacar win and each successive anonymous performances from the hometown teams, you could feel the anxiety building. Heading into a punishing third week of the Tour, a French rider had not won a stage at the 2025 Tour de France. Marc Madiot's considerable eyebrows scrunched together with extra verve, the man who dresses as a king in the fan zone looked slightly less vainglorious, and the French press seemed somehow even more dour with each passing day. The French have only failed to win a stage three times, and a fruitless Tour on the 40th anniversary of the last time a French rider won the yellow jersey would have prompted a fresh round of French hysterics. That gnawing anxiety is partially what made Julian Alaphilippe's premature celebration so painful, and partially what made Valentin Paret-Peintre's victory on Mont Ventoux one stage later so cathartic.",
          "link": "https://defector.com/france-finally-has-something-to-smile-about-at-the-tour",
          "publishedOn": "2025-07-23T14:35:54.000Z",
          "wordCount": 11037,
          "title": "France Finally Has Something To Smile About At The Tour",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/vpp-tdf.jpeg"
        },
        {
          "id": "https://defector.com/?p=196258",
          "author": "Maitreyi Anantharaman",
          "description": "What money are WNBA players owed? The league’s biggest names got people asking this question Saturday night, when they all wore “Pay Us What You Owe Us” warmup T-shirts before the All-Star Game in Indianapolis. Two days earlier, the players and the league met for their first in-person collective bargaining session, which players generally left feeling frustrated.\n“Based on their most recent proposal, we just aren’t able to get to a place where we’re actually even talking about the same thing,” Breanna Stewart said the day after the meeting. The stakes are big. The labor deal will govern what WNBA commissioner Cathy Engelbert called the league’s “hypergrowth,” a moment of huge new valuations, a $2.2 billion media rights deal set to kick in next year, and a round of expansion that will seriously change the league’s scope. Negotiations for the last CBA lasted into the winter, but the current agreement technically expires at the end of October. Ahead of a big free-agency period in February and the upcoming Toronto and Portland expansion drafts, there's some pressure to get this done before then.",
          "link": "https://defector.com/wnba-players-want-to-share-in-the-leagues-hypergrowth",
          "publishedOn": "2025-07-23T13:13:16.000Z",
          "wordCount": 9961,
          "title": "WNBA Players Want To Share In The League’s “Hypergrowth”",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2226068566.jpg"
        },
        {
          "id": "https://defector.com/?p=196357",
          "author": "Barry Petchesky",
          "description": "Imagine it is December 1970. \"I Think I Love You\" by the Partridge Family was just atop the charts. Billboard would soon name \"Bridge Over Troubled Water\" the most popular song of the year. If you listen to music, that's mostly what you are hearing: flowery pop or earnest folk. Then, you go to a show, and you see this: \n\nhttps://www.youtube.com/watch?v=K3b6SGoN6dA&ab_channel=BlackSabbath",
          "link": "https://defector.com/ozzy-osbourne-was-the-frontman-of-the-future",
          "publishedOn": "2025-07-22T20:03:11.000Z",
          "wordCount": 7652,
          "title": "Ozzy Osbourne Was The Frontman Of The Future",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-73989319.jpg"
        },
        {
          "id": "https://defector.com/?p=196313",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about cleaning up before dying, ketchup, being a new stepdaddy, and more.\nSorry for the abbreviated bag today, but Why Your Team Sucks has begun and I need to stay on point for it. But don’t worry, the bag will return to its normal length soon enough.",
          "link": "https://defector.com/fuck-the-ipad-ordering-kiosk",
          "publishedOn": "2025-07-22T19:04:21.000Z",
          "wordCount": 14972,
          "title": "Fuck The iPad Ordering Kiosk",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-454272690.jpg"
        },
        {
          "id": "https://defector.com/?p=196351",
          "author": "Emily Zhou",
          "description": "On autobiographies of trans female sexuality",
          "link": "https://defector.com/nerves-nerves-nerves",
          "publishedOn": "2025-07-22T18:32:11.000Z",
          "wordCount": 17926,
          "title": "Nerves, Nerves, Nerves",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/nervesnervesnerves1-e1753207235285.jpg"
        },
        {
          "id": "https://defector.com/?p=196319",
          "author": "Kathryn Xu",
          "description": "The advent of the ghost runner made it possible to score a run in baseball without ever getting on base: In extra innings now, a bunt and a sac fly will do the trick. To truncate years-old discourse, this is a clear affront to the principles of baseball. What the Philadelphia Phillies did to the Boston Red Sox in the bottom of the 10th inning of Monday night's game is more old-fashioned than that.\nIt has always been possible to score a run in baseball without ever hitting the ball into play, though it requires so many walks—or so many wild pitches—within an inning that its accomplishment could hardly be credited to the hitting team. To do it requires the full cooperation, intentional or not, of the opposing pitcher. It would be more accurate to place the bulk of the responsibility for what fans had to witness on Monday night not on the Phillies, who were attempting to commit one atrocity and instead committed another, or the ghost runner, though it lowered the difficulty by one walk, but on the Red Sox and relief pitcher Jordan Hicks.",
          "link": "https://defector.com/phillies-implement-forbidden-catchers-interference-strategem-to-walk-off-red-sox",
          "publishedOn": "2025-07-22T16:55:25.000Z",
          "wordCount": 7418,
          "title": "Phillies Implement Forbidden Catcher’s Interference Strategem To Walk Off Red Sox",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/edmundoSosaInterference.jpg"
        },
        {
          "id": "https://defector.com/?p=196303",
          "author": "Patrick Redford",
          "description": "VAISON-LA-ROMAINE, France — On the morning of Stage 15 of the Tour de France, I was strolling the paddock with a colleague when we happened upon the fan who'd had her cardboard signed turned into jersey fluff by Julian Alaphilippe on the top of the Tourmalet. Clara came from Barcelona to watch the Tour, cheer for her favorite rider, and cheekily propose holy matrimony to him via cardboard sign. \"I wanted him to read it quickly, because he is tired,\" she said. Did she think it would work? \"No, I don’t think so, but I have to try.\" Her first language is Spanish, she told me in English, and she wrote her sign in Dutch. Asked in French if she spoke Dutch, she said no, she had to work out the translation. \nAny given exchange at the Tour might involve this amount of translingualism. I have talked to Belgians in Spanish and Norwegians in English, and have tried and failed to talk to anyone in French, often resorting under duress to a dogmouthed combination of the three. Still, I have been surprised at how easy it's been to get around with only English and Spanish. The Tour itself is conducted in French and English, though obviously French takes precedence. Official communiques are issued first in French, race radio is mostly in French, and the English translations have a charming clunkiness.",
          "link": "https://defector.com/the-tour-de-france-is-for-the-polyglots-for-now",
          "publishedOn": "2025-07-22T16:02:13.000Z",
          "wordCount": 9470,
          "title": "The Tour de France Is For The Polyglots, For Now",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/tdf-crowd.jpeg"
        },
        {
          "id": "https://defector.com/?p=194229",
          "author": "Robert Rubsam",
          "description": "Craig Finn is the poet laureate of people who just can’t make it work. His songs are full of burnouts and failures, hard drinkers and rough sleepers, the lagging and the left behind. Their successes evaporate, and their mistakes linger. The narrator of “God in Chicago” has to move a baseball-sized package of heroin left behind by his dead friend Charlie. Every part of the deal—his unemployment, his busted car, the dealer who ruined his chance at college—reminds him of how poorly his life has gone. He makes the trip with Charlie’s sister, they sell the drugs, they get drunk and spend the night together. By the time they get home, she’s sobbing. There is no escape, no solution, no catharsis, and he knows it. “This isn’t the movies.”\nThis unsentimental compassion, with its humanistic care for those making wrong but necessary choices, is maybe my favorite thing about Finn’s music, but then there’s a lot to like. He’s been making music for more than 30 years with the bands Lifter Puller and the Hold Steady, and he’s been putting out a solo record every two or three years since 2012. Deploying a distinctly novelistic irony, he allows his listener to indulge alongside his characters, and then pulls back to survey the wreckage.",
          "link": "https://defector.com/craig-finn-can-write-a-great-song-but-can-he-write-a-good-short-story",
          "publishedOn": "2025-07-22T15:12:30.000Z",
          "wordCount": 10463,
          "title": "Craig Finn Can Write A Great Song, But Can He Write A Good Short Story?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1499095280.jpg"
        },
        {
          "id": "https://defector.com/?p=196233",
          "author": "Drew Magary",
          "description": "Some people are fans of the Tennessee Titans. But many, many more people are NOT fans of the Tennessee Titans. This 2025 Defector NFL team preview is for those in the latter group. Read all the previews so far here.\nYour team: The Tennessee Titans, who are currently attempting to prevent the Houston Texans from using Houston Oilers blue. Jesus Christ Titans, just go back to being the Oilers already. The Houston Oilers’ signature accomplishment, blowing a 35-3 lead in a playoff game, is still a better legacy than anything the “Titans” have “accomplished” in their quarter century-plus as an ongoing NFL concern. The only time the outside world pays attention to these slobs is when Tennessee wears Oilers throwbacks, and you know why? Because it helps them forget that the Titans exist. I’d rather wear a dead skin mask than a Titans jersey.",
          "link": "https://defector.com/why-your-team-sucks-2025-tennessee-titans",
          "publishedOn": "2025-07-22T13:01:49.000Z",
          "wordCount": 13395,
          "title": "Why Your Team Sucks 2025: Tennessee Titans",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2189046725.jpg"
        },
        {
          "id": "https://defector.com/?p=196281",
          "author": "Dave McKenna",
          "description": "Once upon a time, the world heavyweight champ was the most famous man on Earth. But other than hardcore fight fans, nobody can even pick Oleksandr Usyk out of a lineup. And he’s held the belt for nearly four years. But the spotlight could soon shine on the 38-year-old Ukrainian, who remained undefeated and retained his undisputed heavyweight title Saturday night in London with a beautifully brutal defeat of English challenger Daniel Dubois, \nUsyk to this point’s been seen as a fighter’s fighter, far more a technician than a bully. The boxing public prefers that artistry be left to little guys. Whoever wears the heavyweight belt has one job: to knock mofos out. Usyk moved from cruiserweight to heavyweight in 2019, and before this weekend had only knocked out one mofo since moving up. That came in August 2023 in Poland, when he stopped Dubois in a controversial bout tainted by a crucial referee’s decision in Usyk’s favor.",
          "link": "https://defector.com/heavyweight-champ-oleksander-usyk-finally-reveals-hes-a-bad-bad-man",
          "publishedOn": "2025-07-21T19:56:38.000Z",
          "wordCount": 9733,
          "title": "Heavyweight Champ Oleksandr Usyk Finally Reveals He’s A Bad, Bad Man",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2226041983.jpg"
        },
        {
          "id": "https://defector.com/?p=196275",
          "author": "Ray Ratto",
          "description": "For a moment, it almost looked like the current president of our kleptocracy was veering toward a good deed. Fortunately for every American who knows better than to ever get their hopes up regarding this kind of thing, he caught himself and swiftly tied that deed to something retrograde, smallminded, and cheap.\nFirst, Old Squatty said he would interject himself into the potential Washington area football stadium, and do so in a way that was unkind to the owners of the local football factory. As with everything else Trump does or says, it was inevitable that there would be a catch, or just an angle for graft. But in the broadest strokes, it could almost have passed for some fiscal responsibility from the least responsible rich guy of them all.",
          "link": "https://defector.com/donald-trump-is-trying-to-extort-the-washington-commanders-into-making-it-1989-again",
          "publishedOn": "2025-07-21T19:01:11.000Z",
          "wordCount": 10235,
          "title": "Donald Trump Is Trying To Extort The Washington Commanders Into Making It 1989 Again",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2225413799.jpg"
        },
        {
          "id": "https://defector.com/?p=196141",
          "author": "Patrick Redford",
          "description": "MONTPELLIER, France — Fifteen stages and two rest days into the Tour de France, the talk of the press room is not Tadej Pogacar rampaging towards his fourth yellow jersey, brave Kevin Vauquelin trying for an unlikely top-five finish, or Jonas Vingegaard's absurd time-trial helmet. The story that has everyone buzzing concerns events that happened 13 years ago. It is interesting in substance, though its form is the aspect that demands attention. What may seem at first blush like a straightforward story about someone breaking the rules in a different era of cycling is in fact a neat encapsulation of the fraught dynamics between power, media, and performance in cycling; the tension between cycling's dirty past and its supposedly clean present; and the necessity of squaring the two eras.\nThe story begins in Feb. 2019, when Austrian cross-country skier Johannes Dürr blew the whistle on a German physician named Mark Schmidt, accusing the latter of running a systematic blood doping ring. Schmidt had previously worked for the scandal-plagued Milram and Gerolsteiner cycling teams; in 2009 Austrian cyclist Bernard Kohl had accused him of running doping practices for those teams, though he didn't face any consequences until the Dürr revelations. The investigation came to be known as Operation Aderlass, German for \"bloodletting.\"",
          "link": "https://defector.com/an-anatomy-of-the-doping-story-that-has-the-tour-de-france-press-room-buzzing",
          "publishedOn": "2025-07-21T16:58:19.000Z",
          "wordCount": 13097,
          "title": "An Anatomy Of The Doping Story That Has The Tour de France Press Room Buzzing",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/tdfcars.jpeg"
        },
        {
          "id": "https://defector.com/?p=193799",
          "author": "Richard Staff",
          "description": "After Marcus Walden was called up by the Toronto Blue Jays in early 2014, nearly seven years after being drafted by the club, everything went more or less as you might expect for a big league promotion. For Father’s Day, Walden gifted his dad the first jersey he ever wore on a big league field; in his hometown of Fresno, Ca. his spot in history was solidified. “After 2014, when I came home, they put up a sign at my high school, number 67,” Walden told Defector. “And at my college they have a wall with every guy who made it to the big leagues out of Fresno [City College] and I was put up there.” This is how it is supposed to go, and the congratulations and honors that are supposed to be bestowed on a player whose dream is coming true. “It was great,” Walden said, “except the issue was I never played.”\nIn the history recognized by Major League Baseball through to the moment this story is published, 23,522 players have been called up to the highest level of play and participated in at least one game for their team. A little bit deeper in the annals of baseball history, unrecognized by Baseball-Reference, FanGraphs, or Major League Baseball itself are the hundreds of players who were called up to the majors, wore their team’s uniform, had their names written on the lineup card, brought their families to the stadium, and spent at least one full game as an active player on the roster. The one catch, in this case, is that these players were never put into a game before being sent back down to the minors. Because of this, their status as a major leaguer exists in an odd in-between, a limbo of conflicting emotions and almosts. These phantom ballplayers made it to the pinnacle of the sport, but not quite across the threshold.",
          "link": "https://defector.com/the-secret-brotherhood-of-the-phantom-ballplayers",
          "publishedOn": "2025-07-21T16:34:26.000Z",
          "wordCount": 14285,
          "title": "The Secret Brotherhood Of The Phantom Ballplayers",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-1227254725.jpg"
        },
        {
          "id": "https://defector.com/?p=196238",
          "author": "Chris Thompson",
          "description": "The thing that the New York Yankees are doing is not sign-stealing. For one thing, it is entirely independent of the communications of their opponents, which raises it entirely above the board, according to both the rules and the traditions of baseball. For another, professional baseball no longer has signs for the swiping. A team could theoretically hack the PitchCom—the Houston Astros probably have a whole secured campus of evil nerds working on this opportunity—but until someone finally figures out how to bug one of those little suckers it will remain impossible to intercept and decode the signals between a catcher and a pitcher. \nSign-stealing, among fans, was always considered a touchy, somewhat gray area of gamesmanship. Still, what the Yankees are doing would be considered at the honorable end of things even if it did involve decoding signals. They aren't being subtle about it at all: The guy on second base communicating the pitch selection to his teammate in the batter's box is doing everything short of holding up a gigantic poster. Against the Seattle Mariners, back on July 10, Trent Grisham and Cody Bellinger were gesturing so blatantly during New York's late comeback that a baseball non-knower might reasonably have deduced that they were doing aerobics out there. It was a delightfully elaborate system: First the runner on first base had to peek into the glove of Mariners reliever Andrés Muñoz and spot his grip, in the seconds before the pitch was thrown. They were on the lookout for sliders; when Muñoz's slider grip was identified, the runner on first had to then give a clear hand signal to the runner on second base, whose job was to relay this signal to the batter, in many cases as Muñoz was delivering the pitch. In order to pull it off, Grisham and then Bellinger resorted to what I think we can describe as an \"inflated tube man\" gesture, designed to be unmistakable for a batter whose attention is directed elsewhere.",
          "link": "https://defector.com/braves-coach-in-hot-water-over-battle-of-gestures",
          "publishedOn": "2025-07-21T15:49:54.000Z",
          "wordCount": 9454,
          "title": "Braves Coach In Hot Water Over Battle Of Gestures",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2152314818.jpg"
        },
        {
          "id": "https://defector.com/?p=196252",
          "author": "Tom Scocca",
          "description": "Donald Trump was good friends with the notorious sex trafficker Jeffrey Epstein for many years, the New York Times reported over the weekend, a friendship that included Trump hosting Epstein at \"raucous parties with cheerleaders and models.\" The Times wrote that one \"woman has said that Mr. Trump groped her when Mr. Epstein brought her to Trump Tower in Manhattan to meet him.\" Also: \"Another accuser recalled being eyed by Mr. Trump during a brief encounter in Mr. Epstein’s office, and claimed that Mr. Epstein had told Mr. Trump at the time that 'she’s not for you.'\"\nFurthermore, the Times wrote:",
          "link": "https://defector.com/collective-amnesia",
          "publishedOn": "2025-07-21T15:26:05.000Z",
          "wordCount": 12525,
          "title": "Collective Amnesia",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1192977807_6dea5b.jpg"
        },
        {
          "id": "https://defector.com/?p=196225",
          "author": "Maitreyi Anantharaman",
          "description": "Have you been counting down the days until our Monday crossword? This week’s puzzle was constructed by Daniel Hrynick and edited by Hoang-Kim Vu. Dan lives in Winnipeg, where he works as a laborer for Public Works. A commenter on his previous puzzle mentioned that they were disappointed that the clue for MOOG referenced the synthesizers and not Andy Moog. That comment was on his mind when he clued 1-Across in this puzzle.\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE. Note that our submissions are closed through July 31.",
          "link": "https://defector.com/the-crossword-july-21-one-by-one",
          "publishedOn": "2025-07-21T15:05:56.000Z",
          "wordCount": 5941,
          "title": "The Crossword, July 21: One By One",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2191687338.jpg"
        },
        {
          "id": "https://defector.com/?p=196200",
          "author": "Patrick Redford",
          "description": "CARCASSONNE, France — It is hard to know what is going on in the Tour de France, even if your job is to work on the Tour de France. The end of every stage includes a familiar ritual, with team employees and journalists gathering around phones and tablets, squinting into the harsh sunlight to try and figure out what the hell is happening. The team cars on the road are listening to race radio—which, as I learned yesterday, can be imprecise—or watching the race on their phones in the car; I have heard anecdotes about team car drivers getting info relayed to them by colleagues watching the broadcast from home. That information desert enfolds for the riders, too. This truth was most harshly embodied by former French darling Julian Alaphilippe on Stage 15 of the Tour de France.\nThe Tour de France's 15th stage was unremarkable. Everyone was tired from three big days in the Pyrenees, and with a rest day approaching before a Mont Ventoux summit finish, the stage was the most obvious breakaway day in the roadbook. Both Visma and UAE even had riders in the day's big break, as nobody had the energy to spend on chasing them through a hot day in Occitanie. UAE breakaway specialist Tim Wellens, free from a day of Tadej Pogacar duty, slipped away from a small group on a long stretch of rolling road 44 kilometers from the finish and soloed his way in to complete his trilogy of Grand Tour stage wins. Ninety seconds later, Victor Campenaerts crossed the line for second, and he was followed eight seconds later by a large group of breakaway survivors. Watching at the Intermarché bus, we joked about Astana doing a full lead-out to secure maximum UCI points for third, because while it's a result worth sprinting for, it's not one anyone will remember.",
          "link": "https://defector.com/julian-alaphilippe-loses-celebrates-and-learns-to-smile-about-it",
          "publishedOn": "2025-07-21T14:41:38.000Z",
          "wordCount": 9526,
          "title": "Julian Alaphilippe Loses, Celebrates, And Learns To Smile About It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2226148360.jpg"
        },
        {
          "id": "https://defector.com/?p=196218",
          "author": "Ray Ratto",
          "description": "Everything about the NFL Players Association sludgeslide seems so predestined and unavoidable. The usual predicament has been made worse by disgraced former union chief Lloyd Howell getting confused about what side he works for and former president J.C. Tretter misunderstanding how work stoppages are supposed to happen, but for as lurid and goofy as the details have been, and with all due respect to the innovation of holding four-figure team-building exercises at a strip club, none of it quite qualifies as surprising. In the broadest sense, this is just the sort of thing that conflicted and ineffective unions do.\nIf only life in the labor trenches was as easy as the WNBPA makes it seem. They figure out what they want in a negotiation, slap it on a T-shirt, and have every member wear one; at WNBA All-Star Weekend, that message read \"Pay Us What You Owe Us.\" The T-shirt is not the important part, though. The key here is the phrase \"every member.\"",
          "link": "https://defector.com/the-nfl-players-association-is-falling-apart-when-it-needs-solidarity-the-most",
          "publishedOn": "2025-07-21T13:11:47.000Z",
          "wordCount": 8639,
          "title": "The NFL Players Association Is Falling Apart When It Needs Solidarity The Most",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1409717996.jpg"
        },
        {
          "id": "https://defector.com/?p=196194",
          "author": "Rachelle Hampton",
          "description": "I can't remember exactly what I was thinking about when I first saw them. It was one of those summer days that was defined chiefly by its sprawl. I had spent the morning at the gym; every year my trainer holds a charity competition for his clients, and this year's was called Bench-A-Palooza. (Because I know our commentariat will ask: I went for reps and benched 95 pounds 14 times.) The ache in my arms hadn't set in yet, though that maybe had more to do with the drinks we'd all had afterwards, crowded onto wooden benches in the sunshine. I'd stayed longer than I'd planned to, and evening was approaching by the time I said my goodbyes and started my walk home with two of my best friends by my side. We meandered slowly, luxuriating in each other's presence. When our trio formed, we'd been young, and free enough to spend hours together every week. Now, these sorts of sidewalk chat were the norm: rarer, more precious.\nSo maybe that's what I was thinking about when I saw the Henri Rousseau prints, custom framed and matted as if they were waiting for me. Or maybe I was thinking about how empty my fridge was after two weeks of travel. Or how mad my cat Oliver would be because my sprawling, luxuriant summer day had left him without lunch. Whatever it was that I had been thinking left my head immediately upon seeing the prints; the jungle greens were rendered exuberantly enough to be recognizable from half a block away. I approached slowly, as surprised as the tiger that I'd later learn lends one of these paintings its name. Another of Rousseau's images came to mind, that of a woman and a lion in a moonlit desert. I have a miniature of that one stuck to my fridge.",
          "link": "https://defector.com/finding-henri-rousseau",
          "publishedOn": "2025-07-20T21:03:22.000Z",
          "wordCount": 8020,
          "title": "Finding Henri Rousseau",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/IMG_4339.jpg"
        },
        {
          "id": "https://defector.com/?p=196197",
          "author": "David Roth",
          "description": "Before the Mets' game against the Houston Astros on July 18, 1986, Tim Teufel passed out cigars in the team's locker room. The platoon second baseman was rejoining the team after staying behind in Connecticut to be with his wife while she gave birth to their first child. Teufel, who was by all accounts a stand-up guy, made for an odd cultural fit with a Mets team that would become legendary and was already renowned in that moment for high-intensity dirtbaggery; Jeff Pearlman's 2004 book about the team, The Bad Guys Won, revealed that Darryl Strawberry frequently bullied Teufel by calling him \"Richard Head\" until Teufel confronted him. \"There’s a breaking point to every person in their pride and character and who they are,\" Teufel told Pearlman. \"No man is going to just sit there and be a marshmallow.\" \nThat Friday night, Teufel went hitless in three plate appearances in a Mets loss. Later that Friday night, after closing time and a couple of hours into Saturday, Teufel was beaten up by a bunch of Houston police officers outside of a bar called Cooter's Executive Games And Burgers; Ron Darling, who pitched seven strong innings in that loss, was thrown through a plate-glass door by another member of Houston's police department, and two other Met Cooter's patrons, Bobby Ojeda and Rick Aguilera, were also arrested. That happened around two in the morning on Saturday the 19th, and the players were held for 11 hours before being released on bond. This was a long time ago. Darling is in his 25th year as a television analyst; the former Cooter's is now a TJ Maxx parking lot; it has been a decade since the son whose birth Teufel stayed behind to witness wrapped up his five-year minor league career. But another way to know how long ago it was is that the news that four Mets players had been booked after fighting the cops didn't break until the next day—Sunday July 20, 1986.",
          "link": "https://defector.com/39-years-ago-four-mets-fought-the-cops-at-a-houston-bar-named-cooters",
          "publishedOn": "2025-07-20T20:02:12.000Z",
          "wordCount": 10487,
          "title": "39 Years Ago, Four Mets Fought The Cops At A Houston Bar Named Cooter’s",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-515174832.jpg"
        },
        {
          "id": "https://defector.com/?p=196169",
          "author": "Patrick Redford",
          "description": "BAGNERES-DE-LUCHON, France — As we descend off the back of the Col du Tourmalet, a fan clasps her hands to her head, mouth gaping in disbelief at our speed. Markus Hoelgaard nearly overcooks a wet corner and unclips to stabilize his balance at the last second, with our car and two motos bearing down on him a scant few meters behind. Alexey Lutsenko raises his hand to signal a problem with his front wheel, we pull over on a negative-eight percent gradient, and Kevin Poret pops out of the back seat with a fresh wheel. I time his work from the front seat: 21 seconds.\nI spent the 2025 Tour de France's fourteenth stage inside the race, in the Shimano neutral service car. It's the closest I could have gotten to the racing without being on two wheels. A charming property of the Tour de France is that the closer you get to the action, the less of the race you'll see. Proximity has an inverse relationship with context. I wanted to see what it was like to have both, and to understand the work of the mechanics who are closer to the action than anyone. Luckily, I was able to do so on the hardest stage of the Tour's Pyrenean turn, a 182-kilometer beast with four categorized climbs, each of which has its own place in Tour de France lore.",
          "link": "https://defector.com/a-day-inside-the-tour-de-france-from-the-neutral-service-car",
          "publishedOn": "2025-07-20T13:49:44.000Z",
          "wordCount": 12012,
          "title": "A Day Inside The Tour de France From The Neutral Service Car",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2226022774.jpg"
        },
        {
          "id": "https://defector.com/?p=196096",
          "author": "Tom Ley",
          "description": "Did you just hear that loud noise? That was me banging the gavel on Bills Week. I'll do it again: Bang! Bills Week is now over.\nThanks for joining us during this year's theme week, and for your continued support of Defector. Catch up on any Bills Week posts you might have missed right here. And be sure to check out the exciting announcements we made this week, if you haven't already. Onward.",
          "link": "https://defector.com/its-no-longer-bills-week",
          "publishedOn": "2025-07-18T21:30:22.000Z",
          "wordCount": 5052,
          "title": "It’s No Longer Bills Week",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/Bills-Week-1.png"
        },
        {
          "id": "https://defector.com/?p=196079",
          "author": "David Roth",
          "description": "As he told the story, Bill Paxton came to the movies as a teenager more or less how all teenagers discover things: by being startled out of laziness by an urge and interest that they didn't expect. Paxton credited a challenging drama teacher at his Fort Worth high school for part of this, and the rest—the rest of the story, and a film career that unfolded over four decades, until Paxton's death at 61 in 2017—was a matter of chasing his urge to make something with his friends. Before he went to Hollywood, Paxton shot movies on Super 8 film with similarly film-obsessed Texas friends he met while studying abroad in England after high school. \"We made films because we liked to blow stuff up,\" Paxton told Texas Monthly in 1997.\nAt the time, he was promoting Traveller, the first movie Paxton had produced after what was already a long career that began with his father finding him work as a set-dresser on Encyclopaedia Britannica educational films, Paxton finding his way into the orbit of exploitation film maestro Roger Corman, and parlaying his jittery charisma into gradually bigger roles. By 1997, Paxton had already spent more than a decade poised somewhere between character actor and star. The friends with whom Paxton had snuck around railroad tracks and movie theaters two decades earlier had credits on Traveller, too.",
          "link": "https://defector.com/in-bill-paxtons-frailty-certainty-is-the-scariest-thing-there-is",
          "publishedOn": "2025-07-18T21:03:28.000Z",
          "wordCount": 8636,
          "title": "In Bill Paxton’s ‘Frailty,’ Certainty Is The Scariest Thing There Is",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-480932391_a624fe.jpg"
        },
        {
          "id": "https://defector.com/?p=196041",
          "author": "Lucy Bloom",
          "description": "Billie Marten's new record, Dog Eared, is a pretty major departure from her prior output. We do not hear a solo, cleanly produced acoustic guitar at any point on it. Our girl got an electric axe, a chorus pedal, a few more people, and did not look back. And I'm not judging! It's delightful. The record has the sound that tumbling down a flight of stairs in a Dr. Seuss book might have. It wants to maximize the whimsy found in its sadness, which requires a rather particular mindset. While the sound is quite different, Marten's writing typically conveys a loneliness that can rend your soul. Some people make music for being in bed with someone else. She makes music for being in bed all by yourself.\nBack to me. The woman who introduced me to Billie Marten some years back did so while we were theoretically sharing a bed, though in hindsight I think I may have just been a way to get out of the house for her. She was living with her ex-boyfriend and his parents, but claimed to have seen the light and realized she was a lesbian. She told me (unprompted) that she wasn't ready to start a new relationship until she moved out of the house of the old one. Then she hit me up out of the blue a few months down the line to alert me that she was now dating another man. I wish I could say that shit like this still fucked me up, but it doesn't really—not because I think being used to this sort of thing is bad or a sign of the times, but just because I really enjoy getting in my feelings every now and again.",
          "link": "https://defector.com/billie-martens-music-makes-loneliness-a-thrill",
          "publishedOn": "2025-07-18T20:49:42.000Z",
          "wordCount": 7384,
          "title": "Billie Marten’s Music Makes Loneliness A Thrill",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-18412860831.jpg"
        },
        {
          "id": "https://defector.com/?p=196120",
          "author": "Brandy Jensen",
          "description": "Perhaps the highest praise I can offer a book that took 27 years to complete and runs over 1,000 pages is that I can see why, and that it doesn’t feel like it. Sam Tanenhaus’s extremely long and anxiously awaited biography of the man who founded National Review, and is often regarded as the architect of modern American conservatism, arrived with a resounding thud on my doorstep. There is no way that a book the size of Buckley: The Life and The Revolution that Changed America could arrive quietly. It is, in many ways, a remarkable accomplishment: exhaustive but not tiring, serious yet lively, both affectionate and suspicious. It is almost dizzyingly populated with recognizable characters—the result of Buckley’s famed and enormous social influence—which offers regular satisfaction both to readers who like knowing what Sylvia Plath thought of the Buckley family home, and ones who yearn to learn more about cranky Viennese ex-Leninists. Most of all, Buckley is very clearly the result of slow thinking and methodical research, which makes it precisely the sort of work that its subject could never produce. \nWilliam F. Buckley Jr. went for quantity instead. He wrote dozens of books, including non-fiction and a bestselling series of spy novels, both of which were mainly dashed off while on skiing vacations in Gstaad. He also produced three columns a week for decades, generated prodigious written correspondence, and appeared in 1,504 episodes of Firing Line, all while editing the magazine and accepting regular speaking gigs. For years, Buckley promised to write a serious work of political theory—he managed to produce thousands of words railing against his liberal enemies, but was ultimately thwarted by his inability to offer a coherent elaboration of what conservatives were really about.",
          "link": "https://defector.com/william-f-buckleys-bill-never-came-due",
          "publishedOn": "2025-07-18T19:31:18.000Z",
          "wordCount": 11563,
          "title": "William F. Buckley’s Bill Never Came Due",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/BillBuckley.jpg"
        },
        {
          "id": "https://defector.com/?p=196106",
          "author": "Dave McKenna",
          "description": "Liam Gallagher won out over Liam MacCarthy. And so the All-Ireland hurling final, traditionally a fall classic, will be played this weekend at Croke Park in Dublin, as the hallowed Dublin stadium gears up for Oasis reunion shows. \nBut seasonal shift or no, Cork vs. Tipperary promises to be a supernova of a tilt, and the toughest ticket in town, notwithstanding the upcoming concerts from the reunited Manchester band, led by Liam and Noel Gallagher. This is a mashup of historic hurling powerhouses.",
          "link": "https://defector.com/its-liams-week-in-ireland",
          "publishedOn": "2025-07-18T18:59:51.000Z",
          "wordCount": 7737,
          "title": "It’s Liams Week In Ireland",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2223603364.jpg"
        },
        {
          "id": "https://defector.com/?p=196086",
          "author": "Israel Daramola",
          "description": "After a month of controversy, Lloyd Howell Jr. resigned from his post as the NFL Players Association executive director on Thursday night, effective immediately. “It’s clear that my leadership has become a distraction to the important work the NFLPA advances every day,” Howell wrote in a statement announcing his decision. “I hope this will allow the NFLPA to maintain its focus on its player members ahead of the upcoming season.”\n\nhttps://twitter.com/NFLPA/status/1946037991035613238?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1946037991035613238%7Ctwgr%5Ef02c3db0e23267b55144cb4a17ab3cd5d060ec01%7Ctwcon%5Es1_c10&ref_url=https%3A%2F%2Fwww.nytimes.com%2Fathletic%2F6501428%2F2025%2F07%2F17%2Fnfl-nflpa-union-lloyd-howell-steps-down%2F",
          "link": "https://defector.com/bills-players-among-many-in-need-of-new-union-head",
          "publishedOn": "2025-07-18T18:19:17.000Z",
          "wordCount": 5839,
          "title": "Bills Players Among Many In Need Of New Union Head",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2197819465_75c10f.jpg"
        },
        {
          "id": "https://defector.com/?p=196040",
          "author": "Chris Thompson",
          "description": "Bill Belichick, aging boyfriend to emerging media mogul Jordon Hudson, will be the subject of an upcoming Hulu docuseries, per reporting by Front Office Sports.\nBack in March, HBO, NFL Films, and the University of North Carolina were working out a deal to make Belichick's Tar Heels football team the focus of a season of the Hard Knocks series. That deal reportedly fell through very late in the process, with Belichick insisting, unconvincingly, that there was never much mutual interest. \"The Hard Knocks thing, you know, like, just for the record, Hard Knocks is training camp,” Belichick told The Pivot Podcast, in May. “And we’re not training camp. We’re just not. That’s not what we are. You know, the drama of training camp, the who’s gonna cut and all that. Like, we’re a season, and they don’t want that.\" The New York Times reported days later that NFL Films kiboshed the deal not over anything having to do with the inherent drama of training camp, but because Hudson—who at 24 years old is less than a third the age of her doddering old lover—demanded content approval and \"partial ownership of the show.\"",
          "link": "https://defector.com/just-what-you-wanted-a-bill-belichick-tv-show",
          "publishedOn": "2025-07-18T17:53:27.000Z",
          "wordCount": 6327,
          "title": "Just What You Wanted: A Bill Belichick TV Show",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/bill-holes-4-1.jpg"
        },
        {
          "id": "https://defector.com/?p=195806",
          "author": "Maitreyi Anantharaman",
          "description": "What I knew of the eccentric baseball owner Bill Veeck, I knew only from stray web searches at White Sox games. What was a shower stall doing on the concourse? What are those pinwheel things above the scoreboard? While the trainer came out to check on Yoan Moncada or the pitching coach asked Michael Kopech to throw strikes, the answers to these questions were easy to find, read, and forget. Usually the research never went much further; my curiosity is no match for bad ballpark WiFi and dwindling phone battery. And usually, Michael Kopech continued to not throw strikes.\nLast summer, Veeck popped up on my phone again for a different reason. On a slow news day in Chicago, he was the subject of a heated sports talk radio rant: The just-hired White Sox play-by-play guy had mispronounced his name.",
          "link": "https://defector.com/bill-veeck-goofy-gag-filled-baseball-book-was-ahead-of-its-time",
          "publishedOn": "2025-07-18T17:21:12.000Z",
          "wordCount": 11863,
          "title": "Bill Veeck’s Goofy, Gag-Filled Baseball Book Was Ahead Of Its Time",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/veeck_png.jpg"
        },
        {
          "id": "https://defector.com/?p=196015",
          "author": "Luis Paez-Pumar",
          "description": "While watching the Euros quarterfinal between Sweden and England with an eye toward covering it, I kept changing my mind on what to write about. This is a side effect of my job and my brain, both of which combine to help me begin to see narratives as soccer matches burn through their allotted time. Some matches are straightforward in this way: One team controls the game and takes the win, and isn't that just the most boring thing to write about? Others, though, rocket between extremes, making it almost impossible to pre-write, even in my mind, what I'm going to take away from a match. Those are fun, I enjoy the challenge. There is, however, a third kind of match, unique to knockout soccer, in which penalty kicks arrive and suddenly, everything I had thought over 120 minutes of play gets thrown out the window, and all you are left with is picking up the pieces of a shootout. Sweden-England was, unequivocally, that third type of match.\n\nhttps://www.youtube.com/watch?v=iBKz8GPFj44",
          "link": "https://defector.com/atrocious-england-sweden-penalty-shootout-has-wild-bill-hickok-turning-over-in-his-grave",
          "publishedOn": "2025-07-18T16:37:04.000Z",
          "wordCount": 11007,
          "title": "Atrocious England-Sweden Penalty Shootout Has Wild Bill Hickok Turning Over In His Grave",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2225778508.png"
        },
        {
          "id": "https://defector.com/?p=195937",
          "author": "Kathryn Xu",
          "description": "I do not usually have a fear that my friends will change, in whatever facets they may. Change is just an inevitable, wonderful part of getting older. There is, however, one exception: I have recently developed a fear that my friend Will, whom I have known since middle school, will eventually become a Bill, and as such, I will have to refer to my friend Will as \"Bill.\" This fear has led me to realize that I don't know much about the machinations of the William Nickname League.\nMy family only ever uses my English name in the third person, so any nicknames on Kathryn in my life have arisen out of some sort of contrivance with my friends. As a side effect, you can figure out when and how someone came to know me by how they refer to me. Will, like Kate or Joe, can be a given name but generally is a nickname—specifically a hypocoristic, a shortened form without a diminutive suffix (-ie or y or whatever). How does one become a Will from, presumably, William? (I think about names a normal amount.)",
          "link": "https://defector.com/will-a-will-ever-become-a-bill",
          "publishedOn": "2025-07-18T16:06:00.000Z",
          "wordCount": 7500,
          "title": "Will A Will Ever Become A Bill?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/hickock.jpeg"
        },
        {
          "id": "https://defector.com/?p=195470",
          "author": "Lucy Bloom",
          "description": "Before Bill Nye was a Science Guy, he was the pride of Seattle. Shit, he was Seattle, in many senses. He worked as an engineer for Boeing, yet harbored delusions of grandeur—first of being an astronaut despite not being a deranged military test pilot, and later, even more embarrassingly, of being a successful comedian. In 1986, he met John Keister after an open mic, which would lead to his first television role. Almost Live. Almost Live! was a Seattle-area sketch comedy show which would air either directly before or after SNL. It really can't be overstated how big of a deal Almost Live! was in Seattle. You talk to anyone in the area over a certain age, and they have a favorite bit.\nI'm a little too young to remember watching Almost Live! live, but I do still have a favorite. \"COPS in [Seattle neighborhood]\" was a recurring sketch lampooning the show COPS and Seattle, but it is also a near-perfect time capsule. Here is \"COPS in Wallingford,\" with Keister patrolling the neighborhood that neighbors the university and was the home of many of the town's artsier types:",
          "link": "https://defector.com/bill-nye-isnt-fun-anymore",
          "publishedOn": "2025-07-18T15:48:18.000Z",
          "wordCount": 9755,
          "title": "Bill Nye Isn’t Fun Anymore",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-22121336821.jpg"
        },
        {
          "id": "https://defector.com/?p=195828",
          "author": "Patrick Redford",
          "description": "HAUTACAM, France — \"Fuck, what a shit birthday,\" Laurence Pithie gasps. The Kiwi rider from Red Bull has just summited the Hautacam, a winding, rolling, and, today, infernally hot Pyrenean climb that takes roughly 40 minutes. A better verb for what he did might be survived, as he finished 63rd, more than 31 minutes behind the winner, and he is currently stuffing his jersey full of ice. I ask him how old he is turning (23) and wish him a happy birthday. In response I receive the most venomous \"Thank you\" of my life.\n\"Shit birthday\" is a great, punchy descriptor for 2025 Tour de France's first climbing day: a party that drives you mad. The gathered thousands love it; the riders, not as much. As we'd threaded our way up the Hautacam amid clueless fans riding their bikes as if trying to get squished, children screamed at us and dirtbag French guys squirted water into my open window. My comrades and I are denied turns on a luge ride reserved for VIPs. Riders cross the finish line excreting and then gulping various salts and are swarmed by TV cameras. Jonas Vingegaard nearly runs me over seconds after finishing. Emmanuel Macron has flown to the top of the Hautacam in a helicopter.",
          "link": "https://defector.com/feral-belgians-superfan-gendarmes-and-tattered-cyclists-at-the-tour-de-frances-first-summit-finish",
          "publishedOn": "2025-07-18T15:06:07.000Z",
          "wordCount": 11935,
          "title": "Feral Belgians, Superfan Gendarmes, And Tattered Cyclists At The Tour de France’s First Summit Finish",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/hautacam1.jpeg"
        },
        {
          "id": "https://defector.com/?p=195381",
          "author": "David Roth",
          "description": "At the beginning of every baseball career, everyone is pretty much guessing. From a certain perspective, the work of that career amounts to generating enough information—filling out the back of a baseball card, coloring in a Savant page, being transacted upon in the ways that baseball players are—that it can all be evaluated in the end. That is not my perspective, personally, but it is very much a purpose that baseball has served for some of those who are served in some way or another by caring about the game. A career is a career, it's a life in the sport, but it is also both an accumulation of evidence and a story told all the way through to a conclusion. They all end, and a striking number of the illustrious ones end in the same way as the more prosaic ones, with one or two or three last thwarted tries to see if that's really everything there was to find or know.\nBut at the beginning, no one knows very much at all. Teams drafting or signing amateur players do so based on information that, for all the ways in which the process has been smoothed and sharpened by technology over time, is necessarily incomplete. The statistics don't really mean very much; potential Major Leaguers are sufficiently different from the people they play baseball against even in college that their statistics often wind up so outsized that they're impossible to parse. This can be as true for a high school player who hits .575 against other teenagers who will never play another meaningful baseball game in their lives as it is for an SEC pitcher who gets drafted despite putting up an ERA in the mid-sevens. Teams, or anyway smarter and more ambitious teams, tune the numbers out, or just down. The other stuff is what matters.",
          "link": "https://defector.com/bill-hall-put-it-together",
          "publishedOn": "2025-07-18T13:49:23.000Z",
          "wordCount": 9536,
          "title": "Bill Hall Put It Together",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-86085103.jpg"
        },
        {
          "id": "https://defector.com/?p=195889",
          "author": "Tom Ley",
          "description": "You may have once again noticed that a lot of people on TV, the internet, and in your real life are talking about files. The Epstein files. They want them released! They want Donald Trump in jail! They want to know what the hell is going on! Seriously, though, what the hell is going on?\nAs Defector's chief file-explainer, I am here to once again tell you all you need to know about the latest files.",
          "link": "https://defector.com/what-are-the-epstein-files-and-how-much-should-you-care-about-them",
          "publishedOn": "2025-07-18T13:06:15.000Z",
          "wordCount": 14388,
          "title": "What Are The Epstein Files, And How Much Should You Care About Them?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/EpsteinClinton.jpg"
        },
        {
          "id": "https://defector.com/?p=195931",
          "author": "Giri Nathan",
          "description": "On Wednesday, the Phoenix Suns agreed to a buyout of Bradley Beal's contract, ending a putrid era that amounted to very little. The team traded for Beal in the summer of 2023 to play alongside Kevin Durant, who was traded to Houston in June, and Devin Booker, the last one standing, having just signed an extension in Phoenix. Their skillsets were redundant, their chemistry depressing, and, despite their three salaries adding up to 107 percent of the salary cap in the 2024-25 season, they never won a single playoff game together.\nBeal had reportedly been unhappy in Phoenix for a long time; since-fired coach Mike Budenholzer even yanked the guard out of the starting lineup for six weeks. But Beal's contract had a no-trade clause, narrowing the Suns' options for offloading him. The solution: a gigantic buyout. Per The Athletic, Beal was owed $110.8 million over the remaining two years of his contract. He agreed to forgo $13.8 million of it, and will see the remaining $97 million stretched over the next five seasons. Beal's agent Mark Bartelstein told ESPN that he took \"intense conversations\" to pull off the buyout; it's worth remembering that he was negotiating against his son Josh, who is the CEO of the Suns.",
          "link": "https://defector.com/the-aimless-suns-settle-bradley-beals-bill",
          "publishedOn": "2025-07-17T18:46:38.000Z",
          "wordCount": 6823,
          "title": "The Aimless Suns Settle Bradley Beal’s Bill",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2209840061.jpg"
        },
        {
          "id": "https://defector.com/?p=195867",
          "author": "David Roth",
          "description": "There was a moment, near the end of my week-plus in Maine, when I could actually feel myself Becoming Normal again. The combination of relatively healthy activities, reduced screen-time, and a spike in omega-3 fatty acids due to increased seafood intake chipped some of the barnacles off my brain; detaching from the news cycle to some extent did the rest. I mention this not just to tell you how my vacation went, but because it was in listening to this episode that I realized how fleeting that moment truly was. We're back.",
          "link": "https://defector.com/the-hazards-of-bob-nutting-mindset-with-justin-halpern",
          "publishedOn": "2025-07-17T18:31:26.000Z",
          "wordCount": 7254,
          "title": "The Hazards Of Bob Nutting Mindset, With Justin Halpern",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2174392067.jpg"
        },
        {
          "id": "https://defector.com/?p=195691",
          "author": "Barry Petchesky",
          "description": "There are only two pieces of media that have made me wistful for a small-town/suburban childhood I didn't have: A Christmas Story, and Calvin And Hobbes. Before you accuse me of specifically longing for the tract housing of Ohio, if I interrogate this a little further it turns out that what I really wanted was a yard. Because I wanted to shoot a BB gun at imaginary bandits like Ralphie did, and, like Calvin, I wanted to build demented snowmen.\nBill Watterson knew, or at least captured better than anyone, the private derangement of the average 6-year-old boy. Imagination is one thing: Monsters lived under the bed, dinosaurs roamed the Earth, teachers were misshapen alien monsters in disguise, Tracer Bullet charges $50 per day plus expenses. But somewhere beyond those fairly standard fantasy worlds lies the grisly id of the artist, and the snow is his canvas.",
          "link": "https://defector.com/calvin-and-hobbess-gruesome-snowmen-were-a-world-all-their-own",
          "publishedOn": "2025-07-17T17:14:21.000Z",
          "wordCount": 8784,
          "title": "Calvin And Hobbes’s Gruesome Snowmen Were A World All Their Own",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1477489801.jpg"
        },
        {
          "id": "https://defector.com/?p=195570",
          "author": "Sabrina Imbler",
          "description": "In 2019, Victor Ortega Jiménez was visiting the Atlanta zoo with his family when he became mesmerized by a flock of Chilean flamingos. The flamingos were feeding, their long necks squiggled into the water and flat feet stomping in a kind of dance. Ortega Jiménez noticed the flamingo heads produced capillary waves, concentric ripples on the water's surface. \"What is happening inside of the water?\" he wondered.",
          "link": "https://defector.com/why-do-flamingos-eat-so-weird",
          "publishedOn": "2025-07-17T16:39:09.000Z",
          "wordCount": 9090,
          "title": "Why Do Flamingos Eat So Weird?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/ChileanFlamingo2_creditsVictorMOrtegaJimenezD1.jpg"
        },
        {
          "id": "https://defector.com/?p=195825",
          "author": "Lauren Theisen",
          "description": "For Bill Guerin, who's been GM of the Minnesota Wild since 2019, the beginning of this month must have felt like finally taking off an extremely tight pair of pants after a very long day. As a consequence of the team buying out both Zach Parise and Ryan Suter, they were stifled by three years of salary cap weight totaling over $10 million annually. That burden severely limited the Wild's ability to build around superstar winger Kirill Kaprizov, particularly in a 2023–24 campaign where his 46 goals went to waste without even a playoff appearance. Now, however, the impact of the Parise and Suter contracts is negligible on Minnesota's finances, so Guerin is free to do deals without those 30x30 skinny jeans crushing his waist. The results? Well, actually, not that much so far.\nThe one thing you need to know, if you want to know anything about the Minnesota Wild, is that they are the most \"slightly above average\" franchise in the history of the NHL. Dating back to 2013, they have missed the postseason only twice. But in that time, they have won exactly two playoff series, and none since 2015. Their regular seasons are usually pretty solid, but time and again they get walloped in a best-of-seven. By the time trophies are being polished, nobody anywhere is thinking about the Wild.",
          "link": "https://defector.com/the-wilds-offseason-has-been-pretty-tame",
          "publishedOn": "2025-07-17T16:10:00.000Z",
          "wordCount": 7404,
          "title": "The Wild’s Offseason Has Been Pretty Tame",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-13304130521.jpg"
        },
        {
          "id": "https://defector.com/?p=195534",
          "author": "Israel Daramola",
          "description": "Let's face it, we have been living through a pop cultural age—particularly in cinema—made in Quentin Tarantino's image. Before Marvel, before George Lucas sold Star Wars to Disney, Tarantino made nerd culture mainstream, showing that a movie- and culture-obsessed kid could bring that obsession to life in their own art, to great success.\nTarantino wasn't the only one, of course. He was part of a generation of auteurs who were the right age to have grown up watching TV their whole lives, who made post-modernist art that seemed to be just as much a commentary on the things they consumed as they were new and unique works in their own right. Tarantino was just the first one to hit the jackpot, emerging in the early '90s with a showy directorial debut Reservoir Dogs and two buzzy scripts eventually adapted by big-name filmmakers Tony Scott and Oliver Stone. Then in 1994 he cemented his place at the front of this new wave with Pulp Fiction, one of the finest independent films of the decade, a cultural earthquake that is still felt to this day.",
          "link": "https://defector.com/how-kill-bill-changed-the-action-blockbuster",
          "publishedOn": "2025-07-17T15:45:42.000Z",
          "wordCount": 10754,
          "title": "How ‘Kill Bill’ Changed The Action Blockbuster",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/AAAABUpPogGMpXf1Uylknch49JzYJTrH-HZJhIa7SlTSVfBV9Ao7zx4h3eXfrX49XBOkUY1f4uADMCakQG9GaQy8Cb7ERO0FWw7Aebx8.jpg"
        },
        {
          "id": "https://defector.com/?p=195493",
          "author": "Phillip Maciak",
          "description": "This post was originally published on the author's Substack on June 24. It has been republished here in conjunction with Bills Week. \nEverybody knows about the MAGA hat. It’s red. It says what it says on it. The content of the MAGA hat is obvious. It’s a team hat, a cult uniform, a panting, sniveling dare for you to say something about it. It is, for better or worse, iconic at this point, the single image or object that exemplifies this movement, the illustration that will appear in future history books so long as Elon Musk hasn’t had Grok “rewrite the entire corpus of human knowledge” by then. But its iconicity is not just limited to its color and its catchphrase. The FORM of this hat matters, in part because it’s such a telling one.",
          "link": "https://defector.com/cultural-capitulation",
          "publishedOn": "2025-07-17T15:19:25.000Z",
          "wordCount": 10558,
          "title": "Cultural Capitulation",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2221647538.jpg"
        },
        {
          "id": "https://defector.com/?p=195882",
          "author": "Lauren Theisen",
          "description": "You oughta know by now: This is Defector Music Club, where a number of our writers get together to dish about an album. Today, in honor of Bills Week, Dave McKenna, David Roth, and Lauren Theisen debate Billy Joel's 1977 smash The Stranger.\nMcKenna: Stunning how few rock and roll Bills are out there! But Lauren’s suggestion that we take up Billy Joel and The Stranger took me back. Everything takes me back at this age, sure, but this record hit the bins at the end of the Summer of 1977, which I spent with my cousins in Astoria, Queens, when my feelings for Billy Joel were their fondest. I was into guitars and dirtball rock. The only keyboard guys I gave my time to were bombastic longhair prog rockers with walls of organs and synths, like Rick Wakeman of Yes or Keith Emerson of Emerson, Lake and Palmer. (This nostalgia wave got me to dig out the Yes belt buckle I bought on Steinway Street in Astoria for $5 that summer.)",
          "link": "https://defector.com/you-should-never-argue-with-a-crazy-m-m-music-club",
          "publishedOn": "2025-07-17T14:27:03.000Z",
          "wordCount": 12746,
          "title": "You Should Never Argue With A Crazy M-M-Music Club",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-5766254461.jpg"
        },
        {
          "id": "https://defector.com/?p=195592",
          "author": "Billy Haisley",
          "description": "To call it a \"pleasant surprise\" wouldn't quite be right. As someone with an abiding interest in the colorful names and nicknames of Brazilian athletes—my all-time favorite remains that of Leandro Matos Souza, who went by \"Gatorade\"—I had a hunch that a particular theme week–inspired Google search would turn up the result I was hoping for. So, while certainly pleasant, it was hardly surprising that typing \"bill footballer\" into my search bar brought me to not one, but two mononymous Brazilian Bills.\nThough I'm sure the player Wikipedia designates \"Bill (footballer, 1999)\" has an interesting story of his own, today we are going to focus on the life and times of one Rosimar Amâncio, the better known of the two Bills. Our chosen Bill is a 41-year-old striker who has traversed the globe in one of those far-flung journeyman careers that are pretty unique to a certain class of Brazilian player. Brazil not only produces more professional-caliber soccer players than any other country, but the nationality itself, with its redolence of jogo bonito and World Cup wins and flashy tricks and Pelé and Romário and Ronaldinho and Neymar and the like, means that the Brazilian player is highly coveted globally both for what they can do and for what they represent. Couple that with the Brazilian economy, which is relatively advanced but nevertheless struggles to provide a comfortable living for its entire population, and you can understand why it's so common to find a handful of Portuguese names on the rosters of tertiary soccer leagues the world over.",
          "link": "https://defector.com/the-inspiring-soccer-odyssey-of-the-man-they-call-bill",
          "publishedOn": "2025-07-17T13:56:04.000Z",
          "wordCount": 11242,
          "title": "The Inspiring Soccer Odyssey Of The Man They Call Bill",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1238237416.jpg"
        },
        {
          "id": "https://defector.com/?p=195785",
          "author": "Victoria Zeller",
          "description": "The Buffalo Bills of my childhood are not the Buffalo Bills I live with now. They are certainly not the Buffalo Bills I’ve written about before on this website.\nIt’s weird to think about in retrospect. The Bills went from clockwork ineptitude to clockwork competence with only a handful of transition years in the middle, from the team I finally saw suit up for a playoff game when I was 19 years old to the team that has won five division titles in a row. From the basement to the top of the league.",
          "link": "https://defector.com/lets-remember-some-bills",
          "publishedOn": "2025-07-17T13:01:06.000Z",
          "wordCount": 14488,
          "title": "Let’s Remember Some Bills",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-455454810.jpg"
        },
        {
          "id": "https://defector.com/?p=195791",
          "author": "Defector Staff",
          "description": "Keen observers of the independent media space might be aware that we at Defector have done some informal consulting over the years to help other emerging worker-owned publications find their footing. Without overstating our contributions to their efforts—generally we’re providing just an hour or two on the phone, and a couple email responses—we always find […]",
          "link": "https://defector.com/we-won-a-grant",
          "publishedOn": "2025-07-16T18:38:58.000Z",
          "wordCount": 5679,
          "title": "We Won A Grant",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/Press_Forward_Logo_Stacked_Blue.png"
        },
        {
          "id": "https://defector.com/?p=195796",
          "author": "Patrick Redford",
          "description": "TOULOUSE, France — They were going to make it. After working with three riders all day, staving off the pursuit of five others, and eventually holding off the determined charge of a former world champion, Uno-X's Jonas Abrahamsen and Jayco's Mauro Schmid rode into Toulouse together to contest Stage 11 of the Tour de France. One of them was going to earn their first career Tour de France stage win. The other would leave with nothing. All I knew as I saw the pair wind up for the sprint was: I was going to talk to the loser.\nBreakaways succeed only rarely and only for reasons that are legible in retrospect. You need to be a strong rider to win from a breakaway, but more than that you need to be a good gambler, which is code for: blessed by divine providence. Moves off the front of a race only succeed when the strongest teams decide against expending the energy necessary to chase them down or, in quite rare cases, do some gambling of their own and leave the chasing too late. Chasing everything down is usually worth the best teams' while, so many breaks are by their nature doomed. That makes the ones that work extra precious.",
          "link": "https://defector.com/what-its-like-to-lose-from-the-winning-move",
          "publishedOn": "2025-07-16T18:20:01.000Z",
          "wordCount": 9235,
          "title": "What It’s Like To Lose From The Winning Move",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/abrahamsenschmid.jpeg"
        },
        {
          "id": "https://defector.com/?p=195767",
          "author": "Albert Burneko",
          "description": "Here at Defector we are laser focused on serving readers Bill and everything related to Bill. At first I had a hard time with this mandate—I could not think of anything \"newsy\" related to Bill—until I remembered that in the 1979 television miniseries Salem's Lot there is a scene in which a guy yells \"Bill!\" a bunch of times. What could be more salient to the interests of Defector readers than that, I ask you—nothing!\n\nhttps://www.youtube.com/watch?v=hc_mUIkiDX4",
          "link": "https://defector.com/bill",
          "publishedOn": "2025-07-16T17:17:26.000Z",
          "wordCount": 9646,
          "title": "Bill!",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/bill2.jpeg"
        },
        {
          "id": "https://defector.com/?p=195781",
          "author": "Ray Ratto",
          "description": "Nobody does self-loathing quite like baseball, so it comes as little surprise that its governing body has yet again veered away fearfully yet violently from its essential product, so it can avoid doing more of the thing it purports to celebrate. There is nothing sacred about the All-Star Game, and nothing really to mourn about the fact that a game that was tied after nine innings didn’t proceed to the tenth. But the fact remains that the Most Valuable Player in Tuesday night's exhibition officially went 0-for-2 with a walk during that game, and that the box score does not in any way reflect the only thing about that game that people are discussing today.\nIndeed, that very box score reflects the historical, artistic and essentially pastoral nature of the same with these famous and memory-invoking stars:",
          "link": "https://defector.com/the-all-star-games-confusing-ending-fit-the-bill-for-a-confused-league",
          "publishedOn": "2025-07-16T16:56:40.000Z",
          "wordCount": 8550,
          "title": "The All-Star Game’s Confusing Ending Fit The Bill For A Confused League",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2224660049.jpg"
        },
        {
          "id": "https://defector.com/?p=195473",
          "author": "Defector Staff",
          "description": "We are forced once again to interrupt Bills Week in order to bring an important matter to your attention: Defector is adding the Nothing But Respect basketball podcast to its robust and ever-growing portfolio of media offerings. For those of you who are not familiar with Nothing But Respect, it is a weekly basketball podcast […]",
          "link": "https://defector.com/in-paradigm-shifting-business-maneuver-defector-acquires-basketball-podcast",
          "publishedOn": "2025-07-16T16:35:40.000Z",
          "wordCount": 5691,
          "title": "In Paradigm-Shifting Business Maneuver, Defector Acquires Basketball Podcast",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/nbrring.png"
        },
        {
          "id": "https://defector.com/?p=195765",
          "author": "Drew Magary",
          "description": "The Buffalo Bills open training camp a week from today and running back James Cook isn’t happy. A year ago, Cook flourished when new offensive coordinator Joe Brady introduced the team to the concept of handing the ball off. Now Cook would like to be compensated for his services before he falls off the running back cliff, just as his brother Dalvin did in 2023. James Cook is no dummy. He wants his money while he can still get it.\nFor other teams, this would be fairly garden-variety standoff that results in a camp hold-in before both sides agree to a deal sometime in August. But this is Buffalo, where any ripple in the waves causes Bills fan to have Bills fan thoughts. You never want to have Bills fan thoughts. A minor contract dispute with the RB1 begets thoughts about the rest of the team’s backfield depth, which begets thoughts about Josh Allen running the ball himself far too often, which begets thoughts about the passing game, which begets DEAR CHRIST WILL WE EVER WIN A SUPER BOWL OR DID I STICK AROUND THIS FROZEN WASTELAND MY WHOLE LIFE FOR NOTHING?",
          "link": "https://defector.com/who-the-fuck-is-josh-allen-gonna-give-the-ball-to",
          "publishedOn": "2025-07-16T16:20:47.000Z",
          "wordCount": null,
          "title": "Who The Fuck Is Josh Allen Gonna Give The Ball To?",
          "imageUrl": null
        },
        {
          "id": "https://defector.com/?p=195485",
          "author": "Luis Paez-Pumar",
          "description": "For a series with little by way of story, it's impressive how many iconic non-player characters Pokémon has spawned. There is of course Professor Oak, who sets the player on their path to be a master trainer in the original games, as well as Brock and Misty, gym leaders who grew to be fan favorites in the anime series. And who can forget Blue a.k.a. Gary, the rapscallion first rival in Generation One? These are just a few of the endearing NPCs who have left a mark on both the series and popular culture across the series' nine generations of games. (There's also Hop, from Generation Eight, who is very annoying.) However, my favorite NPC is also, in my opinion, the most helpful: Bill, the Pokémon Maniac from Red, Blue, and Yellow.\nWhen the player first meets Bill at his house at the Cerulean Cape, near the second gym, he is not human. Bill, a Pokémon obsessive who is also something of a mad scientist, has seen a Pokémon teleportation experiment of his backfire, which has physically combined him with one. The player helps get Bill fixed up, and it's all cute and silly. What is not silly is what Bill does for the player, giving them access to the Pokémon storage system, afterwards known as \"Bill's PC.\"",
          "link": "https://defector.com/an-ode-to-bill-the-pokemon-maniac",
          "publishedOn": "2025-07-16T15:48:29.000Z",
          "wordCount": null,
          "title": "An Ode To Bill, The Pokémon Maniac",
          "imageUrl": null
        },
        {
          "id": "https://defector.com/?p=195308",
          "author": "Alex Sujong Laughlin",
          "description": "We interrupt Bills Week to bring you some good news: Defector is launching two new podcasts in partnership with Radiotopia!  When Kelsey and I handed off Normal Gossip to Rachelle and Se’era in December, people asked what was next, and we said “:) I don’t know yet :)” but that was a lie—at least on […]",
          "link": "https://defector.com/try-hard-only-if-you-get-caught-defector-podcasts",
          "publishedOn": "2025-07-16T14:51:42.000Z",
          "wordCount": null,
          "title": "Defector Is Launching New Podcasts",
          "imageUrl": null
        },
        {
          "id": "https://defector.com/?p=194954",
          "author": "Barry Petchesky",
          "description": "Let's rank bird bills, from best bill to least-best bill.\n1 (TIED): Toucan",
          "link": "https://defector.com/bill-shapes-ranked",
          "publishedOn": "2025-07-16T14:19:29.000Z",
          "wordCount": null,
          "title": "Bill Shapes, Ranked",
          "imageUrl": null
        },
        {
          "id": "https://defector.com/?p=195525",
          "author": "Lauren Theisen",
          "description": "When Major League Baseball announced the roster for the 2025 All-Star Game, it was no surprise to see William \"Will\" \"Bill\" Smith listed as the starting catcher for the National League. The backstop has been tremendous for the Dodgers since he debuted in 2019, and this season is on track to be his own personal best. Showing sturdy power, savvy plate discipline, and a sweet swing, Bill was apparently tired of hearing people say he \"hits well for a catcher.\" Among NL batters, Bill is leading the field in average and on-base percentage, and his OPS is second only to his L.A. teammate Shohei Ohtani.\nSaid fellow Dodger Freddie Freeman, “People are gonna tune into the All-Star Game, they’ll throw his numbers up on the TV, and they’re gonna be like, ‘Whoa, that’s a really good season.’”",
          "link": "https://defector.com/how-did-will-bill-smith-do-at-the-mlb-all-star-game",
          "publishedOn": "2025-07-16T13:40:08.000Z",
          "wordCount": null,
          "title": "How Did Will “Bill” Smith Do At The MLB All-Star Game?",
          "imageUrl": null
        },
        {
          "id": "https://defector.com/?p=195229",
          "author": "Ray Ratto",
          "description": "It's been a few weeks since we heard anything salacious, greedy, stupid or just plain time-wasting from Bill Belichick, which is a surprise as well as a blessing given that he is one of those sports figures who producers and station managers never tire of churning. In short, enjoy the sounds of nature in a vacuum, because fall practice starts soon and we are about to relearn what it's like to be angry at and sick of the North Carolina Tar Heels the way we were the New England Patriots.\nBut that's no longer the standard, because as much as he wants his new job to be about football, he knows in a corner of his mind that he is actually a science experiment on the hoof. Specifically, how Old Folks America can pretend to be interested in a team just because he's there at a time when that team is in a sport that's shrinking back into a regional entertainment. It is a question of how long bankable fame actually lasts before it turns into something pejorative, or worse. It is also a test case on how long teenagers in an open market can be moved by someone who is a hero to their parents and grandparents.",
          "link": "https://defector.com/bill-belichicks-talent-is-becoming-tiresome",
          "publishedOn": "2025-07-15T18:31:03.000Z",
          "wordCount": 7266,
          "title": "Bill Belichick’s Talent Is Becoming Tiresome",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/bills-week-belichick.jpg"
        },
        {
          "id": "https://defector.com/?p=195498",
          "author": "Giri Nathan",
          "description": "Financier Bill Ackman has been widely shamed for his appearance in a professional tennis tournament last week. Since shame is no longer operative in American culture, he's continued to explain every painstaking detail of the experience in his tweets, which read like a transcript of a front-facing video filmed in a car. In the course of defending his embarrassing appearance at the Hall of Fame Open, Ackman is approaching something like performance art.\nAckman denied the charge that his doubles match at the tournament was a pay-for-play situation. \"Many also claimed that I bribed the [International Tennis Hall of Fame] for the wildcard, which is entirely untrue,\" he wrote on Sunday. \"The HOF asked me for nothing and I made no commitments to the HOF. I had in the past donated to the HOF, but had done nothing in recent years.\" When denying a bribe, it's always important to complete the terms of the bribe: Ackman announced a few paragraphs later that he would be granting the Hall of Fame a \"$10 million endowment that I will manage for free.\"",
          "link": "https://defector.com/bill-ackman-weird-sad-tennis-farce",
          "publishedOn": "2025-07-15T18:09:00.000Z",
          "wordCount": 6506,
          "title": "Bill Ackman Says He’ll Give Tennis Hall Of Fame $10 Million After His Weird, Sad Match",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2213174215.jpg"
        },
        {
          "id": "https://defector.com/?p=195429",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about the national anthem, Kevin Costner, desert island actors, action film musicals, and more.\nFinal reminder: Why Your Team Sucks returns to these fine servers next week, so get your submissions in here before I go turning off the spigot. We’ve got a lot of NFL teams to preview and a lot of sucking to cover, so don’t fuck around. Get me that hate and get it to me fast.",
          "link": "https://defector.com/and-now-a-letter-from-a-bill",
          "publishedOn": "2025-07-15T17:45:40.000Z",
          "wordCount": 17365,
          "title": "And Now, A Letter From A Bill",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-170428350.jpg"
        },
        {
          "id": "https://defector.com/?p=195438",
          "author": "Alex Sujong Laughlin",
          "description": "When I was growing up, my mother kept notebooks where she meticulously recorded every dollar our family spent. She never talked about them with me, she just left the notebooks on the kitchen table where I could see them. I would flip through the lines of expenses, horrified at the dollars and cents I’d incurred by just existing, terrified that I would bankrupt our family. \nMy parents were young and making it work on a second lieutenant's salary, so they didn’t earn much money to begin with—as the child of Korean War survivors, my mom learned to hold tight to what little she had. With her savvy budgeting, she kept me fed and clothed and even entertained. We spent countless afternoons at the library and in the children’s department of the city’s free art museum. Decades later, my family’s financial situation has improved drastically, but the years of scarcity have shaped us both. She still records her expenses in the notebooks and hides the majority of her money from herself so she won’t spend it. From her, I learned that money is a source of fear and shame.",
          "link": "https://defector.com/i-have-found-a-personal-finance-influencer-who-isnt-as-bad-as-personal-finance-influencer-sounds",
          "publishedOn": "2025-07-15T17:18:42.000Z",
          "wordCount": 8579,
          "title": "I Have Found A Personal Finance Influencer Who Isn’t As Bad As “Personal Finance Influencer” Sounds",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/Untitled-design.png"
        },
        {
          "id": "https://defector.com/?p=195170",
          "author": "Kelsey McKinney",
          "description": "One advantage I have always held in the literary arts is speed. I am a fast reader and an even faster scanner. I can draft quickly, churning out hundreds of words as if turning on a spigot. It's an advantage in the age of quantity, and the ability to write a lot all the time is one I never take for granted. But it is a blessing as often as it is a curse. What you lose with speed is often beauty, care, and intention. If I wrote as fast as my brain would prefer (at the speed of light), there would never be a good turn of phrase, and I would hate myself. But I hate myself all the same when I force myself to go slowly in order to make something beautiful and creative, because it is so hard for me to do so.\nFor a piece I really care about, I have a lot of tricks to convince my brain to slow down, and think more critically and carefully about the words in front of me. I sometimes write longhand before transcribing to the computer. To revise, I will read the sentences from bottom to top to make sure they all stand up on their own. And when I'm feeling very bogged down and uninspired by the English language, I read Shakespeare.",
          "link": "https://defector.com/shakespeare-makes-me-a-slower-and-better-reader",
          "publishedOn": "2025-07-15T15:19:00.000Z",
          "wordCount": 10812,
          "title": "Shakespeare Makes Me A Slower And Better Reader",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-929210872.jpg"
        },
        {
          "id": "https://defector.com/?p=195190",
          "author": "Lauren Theisen",
          "description": "There is no shortage of entrepreneurial Bills in New York City. A trip around town can bring you to such businesses as the diner Bill's in Ridgewood, the bike shop Bill's Cyclery in Woodside, the jazz club Bill's Place in Harlem, or Bill's Supper Club in Midtown. (There is also a Brooklyn bar called Post No Bills—a command we are vehemently disregarding this week.) But out of all the Bills in my city, I selected Bill's Wines & Liquors in Sunnyside, Queens.\nI've lived in Brooklyn for the last eight years, but I've recently been spending a lot of time in Astoria, at the northwest tip of Queens, because that's where my boyfriend lives. I can't claim that there's any grander reason why I chose Bill's Wines & Liquors over the other Bills than \"it was the closest.\" So: High marks for Bill's in convenience.",
          "link": "https://defector.com/bills-wines-liquors-the-defector-review",
          "publishedOn": "2025-07-15T14:51:00.000Z",
          "wordCount": 7926,
          "title": "Bill’s Wines & Liquors: The Defector Review",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/20250711_1255191-e1752266180791_jpg.jpg"
        },
        {
          "id": "https://defector.com/?p=195305",
          "author": "Kelsey McKinney",
          "description": "On Monday night, Major League Baseball gathered together all the big boys with their big bats from around the league to show off for us. And they did! Cal \"Big Dumper\" Raleigh showed off the most, and so he won.\nEvery year, MLB gets all these big boys with their big bats, and they line them up on national television and ask them to hit baseballs one million miles. This is cool. I like to watch this! I am in no way a Home Run Derby hater, because I think it's fun when guys who play games for a living get to play games for fun.",
          "link": "https://defector.com/all-star-week-needs-a-cool-catch-contest",
          "publishedOn": "2025-07-15T14:21:49.000Z",
          "wordCount": 7428,
          "title": "All-Star Week Needs A Cool Catch Contest",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-640131990_jpg.jpg"
        },
        {
          "id": "https://defector.com/?p=195417",
          "author": "Sabrina Imbler",
          "description": "Kathryn Xu: This weekend, my family and I went up to Lake Placid, where I saw several loons. As is the case when I see birds of note, I informed Barry Petchesky of this fact, only to discover that I was not the only Defector staffer to recently see loons and subsequently inform Barry Petchesky of the fact. What are the odds!\nSabrina Imbler: I am no statistician, but I imagine they are quite low! I spent the past month in the Adirondacks, and had no idea Kathryn also came up to the beautiful North, and the land of loons. I too saw loons on a lake and informed Barry Petchesky, because this is simply how things are done here. Barry then told me that Kathryn had also seen loons, and this is all the context you need to understand how we arrived here, in this blog. Kathryn, was this your first loon sighting? What did you know of loons before this weekend?",
          "link": "https://defector.com/fatal-battles-in-common-loons-a-subsequent-analysis",
          "publishedOn": "2025-07-15T13:44:35.000Z",
          "wordCount": 10409,
          "title": "Fatal Battles In Common Loons: A Subsequent Analysis",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-624146538_7f9438.jpg"
        },
        {
          "id": "https://defector.com/?p=195283",
          "author": "Tom Ley",
          "description": "Bill Simmons has been a part of my life for about 20 years now. As with any relationship that lasts that long, my feelings about him have evolved. At various points I've been a fan, a hater, a critic, a detached observer, and a begrudging admirer, sometimes all at once. \nI'm not alone in this. I have only recently discovered that I am part of a whole demographic of sports fans for whom Simmons occupies an odd, conflicted space in their media diet. They are dedicated listeners of his podcast, which they primarily consume in order to find things to make fun of him over, and they would be devastated if Simmons were to retire tomorrow. Thousands of these people congregate on a subreddit dedicated to Bill Simmons, where they crack jokes at his expense, maintain the lore of The Bill Simmons Podcast universe, and speak in a language that can only be understood by fellow sickos. Some of them even listen to a podcast about The Bill Simmons Podcast.",
          "link": "https://defector.com/an-interview-with-a-guy-who-hosts-a-podcast-about-the-bill-simmons-podcast",
          "publishedOn": "2025-07-15T13:00:06.000Z",
          "wordCount": 13906,
          "title": "An Interview With A Guy Who Hosts A Podcast About ‘The Bill Simmons Podcast’",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/Bill-simmons-distressed1.png"
        },
        {
          "id": "https://defector.com/?p=195421",
          "author": "Tom Ley",
          "description": "The MLB All-Star Game has unfortunately been handed over to Pat McAfee, who spent Monday kicking off the week's festivities on ESPN. What better way to get baseball fans excited about the Home Run Derby than by subjecting them to a few hours of a poached ex-punter bellowing about a sport he barely follows while he embellishes his yinzer accent?\nMcAfee had a few lowlights today. While emceeing a press conference with Tarik Skubal, Paul Skenes, Dave Roberts, and Aaron Boone, he stammered his way through an answer to some pointed questioning by Jen Ramos Eisen. He also duffed an interview with Shohei Ohtani, at one point instructing Ohtani's interpreter to provide some \"energy on the delivery\" of his question. But McAfee's most embarrassing moment was probably donning a sleeveless jersey while sucking up to MLB commissioner Rob Manfred by stumping for a salary cap:",
          "link": "https://defector.com/bill-skarsgard-nosferatu-pat-mcafee-bills-week",
          "publishedOn": "2025-07-14T21:15:46.000Z",
          "wordCount": 7331,
          "title": "Bill Skarsgard In His Nude ‘Nosferatu’ Getup Would’ve Been A Better MLB All-Star Week Host Than Pat McAfee",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/More-nude-orlok.png"
        },
        {
          "id": "https://defector.com/?p=195330",
          "author": "Billy Haisley",
          "description": "It must be said that the 2024–25 European soccer season belonged to Paris Saint-Germain. After a shaky start, which saw them come within a whisker of failing to even make it out of the forgiving league stage of the new Champions League format, the Parisiens bought a new star, found themselves, and hit their stride. Behind a well-ordered but dizzyingly, dazzlingly fluid style of play, and supernova turns from the likes of Ousmane Dembélé and Vitinha, PSG ended the season blowing away all challengers, capped off by an iconic 5–0 demolition job against Inter in the UCL final. The sumptuous play, imposing results, and the youthfulness of the roster won the team the biggest title in the club game, will likely win Dembélé the Ballon d'Or, and marked this team as a potentially era-defining one.\nAnd yet, at what I guess is the official close of that season, PSG is not the team standing in the spotlight today. Though the French club was the massive favorite to add the title of world champion to its extended list of accolades in Sunday's Club World Cup final, it was actually Chelsea that wound up lifting the trophy by doing what PSG had made its calling card over the last seven months: going up against a great team and beating the hell out of them.",
          "link": "https://defector.com/cole-palmer-demolished-a-bill-less-psg-and-the-rest-is-history",
          "publishedOn": "2025-07-14T20:47:27.000Z",
          "wordCount": 10701,
          "title": "Cole Palmer Demolished A Bill-Less PSG, And The Rest Is History",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2225072549.jpg"
        },
        {
          "id": "https://defector.com/?p=195389",
          "author": "Dave McKenna",
          "description": "Whatever the Thrilla in Manila was, this wasn't that. Katie Taylor and Amanda Serrano, who previously gave the world two of the greatest fights in recent memory, delivered a comparative stinker while capping off their trilogy atop the bill of the first all-women’s professional boxing card on Friday at the sweet science's holiest room, Madison Square Garden.\nTaylor, in what could be the final bout of her incredible career, took a majority decision over Serrano after 10 mostly lackluster two-minute rounds. Judge Mark Lyson scored the fight a 95-95 draw, while Steve Weisfeld and Nicolas Esnault both had Taylor winning easily, 97-93. With the win, Taylor holds onto her undisputed super-lightweight championship.",
          "link": "https://defector.com/taylor-serrano-iii-couldnt-live-up-to-its-historic-billing",
          "publishedOn": "2025-07-14T18:40:14.000Z",
          "wordCount": 8511,
          "title": "Taylor–Serrano III Couldn’t Live Up To Its Historic Billing",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2224081963.jpg"
        },
        {
          "id": "https://defector.com/?p=194834",
          "author": "Barry Petchesky",
          "description": "For all its miracles, the internet has had some drawbacks. Before the internet, people generally had more friends, and more lasting relationships; they went outside more, and were more physically active; the fighting weight of the average cultural product was a little higher. I don't really care about all that unimportant stuff, though. The thing that was most obviously more enjoyable before the internet could tell you everything about everything was pro wrestling. \nI know some people enjoy the backstage stuff as its own soap opera, and more power to them. In what is no way a pathetic nostalgic yearning for the simplicity of childhood, I preferred when angles didn't carry a second, meta element, when watching wrestling didn't require knowing all about the workplace politics that went into its booking. I miss not knowing who a guy was, because then he could be anything. If the current industry is better in many ways, it could never give us a push like Bill Goldberg's.",
          "link": "https://defector.com/bill-goldberg-was-a-star-from-day-1",
          "publishedOn": "2025-07-14T16:30:02.000Z",
          "wordCount": 9882,
          "title": "Bill Goldberg Was A Star From Day 1",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-628271852.jpg"
        },
        {
          "id": "https://defector.com/?p=195259",
          "author": "Barry Petchesky",
          "description": "The Space Shuttle drips romance. Representing nearly a half-century of human spaceflight—from its conception in 1968, even before the Moon landing, until its retirement in 2011—its design and even its name capture a hope that space travel would one day be commonplace. That before long, the first step to heading to the Moon or Mars would be as workaday as boarding a shuttle for a quick jaunt to low Earth orbit. It proved a beautiful, flawed achievement: Two traumatic catastrophes showed early safety analyses were overgenerous, but the Shuttle did provide the freight and manpower for the first tentative steps toward a permanent spacefaring presence, and all the science that came with it. The craft themselves are retrofuturist works of art: gleaming white above, reverse countershaded beneath, all swooping curves and aerodynamic lines. A stately relic of space-age optimism.\nIt's no wonder, upon the program's retirement, that everyone wanted a Shuttle. Twenty-one museums and institutions vied for the right to house one of the four surviving craft. NASA made its selections based on applicants' historical significance and plans to preserve and display the Shuttles, and in 2011 the winners were announced. The Intrepid Museum in New York received Enterprise; Kennedy Space Center in Florida got Atlantis; the California Science Center obtained Endeavour; and the Steven F. Udvar-Hazy Center, an annex of the Smithsonian National Air and Space Museum in Fairfax County, Va., received Discovery.",
          "link": "https://defector.com/the-big-beautiful-bill-is-trying-to-steal-a-space-shuttle",
          "publishedOn": "2025-07-14T15:50:06.000Z",
          "wordCount": 7823,
          "title": "The “Big Beautiful Bill” Is Trying To Steal A Space Shuttle",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-542411136.jpg"
        },
        {
          "id": "https://defector.com/?p=195285",
          "author": "Hamilton Nolan",
          "description": "An old boxing coach of mine became an avid tennis player after he retired from pro fighting. He always said that boxing and tennis were very similar. This never struck me as completely convincing. Yes, both are one-on-one sports, and both require strategic choices about how to attack and defend, how to break an opponent’s will. But in tennis, nobody is punching you in the face. I guess you could say there are both similarities and differences. \nTo see tennis in New York City, take the 7 train way the fuck out in Queens to Willetts Point. Instead of turning left to go to the Mets Stadium, hang a right, over the MTA trainyard, down a long and alarmingly rickety boardwalk whose lumber creaks and moves under your steps. At the end you are rewarded with the sweeping vista of Flushing Meadows Park. The circle at the park’s entrance is named after David Dinkins, New York City’s first black mayor, who helped to bring the US Open to the USTA Tennis Center on the park’s edge. Dinkins was a member of the Democratic Socialists of America, a fact that Zohran Mamdani, our current mayor-in-waiting, brought up every time that one of his primary opponents tried to smear him as a communist due to his own DSA membership.",
          "link": "https://defector.com/the-fighters-pay-the-bills",
          "publishedOn": "2025-07-14T15:22:01.000Z",
          "wordCount": 10387,
          "title": "The Fighters Pay The Bills",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2224227634.jpg"
        },
        {
          "id": "https://defector.com/?p=195289",
          "author": "Maitreyi Anantharaman",
          "description": "This week's puzzle was constructed by Maddy Ziegler and edited by Hoang-Kim Vu. Maddy is an attorney in Madison, Wisconsin. She enjoys watching many sports and playing none. You can find more of her puzzles at poppypuzzles.blogspot.com.\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE. Note that our submissions are closed through July 31.",
          "link": "https://defector.com/the-crossword-july-14-quarterback-scramble",
          "publishedOn": "2025-07-14T15:04:43.000Z",
          "wordCount": 5847,
          "title": "The Crossword, July 14: Quarterback Scramble",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1448389543.jpg"
        },
        {
          "id": "https://defector.com/?p=194645",
          "author": "Lauren Theisen",
          "description": "The VHS/DVD championship season recap is a lost art in the era of Youtube, but I'm old enough to remember when it was the only game in town. I'd see ads for them in the immediate aftermath of a title win—a chance to relive a great run through a curated collection of clips and interviews. We had the tape for the 1998 Red Wings in my home growing up, and a disc for the 2004 Pistons, but neither of those affected me quite as much as a video I borrowed from the library as a young kid, which introduced me to the concept of violent, aggressive basketball—a style I decided I wanted to play.\nThis was a tape recapping the 1988 Detroit Pistons season. That's not a year in which they actually won a title, you might notice, but it was the first time Detroit ever made the Finals, pushing the Lakers to seven games. I was lucky enough to get taken to the library on a regular basis, and I did the thing that kids do when they go, which is grab whatever they see on topics they're interested in. My topics included baseball, hockey, planets, those Eyewitness Books with all the cool pictures, and at some point, the Detroit Pistons.",
          "link": "https://defector.com/bill-laimbeer-made-me-a-youth-basketball-maniac",
          "publishedOn": "2025-07-14T14:13:07.000Z",
          "wordCount": 9692,
          "title": "Bill Laimbeer Made Me A Youth Basketball Maniac",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-522413051.jpg"
        },
        {
          "id": "https://defector.com/?p=195177",
          "author": "Ray Ratto",
          "description": "The choice of Bills Week for this year's What Defector Does When It Needs To Skive Off For A Week Week had an unforeseen deficiency when it was being spitballed by the Phlegm Committee. Specifically, we are historically low on Bills.\nBetween 1950 and 2008, the name Bill (or more specifically William), became gradually and increasingly uncool in the United States, according to data from the Social Security Administration. Even by 1980 a kid might as well have been named Jehoshaphat, Algonquin, or Xythron The Enfeebled. Most likely, Bill is the name of your last living relative, and if it isn't, may he rest in peace. If you have a Bill in your family, cherish the old coot. Water him regularly, and keep the air in front of his easy chair free of things he can trip over. You need him mobile and independent, at least from you.",
          "link": "https://defector.com/where-have-all-the-sports-bills-gone",
          "publishedOn": "2025-07-14T13:48:45.000Z",
          "wordCount": 8219,
          "title": "Where Have All The Sports Bills Gone?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-51685346.jpg"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=860257",
          "author": "Anthony Franco",
          "description": "Seth Lugo reeled off another productive start this afternoon, tossing six innings of two-run ball to earn the win at Wrigley Field. The veteran right-hander now carries a 2.95 earned run average with a 22% strikeout rate. This was his 11th quality start in 19 appearances. Kansas City took two out of three from the…",
          "link": "https://www.mlbtraderumors.com/2025/07/latest-on-seth-lugos-trade-candidacy.html",
          "publishedOn": "2025-07-24T00:43:11.000Z",
          "wordCount": 3019,
          "title": "Latest On Seth Lugo’s Trade Candidacy",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/USATSI_26692813-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=860169",
          "author": "Steve Adams",
          "description": "10:26am: The Royals are sending cash to the Rays, reports Ken Rosenthal of The Athletic. 10:16am: The Royals are acquiring right-handed reliever Joey Krehbiel from the Rays, reports Marc Topkin of the Tampa Bay Times. The 32-year-old Krehbiel is not on Tampa Bay’s 40-man roster. He’s been pitching with their Triple-A affiliate in Durham after…",
          "link": "https://www.mlbtraderumors.com/2025/07/rays-trade-reliever-joey-krehbiel-royals.html",
          "publishedOn": "2025-07-23T15:26:56.000Z",
          "wordCount": 2579,
          "title": "Royals To Acquire Joey Krehbiel",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/joey-krehbiel-rays-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=860095",
          "author": "Steve Adams",
          "description": "The Royals announced Tuesday that they’ve designated outfielder Tyler Gentry for assignment. His spot on the 40-man roster goes to left-hander Rich Hill, whose previously reported promotion from Triple-A Omaha is now official. Righty Andrew Hoffmann was optioned to Omaha to open an active roster spot for the 45-year-old Hill. Gentry, 26, made his big…",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-designate-tyler-gentry-for-assignment.html",
          "publishedOn": "2025-07-22T20:06:54.000Z",
          "wordCount": 2296,
          "title": "Royals Designate Tyler Gentry For Assignment",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/tyler-gentry-royals-1024x725.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=860017",
          "author": "Anthony Franco",
          "description": "The Royals agreed to deals with first-round selections Sean Gamble and Josh Hammond, reports Jim Callis of MLB Pipeline. Kansas City also has deals with second-rounders Michael Lombardi and Justin Lamkin, Callis adds. Gamble was selected with the 23rd overall pick, K.C.’s standard first-round selection. Hammond went 28th with a supplemental selection that the Royals received under the Prospect…",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-agree-to-deals-with-first-round-picks-sean-gamble-josh-hammond.html",
          "publishedOn": "2025-07-22T04:29:13.000Z",
          "wordCount": 2308,
          "title": "Royals Agree To Deals With First-Round Picks Sean Gamble, Josh Hammond",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/USATSI_26462964-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=859943",
          "author": "Steve Adams",
          "description": "Rich Hill is headed back to the majors for a 21st season. The Royals plan to select Hill’s contract from Triple-A Omaha, Robert Murray of FanSided reports, and he could pitch for them as soon as tomorrow. Hill signed a minor league contract with Kansas City back in May, and he’s been pitching with their…",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-to-select-rich-hill.html",
          "publishedOn": "2025-07-21T18:23:43.000Z",
          "wordCount": 2264,
          "title": "Royals To Select Rich Hill",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/01/rich-hill-pitching-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=859389",
          "author": "Mark Polishuk",
          "description": "The Royals are running out of time.  After starting the second half by losing two of three games to the Marlins, Kansas City is now 48-52, and 5.5 games back of the final AL wild card position.  While the club's recent transactions indicate that they're not ready to wave the white flag just yet, it…",
          "link": "https://www.mlbtraderumors.com/2025/07/trade-deadline-outlook-kansas-city-royals.html",
          "publishedOn": "2025-07-21T15:31:11.000Z",
          "wordCount": 2783,
          "title": "Trade Deadline Outlook: Kansas City Royals",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2021/09/USATSI_16519653-1024x677.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=859366",
          "author": "Steve Adams",
          "description": "10:45am: The teams have announced the trade. Pittsburgh optioned Devanney to Triple-A Indianapolis. 9:27am: The Royals are set to acquire infielder/outfielder Adam Frazier from the Pirates, reports Robert Murray of FanSided. Kansas City will send infielder Cam Devanney back to Pittsburgh in the trade. Devanney was just selected to the major league roster by the…",
          "link": "https://www.mlbtraderumors.com/2025/07/pirates-trade-adam-frazier-royals.html",
          "publishedOn": "2025-07-16T15:45:41.000Z",
          "wordCount": 5694,
          "title": "Pirates Trade Adam Frazier To Royals",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/adam-frazier-pittsburgh-pirates-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=859167",
          "author": "Steve Adams",
          "description": "The Royals have placed right-hander Michael Lorenzen on the 15-day injured list due to a left oblique strain, per a team announcement. The move is retroactive to July 11, so he’ll be eligible to return no sooner than July 26. He joins fellow starters Cole Ragans (rotator cuff strain) and Alec Marsh (shoulder impingement) on…",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-michael-lorenzen-injured-list-oblique.html",
          "publishedOn": "2025-07-14T17:44:13.000Z",
          "wordCount": 2440,
          "title": "Royals Place Michael Lorenzen On Injured List",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/michael-lorenzen-royals-kansas-city-1024x683.jpg"
        }
      ]
    },
    {
      "title": "Flaming Hydra",
      "feedUrl": "https://flaminghydra.com/rss/",
      "siteUrl": "https://flaminghydra.com/",
      "articles": [
        {
          "id": "6880128b19c0620001df4d55",
          "author": "The Editors",
          "description": "Myriam Gurba in conversation with Lindsey Boylan; a new home for S.I. Rosenbaum",
          "link": "https://flaminghydra.com/issue-365/",
          "publishedOn": "2025-07-23T00:54:06.000Z",
          "wordCount": 638,
          "title": "Leave abuse / Take love",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/BOYLAN-ABUSER-16x9-1.png"
        },
        {
          "id": "687fde3c19c0620001df4cbc",
          "author": "Myriam Gurba",
          "description": "An Interview with Lindsey Boylan",
          "link": "https://flaminghydra.com/scaring-all-the-right-people/",
          "publishedOn": "2025-07-23T00:53:11.000Z",
          "wordCount": 583,
          "title": "Scaring All the Right People",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/BOYLAN-ABUSER-16x9.png"
        },
        {
          "id": "6880161619c0620001df4d82",
          "author": "S.I. Rosenbaum",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/transmigrations/",
          "publishedOn": "2025-07-23T00:52:45.000Z",
          "wordCount": 313,
          "title": "TRANSMIGRATIONS",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/01-TOP-16x9.png"
        },
        {
          "id": "6880217119c0620001df4e2b",
          "author": "The Editors",
          "description": "by The Editors\n\nSubscribe to Flaming Hydra to play HYDRANYM! And tell your friends who love WORD GAMES who might, for any number of reasons, be looking out for a new word game to play online. \n\n[countdown to 2025-07-24 12:00am PDT]\nExcelsior!\nCOME BACK THURSDAY, JULY 24\nTO CHOOSE",
          "link": "https://flaminghydra.com/hydranym-no-9/",
          "publishedOn": "2025-07-23T00:50:59.000Z",
          "wordCount": 555,
          "title": "HYDRANYM No. 9",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/HYDRANYM-5.jpg"
        },
        {
          "id": "687ed09f19c0620001df3a60",
          "author": "The Editors",
          "description": "Jídé Salawu investigates a faux-Nigerian literary hoax, and Anna Merlan takes in an art exhibit",
          "link": "https://flaminghydra.com/issue-364/",
          "publishedOn": "2025-07-22T01:33:12.000Z",
          "wordCount": 656,
          "title": "Perverse verse / Creative instinct",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/DO-NOT-LORES-16x9-1.jpg"
        },
        {
          "id": "687eb6ab19c0620001df39aa",
          "author": "Jídé Salawu",
          "description": "On Thursday, July 17, 2025, my friend Hussain Ahmed sent me a Daily Mail article written by Sonya Gugliara headlined, “Straight white author’s career finally takes off after he tells woke publishers he’s gender queer Nigerian.” The piece describes the exploits of literary hoaxer",
          "link": "https://flaminghydra.com/the-poetry-swindler/",
          "publishedOn": "2025-07-22T01:32:34.000Z",
          "wordCount": 667,
          "title": "The Poetry Swindler",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/DO-NOT-LORES-16x9.jpg"
        },
        {
          "id": "687e9d1f19c0620001df392a",
          "author": "Anna Merlan",
          "description": "The artist has embarked on a dazzling constellation of experimental works that stretches the boundaries of genre, performance, and commentary. \n\nPrey \nThe artist endlessly chases a cloth-covered beast through a domestic tableau vivant in a manifestation of the predatory nature of the art world. The quarry is permeated",
          "link": "https://flaminghydra.com/the-artist-is-present/",
          "publishedOn": "2025-07-22T01:32:12.000Z",
          "wordCount": 647,
          "title": "The Artist Is Present",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/IMG_8682-16x9-72.jpg"
        },
        {
          "id": "687abab118410e000135ae14",
          "author": "The Editors",
          "description": "Nathan Munn knows what Art is",
          "link": "https://flaminghydra.com/issue-363/",
          "publishedOn": "2025-07-18T23:06:56.000Z",
          "wordCount": 522,
          "title": "Art’s sake",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/ice-cream-children-16x9-1.png"
        },
        {
          "id": "687a67df18410e000135abfd",
          "author": "Nathan Munn",
          "description": "For a long time there was a small purple ice cream cone on the back of my phone, delicately crafted in a child's cross-hatch—a homemade sticker given to me by my nine-year-old daughter. Nestled in the cone, rather than a scoop of something delicious, was the",
          "link": "https://flaminghydra.com/the-taste-of-creation/",
          "publishedOn": "2025-07-18T23:05:17.000Z",
          "wordCount": 585,
          "title": "The Taste of Creation",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/ice-cream-children-16x9.png"
        },
        {
          "id": "6876c3ccefa3900001458b36",
          "author": "The Editors",
          "description": "Arwa Mahdawi brings news from Gaza; Jennie Rose Halperin faces family secrets",
          "link": "https://flaminghydra.com/issue-362/",
          "publishedOn": "2025-07-18T01:58:30.000Z",
          "wordCount": 3385,
          "title": "Trading in fluids / Dealing in lives",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/plumpy-1.jpg"
        },
        {
          "id": "687149aed2c01800010a17d4",
          "author": "Jennie Rose Halperin",
          "description": "Liza and Adam, my grandmother’s best friends and neighbors, used to tell a dramatic—if somewhat vague—story about their lives in World War II. In their telling, Adam had jumped off a cattle car heading to Auschwitz in late 1944 and fought his way through",
          "link": "https://flaminghydra.com/the-price-of-survival/",
          "publishedOn": "2025-07-18T01:57:59.000Z",
          "wordCount": 2022,
          "title": "The Price of Survival",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/door-2.jpg"
        },
        {
          "id": "6871755dd2c01800010a186c",
          "author": "Arwa Mahdawi",
          "description": "It’s been over 21 months since Israel started its genocidal campaign in Gaza. Most of the region has been turned into rubble, and into a mass grave. And still our elected officials are cheering it on. Lawmakers are not the only ones complicit in this genocide. Well-paid consultants",
          "link": "https://flaminghydra.com/pregnant-women-in-gaza-are-selling-urine-to-survive/",
          "publishedOn": "2025-07-18T01:55:30.000Z",
          "wordCount": 1566,
          "title": "Pregnant Women in Gaza Are Selling Urine to Survive",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/plumpy.jpg"
        },
        {
          "id": "68795d4418410e0001359808",
          "author": "Maria Bustillos",
          "description": "You are charged, esteemed comrades, with the solemn duty to select, from among the 21 best entries received this week on the theme of\nLETTERS \nthe victor of Hydranym No. 8. \nHYDRANYM is the Creative Writing word game especially for Flaming Hydra subscribers. Please join in by subscribing! It’",
          "link": "https://flaminghydra.com/hydranym-no-8-vote/",
          "publishedOn": "2025-07-18T01:55:02.000Z",
          "wordCount": 452,
          "title": "HYDRANYM No. 8: Vote!",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/hydravot.jpg"
        },
        {
          "id": "68781c5518410e00013582ae",
          "author": "The Editors",
          "description": "Jonathan M. Katz remembers the Hotel Oloffson, Port-au-Prince",
          "link": "https://flaminghydra.com/issue-361/",
          "publishedOn": "2025-07-17T00:20:18.000Z",
          "wordCount": 731,
          "title": "Fragile refuge",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/Hotel_Oloffson_2010.06.04_-_07-1.jpg"
        },
        {
          "id": "6877ef5418410e0001358148",
          "author": "Jonathan M. Katz",
          "description": "There was a place in Port-au-Prince called the Oloffson. It housed a nearly century-old hotel, but it was more than that. Earlier this year, amid the spiraling gang war that has seized almost all of Haiti’s capital, the hotel’s enigmatic last owners, Richard and Lunise Morse,",
          "link": "https://flaminghydra.com/a-lost-haven-in-haiti/",
          "publishedOn": "2025-07-17T00:18:47.000Z",
          "wordCount": 791,
          "title": "A Lost Haven in Haiti",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/Hotel_Oloffson_2010.06.04_-_07.jpg"
        },
        {
          "id": "68717277d2c01800010a185a",
          "author": "The Editors",
          "description": "Will California secede? asks Annalee Newitz; tour the inner worlds of Trevor Alixopulos",
          "link": "https://flaminghydra.com/issue-360/",
          "publishedOn": "2025-07-16T00:24:41.000Z",
          "wordCount": 2084,
          "title": "Quitting the Union / Shutting out the world",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/BEAR-Flag_of_California-1.png"
        },
        {
          "id": "68769abeefa3900001458a04",
          "author": "Trevor Alixopulos",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/entrance-exam/",
          "publishedOn": "2025-07-16T00:23:33.000Z",
          "wordCount": 318,
          "title": "Entrance Exam",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/entrancethumb.png"
        },
        {
          "id": "6876b701efa3900001458a62",
          "author": "Annalee Newitz",
          "description": "The Trans March in San Francisco is usually pretty chaotic—there are no fancy floats or formal activities—but this year a group had gotten their shit together to make an enormous, street-spanning trans flag. Its pink, white, and blue stripes stretched for nearly a quarter block. It",
          "link": "https://flaminghydra.com/the-fall-and-rise-of-the-california-republic/",
          "publishedOn": "2025-07-16T00:23:18.000Z",
          "wordCount": 735,
          "title": "The Fall and Rise of the California Republic",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/BEAR-Flag_of_California.png"
        },
        {
          "id": "6876c996efa3900001458b8d",
          "author": "The Editors",
          "description": "by The Editors\n\nSubscribe to Flaming Hydra to play HYDRANYM! And tell your friends who love WORD GAMES who might, for any number of reasons, be looking out for a new word game to play online. \n\n[countdown to 2025-07-17 12:00am PDT]\nENTER NOW... AND COME BACK\nTHURSDAY, JULY 17,",
          "link": "https://flaminghydra.com/hydranym-no-8/",
          "publishedOn": "2025-07-16T00:22:53.000Z",
          "wordCount": 557,
          "title": "HYDRANYM No. 8",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/HYDRANYM-4.jpg"
        },
        {
          "id": "6875703fd2c01800010a1c6e",
          "author": "The Editors",
          "description": "Julianne Escobedo Shepherd + Megan Greenwell talk money; a free-for-all podcast on SUPERMAN; Zach Rabiroff on the Man of Steel",
          "link": "https://flaminghydra.com/issue-359/",
          "publishedOn": "2025-07-14T23:16:13.000Z",
          "wordCount": 716,
          "title": "Almighty dollar / Popular powers",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/meg-2.jpg"
        },
        {
          "id": "68756e35d2c01800010a1c64",
          "author": "Julianne Escobedo Shepherd",
          "description": "A conversation with author Megan Greenwell",
          "link": "https://flaminghydra.com/the-public-is-catching-on-about-private-equity/",
          "publishedOn": "2025-07-14T23:15:54.000Z",
          "wordCount": 596,
          "title": "The Public Is Catching on About Private Equity",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/meg.jpg"
        },
        {
          "id": "687576dcd2c01800010a1d3b",
          "author": "Zach Rabiroff",
          "description": "It is the way of the world that Clark Kent must periodically stand in the dock before the nerds of the world to answer a single question: is Superman a fascist?\nThere are two schools of thought on this matter. The first is what we might call the Alan Moore",
          "link": "https://flaminghydra.com/superman-is-as-good-as-we-can-stand-him-being/",
          "publishedOn": "2025-07-14T23:15:33.000Z",
          "wordCount": 720,
          "title": "Superman Is as Good as We Can Stand Him Being",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/Screenshot-2025-07-14-at-6.51.22---PM.jpg"
        },
        {
          "id": "68757a9bd2c01800010a1d78",
          "author": "Zach Rabiroff",
          "description": "Sam Thielman, Josephine Riesman, Zach Rabiroff, and S.I. Rosenbaum discuss the new SUPERMAN movie. Joe MacLeod pressed the RECORD button.\nListen on Apple/Spotify/RSS/plus more options at pod.link \n\nEpisode 11: The Ultimate Truth of Superman\nJosephine Riesman, Zach Rabiroff, S.I. Rosenbaum, and Sam",
          "link": "https://flaminghydra.com/podcast-episode-11-the-ultimate-truth-of-superman/",
          "publishedOn": "2025-07-14T23:15:00.000Z",
          "wordCount": 530,
          "title": "PODCAST! Episode 11: The Ultimate Truth of Superman",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/superman-title-IMG_4732.png"
        }
      ]
    },
    {
      "title": "Today in Tabs",
      "feedUrl": "https://rss.beehiiv.com/feeds/ZRiesnGI0u.xml",
      "siteUrl": "https://www.todayintabs.com/",
      "articles": [
        {
          "id": "https://www.todayintabs.com/p/the-news-305f",
          "author": "Rusty Foster",
          "description": "Mysterious ‘ship goo’ creates everyday painkiller in your sinuses—from yogurt.",
          "link": "https://www.todayintabs.com/p/the-news-305f",
          "publishedOn": "2025-07-22T19:43:06.000Z",
          "wordCount": 10475,
          "title": "The News",
          "enclosure": {
            "url": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/df9f7054-ae4f-41d6-af0c-bf5a8cbd145d/Screenshot_2025-07-22_at_2.29.48_PM.png",
            "length": "98649",
            "type": "image/png"
          },
          "imageUrl": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/df9f7054-ae4f-41d6-af0c-bf5a8cbd145d/Screenshot_2025-07-22_at_2.29.48_PM.png"
        },
        {
          "id": "https://www.todayintabs.com/p/billionaires-destroyed-american-news-media-on-purpose-7d91",
          "author": "Rusty Foster",
          "description": "It's not a conspiracy, it's simply what happened.",
          "link": "https://www.todayintabs.com/p/billionaires-destroyed-american-news-media-on-purpose-7d91",
          "publishedOn": "2025-07-18T19:59:42.000Z",
          "wordCount": 13240,
          "title": "Billionaires Destroyed American News Media On Purpose",
          "enclosure": {
            "url": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/00c4fe80-196a-434d-9785-ca816a847d7d/Screenshot_2025-07-18_at_1.41.56_PM.png",
            "length": "1362850",
            "type": "image/png"
          },
          "imageUrl": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/00c4fe80-196a-434d-9785-ca816a847d7d/Screenshot_2025-07-18_at_1.41.56_PM.png"
        },
        {
          "id": "https://www.todayintabs.com/p/getting-my-concussy-slonked-silly-style-17b0",
          "author": "Rusty Foster",
          "description": "sqɐ┴ uʍop ǝpᴉsd∩",
          "link": "https://www.todayintabs.com/p/getting-my-concussy-slonked-silly-style-17b0",
          "publishedOn": "2025-07-14T20:36:03.000Z",
          "wordCount": 9765,
          "title": "Getting My Concussy Slonked Silly Style",
          "enclosure": {
            "url": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/c78cfbcc-1473-499b-a328-2edcb8b5b529/Screenshot_2025-07-14_at_4.27.40_PM.png",
            "length": "930537",
            "type": "image/png"
          },
          "imageUrl": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/c78cfbcc-1473-499b-a328-2edcb8b5b529/Screenshot_2025-07-14_at_4.27.40_PM.png"
        }
      ]
    },
    {
      "title": "Bad Faith Times",
      "feedUrl": "https://bad-faith-times.ghost.io/rss/",
      "siteUrl": "https://badfaithtimes.com/",
      "articles": [
        {
          "id": "687e942619f1d000010a2c2b",
          "author": "Denny Carter",
          "description": "\"[Fascists] are amusing themselves, for it is their adversary who is obliged to use words responsibly, since he believes in words.\"",
          "link": "https://badfaithtimes.com/its-one-long-joke/",
          "publishedOn": "2025-07-22T11:30:55.000Z",
          "wordCount": 2644,
          "title": "It's One Long Joke",
          "imageUrl": "https://badfaithtimes.com/content/images/size/w1200/2025/07/Screenshot-2025-07-21-at-5.11.03---PM-1.png"
        },
        {
          "id": "68792501bc051b000154f230",
          "author": "Denny Carter",
          "description": "We can't be afraid of social media rules and regulations forever. It's the only way to dismantle the right's unreality.",
          "link": "https://badfaithtimes.com/the-brains-will-be-cooked-until-further-notice/",
          "publishedOn": "2025-07-18T18:05:04.000Z",
          "wordCount": 1565,
          "title": "The Brains Will Be Cooked Until Further Notice",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/07/Screenshot-2025-07-18-at-1.36.35---PM.png"
        },
        {
          "id": "68780216bc051b000154ec20",
          "author": "Denny Carter",
          "description": "What will it take for liberals to see there is no returning to political norms?",
          "link": "https://badfaithtimes.com/the-norms-respecters-have-to-be-stopped/",
          "publishedOn": "2025-07-17T12:18:00.000Z",
          "wordCount": 2405,
          "title": "The Norms Respecters Have To Be Stopped",
          "imageUrl": "https://badfaithtimes.com/content/images/size/w1200/2025/07/download.webp"
        },
        {
          "id": "687541afe989ff0001fb5e35",
          "author": "Denny Carter",
          "description": "The American right's bad-faith worldview and the entire MAGA project is threatened by Trump's inaction on the Epstein files.",
          "link": "https://badfaithtimes.com/why-the-epstein-thing-is-different/",
          "publishedOn": "2025-07-14T18:29:27.000Z",
          "wordCount": 2058,
          "title": "Why The Epstein Thing Is Different",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/07/unnamed--1-.jpg"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}