{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": [
        {
          "id": "https://blogs.fangraphs.com/?p=462523",
          "author": "Eric Longenhagen",
          "description": "Plus, an update on Braves right-hander Didier Fuentes.",
          "link": "https://blogs.fangraphs.com/scouting-todays-call-ups-chase-petty-noah-cameron-and-aj-blubaugh/",
          "publishedOn": "2025-04-30T18:30:09.000Z",
          "wordCount": null,
          "title": "Scouting Today’s Call-Ups: Chase Petty, Noah Cameron, and AJ Blubaugh",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=184459",
          "author": "Barry Petchesky",
          "description": "I've already completed my bucket list. It had one item on it. I didn't know that item was on my bucket list until I did it, or even that I had a list. But now I know that I will die having seen the rings of Saturn through a telescope. I would like you to make sure that you, too, die that way. Wait, that sounds ominous.\nLet me back up. It was about a decade ago, at some open house event at my neighborhood arts center, and someone had brought a telescope. I don't think he worked there; I think he just liked bringing his telescope places and letting people look through it. It wasn't even a particularly large telescope, to my eye: easily portable, set up on a tripod, and with a line of just two or three people waiting to use it. Can I look?, I asked, stupidly. You bet.",
          "link": "https://defector.com/i-implore-you-to-look-at-saturn-through-a-telescope",
          "publishedOn": "2025-05-01T18:34:33.000Z",
          "wordCount": 7852,
          "title": "I Implore You To Look At Saturn Through A Telescope",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-102724750.jpg"
        },
        {
          "id": "https://defector.com/?p=188422",
          "author": "Luis Paez-Pumar",
          "description": "As if in response to my minor complaint about the cagey first leg of the Arsenal vs. Paris Saint-Germain Champions League semifinal, the other semifinal, between Barcelona and Internazionale, served as a stark counterpart. A wide-open 3-3 thriller, up there with the best first-leg knockout matches of the tournament's last decade, had almost too much action to recap. The goals came hard and fast, and with almost otherworldly quality, from both sides, and Inter especially weathered a furious storm to pick its spots and send the tie back to Italy for the second leg all knotted up.\nThat's not to say, though, that all the goals, or even all the performances, were created equal. If ever a six-goal masterpiece could be distilled down to the exploits of one player, it was Wednesday's match. That player was, as it already has been in big-ticket showdowns and as it looks like it might be for years to come, Lamine Yamal, Barcelona's 17-year-old (17!) winger who isn't just the best prospect in the world by a mile; he might already be the best player on the planet, a whirlwind of technical prowess and creativity that European soccer hasn't seen since, well, another teenager suited up in the same club's colors.",
          "link": "https://defector.com/on-a-spectacular-night-lamine-yamal-shone-brightest",
          "publishedOn": "2025-05-01T16:45:04.000Z",
          "wordCount": 8709,
          "title": "On A Spectacular Night, Lamine Yamal Shone Brightest",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2212162593.jpg"
        },
        {
          "id": "https://defector.com/?p=188388",
          "author": "Samer Kalaf",
          "description": "Because of the widely negative reaction to Bill Belichick's tense and awkward interview on CBS Sunday Morning, he and Jordon Hudson, his girlfriend and managerial-type figure, have attempted to take back control of the narrative. The strategy so far: more open contempt. Let's see how this goes for them.\nOn Wednesday afternoon, the North Carolina football coach released a statement through the school, claiming that CBS and interviewer Tony Dokoupil had breached some kind of agreement to keep the topics limited to Belichick's new book:",
          "link": "https://defector.com/bill-belichicks-shit-isnt-flying-anymore",
          "publishedOn": "2025-05-01T16:23:08.000Z",
          "wordCount": 6933,
          "title": "Bill Belichick’s Shit Isn’t Flying Anymore",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/belichick-cbs-interview-2.jpg"
        },
        {
          "id": "https://defector.com/?p=188410",
          "author": "Kate Wagner",
          "description": "In April, after months of tech-dipshit palace intrigue, photos of Mark Zuckerberg’s long-rumored D.C. mansion finally spread their way through social media. Because Zuckerberg is an immensely disliked figure for democracy-destroying and culture-annihilating reasons, mass architectural criticism was equally swift.\nTo social media users, the house looked like everything from a dorm at a mid-sized state college to, well, a McMansion—which it is, in spirit. The building itself, designed by long-time domestic architect for various elites, Robert Gurney, is not particularly flamboyant, at least as far as rich people's houses are concerned. (Certainly it lacks the foam appliques so beloved by Donald Trump.) Clad monotonously in red brick, it features a central pared-down gable complete with a garage-door-esque picture window, flanked on either side by similarly gabled and frankly barn-like wings, each connected by breezeways.",
          "link": "https://defector.com/mark-zuckerberg-still-cant-buy-taste",
          "publishedOn": "2025-05-01T15:11:32.000Z",
          "wordCount": 8572,
          "title": "Mark Zuckerberg Still Can’t Buy Taste",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/ZuckHouse.jpg"
        },
        {
          "id": "https://defector.com/?p=188397",
          "author": "Chris Thompson",
          "description": "The Minnesota Timberwolves eliminated the higher-seeded Los Angeles Lakers Wednesday night, in Game 5 of their first-round series. The final score, 103–96, suggests a closely fought contest, but what it really shows is the Timberwolves missing way more than the usual number of three-pointers, plus, sure, some dignity in defeat from the Lakers. Minnesota led, in Los Angeles, for every minute of the first half, and often by double digits; the Lakers scrambled back in the third quarter, but Minnesota just eased away without a whole lot of extraordinary effort down the stretch of the fourth. You had the sense, by the end, that if these teams played for another two or six or 30 games, the Wolves would spend the bulk of the time ahead by 11 points, with some wobbles in there to account for streaky shooting.\nLately, when the Timberwolves win, you expect it to be because Anthony Edwards did something cool, or possibly even incredible. It's hard sometimes even to imagine how this year's Timberwolves win games without their All-NBA shot-creator creating and making lots of shots for himself. When they edged the Lakers in Game 4, it was largely because Edwards manufactured a huge fourth quarter against an exhausted Lakers lineup missing any semblance of rim protection. Not so Wednesday: Edwards made just five shots in 42 minutes in Game 5, bricked all 11 of his three-point attempts, and finished with just 15 points, tied for his fifth-lowest scoring output of the entire season. He scored just once in the fourth quarter, and made it to the free-throw line not at all. That is not to say he played poorly—Edwards grabbed 11 rebounds on the night and was credited with eight assists, did not turn the ball over even once, and had a game-high three steals—but the Wolves never got, and in the end never needed, one of his big signature scoring explosions.",
          "link": "https://defector.com/big-lakers-ambitions-squished-by-of-all-people-rudy-gobert",
          "publishedOn": "2025-05-01T13:01:03.000Z",
          "wordCount": 10331,
          "title": "Big Lakers Ambitions Squished By, Of All People, Rudy Gobert",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2212832934.jpg"
        },
        {
          "id": "https://defector.com/?p=188368",
          "author": "Ray Ratto",
          "description": "The Kentucky Derby is the undisputed crown jewel of a sport that has been diminishing in national notice for decades now, but it can stand in line on that. Kids just don't go to the track anymore, which is a shame because it remains a great place for young people to learn to smoke cigarettes and leave the butts in someone else's beer. The only real lure for fans outside Churchill Downs is the occasional Derby party, which is also the only time anyone drinks a mint julep. It's an industry that screams old folks' amusement.\nYou know, like the favorite in this year's race, Journalism.",
          "link": "https://defector.com/are-you-sure-you-want-to-bet-on-journalism",
          "publishedOn": "2025-04-30T19:11:29.000Z",
          "wordCount": 6918,
          "title": "Are You Sure You Want To Bet On Journalism?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212756259.jpg"
        },
        {
          "id": "https://defector.com/?p=188258",
          "author": "Tom Ley",
          "description": "ESPN published a fun oral history yesterday about how much it sucks to pitch at the Colorado Rockies' ballpark. The writers of the story wisely got in touch with current and former pitchers who have experienced the ERA-inflating effects of high-altitude pitching, and then let them recount their horror stories. I enjoyed the story a great deal, but one particular anecdote, from former Rockies reliever and current Seattle Mariners general manager Jerry Dipoto, stuck out to me.\nFrom the article:",
          "link": "https://defector.com/which-towering-dinger-in-denver-is-jerry-dipoto-actually-talking-about",
          "publishedOn": "2025-04-30T18:43:03.000Z",
          "wordCount": 7757,
          "title": "Which Towering Dinger In Denver Is Jerry Dipoto Actually Talking About?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-122852247.jpg"
        },
        {
          "id": "https://defector.com/?p=188332",
          "author": "Kathryn Xu",
          "description": "FLUSHING, N.Y. — To be honest, I wanted to see Corbin Carroll and Juan Soto have a game. I was faintly aware of the Arizona Diamondbacks bravely holding up the rear of the competitive teams in the NL West (four of them!), but during an obligatory pre-game database check, I learned that Carroll was having an obscene start. Per FanGraphs, he has been the second-best position player this season; per a cursory glance at Baseball Savant sliders, he had pivoted from a hitting profile traditional to players primarily described as \"fast\"—above-average plate discipline that'll get a guy on base well enough—to a faster swing and strikeout-happier approach that could—could!—mean he's now a bona fide slugger who also happens to be extremely fast. Meanwhile for Soto, it was a bit simpler: Surely he was due a game at this point.\nIn the way these things usually go, I got neither. Carroll went 0-for-4. Soto, despite two smoked line drives into the outfield, went 0-for-3 with a walk. The game itself carried little tension. In spite of David Roth doomposting in Slack about the post-blog Mets being struck down by possible season-ending surgery and a stomach bug, the lineup smacked around Diamondbacks starter Eduardo Rodríguez in the third and fourth inning to rack up a near-unloseable 7–0 lead. At that point, for the underprepared game-goer trembling in the Citi Field 500-level like a chihuahua that more closely resembles a stick insect than a dog, the only rooting interests were for some highlights to get pumped up about, and a kind ending time with respect to the NJ Transit train schedule.",
          "link": "https://defector.com/its-all-coming-up-mets",
          "publishedOn": "2025-04-30T17:37:19.000Z",
          "wordCount": 7487,
          "title": "It’s All Coming Up Mets",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/tyroneTaylorMetsDefense.jpg"
        },
        {
          "id": "https://defector.com/?p=188349",
          "author": "Patrick Redford",
          "description": "As any broadcast crew will point out the second he starts cooking, Jamal Murray owns a strange and wondrous NBA distinction: No player increases their scoring average more between the regular season and playoffs than Murray does. One can interpret that stat a number of ways, including asking the logical question of why someone who is so mission-critical to the Denver Nuggets winning anything serious can barely play himself onto all-star snub lists, but Murray's masterclass performance in Tuesday's Game 5 against the Los Angeles Clippers provided insurmountable evidence that his game is built for the biggest moments.\nMurray dropped 43 points on 26 shots, adding three steals, seven assists, and five boards—according to Basketball Reference's holistic game-score stat, his second-best postseason performance ever—and was comfortably the best player on the floor, as James Harden and Nikola Jokic neutralized each other, Kawhi Leonard was Fine, and Ivica Zubac had a good game on his government-mandated supply of six-foot half-hooks and putbacks. Everyone seemed, if not nervous, then exhausted from the mental and physical strain of the series, a conference-final wolf in first-rounder's clothing.",
          "link": "https://defector.com/jamal-murray-was-arrogant-and-generous-enough-to-craft-another-classic",
          "publishedOn": "2025-04-30T16:24:46.000Z",
          "wordCount": 7033,
          "title": "Jamal Murray Was Arrogant And Generous Enough To Craft Another Classic",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212108951.jpg"
        },
        {
          "id": "https://defector.com/?p=188357",
          "author": "Jae Towle Vieira",
          "description": "Certain friends make you braver. Sure, you might call friends like this a “bad influence,” but adventures with them are always memorable. \nHowever, when giggling with your friend over getting kicked out of a magic show turns into a flame war with the magician on Facebook—and when that magician happens to be a local celebrity with free time to burn and infinite capacity for honing a grudge—maybe it’s time to shift your focus from making memories to getting the hell out of town.",
          "link": "https://defector.com/a-run-in-with-the-mysterious-steve",
          "publishedOn": "2025-04-30T15:53:32.000Z",
          "wordCount": 5392,
          "title": "A Run-In With The Mysterious Steve",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2023/03/Normal_Gossip_16-9_V2.png"
        },
        {
          "id": "https://defector.com/?p=188315",
          "author": "Barry Petchesky",
          "description": "If—if!—one wanted to identify a trend, one might point out the successive results in the Maple Leafs–Senators series. In Game 1 the Leafs dominated. Games 2 and 3 required overtime to settle, with Toronto winning both. Game 4 also went to prolongation, this time with Ottawa finally breaking through. Tuesday night's Game 5 was a mostly comfortable 4-0 Sens win. Using my elite pattern recognition, honed by millions of years of evolution, I could note that the Senators have played increasingly well in each game, and the Maple Leafs increasingly worse. Ottawa's scoring by game is a line trending only up, while Toronto's veers dirtward.\nAnd if—if!!!—I chose to retreat to my mind palace to catalog and cite past events for the purposes of providing context for this series, I might reflect upon the fact that the Maple Leafs have a history of choking to death, especially in the first round, often against objectively less talented teams that nonetheless stop fearing them as the series moves along and the Leafs fail to clinch when the opportunity is available. Why, I might even observe that their core is 1-13 in series-clinching games, and 0-6 at home. I'm not saying any of this means the Leafs are gonna blow it again! I am not saying that. I'm just noticing things.",
          "link": "https://defector.com/do-not-say-the-leafs-could-blow-this-series-dont-even-think-it",
          "publishedOn": "2025-04-30T14:42:38.000Z",
          "wordCount": 6427,
          "title": "Do Not Say The Leafs Could Blow This Series. Don’t Even Think It!",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212092716.jpg"
        },
        {
          "id": "https://defector.com/?p=188306",
          "author": "Tom Ley",
          "description": "Dads can be embarrassing. The flashlight on their smart phone is always on for no reason, they put way too much effort into creating a rapport with waitstaff, and they are always nearly getting themselves killed by Giannis Antetokounmpo on national television.\nAs far as we know, only that last one applies to Tyrese Haliburton's father, who managed to turn himself into the big storyline of last night's Game 5 clash between the Bucks and Pacers, which ended in a series-clinching win for Indiana following a horrendous collapse by Milwaukee. Let's run through the collapse before we get to the dad content.",
          "link": "https://defector.com/haliburton-father-antetokounmpo",
          "publishedOn": "2025-04-30T13:24:04.000Z",
          "wordCount": 7021,
          "title": "Bucks Collapse Leads To Giannis Antetokounmpo Delivering Fatherhood Lessons To Tyrese Haliburton’s Dad",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212663683.jpg"
        },
        {
          "id": "https://defector.com/?p=188300",
          "author": "Luis Paez-Pumar",
          "description": "With the removal of the away goals rule, Champions League match-ups have tended towards more open play and riskier attacks in search of goals, particularly in the first legs. It makes sense. Without away goals hanging on the home team's head, it can push forward more often, knowing that giving up a goal is merely bad instead of potentially catastrophic. With that in mind, though, the first leg of the first semifinal, the one between Arsenal and Paris Saint-Germain, felt more like a match from the away goals era.\nIn part this is because of the lateness of this tie in the competition. It is only natural for both clubs to play conservatively, not wanting to fall right on the doorstep of the final (this is also why most, though not all, Champions League finals tend to be a bit underwhelming as actual matches), and so the order of the day for both the host Gunners and the visiting Parisians appeared to be safety. The other reason, however, is that PSG scored its first half-chance on a day of half-chances, a goal that immediately changed the complexion of the whole tie just four minutes in, and one that showed the difference between the two sides, particularly in attack.",
          "link": "https://defector.com/all-psg-needed-was-a-half-chance",
          "publishedOn": "2025-04-30T12:58:40.000Z",
          "wordCount": 9047,
          "title": "All PSG Needed Was A Half-Chance",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212066208.jpg"
        },
        {
          "id": "https://defector.com/?p=187703",
          "author": "Sabrina Imbler",
          "description": "Madyson Miller's Florida childhood was almost like a crash course in marine biology. She grew up going to the beach and going with her grandparents to see Shamu—\"which I obviously realize now is not the kind of value system I have when it comes to animal care,\" Miller caveats. But she wasn't sure if she wanted to pursue science—she dreamed of being on Broadway—until a teacher told her she had what it takes.\nMiller, a first-generation college student, initially struggled in university. \"I was a terrible test-taker, and my first year my grades just were not great,\" she said. \"I really thought, like, I'm not going to be able to do this.\" But then a professor offered Miller the chance to work in her lab studying the environmental DNA—genetic material shed by animals in their environment—of creatures like lionfish and salamanders. This experience in the lab cemented Miller's passion for biology, as well as her confidence that she could make it in the field.",
          "link": "https://defector.com/an-interview-with-a-fired-noaa-program-analyst",
          "publishedOn": "2025-04-29T19:59:33.000Z",
          "wordCount": 14810,
          "title": "An Interview With A Fired NOAA Program Analyst",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/Miller-Headshot.png"
        },
        {
          "id": "https://defector.com/?p=188221",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about country clubs, fixing your news diet, beard dandruff, and more.\nYour letters:",
          "link": "https://defector.com/its-time-for-mel-kiper-to-go",
          "publishedOn": "2025-04-29T18:44:45.000Z",
          "wordCount": 16342,
          "title": "It’s Time For Mel Kiper To Go",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-1252451670.jpg"
        },
        {
          "id": "https://defector.com/?p=187068",
          "author": "Diana Moskovitz",
          "description": "Todd Golden smiled as the orange and blue confetti fell around him. He had accomplished what no Florida Gators men's basketball coach had in nearly two decades—a national championship—bringing a title home to a university and a fan base desperate for a win. (The last national championship for Florida in football or basketball came in 2008, just a year after Apple announced the iPhone.) All those years of disappointment later, the scene played out exactly as it was supposed to. Florida players hugged and cried. Fans screamed. The marching band blasted the university fight song. Play-by-play broadcaster Ian Eagle called out on the TV broadcast a slight twist on the phrase every Florida student learns, \"It's a great day to be a Gator!\"\nAnd it was. The streets of Gainesville filled with jubilant students. The university's social media accounts boasted and bragged. Alumni young and old swelled with pride. All the years of losing, of coming up short, of watching other schools hoist trophies was swept away—as was any public memory of the two investigations involving two Florida basketball coaches: head coach Golden and one of his assistants, Gators legend Taurean Green.",
          "link": "https://defector.com/florida-built-a-black-box-and-put-the-todd-golden-case-inside-it",
          "publishedOn": "2025-04-29T17:56:30.000Z",
          "wordCount": 13322,
          "title": "Florida Built A Black Box And Put The Todd Golden Case Inside It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2208509825-e1744751146639.jpeg"
        },
        {
          "id": "https://defector.com/?p=188245",
          "author": "Jack Hanson",
          "description": "Curzio Malaparte was the shape-shifting Zelig of the catastrophe of Italian fascism, a political and social operator of such profound equivocation that in his writings he seems almost to convince even himself of his own sincerity. In Maurizio Serra’s comprehensive biography, first published in Italian in 2011 and now available in English from New York Review Books, we follow Malaparte’s skittering movements across a century to which he seems uniquely suited and yet, near daily, increasingly familiar to our own. \nBest known for his nightmarish 1944 novel of the Second World War, Kaputt, Malaparte—a novelist, journalist, playwright, diplomat, and filmmaker—wrote like a cross between Ernst Jünger and Thomas Pynchon, and lived like a daredevil prince. He was forever on the move, forever aggrieved, forever on the verge of world fame, even immortality, or, at the very least, slipping through whatever net was closing around him. He began his adult life as a fascist and became a communist in his later years (a conversion he seemed to think was more a shift of emphasis—his first book, 1931’s Coup d’Etat: The Technique of Revolution, argued that it was Mussolini’s own youthful Marxism that had made him such an effective revolutionary), before embracing Catholicism on his deathbed in 1957.",
          "link": "https://defector.com/the-perfect-fascist",
          "publishedOn": "2025-04-29T17:04:57.000Z",
          "wordCount": 12355,
          "title": "The Perfect Fascist",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-154070952.jpg"
        },
        {
          "id": "https://defector.com/?p=188218",
          "author": "Chris Thompson",
          "description": "First, some good news: The Colorado Rockies got a big early homer against the Atlanta Braves Monday, off the bat of designated hitter Hunter Goodman. The Rockies had two men on, and Atlanta's Bryce Elder threw a big fat cement-mixer of a slider, and Goodman put some mighty wood to it. Rockies play-by-play guy Drew Goodman (unrelated) couldn't immediately accept that something had happened to cause the home team to have more runs than the opposition. Here is the proof:\n\nhttps://www.youtube.com/watch?v=El9-UalE7JQ",
          "link": "https://defector.com/the-rockies-are-bad-at-every-part-of-baseball",
          "publishedOn": "2025-04-29T16:15:08.000Z",
          "wordCount": 7835,
          "title": "The Rockies Are Bad At Every Part Of Baseball",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211801549.jpg"
        },
        {
          "id": "https://defector.com/?p=188227",
          "author": "Patrick Redford",
          "description": "One reason the NBA Playoffs are great is that the postseason's competitive structure and tactical complexity make something like the Buddy Hield Game not only possible, but necessary.\nThe Golden State Warriors won a thriller in San Francisco on Monday night to take a 3–1 lead in their first-round series against the offensively inept and defensively murderous Houston Rockets, and they did so despite a straight-up bad game from Steph Curry. Watch any of the first three games from this series, and consider the state of Jimmy Butler's ass, and you would come to the logical conclusion that the Warriors were not set up to win any less-than-stellar Curry game, let alone a game in which Fred VanVleet made eight three-pointers. Unless Curry is forcing double-teams and bending Houston's strong, flexible defensive structure, Golden State's offense is largely incapable of making the Rockets sweat. Draymond Green, once and occasionally still a good passer, has been excised from the attack, and on Monday, Curry didn't have it.",
          "link": "https://defector.com/buddy-hield-to-the-rescue",
          "publishedOn": "2025-04-29T15:40:53.000Z",
          "wordCount": 7100,
          "title": "Buddy Hield To The Rescue",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/buddy-hield.jpeg"
        },
        {
          "id": "https://defector.com/?p=187997",
          "author": "Soraya Roberts",
          "description": "Anything I say about “Magnetic,” the lead single off TV On The Radio frontman Tunde Adebimpe’s first solo album, Thee Black Boltz, won’t live up to hearing it for the first time. Go listen to it. Better yet, go watch the video. It’s super simple. It’s black and white and it’s basically just Adebimpe shouting this perfect song into his mic all in black—those muscles, that bleached hair—and a woman (dancer Brooke Shepherd) in white bouncing and flailing around a massive amp with her supernaturally long arms clapping, thighs pumping, dreads flying. It’s the perfect dance, whatever it is, for this perfect music, whatever it is. Every time it ends, I have the impulse to turn it right back on again. It feels like life. Or like life’s supposed to feel. “I was thinkin' 'bout my time in space/I was thinkin' 'bout the human race/In the age of tenderness and rage/Had me kickin' through the end of days.” If you’re not writing this as the opening to your opening song, why’re you even bothering?\nMy favorite part, right before the chorus, right after Adebimpe sings, “We’re gonna crash your matrix/And how you gonna feel about that?\" has him following up with: “Why you wanna come like that”—and then a big, long pause—“for.” The chorus goes nuts. “Magnetic” is a great representative for this entire album, which gives space to whatever it wants.",
          "link": "https://defector.com/tunde-adebimpes-solo-debut-channels-the-gift-of-the-mixtape",
          "publishedOn": "2025-04-29T15:13:18.000Z",
          "wordCount": 8134,
          "title": "Tunde Adebimpe’s Solo Debut Channels The Gift Of The Mixtape",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/tundeadebimpe-theeblackboltz-4000px.jpg"
        },
        {
          "id": "https://defector.com/?p=187751",
          "author": "David Roth",
          "description": "When Steve Cohen bought the New York Mets near the end of the 2020 season, he acquired a property that was valuable, scarce, and absolutely lousy with toxic mold and crawling with skunks. The value was easy to see; there are only so many Major League Baseball franchises and they're not making new ones at the moment, which makes this both a good business to be in and one that doesn't do much to discourage the sort of laziness that led to those unaddressed mold/skunk issues under previous ownership. It is more difficult and more persistently demanding to be a smart baseball organization than a stupid one, and far more cost-effective in the long run, but from an owner's perspective it doesn't really make much of a difference. Smart teams win and dumb teams mostly don't, but owners do fine either way; the family that spent the better part of two decades making the Mets as mediocre and repellent as they could possibly be banked $2 billion in profit from the sale of the property they'd desecrated.\nThat sour mediocrity was the result not of a lack of effort, but of a heroic surplus of the worst and wrongest kinds of effort; neglect would have been a marked improvement upon the sort of toxic attention the owners lavished upon the organization. It wasn't that the Wilpons didn't want to win; they did, but only if it meant that the dumb things they cared about—a crabbed half-ideology devoted to various antique and idiotic rules and hierarchies, except when and where it was dictated by patronage or some salty executive whim—to be winning things, when they were not.",
          "link": "https://defector.com/the-mets-are-doing-the-hard-stuff-now",
          "publishedOn": "2025-04-29T13:03:24.000Z",
          "wordCount": 10743,
          "title": "The Mets Are Doing The Hard Stuff Now",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2209827443_52c067.jpg"
        },
        {
          "id": "https://defector.com/?p=188143",
          "author": "Chris Thompson",
          "description": "LeBron James failed to score a point in the fourth quarter of Game 4 of the Western Conference first-round series between his Lakers and the Minnesota Timberwolves. The Wolves erased a 12-point third-quarter deficit and won the game by a single bucket; with the victory they pulled into a 3–1 series lead over the higher-seeded Lakers, who are now a loss away from elimination. Worse, perhaps, than James's failure to score was Los Angeles's difficulty even getting him opportunities: The NBA's all-time leading scorer—fresh off a regular season in which he averaged 24.4 points per game on an outrageous 64 percent true shooting—attempted just two field goals in the fourth quarter of the most important game of his team's season. This, in technical terms, just ain't right.\nHowever much what I am a…",
          "link": "https://defector.com/jj-redick-pushed-the-panic-button-and-lost-anyway",
          "publishedOn": "2025-04-28T19:17:43.000Z",
          "wordCount": 9107,
          "title": "JJ Redick Pushed The Panic Button And Lost Anyway",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211794240.jpg"
        },
        {
          "id": "https://defector.com/?p=188157",
          "author": "Lauren Theisen",
          "description": "When you listen to a game on the radio, all you have is the noise. And in Montreal on Sunday night, stimulated by two dramatic events late in the second period, the Habs' arena swelled to the point of deafening, with a force that made me believe the home team might really have the power to knock out the No. 1 seed in the East. But after a giddy intermission under the banner of a 2-1 score, Canadiens fans watched—and I listened—helplessly as the prospect of a tied series was ripped away by a ruthless and experienced Washington Capitals group that took the breaks the local boys couldn't.\nFirst, the high point. With two minutes to go in the second and the score 1-1, a Capitals player was sent the box for one of several hits on both sides that got punished by the refs throughout a particularly physical game. But this wasn't just any player: This was the Greatest Goal Scorer Of All Time™, Alexander Ovechkin, who took the two for interference by trucking Jake Evans at the edge of the Caps' attacking zone. The Quebecois screams, shouts, and boos overwhelmed the announcement of the penalty, and for good reason. The newly crowned scoring king entering the sin bin for the first time in almost two months felt like an event in itself—the kind of rare, odd misstep that can doom a favorite in a tricky series.",
          "link": "https://defector.com/theres-nothing-like-the-sound-of-a-goal-in-montreal",
          "publishedOn": "2025-04-28T19:00:24.000Z",
          "wordCount": 6704,
          "title": "There’s Nothing Like The Sound Of A Goal In Montreal",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211798585.jpg"
        },
        {
          "id": "https://defector.com/?p=188047",
          "author": "Samer Kalaf",
          "description": "Bark at the Park is always a fun promotion. While a dog might not fully appreciate the crack of the bat, the pop of the mitt or James Wood's opposite-field power, they can perhaps enjoy a little piece of sausage that fell on the ground. And if there's anything a dog loves more than floor food, it's a barrage of extremely loud, booming noises. The Washington Nationals were happy to accommodate last weekend.",
          "link": "https://defector.com/the-nationals-know-what-goes-great-together-dogs-and-fireworks",
          "publishedOn": "2025-04-28T18:04:00.000Z",
          "wordCount": 6058,
          "title": "The Nationals Know What Goes Great Together: Dogs And Fireworks",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/washington-nationals-dogs-fireworks.jpg"
        },
        {
          "id": "https://defector.com/?p=188141",
          "author": "Patrick Redford",
          "description": "The Milwaukee Bucks got smoked by the Indiana Pacers in Game 4 on their home court, in a loss that felt less like ending a chapter and more like slamming a book shut, incinerating it, and purging the memory of ever having read it. They are now down 3–1 to a team that has proved matchup poison for them even in the best of times; Giannis Antetokounmpo's game is stretched as thin as his patience; they have swiftly degraded from a team with a strong identity to a team about nothing, playing yesterday's game with yesterday's players. Their only other good player just wrecked his leg, they handed their archrival a title in pursuing said good player, and because of that, they have no future. Four years after the Bucks won a championship, things are looking unimaginably bleak in Milwaukee.\nHalfway through the first quarter of Sunday's Game 4, Damian Lillard burst forward to tap an offensive rebound to the corner, then crumpled and instantly grabbed at the back of his left leg. As of this writing he has not received an official diagnosis, but everyone in the know is reporting that he probably did in his Achilles. With Lillard in the lineup, the Bucks had an essentially even point differential, with his 24.9 points per game being largely canceled out by his inability to even contain anyone with a live dribble. Still, they needed his offensive dynamism in the playoffs, because without him, the offense funnels to Bobby Portis and Kevin Porter Jr., and that's if the Bucks are lucky enough not to be dragged into a Kyle Kuzma game. Antetokounmpo is still the best player in this series, but everything he gets is very tough, and Indiana's extremely connected defense is never really stressed out by anything he does—again, because his team is butt.",
          "link": "https://defector.com/the-milwaukee-bucks-are-dead",
          "publishedOn": "2025-04-28T17:15:30.000Z",
          "wordCount": 7332,
          "title": "The Milwaukee Bucks Are Dead",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212317303.jpg"
        },
        {
          "id": "https://defector.com/?p=188114",
          "author": "Luis Paez-Pumar",
          "description": "If Liverpool wins the Premier League and no one is in the stands to celebrate it, does it count? Well, yes, but there's nothing quite like winning the club's record-tying 20th first-division title in front of a roaring Anfield crowd, as Liverpool found out on Sunday. Despite getting the Premier League trophy monkey off its back in the COVID-delayed 2019-20 season, Liverpool finished this season, the first after Jürgen Klopp and the first under Arne Slot, in style, shrugging off some cup disappointments with the one trophy that, for this club, means more than any other. Thanks to a comprehensive 5-1 victory over middling Tottenham, Anfield got its long-awaited party on Sunday, and now Liverpool once again sits atop its historic perch as the most successful club in English soccer history.\n\nhttps://www.youtube.com/watch?v=PVFSJRFNvXQ\n\"The Slot machine pays out the jackpot\" is such a dumb thing to say, I love it.",
          "link": "https://defector.com/liverpool-was-always-in-control",
          "publishedOn": "2025-04-28T16:13:22.000Z",
          "wordCount": 8141,
          "title": "Liverpool Was Always In Control",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212280586.jpg"
        },
        {
          "id": "https://defector.com/?p=188135",
          "author": "Ray Ratto",
          "description": "The Winnipeg Jets were the best hockey team in the world, largely because they had the best goalie in the world, until they weren’t and didn’t. They are now facing down the possibility of being the biggest disappointment in the sport, because their goalie has been the biggest disappointment. Again.\nTherein lies the problem Jets coach Scott Arniel arose to today: What to do about a three-year trend that plays itself out the same way every time. It's Wile E. Coyote sending away to Acme for the same contraption that breaks every time he uses it.",
          "link": "https://defector.com/the-jets-have-a-connor-hellebuyck-problem-and-the-only-solution-is-more-connor-hellebuyck",
          "publishedOn": "2025-04-28T15:30:11.000Z",
          "wordCount": 6716,
          "title": "The Jets Have A Connor Hellebuyck Problem, And The Only Solution Is More Connor Hellebuyck",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211195796.jpg"
        },
        {
          "id": "https://defector.com/?p=188093",
          "author": "Chris Thompson",
          "description": "The Texas Rangers found an excellent way to lose a baseball game Sunday night. Or, if they didn't find it or invent it, they at least deserve recognition for having iterated this delightful method. They were tied at two runs apiece with the San Francisco Giants in the bottom of the ninth inning, in what had been a somewhat choppy and frustrating game for both teams. Heliot Ramos of the Giants squibbed a first-pitch slider from Rangers reliever Luke Jackson; the ball left Ramos's bat at 58.7 miles per hour and traveled maybe 50 feet onto the left side of the infield grass. This is not what you want from whoever is leading off a late inning, but to Ramos's credit, he at least tore ass up the first-base line, forcing Jackson to attempt a quick and athletic play.\nThis is where things first went bad. Jackson, whose pitching motion has him falling off the mound toward first base, raced back the other way to field the ball on the move. Ramos was chugging. A wiser fielder might've pocketed this baseball and lived to fight another day. Jackson felt the pressure to make a play. He grabbed the ball bare-handed, rolled his throwing shoulder under his upper body, and almost blindly fired the ball to first, against his momentum and while crashing onto his back. It would've been an incredible, highlight out, except that Jackson's throw was really nowhere close, sailing up the field and well out of the reach of first-baseman Jake Burger. The ball bounced at the edge of the outfield and rolled away. Disaster!",
          "link": "https://defector.com/horrible-rangers-loss-also-really-funny",
          "publishedOn": "2025-04-28T15:08:56.000Z",
          "wordCount": 7670,
          "title": "Horrible Rangers Loss Also Really Funny",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212301111.jpg"
        },
        {
          "id": "https://defector.com/?p=188064",
          "author": "Maitreyi Anantharaman",
          "description": "It's time to wrap up the month with a challenging themeless. Keep an eye out for tricky clues and fun wordplay. This week’s puzzle was constructed by Rebecca Goldstein and edited by Hoang-Kim Vu. Rebecca is a research scientist and crossword constructor in the Bay Area. She is also a co-director of Westwords, a crossword tournament taking place in Berkeley, Calif., and online on June 22.\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE.",
          "link": "https://defector.com/the-crossword-april-28-you-dropped-this-king-themeless",
          "publishedOn": "2025-04-28T15:00:00.000Z",
          "wordCount": 5117,
          "title": "The Crossword, April 28: You Dropped This, King (Themeless)",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2159838184.jpg"
        },
        {
          "id": "https://defector.com/?p=188115",
          "author": "Tom Scocca",
          "description": "What does a successful Democratic opposition—or a successful Democratic presidency—look like? Patrick Healy, the deputy opinion editor of the New York Times, convened a roundtable of experts to discuss what he thought was that question. \"I caught some heat this winter from Democrats when I raised the idea that the party is in deeper trouble with voters than its leaders are admitting,\" Healy wrote. \nHealy is dedicated to the panel format. He spent election season working on a sort of anti-journalism project for the Times, in which the Opinion section, collaborating with professional political consultants, gathered focus groups of what it took to be regular Americans and encouraged them to express their ignorance, confusion, and secondhand beliefs, so that the newspaper could publish them as if they were facts. For instance:",
          "link": "https://defector.com/the-era-of-meek-government-is-over",
          "publishedOn": "2025-04-28T14:03:36.000Z",
          "wordCount": 10374,
          "title": "The Era Of Meek Government Is Over",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/clintons.jpeg"
        },
        {
          "id": "https://defector.com/?p=188087",
          "author": "Barry Petchesky",
          "description": "Give the Kings and Oilers this: Their commitment to never making anything easy has led to some pretty great TV. The games in this first-round series have mostly followed the same basic outline. The Kings nab a multi-goal lead; the Oilers score a couple to get back in it. The moments where the game scripts have differed—why the series is tied 2-2 rather than already decided, in either team's favor—have all come in act 3, and have hinged on whether L.A. can close out what it started, or whether Edmonton has enough time left for its furious late-game rallies. Neither is a particularly envious position to be in. But all else being equal, I'd rather be the team that gets better as games wear on rather than the one that mostly seems to get tired.\nThe Oilers took Game 4 in Edmonton 4-3 in overtime Sunday night, by—what else?—a multi-goal, third-period comeback. It doesn't even get to the extra frame without Quinton Byfield failing to clear the puck and instead turning it over to Evan Bouchard with under a minute left. I'll chalk it up to being gassed—heavy legs and low oxygen levels make for bad decisions and worse execution—and Byfield, who's going to be a huge star if he's not there already, ended up playing a whopping 38 shifts in this one, most among forwards on either team. But fail to clear he did, and Bouchard scored his second unanswered of the period to tie things up.",
          "link": "https://defector.com/the-kings-are-wearing-out",
          "publishedOn": "2025-04-28T13:41:53.000Z",
          "wordCount": 7239,
          "title": "The Kings Are Wearing Out",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211817890.jpg"
        },
        {
          "id": "https://defector.com/?p=188062",
          "author": "Samer Kalaf",
          "description": "It was a bad weekend for football coaches' zoomer sons. During the early stages of Shedeur Sanders's unexpectedly protracted draft experience, he was faked out by a phone call on Friday from someone pretending to be New Orleans Saints general manager Mickey Loomis. \"We're going to take you with our next pick right here, man,\" the caller said. \"But you're going to have to wait a little bit longer, man. Sorry about that.\" As pranks go, this was mostly confusing; Sanders's response to the call was to ask the guests at his draft party, \"What does that mean?\" While it was just one of many indignities heaped upon Sanders during the draft, the call was inarguably the rudest.\nOn Sunday, the culprit was identified: Jax Ulbrich, the 21-year-old son of Atlanta Falcons defensive coordinator Jeff Ulbrich. Presumably the NFL's investigation was pretty efficient, because these idiots recorded themselves making the prank call and put it online. Here's the call from both sides:",
          "link": "https://defector.com/jeff-ulbrich-jax-ulbrich-shedeur-sanders-prank-call-nfl-draft",
          "publishedOn": "2025-04-28T13:06:28.000Z",
          "wordCount": 7138,
          "title": "Jeff Ulbrich’s Dreadful Son Was Behind The Shedeur Sanders Prank Call",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2190107261.jpg"
        },
        {
          "id": "https://defector.com/?p=188058",
          "author": "Ray Ratto",
          "description": "In a just world, Tim Hardaway Jr. makes that three-pointer from the corner, and the Detroit Pistons beat the New York Knicks, 96-94. Not, \"In a just world, David Guthrie calls that foul,\" even though he performed that rarest of mea culpae: the official's admission of doctrinal error. This may seem like a needle's-eye distinction, but we're not here to indulge a rant about bad officiating. If that's you, you deserve to drink alone, outside. In a hailstorm. In Scotland.\nBut we're also willing to say that in a just world, Cade Cunningham makes that 14-footer seven seconds earlier, and the Pistons beat the Knicks, 95-94. Not because we care about the Pistons, or for that matter the Knicks. In a good and entertaining series, the team that is behind should always tie the series up to increase the chances of Game 7 Christmas, and Knicks-Pistons is indeed that. That New York survived Sunday, 94-93, and took a 3-1 lead over Detroit is not good, not good at all, because it could make Game 5 on Tuesday the clincher, and there has never been a seven-game series that ends in five that has been worth a damn or remembered as anything special.",
          "link": "https://defector.com/the-knicks-got-away-with-that-one",
          "publishedOn": "2025-04-27T21:44:53.000Z",
          "wordCount": 6334,
          "title": "The Knicks Got Away With That One",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212283506.jpg"
        },
        {
          "id": "https://defector.com/?p=188048",
          "author": "Samer Kalaf",
          "description": "Former New England Patriots head coach Bill Belichick isn't one for non-mandatory media appearances, but those with a book to sell don't really have a choice. The North Carolina football coach sat down with Tony Dokoupil for a CBS Sunday Morning conversation that started out as routine and then turned agonizing when the interviewer began to ask questions that might actually interest the public.\n\nhttps://youtu.be/ZStmSZoc_Ps?si=BBK1DGv1xK_wzP04&t=328",
          "link": "https://defector.com/bill-belichick-brings-his-trademark-charm-to-excruciating-cbs-interview",
          "publishedOn": "2025-04-27T20:44:40.000Z",
          "wordCount": 5815,
          "title": "Bill Belichick Brings His Trademark Charm To Excruciating CBS Interview",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/bill-belichick-cbs.jpg"
        },
        {
          "id": "https://defector.com/?p=188051",
          "author": "Ray Ratto",
          "description": "NBC football gabbler Jon Champion said it early in Liverpool's crowning achievement on Sunday: \"Tottenham is in many ways the ideal opponent for this occasion.\" Even though it wasn't a stretch to realize that, he nailed it, for it was the sentence that served both as an upraised finger to celebrate the Reds' Premier League championship nearly two hours before it was made official, and a thumb straight in the eye of a Tottenham side that fully laid down to insure the title celebration.\n\nhttps://www.youtube.com/watch?v=3POvYkYFo30",
          "link": "https://defector.com/tottenham-was-a-polite-guest-for-liverpools-title-party",
          "publishedOn": "2025-04-27T19:21:36.000Z",
          "wordCount": 6014,
          "title": "Tottenham Was A Polite Guest For Liverpool’s Title Party",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211732588.jpg"
        },
        {
          "id": "https://defector.com/?p=188044",
          "author": "Ray Ratto",
          "description": "If Eugenio Suárez had his preference, he might have chosen a different day to hit four home runs in a game. But given that he entered Saturday's game batting .167 for the season, he was in no position to be picky. To his credit, neither he nor the Arizona Diamondbacks are so ungracious.",
          "link": "https://defector.com/eugenio-suarez-picked-a-bad-day-to-hit-four-homers",
          "publishedOn": "2025-04-27T16:18:32.000Z",
          "wordCount": 6553,
          "title": "Eugenio Suárez Picked A Bad Day To Hit Four Homers",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212166943.jpg"
        },
        {
          "id": "https://defector.com/?p=188037",
          "author": "Samer Kalaf",
          "description": "Nikola Jokic knew his shot wasn't going in. After the conclusion of Game 4 on Saturday, he shared his thoughts while the ball traveled through the air: \"This is gonna be bad.\" He was correct. But out of nowhere, his teammate Aaron Gordon arrived to turn an airball into a buzzer-beating dunk, allowing the Denver Nuggets to escape with a 101-99 win that guaranteed at least two more games in an incredible series against the Los Angeles Clippers.\n\nhttps://www.youtube.com/watch?v=N0PE3BwrJIQ",
          "link": "https://defector.com/aaron-gordon-bails-out-nuggets-with-buzzer-beating-dunk",
          "publishedOn": "2025-04-27T14:51:53.000Z",
          "wordCount": 6335,
          "title": "Aaron Gordon Bails Out Nuggets With Buzzer-Beating Dunk",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212156613.jpg"
        },
        {
          "id": "https://defector.com/?p=188031",
          "author": "Samer Kalaf",
          "description": "Hours before the NFL Draft began on Thursday, Shedeur Sanders expressed his readiness. \"I’m built for whatever today may bring,\" the quarterback prospect tweeted. After the first round ended without a team picking Sanders, the gag wrote itself: What about tomorrow? When nobody selected him in the second or third rounds on Friday, and a prank caller interrupted his live-streamed draft party to deliver false hope, it all became a bit sad.\n\nhttps://www.youtube.com/shorts/a49Qsn4poAE",
          "link": "https://defector.com/shedeur-sanders-nfl-draft-cleveland-browns",
          "publishedOn": "2025-04-27T14:11:18.000Z",
          "wordCount": 6834,
          "title": "Shedeur Sanders’s Weekend Of Humiliation Ends With Him Going To The Browns",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212126365.jpg"
        },
        {
          "id": "https://defector.com/?p=187969",
          "author": "Samer Kalaf",
          "description": "Even by the standards of Fox Corp, Fox Sports 1 seems like a pretty sinister place for an employee. Over the past few months, enough lawsuits, complaints, and allegations have emerged to suggest that the workplace environment is so rotten and sinister that it might be best to raze it and start over.",
          "link": "https://defector.com/seal-up-the-pit-that-contains-fox-sports-1",
          "publishedOn": "2025-04-25T20:36:19.000Z",
          "wordCount": 6842,
          "title": "Seal Up The Pit That Contains Fox Sports 1",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/undisputed-skip-shannon.jpg"
        },
        {
          "id": "https://defector.com/?p=187970",
          "author": "Albert Burneko",
          "description": "Grave editorial failure only seldom can be located in something as precise as a single word choice. The following block-quoted sentence, from a Thursday article by New York Times technology reporter Kevin Roose, contains one, and it feels like journalistic malpractice that his editor or editors let him type it. I bet you can spot the word:\nThere is a small body of academic research on A.I. model welfare, and a modest but growing number of experts in fields like philosophy and neuroscience are taking the prospect of A.I. consciousness more seriously, as A.I. systems grow more intelligent.",
          "link": "https://defector.com/only-kevin-rooses-editors-despise-him-more-than-i-do",
          "publishedOn": "2025-04-25T18:23:11.000Z",
          "wordCount": 8046,
          "title": "Only Kevin Roose’s Editors Despise Him More Than I Do",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/robot-guy.jpeg"
        },
        {
          "id": "https://defector.com/?p=187927",
          "author": "Dave McKenna",
          "description": "Boxing needs big events. And here comes one, maybe: A three-fight card made up of some of the biggest names in the game–Teofimo Lopez, Devin Haney, and headlining headcase Ryan Garcia–is scheduled for Friday, May 2, outdoors in Times Square. \nThe bill is intriguing enough. Garcia, who somehow remains a sympathetic figure despite being a very insistent and public asshole coming off a cheating suspension, is as compelling a character as the fight game offers these days. But the Times Square setting takes things to another level.",
          "link": "https://defector.com/saudi-arabias-latest-boxing-spectacle-is-a-times-square-fight-card-with-no-start-time-and-no-tickets",
          "publishedOn": "2025-04-25T16:26:45.000Z",
          "wordCount": 7292,
          "title": "Saudi Arabia’s Latest Boxing Spectacle Is A Times Square Fight Card With No Start Time And No Tickets",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2190296061.jpg"
        },
        {
          "id": "https://defector.com/?p=187960",
          "author": "Ray Ratto",
          "description": "There was a 20-minute window on Thursday night when the Vancouver Grizzlies looked like they very much belonged in the NBA Playoffs. And yeah, we said Vancouver. That was the uniform they wore for this one, and the name across that uniform's front. You want to be Memphis, make a uniform you like.\nThen again, maybe Memphis should stay in their Vancouvers. Because other than those 20 minutes, give or take, in the first half Thursday night, their team has gotten out-and-out Wizarded by the Oklahoma City Thunder. That a Grizzlies team that tailspun its way into the playoffs would get wiped out by the top seed in the Western Conference isn’t a surprise, but they’re getting wiped out in a weird way, and Thursday night's 114-108 loss to the 'Der was both the worst and weirdest of the three losses.",
          "link": "https://defector.com/for-20-minutes-the-memphis-grizzlies-were-actually-in-it",
          "publishedOn": "2025-04-25T15:52:14.000Z",
          "wordCount": 8003,
          "title": "For 20 Minutes, The Memphis Grizzlies Were Actually In It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211860890.jpg"
        },
        {
          "id": "https://defector.com/?p=187944",
          "author": "Barry Petchesky",
          "description": "The numbers and the highlights agree: The Minnesota Wild's top line is the league's most dangerous right now. High-scoring wingers Matt Boldy and Kirill Kaprizov, centered by Joel Eriksson Ek, are dominating play every minute they're on the ice, outshooting opponents 21-13 at 5-on-5 and outchancing them 26-11. This is no mean feat coming largely against Vegas's own formidable first line of Barbashev-Eichel-Stone, all of whom have yet to score a point through three games of the series. The Wild forwards are imposing their will in every zone, and executing on a level that makes even their most optimistic efforts result in legitimate chances.\nIf you're not watching the Minnesota Wild because of their historic Minnesota Wildness, you're missing out on some of the most confident offensive hockey being played. Take this saucer breakout from Kaprizov on Tuesday, which Boldy called \"the best pass I've ever seen.\"",
          "link": "https://defector.com/vegas-cant-answer-the-call-of-the-wild",
          "publishedOn": "2025-04-25T15:29:06.000Z",
          "wordCount": 6547,
          "title": "Vegas Can’t Answer The Call Of The Wild",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211181487.jpg"
        },
        {
          "id": "https://defector.com/?p=187930",
          "author": "Ray Ratto",
          "description": "Let someone else be the one to parse out Shedeur Sanders Agonistes. Meanwhile, on the internet's version of Page 8, there is the news that the Toronto Maple Leafs have now played three full playoff games and haven't lost one yet. Nothing raises suspicion quite like a perennial un-winner suddenly seeming to reconstruct its historical effluent, and while it's way early, these are still the Leafs. They are to be trusted with good fortune the way Pete Hegseth is to be trusted with troop deployments.\nYet with Thursday’s 3-2 overtime win over the Senators in Game 3 of the Great Ontario Wank they have become the first team to take a 3-0 series lead, and toward that end have taken a 3-0 lead in a four-game series for only the second time since Canada became fully independent from Queenie Liz in 1982. The Leafs are Canada's team and Canada's banana peel, because the playoffs are their goal and their undoing, and have been since 1967.",
          "link": "https://defector.com/the-leafs-are-in-uncharted-territory",
          "publishedOn": "2025-04-25T14:05:32.000Z",
          "wordCount": 6411,
          "title": "The Leafs Are In Uncharted Territory",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211173608.jpg"
        },
        {
          "id": "https://defector.com/?p=187929",
          "author": "Israel Daramola",
          "description": "NFL draft coverage has long been an industry unto itself for pundits and networks, but judging by the aerial shots over Green Bay, Wis., where last night's opening round was held, it’s also become something like sports-nerd Coachella. Some 200,000 people showed up to watch what is ultimately a boring product, only slightly more interesting than Marvel livestreaming a bunch of chairs with actors' names on it. But the draft thrives as an event for two reasons: 1) it sells hope, and sports fans love hope 2) it makes for a long TV broadcast, and the league loves its long TV broadcasts, so much so that it will go out of its way to lengthen the proceedings through brute geographical force.\n\nhttps://youtu.be/7-02YJAiA1M?feature=shared",
          "link": "https://defector.com/the-draft-tunnel-is-too-long",
          "publishedOn": "2025-04-25T13:40:25.000Z",
          "wordCount": 6215,
          "title": "The Draft Tunnel Is Too Long",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211847319.jpg"
        },
        {
          "id": "https://defector.com/?p=187811",
          "author": "Maitreyi Anantharaman",
          "description": "The PWHL season resumes on Saturday after a three-week international break for the Women’s World Championship in Czechia. In the absence of play, there has still been some action: The league announced plans to expand to Vancouver next season, at a press conference this week. But people around the PWHL have come to question the breaks, which accommodate an international tournament schedule designed before the league existed. “It's a long three weeks,” Marie-Philip Poulin told The Canadian Press, adding that it might make more sense to reschedule the international tournaments so they are not happening, say, right in the middle of a playoff push. \nIf nothing else, the break makes for a fun, weird wrench in the season. For the league-leading Montréal Victoire, whose games before the break were tense and sluggish, maybe it was needed. For the New York Sirens, winners of back-to-back regulation games before the break, maybe it was ill-timed. When teams take the ice again, all of them but Montréal still vying for the spot in the four-team playoff, they'll have three regular-season games left to play before the postseason starts.",
          "link": "https://defector.com/hilary-knights-not-rested-but-she-is-ready",
          "publishedOn": "2025-04-24T21:32:40.000Z",
          "wordCount": 6816,
          "title": "Hilary Knight’s Not Rested, But She Is Ready",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2202091043.jpg"
        },
        {
          "id": "https://defector.com/?p=187853",
          "author": "Tom Ley",
          "description": "ESPN host Shannon Sharpe released a statement Thursday announcing that he will \"step aside temporarily\" from his role at the network. It came four days after Sharpe was sued by a Nevada woman who said that he raped her twice.\nAccording to the lawsuit, filed in Clark County District Court, the woman met Sharpe when she was 19 at a Los Angeles gym in 2023. The suit said the two began \"a rocky consensual relationship\" that lasted nearly two years, but Sharpe became increasingly controlling and violent as time went on. Sharpe choked and hit her on multiple occasions, the suit said, and also threatened to kill her for accusing him of infidelity and resisting his sexual advances. The lawsuit claimed that Sharpe raped the woman once in October 2024, and again in January 2025. It asked for $50 million.",
          "link": "https://defector.com/shannon-sharpe-stepping-away-from-espn-following-sexual-assault-lawsuit",
          "publishedOn": "2025-04-24T20:22:35.000Z",
          "wordCount": 6083,
          "title": "Shannon Sharpe Stepping Away From ESPN Following Sexual Assault Lawsuit",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2200704634.jpg"
        },
        {
          "id": "https://defector.com/?p=187773",
          "author": "David Roth",
          "description": "You could hear it on the horizon, getting louder as the hour and object drew closer. It was the sound of Drew, on his way back from vacation, making the NFL Draft chime at peak volume as he prepared to return to the podcast in time for the beginning of the draft. Drew loves it enough for the both of us and also a decent number of you all as well, so there was no way that we weren't going to Talk Football upon his return from Puerto Rico. After a brief discussion of his vacation misadventures, highlighted by him groaning through watching Gabriel Iglesias complain about wokeism and pronouns, and immediately after a stirring a capella version of that very same NFL Draft chime from Drew, we did just that.",
          "link": "https://defector.com/journey-within-the-football-guy-brain-with-mike-tanier",
          "publishedOn": "2025-04-24T19:41:58.000Z",
          "wordCount": 6963,
          "title": "Journey Within The Football Guy Brain, With Mike Tanier",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2187509475.jpg"
        },
        {
          "id": "https://defector.com/?p=187825",
          "author": "Patrick Redford",
          "description": "Here is a backhanded compliment: The Houston Rockets have been one of the most fascinating teams in the league all year. The competitive dynamic of basketball is changing, and the Rockets epitomize the trajectory of that shift, with their deep rotation of committed hellraisers and one of the game's category-busting Thompson twins. What fascinates is that they won 52 games with depth, cussed determination, and an objectively bad half-court offense. \nThe Rockets have built an incredible roster, stocked with all the sorts of players needed to win big except for the most important one. That deviant style stuff is fun and cool and has not tended to work in the playoffs, where defenses lock in and erase a lot of easy effort buckets. What matters here, to be reductive, is how good your best perimeter offensive player is. How relieving for Houston then that Jalen Green had himself a fantastic Game 2.",
          "link": "https://defector.com/jalen-green-stops-killing-the-rockets-long-enough-to-kill-the-warriors-instead",
          "publishedOn": "2025-04-24T18:31:26.000Z",
          "wordCount": 6857,
          "title": "Jalen Green Stops Killing The Rockets Long Enough To Kill The Warriors Instead",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211703986.jpg"
        },
        {
          "id": "https://defector.com/?p=187833",
          "author": "Abigail Segel",
          "description": "TORONTO — For a moment, there was silence. Not even two minutes into AFC Toronto's inaugural match in the National Super League, Canada's brand new professional women's soccer league, Tanya Boychuck had taken advantage of a nervy mistake to put Montréal Roses FC ahead 1–0. Boychuck was stunned, and so was the sold-out crowd at BMO Field. The hush was biting, but it was soon replaced by what had been there before the goal: singing. \nThe song was coming from section 114, where the Vermilion Vanguard stood. The Vanguard is a new independent supporters' group founded by a dedicated set of AFC Toronto fans. It was a windy day at the lakeside, but their chants of \"A-F-C TOR-ONT-O,\" to the tune of the chords of \"Seven Nation Army\" by the White Stripes, were clear enough for me to hear them from the press box.",
          "link": "https://defector.com/the-vermilion-vanguard-is-on-the-march",
          "publishedOn": "2025-04-24T18:08:23.000Z",
          "wordCount": 13783,
          "title": "The Vermilion Vanguard Is On The March",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/8C2FC574-96DE-491E-8EC6-A4318C379959_1_105_c.jpeg"
        },
        {
          "id": "https://defector.com/?p=187395",
          "author": "Sabrina Imbler",
          "description": "When Matt O'Malley was forced out of his position at the National Resources Conservation Service, he didn't just lose a job: He lost a job he'd worked toward for 15 years.\nO'Malley first learned about the NRCS as an undergraduate. The agency, which is a part of the United States Department of Agriculture, helps landowners conserve their natural resources. He studied biological systems engineering, which would allow him to focus his work on helping farmers and agricultural producers achieve a more sustainable relationship with their land. To him, working for the NRCS would mean \"looking towards the public good and working with typically smaller farmers who don't have access to the same type of inputs and opportunities that larger commercial farms do, helping them succeed, and doing it in a way that also helps the land.\"",
          "link": "https://defector.com/an-interview-with-a-fired-usda-agricultural-engineer",
          "publishedOn": "2025-04-24T16:24:00.000Z",
          "wordCount": 12850,
          "title": "An Interview With A Fired USDA Agricultural Engineer",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/20240915_140556.jpg"
        },
        {
          "id": "https://defector.com/?p=187787",
          "author": "Drew Magary",
          "description": "Drew Magary’s Thursday Afternoon NFL Dick Joke Jamboroo runs every Thursday at Defector during the NFL season. Got something you wanna contribute? Email the Roo. And buy Drew’s book, The Night The Lights Went Out, through here.\nI’m one of those people now. For nearly two decades, I have treated some of the primary actors in the NFL Draft process—the anonymous scouts, the combine interrogators, the Andy Benoits—with the disdain that they have richly deserved. These are the people who, come early spring, fill the great sucking void in the NFL news cycle with their pettiest gripes regarding top prospects. Before he was drafted first overall and went on to have a borderline Hall of Fame career, Cam Newton accounted for some of the most truly deranged pre-draft analysis I’ve ever had the displeasure of reading. You probably remember those Cam takes, just as you remember Bill Polian suggesting that Lamar Jackson should play wideout, or Mike Mayock publicly marveling at Andrus Peat’s bubble butt. All of these men were not only socially ignorant, but often quite wrong about the very men they were attacking. I enjoyed being above them.",
          "link": "https://defector.com/secrets-of-the-worlds-foremost-nfl-youtube-grinder",
          "publishedOn": "2025-04-24T15:32:25.000Z",
          "wordCount": 14607,
          "title": "Secrets Of The World’s Foremost NFL YouTube Grinder",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-348763.jpg"
        },
        {
          "id": "https://defector.com/?p=187784",
          "author": "Barry Petchesky",
          "description": "I'd rather gaze directly upon the opening of the Ark of the Covenant than spend too much time looking at Stuart Skinner's horrid numbers in the early (but getting late fast) postseason going. The Oilers goalie has allowed 11 goals on just 58 shots over, functionally, five and a half periods, surrendering six to the Kings in a wild Game 1 and five Wednesday night before being yanked for Calvin Pickard. Pickard promptly allowed a goal on the first shot he faced, which, if it was a salve to Skinner's wounded pride, was gifted not netminder-to-netminder, but by an Edmonton defense that is playing like it holds a grudge against its own backstop.\nPickard will almost surely get the start in a must-have Game 3 back in Edmonton, after the Kings took care of business, 6-2. I am not convinced it will matter. \"No team in this league can give up the amount of Grade As and high-danger chances that we've been giving up,\" Darnell Nurse said. \"We've been hanging our goalie out to dry.\"",
          "link": "https://defector.com/the-oilers-are-getting-carved-up-like-a-moist-and-tender-turkey",
          "publishedOn": "2025-04-24T13:59:35.000Z",
          "wordCount": 6455,
          "title": "The Oilers Are Getting Carved Up Like A Moist And Tender Turkey",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211376428.jpg"
        },
        {
          "id": "https://defector.com/?p=187756",
          "author": "Kathryn Xu",
          "description": "It is possible to accurately calculate the Philadelphia Phillies' record based only on the current state of the team's NBC Sports Philadelphia postgame show, but doing so requires context: It is late April, and the Phillies have just gotten swept by the Mets, who, in the interest of not burying the lede, currently have the best record in all of Major League Baseball; and we are talking about Philly local sports media. So while, say, a 10–15 record would be a perfectly reasonable guess for the day after a postgame commentator asks if it's \"time to sound the alarm,\" astute advanced models will be sure to recalibrate to a much more average 13–12. Which happens to actually be the team's record! Congratulations to all parties involved.\nJohn Kruk, Phillies color commentator and noted voice of reason, tried his best to slow the show's roll. \"I don't know how you make up three games in 130 games left, or 130-something games left,\" he said on Tuesday night, sarcastically, in response to the sound-the-alarm question. \"It's going to be tough when the season's winding down like it is.\" (At the time, the Phillies had 138 games left to play.) He continued, \"My God, what are we talking about?\" An excellent philosophical question, as initially posed by Raymond Carver: What do we talk about when we talk about late-April baseball?",
          "link": "https://defector.com/mets-invincible-phillies-on-bullet-train-to-hell",
          "publishedOn": "2025-04-24T12:59:00.000Z",
          "wordCount": 7535,
          "title": "Mets Invincible, Phillies On Bullet-Train To Hell",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/starlingMarteMetsBestRecord.jpg"
        },
        {
          "id": "https://defector.com/?p=187729",
          "author": "Maitreyi Anantharaman",
          "description": "Against the Dodgers last night, the Cubs gave up three runs in the top of the first, scored five runs in the bottom of the first, and none of it really mattered, because what happens at the beginning of a Cubs game has little bearing on what happens at the end. There is no lead so great it can’t be frittered away. There is no deficit too imposing. In the span of five days, they’ve won two of the wackiest games of the MLB season to stay on top of the NL Central. “It’s a fun team to watch play, that’s what I’d tell you,” manager Craig Counsell said after Tuesday’s 11-10 walk-off win, wearing a slightly rattled and unconvincing smile. \n\nhttps://www.youtube.com/watch?v=zn_KjpuEWuI",
          "link": "https://defector.com/the-cubs-love-to-get-crooked",
          "publishedOn": "2025-04-23T20:39:55.000Z",
          "wordCount": 7521,
          "title": "The Cubs Love To Get Crooked",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211529243.jpg"
        },
        {
          "id": "https://defector.com/?p=187724",
          "author": "Alex Shultz",
          "description": "It has been more than 60 years since the first Sports Illustrated swimsuit issue hit newsstands, a moment in history that bound the business of sports journalism to the business of making sports fans horny.\nWhat started as a way for bored SI editors to amuse themselves during the slow period of the sports calendar soon grew into an annual event capable of subsidizing much of the rest of the magazine. When sports bloggers eventually rose to power in the 2000s and early 2010s, they internalized the lessons of the swimsuit issue, and ate into SI’s subscription and advertising revenue. In their heyday, these bloggers’ randy posts about WAGs, cheerleaders, and random college students were given prominent placement on popular sports sites.",
          "link": "https://defector.com/horny-sports-blogging-makes-a-bewildering-return-to-sports-illustrated",
          "publishedOn": "2025-04-23T17:09:24.000Z",
          "wordCount": 14984,
          "title": "Horny Sports Blogging Makes A Bewildering Return To Sports Illustrated",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/SI.jpg"
        },
        {
          "id": "https://defector.com/?p=187717",
          "author": "Luis Paez-Pumar",
          "description": "One of the tenets of being a Miami Marlins fan is that the future will always be presented as the appeal. The Marlins have made it a habit to trade away star after star for prospects who could eventually become stars, only to then be traded away for more prospects. Logic and reason would lead the team's fans to develop commitment issues, and in turn perhaps shy away from any promising young player, knowing that his time with the Marlins begins to come to an end the second he starts pitching well, or hitting like a machine.\nFortunately, \"logic\" and \"reason\" rarely exist in sports fandom, which is why I believe Agustín Ramírez will slug 1.000 and live forever. The 23-year-old catcher came to South Florida as another star left the Marlins: He was one of the New York Yankees' prospects in the trade for Jazz Chisholm Jr. last July. After a solid second half of the season with the delightfully named Triple-A affiliate Jacksonville Jumbo Shrimp, and a brief stint at the same club to start this year, Ramírez was called up on Monday as the Marlins began a three-game series against the Cincinnati Reds. After only two games, Ramírez has already found himself in the franchise's record books, and he's become the new promising young player to enjoy for an indeterminate amount of time. Given that he's only on the roster due to injuries to catchers Nick Fortes and Rob Brantly, Ramírez's monster debut is found money for a team that currently has few options behind the plate.",
          "link": "https://defector.com/enjoy-the-agustin-ramirez-show-for-as-long-as-it-lasts",
          "publishedOn": "2025-04-23T16:13:13.000Z",
          "wordCount": 6758,
          "title": "Enjoy The Agustín Ramírez Show For As Long As It Lasts",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211430524.jpg"
        },
        {
          "id": "https://defector.com/?p=187736",
          "author": "Jae Towle Vieira",
          "description": "Nothing puts the icing on a mistake like having time to squirm. Desperately brainstorming ways to set things right before your error is discovered gives you a waking-life taste of that nightmare feeling, doesn’t it? \nTurns out heists are baby shit. It’s the reverse heist—delicate operations performed under the emotional weight of both fear and regret—that really puts you in another league. Today we bring you a tale of immaculately curated decor, a beautiful Border Collie, and a prank gone wrong.",
          "link": "https://defector.com/the-fine-line-between-a-prank-and-a-crime",
          "publishedOn": "2025-04-23T15:06:00.000Z",
          "wordCount": 5344,
          "title": "The Fine Line Between A Prank And A Crime",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2023/03/Normal_Gossip_16-9_V2.png"
        },
        {
          "id": "https://defector.com/?p=187708",
          "author": "Chris Thompson",
          "description": "James Wood, 22-year-old outfielder for the Washington Nationals, is mighty big and mighty strong. I think we've been very clear on this matter. Washington's offense, to date, isn't much—they rank eighth worst in the majors both by Statcast's Weighted On-base Average and by Baseball Reference's OPS+—but you cannot blame this on Wood, who is ranked third in the National League in home runs (7) and is 10th in runs batted in, and whose OPS Wednesday morning is a robust .902. Tuesday night Wood batted leadoff in the opening game of a series against the Baltimore Orioles, and had three hits, two doubles, and scored a pair of runs, and the Nationals won for the third time in four games.\nAnother area where our record here at Defector is unimpeachable: We have always been very up front about the fact that Wood, when he hits the ball, tends to hit the dick off of it. His average exit velocity this season is 94 miles per hour, per Statcast, in baseball's sixth percentile and better than such so-called strongmen as Vladimir Guerrero Jr., Bryce Harper, Elly De La Cruz, and Juan Soto. Tuesday's performance, though dingerless, was a showcase of power: The three balls that Wood put in play averaged 108.3 miles per hour off his bat. The 109-mph double he pounded off the wall in the fifth inning only failed to reach the stands due to its screaming 21-degree launch angle. His second-inning single was hit at 107.6 miles per hour and stayed on the infield, but ate up Orioles shortstop Gunnar Henderson, allowing Wood to beat the throw to first. Oh right, Wood is also fast as hell, ranking in baseball's 77th percentile by sprint speed.",
          "link": "https://defector.com/james-wood-is-a-special-case",
          "publishedOn": "2025-04-23T14:11:12.000Z",
          "wordCount": 8157,
          "title": "James Wood Is A Special Case",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210746523.jpg"
        },
        {
          "id": "https://defector.com/?p=187677",
          "author": "Jake Romm",
          "description": "What you need to understand about the Zionist propaganda project October 8 (originally titled October H8te) is that calling it a film at all is generous.",
          "link": "https://defector.com/the-paranoid-fantasies-of-october-8",
          "publishedOn": "2025-04-23T13:13:51.000Z",
          "wordCount": 12006,
          "title": "The Paranoid Fantasies Of ‘October 8’",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/October8.png"
        },
        {
          "id": "https://defector.com/?p=187617",
          "author": "Albert Burneko",
          "description": "Have you ever been lonely? I mean really lonely. Think of the loneliest you ever were. Transpose that experience of loneliness to the bottom of a mineshaft. Oof, right? Anyway, bear that in mind.\nFormer Business Insider CEO and co-founder Henry Blodget, these days the sole proprietor and staffer of the blog/media company Regenerator, published a curious blog on his website on Monday. In it he details the events of an afternoon he spent on his laptop in a Brooklyn coffee shop prompting the ChatGPT program to generate and impersonate four members of an \"AI team\" he would employ at Regenerator, which the company's sole human employee had decided would now be a \"native-AI newsroom,\" and then interacting with the four personas the chatbot adopted in response to his prompts.",
          "link": "https://defector.com/henry-blodget-invents-hires-sexually-harasses-blogs-about-nonexistent-ai-subordinate",
          "publishedOn": "2025-04-22T19:38:40.000Z",
          "wordCount": 8319,
          "title": "Henry Blodget Invents, Hires, Sexually Harasses, Blogs About Nonexistent AI Subordinate",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/robot-lady.jpeg"
        },
        {
          "id": "https://defector.com/?p=187660",
          "author": "Ray Ratto",
          "description": "Whatever Nico Harrison did that made it so that he would have to destroy himself so publicly rather than just have everyone else do it for him, it must have been a doozy. But even if Harrison did nothing to offend a vengeful deity or the universe at large and has just been the designated corporate crap-catcher for the Dallas Mavericks organization all along, he is out there destroying himself in public all the same. And yet the story of the Luka Doncic trade simply won't go away, despite the Mavericks themselves having been swept brusquely out of the play-in, solely because the people who run the team keep bringing it up. This suggests that they think Harrison having to eat garbage by the shovelful, on camera and on the record, is good off-season marketing.\nThat can be the only reason that the Harrison Self-Abasement Tour continues, even to the point that Charles Barkley interrupts TNT's apology for accidentally killing the still very much alive Billy Ray Bates to tell Harrison, whom Barkley said he “considers a friend,” to stop being a public figure.",
          "link": "https://defector.com/the-mavericks-just-keep-on-sending-nico-harrison-out-there",
          "publishedOn": "2025-04-22T18:04:41.000Z",
          "wordCount": 7538,
          "title": "The Mavericks Just Keep On Sending Nico Harrison Out There",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210936979.jpg"
        },
        {
          "id": "https://defector.com/?p=187627",
          "author": "Patrick Redford",
          "description": "If you simply looked at the box score from Game 2 of the Detroit Pistons–New York Knicks series and tried to reverse-engineer some narratives, you would probably look at Jalen Brunson's 37 points and seven assists (both game-highs), Karl-Anthony Towns's 10 anonymous points in 33 minutes, and the final score showing a 100–94 Pistons win and conclude that Brunson had a great game and that the Knicks dropped a game at home because his bum-ass teammates didn't step up. Wrong! Let's check the highlight reel.",
          "link": "https://defector.com/jalen-brunson-is-the-nbas-premier-falling-down-artist",
          "publishedOn": "2025-04-22T17:51:29.000Z",
          "wordCount": 7202,
          "title": "Jalen Brunson Is The NBA’s Premier Falling-Down Artist",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211361707.jpg"
        },
        {
          "id": "https://defector.com/?p=187595",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about smoking, swingers, eating fishing lures, and more.\nYour letters:",
          "link": "https://defector.com/let-travis-hunter-be-football-ohtani",
          "publishedOn": "2025-04-22T17:06:01.000Z",
          "wordCount": 16601,
          "title": "Let Travis Hunter Be Football Ohtani",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2187642784.jpg"
        },
        {
          "id": "https://defector.com/?p=187600",
          "author": "Chris Thompson",
          "description": "Hey, the Atlanta Braves won a game! Not just one, either: Nine of them, while you were off oiling your disgusting mustache. Nine of 15, in fact. Over the weekend they won their second series of the season, sweeping the visiting Minnesota Twins, and then Monday they triumphed in a rousing 7-6 effort against the dreaded St. Louis Cardinals. After a hateful start to the season that saw the Braves get wiped out in consecutive road series against the cream of the National League West, they have started to get healthy, literally and figuratively, against the merely human, and are on the move.\nTheir latest win was a fun one. Braves hitters had a normal amount of trouble across six innings against St. Louis starter Erick Fedde, plating a pair of runs in the third on an Austin Riley sockdolager but otherwise looking generally punchless. This is both because Fedde is good and because Atlanta's offense—even while managing to outscore opponents more often than not since opening week—has not yet hit its stride. With the Cardinals up a run in the bottom of the eighth, a hard-chugging Riley beat out an infield single, and two batters later Matt Olson drove him home with a single through the right side. A walk and a sacrifice fly put the Braves up a run and brought Sean Murphy to the plate. Murphy's power bat has been everything the Braves could've hoped for since returning from injury, and he came up huge in this spot, leveling a mighty rip at a meatball of a first-pitch changeup from Cardinals reliever JoJo Romero and crushing a three-run dinger to left. Atlanta's bullpen tried to blow the lead but could not, and today the very same Braves who opened the season 0–7 are sitting on a four-game win streak.",
          "link": "https://defector.com/the-hobbled-braves-are-hanging-in-there",
          "publishedOn": "2025-04-22T16:43:07.000Z",
          "wordCount": 8361,
          "title": "The Hobbled Braves Are Hanging In There",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210794425.jpg"
        },
        {
          "id": "https://defector.com/?p=187579",
          "author": "Dan McQuade",
          "description": "Monday was the White House Easter Egg Roll, an annual event in which children gather on the lawn and get to meet the president, first lady, and Easter Bunny. Then they all roll eggs down the lawn, I guess—I dunno, I’ve never really seen the thing. Presumably there’s a winner, someone who rolls the most eggs, or rolls them the furthest or the most accurately or just the most to the liking of the president, first lady, and Easter Bunny. I assume this year’s prize was the opportunity to join a group chat dedicated to discussing the U.S. military’s next airstrike.\nBut this year’s event had an extra plum for all the children in attendance, and not just because there were corrupt sponsorships. At one point Donald Trump approached a group of children, knelt down and showed them a collectible trading card with a photo of himself on it. You know the photo: the one in which he was raising his fist in the air after being shot. Hey, the children have to learn about assassination attempts at some point; why not from a man who survived one himself?",
          "link": "https://defector.com/trump-shows-kids-collectible-card-with-photo-of-him-being-shot",
          "publishedOn": "2025-04-22T16:26:24.000Z",
          "wordCount": 9010,
          "title": "Trump Shows Kids Collectible Card With Photo Of Him Being Shot",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/trump-card.jpg"
        },
        {
          "id": "https://defector.com/?p=187520",
          "author": "Israel Daramola",
          "description": "For the entirety of his career so far, there has been some consternation over Ryan Coogler's gifts as a director. His major debut Fruitvale Station was admirable and exciting, but was also a classic first-time director indie film. Creed was a lightning-rod moment: the revitalization of a dormant and dead-seeming IP in Rocky, the comeback of Sylvester Stallone as serious actor, and the validation of both Coogler and his muse Michael B. Jordan as Hollywood mainstays. But it is IP, and it is as much about the Rocky formula as it is about the filmmakers. And, obviously, there were Marvel's Black Panther films, which for all of their virtues remain Marvel films. Coogler, like a lot of talented, capable young filmmakers, got quickly nabbed by the Hollywood system, and good for him, but there has always been a question about what he can do with his own purely original work. Finally, with Sinners, Coogler has put his decade of experience behind his own idea.\nSinners tells the story of twin brothers Elijah \"Smoke\" Moore and Elias \"Stack\" Moore (both played by Michael B. Jordan), bootlegging gangsters and WWI veterans returning home to the Mississippi Delta from Chicago in 1932. It's the opening of their new juke joint built out on former Klan property, and they plan to start off strong with music from their little cousin, Sammie a.k.a. Preacher Boy (Miles Caton), and local blues legend Delta Slim (Delroy Lindo). They have also employed Smoke's former lover Annie (Wunmi Mosaku) and Chinese shopkeepers Grace and Bo Chow (Li Jun Li and Yao, respectively). But later on in the night, everyone there gets more than they bargained for when the power of the blues seems to open a portal to hell and attract a legion of vampires, led by Irish immigrant Remmick (Jack O'Connell), who systematically picks off the entire party in pursuit of Preacher Boy and his ability to commune with the ancestral spirit through his music.",
          "link": "https://defector.com/sinners-is-a-worthy-blockbuster",
          "publishedOn": "2025-04-22T14:39:10.000Z",
          "wordCount": 7444,
          "title": "‘Sinners’ Is A Worthy Blockbuster",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/sinners.jpg"
        },
        {
          "id": "https://defector.com/?p=187559",
          "author": "Barry Petchesky",
          "description": "It is, I insist, cool and good that one of the wildest and most intense playoff games in a while ended so stupidly. It rules, quite frankly, that a game which saw the Kings seemingly exorcise their Oiler-matchup demons, then collapse in the face of a sudden Edmonton onslaught, was ultimately decided by a blooper-reel goal. Hockey is a ludicrous sport sometimes, and puck often lies, and had Phillip Danault taken a normal shot, Stuart Skinner probably would have stopped it easily and Game 1 would've headed to overtime, the Oilers carrying all the momentum after erasing a four-goal deficit. But Danault fanned, and fluttered the puck with comical slowness past Skinner, who saw neither hide nor hair of it.\n\nhttps://www.youtube.com/watch?v=TwyDSh7YJLo&ab_channel=SPORTSNET",
          "link": "https://defector.com/kings-oilers-wacky",
          "publishedOn": "2025-04-22T13:47:13.000Z",
          "wordCount": 6451,
          "title": "It Rocks When A Hockey Game Is Funny",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210804441.jpg"
        },
        {
          "id": "https://defector.com/?p=187560",
          "author": "Tom Ley",
          "description": "A closely contested NBA playoff game is an insanity device. Every turnover is a rake across the brain, every missed free throw a boil on the soul. Each second of game time that passes is designed to pull the contents of your guts closer and closer to the edge of your throat. If that is what it feels like to watch it, I can't imagine what it must be like on the court.\nNone of this applies to Kawhi Leonard. Despite his close proximity to the action, I spent most of Monday night's Game 2 clash between the Nuggets and Clippers wishing I could trade places with him. Even when he had the ball in his hands with under a minute left, readying himself to take what would be the deciding shot in L.A.'s 105-102 victory, it was impossible to imagine anyone, anywhere, more at peace than Kawhi Leonard.",
          "link": "https://defector.com/kawhi-leonard-is-just-living-with-it",
          "publishedOn": "2025-04-22T13:04:58.000Z",
          "wordCount": 7049,
          "title": "Kawhi Leonard Is Just Living With It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210794178.jpg"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=850450",
          "author": "Steve Adams",
          "description": "The Royals have selected the contract of righty Taylor Clarke from Triple-A Omaha and optioned lefty Noah Cameron back to Triple-A after yesterday’s MLB debut, per a team announcement. Righty James McArthur was transferred from the 15-day IL to the 60-day IL to open a spot on the 40-man roster for Clarke. McArthur has been…",
          "link": "https://www.mlbtraderumors.com/2025/05/royals-select-taylor-clarke-option-noah-cameron.html",
          "publishedOn": "2025-05-01T15:26:39.000Z",
          "wordCount": 3558,
          "title": "Royals Select Taylor Clarke, Option Noah Cameron",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2023/12/taylor-clarke-royals-1024x673.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=850213",
          "author": "Anthony Franco",
          "description": "Left-hander Noah Cameron is listed as the Royals’ probable starter for Wednesday evening’s game against the Rays. He’ll go opposite Drew Rasmussen in his major league debut. Cameron was added to the 40-man roster last November, but Kansas City will need to recall him while making a corresponding active roster move involving a pitcher. This would…",
          "link": "https://www.mlbtraderumors.com/2025/04/royals-to-promote-noah-cameron.html",
          "publishedOn": "2025-04-29T23:00:54.000Z",
          "wordCount": 3419,
          "title": "Royals To Promote Noah Cameron",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/04/USATSI_25787800-1024x1024.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=849615",
          "author": "Anthony Franco",
          "description": "Royals top prospect Jac Caglianone is playing right field for Double-A Northwest Arkansas tonight. It’s the first career outfield work for the lefty power hitter, who had played exclusively first base since being drafted with the #6 overall pick last summer. Caglianone had been a two-way star at the University of Florida, but his only defensive…",
          "link": "https://www.mlbtraderumors.com/2025/04/royals-notes-caglianone-ragans-marsh.html",
          "publishedOn": "2025-04-25T03:08:28.000Z",
          "wordCount": 3777,
          "title": "Royals Notes: Caglianone, Ragans, Marsh",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/04/USATSI_25787812-1024x1024.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=849577",
          "author": "Anthony Franco",
          "description": "MLBTR continues our division by division look at next year’s team/mutual option class with the AL Central. Virtually all of the mutual options will be bought out by one side. Generally, if the team is willing to retain the player at the option price, the player will decline his end in search of a better…",
          "link": "https://www.mlbtraderumors.com/2025/04/looking-ahead-to-club-options-al-central.html",
          "publishedOn": "2025-04-24T23:38:48.000Z",
          "wordCount": 4462,
          "title": "Looking Ahead To Club Options: AL Central",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/04/USATSI_25989308-1024x683.jpg"
        }
      ]
    },
    {
      "title": "Flaming Hydra",
      "feedUrl": "https://flaminghydra.com/rss/",
      "siteUrl": "https://flaminghydra.com/",
      "articles": [
        {
          "id": "6813b7789d3b0600014e85a0",
          "author": "The Editors",
          "description": "Today: Kim Kelly, author of FIGHT LIKE HELL: The Untold History of American Labor and founding editor of Salvo; Tom Scocca, editor of Indignity; and writer and editor Maria Bustillos.\n\nIssue No. 311\nHappy May Day, fellow workers!\nKim Kelly\nThe Wrong Side of History\nTom Scocca and Maria",
          "link": "https://flaminghydra.com/issue-311/",
          "publishedOn": "2025-05-01T19:30:07.000Z",
          "wordCount": 1767,
          "title": "Fight the bosses / Leave them kids alone",
          "imageUrl": "https://flaminghydra.com/content/images/2025/05/San_Jose_May_Day_01-crop-1.jpg"
        },
        {
          "id": "681360a19d3b0600014e8435",
          "author": "Kim Kelly",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/happy-may-day-fellow-workers/",
          "publishedOn": "2025-05-01T19:29:54.000Z",
          "wordCount": 324,
          "title": "Happy May Day, fellow workers!",
          "imageUrl": "https://flaminghydra.com/content/images/2025/05/San_Jose_May_Day_01-crop.jpg"
        },
        {
          "id": "6813aefe9d3b0600014e8552",
          "author": "Tom Scocca",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/the-wrong-side-of-history/",
          "publishedOn": "2025-05-01T19:29:40.000Z",
          "wordCount": 323,
          "title": "The Wrong Side of History",
          "imageUrl": "https://flaminghydra.com/content/images/2025/05/David_Horowitz_by_Gage_Skidmore-crop-duo-tight-16x9.jpg"
        },
        {
          "id": "681282fa13780600015fbbac",
          "author": "The Editors",
          "description": "Myriam Gurba talks with journalist Daniel Alvarenga about El Salvador",
          "link": "https://flaminghydra.com/issue-310/",
          "publishedOn": "2025-04-30T23:24:50.000Z",
          "wordCount": 642,
          "title": "Speak now",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/nayib.jpg"
        },
        {
          "id": "68127dc513780600015fbb8d",
          "author": "Myriam Gurba",
          "description": "An Interview with Daniel Alvarenga",
          "link": "https://flaminghydra.com/when-disobedience-saves-lives/",
          "publishedOn": "2025-04-30T22:47:32.000Z",
          "wordCount": 618,
          "title": "When Disobedience Saves Lives",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/nayib-2.jpg"
        },
        {
          "id": "6811276d13780600015fa7f9",
          "author": "The Editors",
          "description": "Anna Merlan, TikTok habitué; Joe MacLeod phones in to Andy Richter",
          "link": "https://flaminghydra.com/issue-309/",
          "publishedOn": "2025-04-29T22:27:10.000Z",
          "wordCount": 638,
          "title": "Shared suffering / Loyal listener",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/pear-16x9-1.jpg"
        },
        {
          "id": "681132e813780600015fa828",
          "author": "Joe MacLeod",
          "description": "I LOVE TO listen to radio in all its forms. I enjoy podcasts, satellite radio, and regular “terrestrial” radio, the original Radio! Mostly, I like to listen to funny stuff, and I have been listening to The Andy Richter Call-In Show on satellite radio, that I pay for,",
          "link": "https://flaminghydra.com/first-time-long-time-last-time/",
          "publishedOn": "2025-04-29T22:26:30.000Z",
          "wordCount": 544,
          "title": "First Time Long Time Last Time",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/andy-richter-call-in-panel-16w-flat.jpg"
        },
        {
          "id": "6810d49513780600015fa701",
          "author": "Anna Merlan",
          "description": "I started watching TikTok videos as research for work, but in the way bad habits tend to do, this one eventually bled outwards into the rest of my life. Now, while doing chores around the house, any time there’s some dead air I want to fill, I inevitably",
          "link": "https://flaminghydra.com/symphony-of-destruction/",
          "publishedOn": "2025-04-29T22:26:11.000Z",
          "wordCount": 656,
          "title": "Symphony of Destruction",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/pear-16x9.jpg"
        },
        {
          "id": "680fe6750d4ed5000161656f",
          "author": "The Editors",
          "description": "Zach Rabiroff on the war on immigrants; all the way to Memphis with Jack Pendarvis",
          "link": "https://flaminghydra.com/issue-308/",
          "publishedOn": "2025-04-28T23:48:32.000Z",
          "wordCount": 793,
          "title": "Brutal anonymity / Famous names",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/braceros-1.jpg"
        },
        {
          "id": "680c08760d4ed50001614d7e",
          "author": "Jack Pendarvis",
          "description": "a collective of 60 writers, on fire and hard to kill",
          "link": "https://flaminghydra.com/ace-goes-to-hollywood-episode-5/",
          "publishedOn": "2025-04-28T23:46:21.000Z",
          "wordCount": 320,
          "title": "Ace Goes to Hollywood: Episode 5",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/teenie.jpg"
        },
        {
          "id": "680fa52b0d4ed5000161642f",
          "author": "Zach Rabiroff",
          "description": "“The president directed the Departments of Homeland Security and Justice to ‘apprehend, restrain, secure, and remove every’ Venezuelan migrant, 14 and older, who is deemed to be a part of Tren de Aragua and who lacks U.S. citizenship or permanent residency.” So began the news",
          "link": "https://flaminghydra.com/the-name-of-kilmar-abrego-garcia/",
          "publishedOn": "2025-04-28T23:46:00.000Z",
          "wordCount": 814,
          "title": "The Name of Kilmar Ábrego García",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/braceros.jpg"
        },
        {
          "id": "680bebb80d4ed50001614cf9",
          "author": "The Editors",
          "description": "In-flight superhero analysis with Brian Hioe",
          "link": "https://flaminghydra.com/issue-307/",
          "publishedOn": "2025-04-25T22:52:35.000Z",
          "wordCount": 304,
          "title": "Formless evil",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/capt-explodin-cop-car-1.jpg"
        },
        {
          "id": "680be7ee0d4ed50001614c92",
          "author": "Brian Hioe",
          "description": "a collective of 60 writers, on fire and hard to kill",
          "link": "https://flaminghydra.com/airplane-movies/",
          "publishedOn": "2025-04-25T22:42:18.000Z",
          "wordCount": 302,
          "title": "Airplane Movies",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/capt-explodin-cop-car.jpg"
        },
        {
          "id": "680aa2350d4ed50001613aa6",
          "author": "The Editors",
          "description": "Yemisi Aribisala on the temptations of rage",
          "link": "https://flaminghydra.com/issue-306/",
          "publishedOn": "2025-04-24T22:54:15.000Z",
          "wordCount": 676,
          "title": "Complex fats",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/IMG_4847-2-.jpg"
        },
        {
          "id": "680a9fb70d4ed50001613a36",
          "author": "Yemisi Aribisala",
          "description": "In February 2021, Evan Kleiman, a North American chef and radio personality broadcasting from Santa Monica, California, asked me about palm oil. She said “It’s such an intrinsic part of your cuisine, not at all what we think about when we think of palm oil. Explain the",
          "link": "https://flaminghydra.com/of-men-and-palm-oil/",
          "publishedOn": "2025-04-24T22:53:58.000Z",
          "wordCount": 740,
          "title": "Of Men and Palm Oil",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/yemisi-palm-oil-IMG_4847-16x.jpg"
        },
        {
          "id": "68095cf70d4ed500016123dd",
          "author": "The Editors",
          "description": "Ana Marie Cox on death and salvation",
          "link": "https://flaminghydra.com/issue-305/",
          "publishedOn": "2025-04-24T00:51:45.000Z",
          "wordCount": 575,
          "title": "Death watch",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/rolex-edit-IMG_3041-1.jpg"
        },
        {
          "id": "6808f2590d4ed500016122f9",
          "author": "Ana Marie Cox",
          "description": "I’ve known since she died that the horror of my mother’s death was a gift. The images of my beautiful mother with her hands drawn up into claws, her lips pale and unrouged, the light out in her eyes, the soft and hesitant way she looked",
          "link": "https://flaminghydra.com/inheritance/",
          "publishedOn": "2025-04-24T00:49:54.000Z",
          "wordCount": 631,
          "title": "Inheritance",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/rolex-edit-IMG_3041.jpg"
        },
        {
          "id": "6807fcfae515060001208f95",
          "author": "The Editors",
          "description": "Talia Lavin on finding the words; Carrie Frye talks The Awl: The Book",
          "link": "https://flaminghydra.com/issue-304/",
          "publishedOn": "2025-04-23T00:03:09.000Z",
          "wordCount": 698,
          "title": "Cold and empty",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/drifts-16w-1.jpg"
        },
        {
          "id": "68080c71e515060001208fda",
          "author": "Talia Lavin",
          "description": "In Russian, writer’s block is known as “fear of the white page.” Or the white screen, in my case. When I sat down to write, my hands shook, in time with the blinking cursor. In the days after Donald Trump’s second inauguration, the sense",
          "link": "https://flaminghydra.com/wordless/",
          "publishedOn": "2025-04-23T00:02:43.000Z",
          "wordCount": 730,
          "title": "Wordless",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/drifts-16w.jpg"
        },
        {
          "id": "68082425e515060001209044",
          "author": "Carrie Frye",
          "description": "Maria Bustillos gabs with Carrie Frye about The Awl and the new THE AWL: THE BOOK! Joe MacLeod pressed the RECORD button.\nListen on Apple/Spotify/RSS/plus more options at pod.link\n\nEpisode 8: Internet pals\nCarrie Frye and Maria Bustillos talk about THE AWL",
          "link": "https://flaminghydra.com/podcast-round-table-episode-8-internet-pals/",
          "publishedOn": "2025-04-23T00:02:20.000Z",
          "wordCount": 429,
          "title": "PODCAST Round Table! Episode 8: Internet Pals",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/awl-IMG_2310.jpg"
        },
        {
          "id": "68082425e515060001209044",
          "author": "Carrie Frye",
          "description": "Maria Bustillos gabs with Carrie Frye about The Awl and the new THE AWL: THE BOOK! Joe MacLeod pressed the RECORD button.\nListen on Apple/Spotify/RSS/plus more options at pod.link\n\nEpisode 8: Internet pals\nCarrie Frye and Maria Bustillos talk about THE AWL",
          "link": "https://flaminghydra.com/podcast-round-table-episode-3-internet-pals/",
          "publishedOn": "2025-04-23T00:02:20.000Z",
          "wordCount": 429,
          "title": "PODCAST Round Table! Episode 3: Internet Pals",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/awl-IMG_2310.jpg"
        }
      ]
    },
    {
      "title": "Today in Tabs",
      "feedUrl": "https://rss.beehiiv.com/feeds/ZRiesnGI0u.xml",
      "siteUrl": "https://www.todayintabs.com/",
      "articles": []
    },
    {
      "title": "Bad Faith Times",
      "feedUrl": "https://bad-faith-times.ghost.io/rss/",
      "siteUrl": "https://bad-faith-times.ghost.io/",
      "articles": [
        {
          "id": "6813a5ece5dfee00015e7550",
          "author": "Denny Carter",
          "description": "JB Pritzker gets it",
          "link": "https://bad-faith-times.ghost.io/bft-podcast-the-leader-of-the-fight-caucus-is-here/",
          "publishedOn": "2025-05-01T17:11:10.000Z",
          "wordCount": 593,
          "title": "BFT Podcast: The Leader Of The Fight Caucus Is Here",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/size/w1200/2025/05/Screenshot-2025-05-01-at-1.03.55-PM.png"
        },
        {
          "id": "68124fb6934fee0001f1e649",
          "author": "Denny Carter",
          "description": "A message from after the Great Redo",
          "link": "https://bad-faith-times.ghost.io/a-blog-post-from-the-glorious-future/",
          "publishedOn": "2025-04-30T16:50:29.000Z",
          "wordCount": 1745,
          "title": "A Blog Post From The Glorious Future",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/04/Screenshot-2025-04-30-at-12.43.16-PM.png"
        },
        {
          "id": "680fb3bdce5fdd0001296435",
          "author": "Denny Carter",
          "description": "Senator Elissa Slotkin says Democrats need the \"goddamn alpha energy\" of Dan Campbell. She's half right.",
          "link": "https://bad-faith-times.ghost.io/alpha-energy-is-not-what-you-think-it-is/",
          "publishedOn": "2025-04-28T17:23:35.000Z",
          "wordCount": 1649,
          "title": "'Alpha Energy' Is Not What You Think It Is",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/04/Screenshot-2025-04-28-at-1.20.16-PM.png"
        },
        {
          "id": "680a8157db769a000141cb93",
          "author": "Denny Carter",
          "description": "Pete Hegseth is breaking barriers in levels of being not mad at all",
          "link": "https://bad-faith-times.ghost.io/bft-podcast-leaky-pete-is-mad/",
          "publishedOn": "2025-04-25T11:36:44.000Z",
          "wordCount": 635,
          "title": "BFT Podcast: Leaky Pete Is Mad",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/size/w1200/2025/04/Screenshot-2025-04-24-at-2.30.23-PM.png"
        },
        {
          "id": "680a4e47db769a000141c602",
          "author": "Denny Carter",
          "description": "Mockery, not viciousness and mean-spiritedness, has proven far more effective in beating back autocracy",
          "link": "https://bad-faith-times.ghost.io/the-fatal-flaw-of-dark-woke/",
          "publishedOn": "2025-04-24T15:19:20.000Z",
          "wordCount": 2689,
          "title": "The Fatal Flaw Of 'Dark Woke'",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/size/w1200/2025/04/31020496355_cb17578a91_h.jpg"
        },
        {
          "id": "68079a95c3c2590001577733",
          "author": "Denny Carter",
          "description": "In three months we've seen Elon Musk go from planning a thousand year autocratic regime to retreating to play with his rockets and cars",
          "link": "https://bad-faith-times.ghost.io/these-guys-are-so-soft/",
          "publishedOn": "2025-04-22T16:39:21.000Z",
          "wordCount": 1409,
          "title": "These Guys Are So Soft",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/04/Screenshot-2025-04-22-at-12.38.12-PM.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}