{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": []
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=187787",
          "author": "Drew Magary",
          "description": "Drew Magary’s Thursday Afternoon NFL Dick Joke Jamboroo runs every Thursday at Defector during the NFL season. Got something you wanna contribute? Email the Roo. And buy Drew’s book, The Night The Lights Went Out, through here.\nI’m one of those people now. For nearly two decades, I have treated some of the primary actors in the NFL Draft process—the anonymous scouts, the combine interrogators, the Andy Benoits—with the disdain that they have richly deserved. These are the people who, come early spring, fill the great sucking void in the NFL news cycle with their pettiest gripes regarding top prospects. Before he was drafted first overall and went on to have a borderline Hall of Fame career, Cam Newton accounted for some of the most truly deranged pre-draft analysis I’ve ever had the displeasure of reading. You probably remember those Cam takes, just as you remember Bill Polian suggesting that Lamar Jackson should play wideout, or Mike Mayock publicly marveling at Andrus Peat’s bubble butt. All of these men were not only socially ignorant, but often quite wrong about the very men they were attacking. I enjoyed being above them.",
          "link": "https://defector.com/secrets-of-the-worlds-foremost-nfl-youtube-grinder",
          "publishedOn": "2025-04-24T15:32:25.000Z",
          "wordCount": 14607,
          "title": "Secrets Of The World’s Foremost NFL YouTube Grinder",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-348763.jpg"
        },
        {
          "id": "https://defector.com/?p=187784",
          "author": "Barry Petchesky",
          "description": "I'd rather gaze directly upon the opening of the Ark of the Covenant than spend too much time looking at Stuart Skinner's horrid numbers in the early (but getting late fast) postseason going. The Oilers goalie has allowed 11 goals on just 58 shots over, functionally, five and a half periods, surrendering six to the Kings in a wild Game 1 and five Wednesday night before being yanked for Calvin Pickard. Pickard promptly allowed a goal on the first shot he faced, which, if it was a salve to Skinner's wounded pride, was gifted not netminder-to-netminder, but by an Edmonton defense that is playing like it holds a grudge against its own backstop.\nPickard will almost surely get the start in a must-have Game 3 back in Edmonton, after the Kings took care of business, 6-2. I am not convinced it will matter. \"No team in this league can give up the amount of Grade As and high-danger chances that we've been giving up,\" Darnell Nurse said. \"We've been hanging our goalie out to dry.\"",
          "link": "https://defector.com/the-oilers-are-getting-carved-up-like-a-moist-and-tender-turkey",
          "publishedOn": "2025-04-24T13:59:35.000Z",
          "wordCount": 6455,
          "title": "The Oilers Are Getting Carved Up Like A Moist And Tender Turkey",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211376428.jpg"
        },
        {
          "id": "https://defector.com/?p=187756",
          "author": "Kathryn Xu",
          "description": "It is possible to accurately calculate the Philadelphia Phillies' record based only on the current state of the team's NBC Sports Philadelphia postgame show, but doing so requires context: It is late April, and the Phillies have just gotten swept by the Mets, who, in the interest of not burying the lede, currently have the best record in all of Major League Baseball; and we are talking about Philly local sports media. So while, say, a 10–15 record would be a perfectly reasonable guess for the day after a postgame commentator asks if it's \"time to sound the alarm,\" astute advanced models will be sure to recalibrate to a much more average 13–12. Which happens to actually be the team's record! Congratulations to all parties involved.\nJohn Kruk, Phillies color commentator and noted voice of reason, tried his best to slow the show's roll. \"I don't know how you make up three games in 130 games left, or 130-something games left,\" he said on Tuesday night, sarcastically, in response to the sound-the-alarm question. \"It's going to be tough when the season's winding down like it is.\" (At the time, the Phillies had 138 games left to play.) He continued, \"My God, what are we talking about?\" An excellent philosophical question, as initially posed by Raymond Carver: What do we talk about when we talk about late-April baseball?",
          "link": "https://defector.com/mets-invincible-phillies-on-bullet-train-to-hell",
          "publishedOn": "2025-04-24T12:59:00.000Z",
          "wordCount": 7535,
          "title": "Mets Invincible, Phillies On Bullet-Train To Hell",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/starlingMarteMetsBestRecord.jpg"
        },
        {
          "id": "https://defector.com/?p=187729",
          "author": "Maitreyi Anantharaman",
          "description": "Against the Dodgers last night, the Cubs gave up three runs in the top of the first, scored five runs in the bottom of the first, and none of it really mattered, because what happens at the beginning of a Cubs game has little bearing on what happens at the end. There is no lead so great it can’t be frittered away. There is no deficit too imposing. In the span of five days, they’ve won two of the wackiest games of the MLB season to stay on top of the NL Central. “It’s a fun team to watch play, that’s what I’d tell you,” manager Craig Counsell said after Tuesday’s 11-10 walk-off win, wearing a slightly rattled and unconvincing smile. \n\nhttps://www.youtube.com/watch?v=zn_KjpuEWuI",
          "link": "https://defector.com/the-cubs-love-to-get-crooked",
          "publishedOn": "2025-04-23T20:39:55.000Z",
          "wordCount": 7521,
          "title": "The Cubs Love To Get Crooked",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211529243.jpg"
        },
        {
          "id": "https://defector.com/?p=187724",
          "author": "Alex Shultz",
          "description": "It has been more than 60 years since the first Sports Illustrated swimsuit issue hit newsstands, a moment in history that bound the business of sports journalism to the business of making sports fans horny.\nWhat started as a way for bored SI editors to amuse themselves during the slow period of the sports calendar soon grew into an annual event capable of subsidizing much of the rest of the magazine. When sports bloggers eventually rose to power in the 2000s and early 2010s, they internalized the lessons of the swimsuit issue, and ate into SI’s subscription and advertising revenue. In their heyday, these bloggers’ randy posts about WAGs, cheerleaders, and random college students were given prominent placement on popular sports sites.",
          "link": "https://defector.com/horny-sports-blogging-makes-a-bewildering-return-to-sports-illustrated",
          "publishedOn": "2025-04-23T17:09:24.000Z",
          "wordCount": 14984,
          "title": "Horny Sports Blogging Makes A Bewildering Return To Sports Illustrated",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/SI.jpg"
        },
        {
          "id": "https://defector.com/?p=187717",
          "author": "Luis Paez-Pumar",
          "description": "One of the tenets of being a Miami Marlins fan is that the future will always be presented as the appeal. The Marlins have made it a habit to trade away star after star for prospects who could eventually become stars, only to then be traded away for more prospects. Logic and reason would lead the team's fans to develop commitment issues, and in turn perhaps shy away from any promising young player, knowing that his time with the Marlins begins to come to an end the second he starts pitching well, or hitting like a machine.\nFortunately, \"logic\" and \"reason\" rarely exist in sports fandom, which is why I believe Agustín Ramírez will slug 1.000 and live forever. The 23-year-old catcher came to South Florida as another star left the Marlins: He was one of the New York Yankees' prospects in the trade for Jazz Chisholm Jr. last July. After a solid second half of the season with the delightfully named Triple-A affiliate Jacksonville Jumbo Shrimp, and a brief stint at the same club to start this year, Ramírez was called up on Monday as the Marlins began a three-game series against the Cincinnati Reds. After only two games, Ramírez has already found himself in the franchise's record books, and he's become the new promising young player to enjoy for an indeterminate amount of time. Given that he's only on the roster due to injuries to catchers Nick Fortes and Rob Brantly, Ramírez's monster debut is found money for a team that currently has few options behind the plate.",
          "link": "https://defector.com/enjoy-the-agustin-ramirez-show-for-as-long-as-it-lasts",
          "publishedOn": "2025-04-23T16:13:13.000Z",
          "wordCount": 6758,
          "title": "Enjoy The Agustín Ramírez Show For As Long As It Lasts",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211430524.jpg"
        },
        {
          "id": "https://defector.com/?p=187736",
          "author": "Jae Towle Vieira",
          "description": "Nothing puts the icing on a mistake like having time to squirm. Desperately brainstorming ways to set things right before your error is discovered gives you a waking-life taste of that nightmare feeling, doesn’t it? \nTurns out heists are baby shit. It’s the reverse heist—delicate operations performed under the emotional weight of both fear and regret—that really puts you in another league. Today we bring you a tale of immaculately curated decor, a beautiful Border Collie, and a prank gone wrong.",
          "link": "https://defector.com/the-fine-line-between-a-prank-and-a-crime",
          "publishedOn": "2025-04-23T15:06:00.000Z",
          "wordCount": 5344,
          "title": "The Fine Line Between A Prank And A Crime",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2023/03/Normal_Gossip_16-9_V2.png"
        },
        {
          "id": "https://defector.com/?p=187708",
          "author": "Chris Thompson",
          "description": "James Wood, 22-year-old outfielder for the Washington Nationals, is mighty big and mighty strong. I think we've been very clear on this matter. Washington's offense, to date, isn't much—they rank eighth worst in the majors both by Statcast's Weighted On-base Average and by Baseball Reference's OPS+—but you cannot blame this on Wood, who is ranked third in the National League in home runs (7) and is 10th in runs batted in, and whose OPS Wednesday morning is a robust .902. Tuesday night Wood batted leadoff in the opening game of a series against the Baltimore Orioles, and had three hits, two doubles, and scored a pair of runs, and the Nationals won for the third time in four games.\nAnother area where our record here at Defector is unimpeachable: We have always been very up front about the fact that Wood, when he hits the ball, tends to hit the dick off of it. His average exit velocity this season is 94 miles per hour, per Statcast, in baseball's sixth percentile and better than such so-called strongmen as Vladimir Guerrero Jr., Bryce Harper, Elly De La Cruz, and Juan Soto. Tuesday's performance, though dingerless, was a showcase of power: The three balls that Wood put in play averaged 108.3 miles per hour off his bat. The 109-mph double he pounded off the wall in the fifth inning only failed to reach the stands due to its screaming 21-degree launch angle. His second-inning single was hit at 107.6 miles per hour and stayed on the infield, but ate up Orioles shortstop Gunnar Henderson, allowing Wood to beat the throw to first. Oh right, Wood is also fast as hell, ranking in baseball's 77th percentile by sprint speed.",
          "link": "https://defector.com/james-wood-is-a-special-case",
          "publishedOn": "2025-04-23T14:11:12.000Z",
          "wordCount": 8157,
          "title": "James Wood Is A Special Case",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210746523.jpg"
        },
        {
          "id": "https://defector.com/?p=187677",
          "author": "Jake Romm",
          "description": "What you need to understand about the Zionist propaganda project October 8 (originally titled October H8te) is that calling it a film at all is generous.",
          "link": "https://defector.com/the-paranoid-fantasies-of-october-8",
          "publishedOn": "2025-04-23T13:13:51.000Z",
          "wordCount": 12006,
          "title": "The Paranoid Fantasies Of ‘October 8’",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/October8.png"
        },
        {
          "id": "https://defector.com/?p=187617",
          "author": "Albert Burneko",
          "description": "Have you ever been lonely? I mean really lonely. Think of the loneliest you ever were. Transpose that experience of loneliness to the bottom of a mineshaft. Oof, right? Anyway, bear that in mind.\nFormer Business Insider CEO and co-founder Henry Blodget, these days the sole proprietor and staffer of the blog/media company Regenerator, published a curious blog on his website on Monday. In it he details the events of an afternoon he spent on his laptop in a Brooklyn coffee shop prompting the ChatGPT program to generate and impersonate four members of an \"AI team\" he would employ at Regenerator, which the company's sole human employee had decided would now be a \"native-AI newsroom,\" and then interacting with the four personas the chatbot adopted in response to his prompts.",
          "link": "https://defector.com/henry-blodget-invents-hires-sexually-harasses-blogs-about-nonexistent-ai-subordinate",
          "publishedOn": "2025-04-22T19:38:40.000Z",
          "wordCount": 8319,
          "title": "Henry Blodget Invents, Hires, Sexually Harasses, Blogs About Nonexistent AI Subordinate",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/robot-lady.jpeg"
        },
        {
          "id": "https://defector.com/?p=187660",
          "author": "Ray Ratto",
          "description": "Whatever Nico Harrison did that made it so that he would have to destroy himself so publicly rather than just have everyone else do it for him, it must have been a doozy. But even if Harrison did nothing to offend a vengeful deity or the universe at large and has just been the designated corporate crap-catcher for the Dallas Mavericks organization all along, he is out there destroying himself in public all the same. And yet the story of the Luka Doncic trade simply won't go away, despite the Mavericks themselves having been swept brusquely out of the play-in, solely because the people who run the team keep bringing it up. This suggests that they think Harrison having to eat garbage by the shovelful, on camera and on the record, is good off-season marketing.\nThat can be the only reason that the Harrison Self-Abasement Tour continues, even to the point that Charles Barkley interrupts TNT's apology for accidentally killing the still very much alive Billy Ray Bates to tell Harrison, whom Barkley said he “considers a friend,” to stop being a public figure.",
          "link": "https://defector.com/the-mavericks-just-keep-on-sending-nico-harrison-out-there",
          "publishedOn": "2025-04-22T18:04:41.000Z",
          "wordCount": 7538,
          "title": "The Mavericks Just Keep On Sending Nico Harrison Out There",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210936979.jpg"
        },
        {
          "id": "https://defector.com/?p=187627",
          "author": "Patrick Redford",
          "description": "If you simply looked at the box score from Game 2 of the Detroit Pistons–New York Knicks series and tried to reverse-engineer some narratives, you would probably look at Jalen Brunson's 37 points and seven assists (both game-highs), Karl-Anthony Towns's 10 anonymous points in 33 minutes, and the final score showing a 100–94 Pistons win and conclude that Brunson had a great game and that the Knicks dropped a game at home because his bum-ass teammates didn't step up. Wrong! Let's check the highlight reel.",
          "link": "https://defector.com/jalen-brunson-is-the-nbas-premier-falling-down-artist",
          "publishedOn": "2025-04-22T17:51:29.000Z",
          "wordCount": 7202,
          "title": "Jalen Brunson Is The NBA’s Premier Falling-Down Artist",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211361707.jpg"
        },
        {
          "id": "https://defector.com/?p=187595",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about smoking, swingers, eating fishing lures, and more.\nYour letters:",
          "link": "https://defector.com/let-travis-hunter-be-football-ohtani",
          "publishedOn": "2025-04-22T17:06:01.000Z",
          "wordCount": 16601,
          "title": "Let Travis Hunter Be Football Ohtani",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2187642784.jpg"
        },
        {
          "id": "https://defector.com/?p=187600",
          "author": "Chris Thompson",
          "description": "Hey, the Atlanta Braves won a game! Not just one, either: Nine of them, while you were off oiling your disgusting mustache. Nine of 15, in fact. Over the weekend they won their second series of the season, sweeping the visiting Minnesota Twins, and then Monday they triumphed in a rousing 7-6 effort against the dreaded St. Louis Cardinals. After a hateful start to the season that saw the Braves get wiped out in consecutive road series against the cream of the National League West, they have started to get healthy, literally and figuratively, against the merely human, and are on the move.\nTheir latest win was a fun one. Braves hitters had a normal amount of trouble across six innings against St. Louis starter Erick Fedde, plating a pair of runs in the third on an Austin Riley sockdolager but otherwise looking generally punchless. This is both because Fedde is good and because Atlanta's offense—even while managing to outscore opponents more often than not since opening week—has not yet hit its stride. With the Cardinals up a run in the bottom of the eighth, a hard-chugging Riley beat out an infield single, and two batters later Matt Olson drove him home with a single through the right side. A walk and a sacrifice fly put the Braves up a run and brought Sean Murphy to the plate. Murphy's power bat has been everything the Braves could've hoped for since returning from injury, and he came up huge in this spot, leveling a mighty rip at a meatball of a first-pitch changeup from Cardinals reliever JoJo Romero and crushing a three-run dinger to left. Atlanta's bullpen tried to blow the lead but could not, and today the very same Braves who opened the season 0–7 are sitting on a four-game win streak.",
          "link": "https://defector.com/the-hobbled-braves-are-hanging-in-there",
          "publishedOn": "2025-04-22T16:43:07.000Z",
          "wordCount": 8361,
          "title": "The Hobbled Braves Are Hanging In There",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210794425.jpg"
        },
        {
          "id": "https://defector.com/?p=187579",
          "author": "Dan McQuade",
          "description": "Monday was the White House Easter Egg Roll, an annual event in which children gather on the lawn and get to meet the president, first lady, and Easter Bunny. Then they all roll eggs down the lawn, I guess—I dunno, I’ve never really seen the thing. Presumably there’s a winner, someone who rolls the most eggs, or rolls them the furthest or the most accurately or just the most to the liking of the president, first lady, and Easter Bunny. I assume this year’s prize was the opportunity to join a group chat dedicated to discussing the U.S. military’s next airstrike.\nBut this year’s event had an extra plum for all the children in attendance, and not just because there were corrupt sponsorships. At one point Donald Trump approached a group of children, knelt down and showed them a collectible trading card with a photo of himself on it. You know the photo: the one in which he was raising his fist in the air after being shot. Hey, the children have to learn about assassination attempts at some point; why not from a man who survived one himself?",
          "link": "https://defector.com/trump-shows-kids-collectible-card-with-photo-of-him-being-shot",
          "publishedOn": "2025-04-22T16:26:24.000Z",
          "wordCount": 9010,
          "title": "Trump Shows Kids Collectible Card With Photo Of Him Being Shot",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/trump-card.jpg"
        },
        {
          "id": "https://defector.com/?p=187520",
          "author": "Israel Daramola",
          "description": "For the entirety of his career so far, there has been some consternation over Ryan Coogler's gifts as a director. His major debut Fruitvale Station was admirable and exciting, but was also a classic first-time director indie film. Creed was a lightning-rod moment: the revitalization of a dormant and dead-seeming IP in Rocky, the comeback of Sylvester Stallone as serious actor, and the validation of both Coogler and his muse Michael B. Jordan as Hollywood mainstays. But it is IP, and it is as much about the Rocky formula as it is about the filmmakers. And, obviously, there were Marvel's Black Panther films, which for all of their virtues remain Marvel films. Coogler, like a lot of talented, capable young filmmakers, got quickly nabbed by the Hollywood system, and good for him, but there has always been a question about what he can do with his own purely original work. Finally, with Sinners, Coogler has put his decade of experience behind his own idea.\nSinners tells the story of twin brothers Elijah \"Smoke\" Moore and Elias \"Stack\" Moore (both played by Michael B. Jordan), bootlegging gangsters and WWI veterans returning home to the Mississippi Delta from Chicago in 1932. It's the opening of their new juke joint built out on former Klan property, and they plan to start off strong with music from their little cousin, Sammie a.k.a. Preacher Boy (Miles Caton), and local blues legend Delta Slim (Delroy Lindo). They have also employed Smoke's former lover Annie (Wunmi Mosaku) and Chinese shopkeepers Grace and Bo Chow (Li Jun Li and Yao, respectively). But later on in the night, everyone there gets more than they bargained for when the power of the blues seems to open a portal to hell and attract a legion of vampires, led by Irish immigrant Remmick (Jack O'Connell), who systematically picks off the entire party in pursuit of Preacher Boy and his ability to commune with the ancestral spirit through his music.",
          "link": "https://defector.com/sinners-is-a-worthy-blockbuster",
          "publishedOn": "2025-04-22T14:39:10.000Z",
          "wordCount": 7444,
          "title": "‘Sinners’ Is A Worthy Blockbuster",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/sinners.jpg"
        },
        {
          "id": "https://defector.com/?p=187559",
          "author": "Barry Petchesky",
          "description": "It is, I insist, cool and good that one of the wildest and most intense playoff games in a while ended so stupidly. It rules, quite frankly, that a game which saw the Kings seemingly exorcise their Oiler-matchup demons, then collapse in the face of a sudden Edmonton onslaught, was ultimately decided by a blooper-reel goal. Hockey is a ludicrous sport sometimes, and puck often lies, and had Phillip Danault taken a normal shot, Stuart Skinner probably would have stopped it easily and Game 1 would've headed to overtime, the Oilers carrying all the momentum after erasing a four-goal deficit. But Danault fanned, and fluttered the puck with comical slowness past Skinner, who saw neither hide nor hair of it.\n\nhttps://www.youtube.com/watch?v=TwyDSh7YJLo&ab_channel=SPORTSNET",
          "link": "https://defector.com/kings-oilers-wacky",
          "publishedOn": "2025-04-22T13:47:13.000Z",
          "wordCount": 6451,
          "title": "It Rocks When A Hockey Game Is Funny",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210804441.jpg"
        },
        {
          "id": "https://defector.com/?p=187560",
          "author": "Tom Ley",
          "description": "A closely contested NBA playoff game is an insanity device. Every turnover is a rake across the brain, every missed free throw a boil on the soul. Each second of game time that passes is designed to pull the contents of your guts closer and closer to the edge of your throat. If that is what it feels like to watch it, I can't imagine what it must be like on the court.\nNone of this applies to Kawhi Leonard. Despite his close proximity to the action, I spent most of Monday night's Game 2 clash between the Nuggets and Clippers wishing I could trade places with him. Even when he had the ball in his hands with under a minute left, readying himself to take what would be the deciding shot in L.A.'s 105-102 victory, it was impossible to imagine anyone, anywhere, more at peace than Kawhi Leonard.",
          "link": "https://defector.com/kawhi-leonard-is-just-living-with-it",
          "publishedOn": "2025-04-22T13:04:58.000Z",
          "wordCount": 7049,
          "title": "Kawhi Leonard Is Just Living With It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210794178.jpg"
        },
        {
          "id": "https://defector.com/?p=187537",
          "author": "Dave McKenna",
          "description": "The pope died on Sunday. Here’s hoping his holiness got to see the Kerry–Cork football match first. To call it the greatest Gaelic game of the millennium would be an understatement of Irish proportions. Or something. But as GAA+ play-by-play man Liam Aherne gushed within seconds of the game’s end: “My god!”\nOn a rain-soaked pitch at regal Páirc Uí Chaoimh in Cork on Saturday evening, the Kingdom advanced in the Munster Championships—one of the provincial tournaments that determines seeding for the All-Ireland Championship—by outlasting the underdog squad from the Rebel County in overtime, 3-21 to 1-25. The back-and-forth contest climaxed on a shocking goal from Kerry midfielder Joe O’Connor, who blasted a ball from 20 meters out in traffic into the Cork net late in the second extra period. The action gave fans, players, and even broadcast commentators no time to breathe from halftime to the final horn (or “hooter” in GAA parlance).",
          "link": "https://defector.com/kerry-and-cork-redeemed-a-dour-season-of-gaelic-football-with-one-great-game",
          "publishedOn": "2025-04-21T19:57:11.000Z",
          "wordCount": 8515,
          "title": "Kerry And Cork Redeemed A Dour Season Of Gaelic Football With One Great Game",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210402091.jpg"
        },
        {
          "id": "https://defector.com/?p=187475",
          "author": "Luis Paez-Pumar",
          "description": "In the WWE house style there are many archetypes, but nothing is more tried-and-true—or, in some cases, tired and false—than the WWE Epic Main Event. As the saying goes, you know it when you see it, but the Epic Main Event is easy enough to break down into its component pieces. An EME will have a lot of cinematic spots, usually involving weapons or the environment around the ring—tables being the main one, but oftentimes the crowd areas come into play as well. It will be a bit on the slower side, for one of two reasons, with the choice between the two depending upon how generous you want to be. Either the EME will be slow to build up the drama until it bubbles over, or it will be sluggish because WWE's main event wrestlers are generally more on the methodical side. Most relevant to WrestleMania 41's double main events is that these matches are usually over-stuffed with outside interference and mechanics that go beyond the simple foundation of wrestling, in which a wrestling match can be boiled down to some amount of performers fighting each other to prove who is best. The Epic Main Event exists because of WWE's longstanding suspicion that that isn't enough.\nWith that in mind, the respective main events for the two-night marathon that was WrestleMania 41 were predictably both in that WWE Epic Main Event style. Taken together, they do a rather neat job of encapsulating the good and the very bad of what that style can bring. If last year's night two main event was WWE at its most giddily excessive, this year's show offered two more measured scoops of melodrama that went down easily when they worked, and crashed and burned almost impossibly hard when they didn't.",
          "link": "https://defector.com/wrestlemania-41s-two-main-events-and-the-risks-of-getting-epic",
          "publishedOn": "2025-04-21T18:01:40.000Z",
          "wordCount": 10471,
          "title": "WrestleMania 41’s Two Main Events And The Risks Of Getting Epic",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211203021.jpg"
        },
        {
          "id": "https://defector.com/?p=187465",
          "author": "Kathryn Xu",
          "description": "Before the third session of qualifying, Lando Norris was the fastest man at the Saudi Arabian Grand Prix. Other drivers beat him on one-off occasions—Max Verstappen in Q1, and, somehow, Pierre Gasly in FP1—but notably and most importantly, neither of those drivers were his teammate and championship rival Oscar Piastri. The Saudi Arabian GP was shaping up to be a bounce-back race for Norris across Formula 1's midseason oil-money double-header, after his comparatively disastrous P3 finish at Bahrain.\nThen Norris clipped a curb on a flying lap, unsettled his car, and crashed into the left-side wall, red-flagging the session. Norris let his race engineer know that he was fine, before following up with a characteristically self-critical, \"Idiot.\" As much as McLaren professes its car the best on the grid, it doesn't have quite the pace of the early hybrid-era Mercedes or rocket Red Bull, where, with the right driver at the wheel and right teammate up ahead, a P10 in qualifying could easily convert to a race win. And with that one mistake, Norris's race goal shifted from a win, cementing his Drivers' Championship lead, to a decent recovery drive.",
          "link": "https://defector.com/oscar-piastri-seizes-the-lead",
          "publishedOn": "2025-04-21T17:34:03.000Z",
          "wordCount": 8472,
          "title": "Oscar Piastri Seizes The Lead",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/oscarPiastriSaudiArabia.jpg"
        },
        {
          "id": "https://defector.com/?p=187525",
          "author": "Ray Ratto",
          "description": "Of all the odd moments of a well-packed sports weekend, maybe the oddest was the debate between what is more unusual, one MLB team beating another 24-2, or an accomplished professional basketball team beating a slightly less accomplished one, in the playoffs, by 51 points. If it helps, it's about a tie.\nBut the sneaky third option might have been the Colorado Rockies winning the second game of their punishment doubleheader with the Washington Nationals. Here was one team with an excruciatingly bad bullpen facing a team with an excruciatingly bad everything else; by rights such a match-up should end up with each team losing once, and it did. But putting it like that diminishes the Rockies' status as an all-time cornea-searing disaster.",
          "link": "https://defector.com/bud-black-has-either-the-best-or-the-worst-job-in-baseball",
          "publishedOn": "2025-04-21T17:11:42.000Z",
          "wordCount": 7619,
          "title": "Bud Black Has Either The Best Or The Worst Job In Baseball",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2209842184.jpg"
        },
        {
          "id": "https://defector.com/?p=187455",
          "author": "Chris Thompson",
          "description": "Because it is a long enough regular season to test and re-test just about every variable, every team in baseball is going to have their wieners mangled in at least one game. Even the mighty zillion-dollar Los Angeles Dodgers recently had their tender bits forcibly run through a cheese-grater by the Chicago Cubs. It happens! Still, it's hard not to feel a little bit uneasy about the suffering delivered to the Baltimore Orioles Sunday, at home, in the rubber match of a weekend series against the Cincinnati Reds. The O's put 41-year-old Charlie Morton on the mound to start the contest, and the Reds lifted him by his ankles and drowned him in a toilet, and then spent the rest of the game mercilessly bullying an increasingly ridiculous sequence of relief pitchers, rudely flaunting MLB's lack of a mercy rule, to the tune of a 24–2 final score.\nThings didn't turn fully gruesome on Morton until the third inning, when Elly De La Cruz (who also made several eye-popping plays up the middle during the very brief period when this game could be described as \"competitive\") socked a high heater into the stands in right field to lead off what would soon become a \"Baseball Bugs\" conga line for the Reds. Minutes later, struggling with command, amassing a nightmarish pitch count, having already used a mound visit, and desperate for an out by any means, a sweaty and flustered Morton attempted a pickoff move to first, missed wide, and allowed an unearned run to scamper home, the fourth of the inning. Reds catcher Austin Wynns then punched a Morton 2–2 changeup into center field to drive home another run, and Orioles manager Brandon Hyde decided to put his bumbling pitcher to bed. Reliever Cody Poteet came on and hung a 3–2 slider to TJ Friedl, who socked it deep to right; Ryan O'Hearn, who is defensively out of position at every position but especially in right field, made a hilariously feeble effort to catch the ball on the warning track, and now the flood gates were not just open but entirely gone.",
          "link": "https://defector.com/os-no",
          "publishedOn": "2025-04-21T16:44:26.000Z",
          "wordCount": 8663,
          "title": "O’s, No!",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211156719.jpg"
        },
        {
          "id": "https://defector.com/?p=187482",
          "author": "Dan McQuade",
          "description": "Yesterday was the third annual Corgi Derby, a tribute to Queen Elizabeth held at the Musselburgh Racecourse in Scotland. The little dogs that the queen loved most race each other around a 230-foot course, with the winner getting a trophy and treats delivered by Judy Murray, Andy’s mom. The winning dog's name is also printed in publications around the world. This year’s winner was named Juno. See! All you need to do to get your dog’s name in Defector is to have it win a corgi race in front of Andy Murray’s mother, and for there to be lots of cute photos on the wire. Of course your dog will never know that its name was published on Defector, but it might be nice for you.\nWhich reminds me: Defector has access to a lot of these cute photos, and we’d like to share them with you now. Enjoy!",
          "link": "https://defector.com/please-enjoy-these-images-of-the-2025-corgi-derby",
          "publishedOn": "2025-04-21T15:34:13.000Z",
          "wordCount": 7494,
          "title": "Please Enjoy These Images Of The 2025 Corgi Derby",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/corgi-7.jpg"
        },
        {
          "id": "https://defector.com/?p=187464",
          "author": "Maitreyi Anantharaman",
          "description": "Why not branch out and try our Monday crossword? This week's puzzle was constructed by Sala Wanetick and Emily Biegas, and edited by Hoang-Kim Vu. Sala is a crossword constructor and cheesemonger based outside of Detroit. Her sports knowledge specialty areas include reality stars' romantic partners, and common crossword clues (shoutout to Mia Hamm, Pele, and Epee.) She would love to connect with solvers and constructors—Sala Wanetick on all platforms, she is the only one. Emily started constructing crosswords with Sala in 2023; they have had puzzles published in the Los Angeles Times, USA Today, and Universal. Besides crosswords, her other passion is music (shoutout to the three-letter king, ENO!) A corporate girlie by day, by night Emily plays guitar in a garage rock trio called ZEM that plays shows in and around Detroit. \nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE.",
          "link": "https://defector.com/the-crossword-april-21-happy-arbor-day",
          "publishedOn": "2025-04-21T15:00:00.000Z",
          "wordCount": 5242,
          "title": "The Crossword, April 21: Happy Arbor Day",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210659541.jpg"
        },
        {
          "id": "https://defector.com/?p=187451",
          "author": "Patrick Redford",
          "description": "The theory of the Cleveland Cavaliers is that by virtue of being able to play at least one of Donovan Mitchell and Darius Garland at all times, they are guaranteed 48 minutes of all-star–level shot creation. That allows them to play a bunch of incredible play-finishers, like Jarrett Allen and Max Strus, who don't need to worry about dribbling the basketball unless it's into an advantage presented to them by one of their genius operators and can otherwise stick to jamming huge dunks and nailing open threes. Everything on offense is fast and so much of it easy, which starts at the top. So naturally, a point guard's big game tells the story of Cleveland's 121-100 playoff-opening win over the Miami Heat. That's right: Ty Jerome.\nThe little point guard has had an incredible season for the Cavs, averaging a hair over 12 points per game on 63-percent true shooting in just under 20 minutes per game for the best offense in the league. When a mildly undersized guard averages those sorts of numbers in that sort of role, you might expect their game to be built around nailing catch-and-shoot threes, attacking closeouts, and running vanilla pick-and-rolls. You know, responsible offense. Jerome is great at all of those things, but what really makes him great is his floater. There's nothing complex about it: Jerome is a floater maestro, with an uncanny sense of timing, enviable balance, and eiderdown touch. If he gets his defender on his hip, he knows exactly how to lathe out an extra six or seven feet of space, and he knows exactly when the low man is either committed to blocking his shot or too terrified of an alley-oop, and thus content to watch Jerome sail it in over his head.",
          "link": "https://defector.com/see-what-makes-the-cavaliers-special-through-the-ty-jerome-game",
          "publishedOn": "2025-04-21T14:29:04.000Z",
          "wordCount": 7378,
          "title": "See What Makes The Cavaliers Special Through The Ty Jerome Game",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211195167.jpg"
        },
        {
          "id": "https://defector.com/?p=187458",
          "author": "Ray Ratto",
          "description": "Occasionally, and by occasionally we of course mean rarely, the dumb luck of the NBA standings will create an early-round playoff series in which each team is somehow a bad matchup for its opponent. The force of the postseason naturally tends to create these as the process grinds on; to get one before things otherwise get interesting is both a gift from the universe and a pain in the ass for the teams involved. You think about a series like this, you watch it and rewatch it, and all you come away with is the brain-bending realization that the teams involved are not playing against each other so much as they are playing against their own capacity for discomfort.\nAnd with that, we present to you Rockets-Warriors, or based on the result in Game 1 of this series, Warriors-Rockets.",
          "link": "https://defector.com/the-warriors-and-rockets-know-each-others-weaknesses",
          "publishedOn": "2025-04-21T13:33:38.000Z",
          "wordCount": 7839,
          "title": "The Warriors And Rockets Know Each Other’s Weaknesses",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211196572.jpg"
        },
        {
          "id": "https://defector.com/?p=187437",
          "author": "Barry Petchesky",
          "description": "The Detroit Pistons roster a bunch of rowdy youths fresh to a playoff atmosphere, with all that entails—good and bad. They don't know what they don't know, which is often a successful mindset: Many a game has been lost by knowing you're supposed to lose it, and many a game won by the weightlessness of happy ignorance. Expectations, too, can be a burden. But gravity-free hoopage only lasts so long. Eventually, especially on the road, the noise builds and the pressure increases and more seasoned opponents are braced against wilting, and suddenly, unawareness of \"what's supposed to happen\" stops working, because the thing starts happening anyway. Over a 21-0 fourth-quarter run that led to a 123-112 New York victory, the Knicks offered the Pistons a corrective for the first three quarters, a demonstration of postseason basketball's unpredictability, and a lesson that not all 48 minutes are created equal.\nThe Knicks' defensive strategy was obvious from the get-go: make life difficult for Cade Cunningham. The Pistons have a dearth of ways to beat teams, and the Knicks were intent with shutting down their 26-ppg primary weapon, with OG Anunoby getting frequent help from Karl-Anthony Towns whenever Cunningham broke through on a screen. But Cunningham was generally content with passing out of pressure, because his mates were hitting their shots. Tobias Harris, Tim Hardaway Jr., and Malik Beasley—the veterans on the team, probably not coincidentally—were 20-of-33 from the field after three quarters, and hitting better than 50 percent of their threes.",
          "link": "https://defector.com/the-knicks-gave-the-pistons-a-lesson-in-playoff-entropy",
          "publishedOn": "2025-04-20T16:36:26.000Z",
          "wordCount": 6741,
          "title": "The Knicks Gave The Pistons A Lesson In Playoff Entropy",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210144242.jpg"
        },
        {
          "id": "https://defector.com/?p=187433",
          "author": "Ray Ratto",
          "description": "The NBA is an odd amalgam of friendships and enemies' lists, alliances and rivalries, defenders and critics—all under the same jiggling tent. Thus, it should have come as little surprise that the Minnesota Timberwolves fought so brilliantly for Nico Harrison's honor when the people currently paying him are not only letting him twist in the breeze but aiming the wind machine at him to make the spinning more painful.\nThis is not, of course, Minnesota's prime intention. The Wolves beat the Los Angeles Lakers 117-95 Saturday night for their own glory, honor and self-esteem. They spotted the Lakers a 28-21 lead, took it away two minutes into the second with a 14-2 run, then reinforced it with a 21-6 burst to start the third. If it wasn't Jaden McDaniels crushing all before him, it was Anthony Edwards at his cheeky best, with sides of Julius Randle and Naz Reid scattered about the landscape, while the Lakers had LeBron James, Luka Doncic, and crickets. The final buzzer was an act of mercy, as was the you-can-go-to-sleep blowout at the end of a 10-hour hoopathon.",
          "link": "https://defector.com/the-lakers-have-bigger-problems-than-luka-doncic-can-fix",
          "publishedOn": "2025-04-20T14:59:14.000Z",
          "wordCount": 7277,
          "title": "The Lakers Have Bigger Problems Than Luka Doncic Can Fix",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210458086.jpg"
        },
        {
          "id": "https://defector.com/?p=187410",
          "author": "Barry Petchesky",
          "description": "It feels almost unfair that the Winnipeg Jets, with their all-universe goalie and their league-fewest goals allowed, are also constructed to be able to win a slugfest if necessary. Third-most goals in the NHL this year, paced as always by the dynamic Kyle Connor–Mark Scheifele duo, the Jets are very much unlike some of the defense-first rosters out there in that they can and will happily absorb a haymaker or two and answer in kind. That came in handy on Saturday, as a white-hot crowd watched the Jets trade goals with the Blues in a wild first period, only to asset their dominance as the game wore on.\nThe final score read 5-3 Jets, but after a 2-2 first period, it felt like it might be one of those very silly playoff openers where the combination of nerves, an extended feeling-out period, and the small sample size add up to a game with no particular contextual anchor, where everyone kind of agrees to pretend it was an anomaly that just sort of happened. \"That first period it was kind of a little bit wacky and we were a little bit sloppy,\" Jets coach Scott Arniel said. But when Jordan Kyrou scored on the power play just 1:13 into the second to give St. Louis the lead, it was hard not to wonder if this was the return of Playoff Helle.",
          "link": "https://defector.com/thats-about-as-hot-as-it-gets-in-winnipeg",
          "publishedOn": "2025-04-20T13:51:26.000Z",
          "wordCount": 6772,
          "title": "That’s About As Hot As It Gets In Winnipeg",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210461367.jpg"
        },
        {
          "id": "https://defector.com/?p=187404",
          "author": "Ray Ratto",
          "description": "Russell Westbrook being a man in a hurry and all, he has needed only four games to show his newest coach, David Adelman, what the full Russ Experience entails. It is, as the nine coaches before him have learned, a flight to a tropical paradise through six hours of turbulence and which may at any moment be rerouted to Gary, Indiana.\nSaturday, though, it was paradise after all. Westbrook made enough superb and silly plays in tandem, including a few of each in overtime, to guide the Denver Nuggets to a 112-110 victory that was, as the Brits like to say, very much \"against the run of play.\" Westbrook's damp dynamite stylings have led people to consider him hyperwashed for several years now because he is capable of such seismographically comedic highs and lows, and yet Adelman has come to rely upon (if not entirely trust) Westbrook. Westbrook played 34 minutes Saturday, including the final 23 minutes that encapsulated half the third quarter and all of the fourth and overtime.",
          "link": "https://defector.com/there-is-no-getting-off-the-russell-westbrook-rollercoaster",
          "publishedOn": "2025-04-20T13:06:40.000Z",
          "wordCount": 7108,
          "title": "There Is No Getting Off The Russell Westbrook Rollercoaster",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210435752.jpg"
        },
        {
          "id": "https://defector.com/?p=187401",
          "author": "Tom Ley",
          "description": "Lotsa games today! Lotsa games tomorrow, too. Feel free to hang out here and chat while you binge on all that spectacular hoops action.",
          "link": "https://defector.com/get-busy-in-the-nba-playoffs-open-thread",
          "publishedOn": "2025-04-19T16:02:58.000Z",
          "wordCount": 4568,
          "title": "Get Busy In The NBA Playoffs Open Thread",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2208937271.jpg"
        },
        {
          "id": "https://defector.com/?p=187330",
          "author": "Patrick Redford",
          "description": "Have you seen this? Are you aware of this? The NBA playoffs are about to begin! This is real. I would not lie to you.\nThis means that the time has come for you, the casual basketball fan, the dunce that you are, the grime on the bottom of a true basketball-knower's shoe, to begin scrambling around for information about this so-called \"NBA postseason.\" There are 16 damn teams in the field, and you need to know stuff about all of them, lest you be driven from the village for your foolishness!",
          "link": "https://defector.com/silence-you-are-summoned-to-read-a-preview-of-the-2024-25-nba-playoffs",
          "publishedOn": "2025-04-18T17:31:19.000Z",
          "wordCount": 23786,
          "title": "Silence! You Are Summoned To Read A Preview Of The 2025 NBA Playoffs",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-515426258.jpg"
        },
        {
          "id": "https://defector.com/?p=187214",
          "author": "Israel Daramola",
          "description": "Welcome to Listening Habits, a column where I share the music I’ve been fixated on recently.",
          "link": "https://defector.com/the-case-for-a-new-mtv",
          "publishedOn": "2025-04-18T15:21:47.000Z",
          "wordCount": 9893,
          "title": "The Case For A New MTV",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-76629515.png"
        },
        {
          "id": "https://defector.com/?p=187190",
          "author": "Sabrina Imbler",
          "description": "After weeks of receiving insulting emails from the federal government, Sarah Boim learned she was fired from her dream job at the Centers for Disease Control and Prevention at 8 p.m. on a Saturday. The email, which adhered to a template sent to all probationary workers, cited Boim's performance as the reason she was being let go. \"That was devastating to me to read, even though I knew that it wasn't true,\" Boim said, adding that she had received a 4.66 out of five on her last annual performance review. Boim was overwhelmed with feelings from shock to depression. \"I basically went through the stages of grief,\" she said. Then she arrived on a more galvanizing emotion: anger.\nBoim and other probationary employees fired from the CDC scrambled to get more information about their situation. \"Everybody was so scared, first of all that we were being spied on, which I'm sure we were,\" she said. They created a Signal chat and crowdsourced information, but they found a thicket of misinformation. \"So a small group of us decided to start a newsletter to cut through some of that noise and increase access to facts,\" Boim said.",
          "link": "https://defector.com/an-interview-with-a-fired-cdc-health-communications-manager",
          "publishedOn": "2025-04-18T14:16:57.000Z",
          "wordCount": 13440,
          "title": "An Interview With A Fired CDC Health Communications Manager",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/Boim_Headshot.jpg"
        },
        {
          "id": "https://defector.com/?p=187308",
          "author": "Ray Ratto",
          "description": "The NHL postseason stands in the exalted place it does because of two counterintuitive yet almost inviolable truths: that the regular-season standings and the achievements attached therein are an utter lie, and that the most fun is always found in the first round, when even the unworthy teams offer delicious levels of entertainment.\nProof of Truth 1: The last time the team with the best regular season record won the Cup in a regulation-length season was 2008.",
          "link": "https://defector.com/the-stanley-cups-got-to-return-to-canada-sometime-nhl-playoffs",
          "publishedOn": "2025-04-18T12:59:55.000Z",
          "wordCount": 7702,
          "title": "The Stanley Cup’s Got To Return To Canada Sometime, Right?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2149367580.jpg"
        },
        {
          "id": "https://defector.com/?p=187242",
          "author": "David Roth",
          "description": "It's not quite a large enough sample to be significant, and too inherently insignificant to really be worth the sampling, but we've done enough Drew Is About To Go On Vacation episodes of the podcast by now that I can detect their specific vibrational energy. Drew is both a little bit more eager than usual to wrap things up and just absolutely relaxed; I am maybe a bit more inclined to wander afield and go long and as close to absolutely relaxed as I get, as if I was getting some sort of residual contact high from the vacation that the big fella is about to take. It is not quite the episode that would be recorded from a vacation—we've done some of those, too, and likely will do some more—but it has all the energy of having more or less wrapped up work. All of which is to say that, at this anxious and ominous broader moment, I found this week's episode to be kind of a relief, and to reiterate I am not even going on vacation.",
          "link": "https://defector.com/at-beautiful-mount-airy-lodge",
          "publishedOn": "2025-04-17T19:36:18.000Z",
          "wordCount": 6719,
          "title": "At Beautiful Mount Airy Lodge",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-1314698254.jpg"
        },
        {
          "id": "https://defector.com/?p=187293",
          "author": "Nicholas Russell",
          "description": "One of the earliest photos of me features my grandfather, a doctor from the Philippines, cradling me as a newborn while wearing a face mask. He had a cold at the time and I was as vulnerable as a human being can be. That photo didn’t normalize the idea of wearing face masks for me, though I did feel comparatively inured to the sight as I grew up. Relatives would show up to gatherings wearing them and, in a family of medical professionals, all manner of PPE was unremarkable. I’d be lying if I said there wasn’t a cultural element to this as well. Up there with that common, meme-ified image of an elderly Asian man out for a leisurely, inquisitive stroll with his hands clasped behind his back is the image of an elderly Asian person out in public with a face mask on. Sometimes, the images are o…",
          "link": "https://defector.com/why-i-keep-masking",
          "publishedOn": "2025-04-17T19:03:11.000Z",
          "wordCount": 9911,
          "title": "Why I Keep Masking",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-1363359698.jpg"
        },
        {
          "id": "https://defector.com/?p=183012",
          "author": "Dan McQuade",
          "description": "A player can look good on the front of his card, but it's what’s on the back that matters. That's where the player's stats and accomplishments appear, and where the bigger story of their career really rounds into shape: what they've done and where they've done it, how well and for how long. The photo on the front might show a guy's only home run all season; if so, the back of the card will tell you.\nBecause they're all grounded in the same categories and expressed in similarly shaped statistics, the numbers on the backs of all those cards can blur together somewhat; they are all different, but they don't really look that different. For instance there is Bill Hanzlik, who averaged 7.2 points per game during his 10 years in the NBA, spent mostly with the Denver Nuggets. The 6-foot-7 small forward was mostly known for his defense, which means that a lot of what he did best didn't show up on the back of his trading cards. But he was there, and the proof is in the 12-card set of Nuggets trading cards that the Denver Children's Hospital released for the 1989–90 season.",
          "link": "https://defector.com/dont-put-poison-in-your-mouth-and-other-great-tips-from-80s-and-90s-trading-cards",
          "publishedOn": "2025-04-17T17:57:39.000Z",
          "wordCount": 18787,
          "title": "“Don’t Put Poison In Your Mouth,” And Other Great Tips From ’80s And ’90s Trading Cards",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/psa-cards-header.jpg"
        },
        {
          "id": "https://defector.com/?p=187261",
          "author": "Chris Thompson",
          "description": "Washington Nationals reliever Jorge López was tossed from a game Wednesday night. He came on in relief in the seventh inning and—in the fashion preferred by members of this insanely terrible bullpen—immediately immolated his own team's chances of winning what had been a one-run game. First he allowed two singles and an RBI-groundout; then with two outs, he threw a first-pitch sinker up and in and plunked Bryan Reynolds. Three pitches later, López fired a fastball at the ear of Andrew McCutchen, which McCutchen avoided only by throwing himself onto the ground. While the umpires conferenced, López and McCutchen began to shout at each other, and soon the benches emptied.\n\nhttps://www.youtube.com/watch?v=ehyFBlpWcSI",
          "link": "https://defector.com/a-dangerously-bad-bullpen-is-everyones-problem",
          "publishedOn": "2025-04-17T17:11:45.000Z",
          "wordCount": 8668,
          "title": "A Dangerously Bad Bullpen Is Everyone’s Problem",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210010517.jpg"
        },
        {
          "id": "https://defector.com/?p=187268",
          "author": "Tom Ley",
          "description": "Listen, I will happily devour any article about Nikola Jokic. He's my big special guy and every anecdote that gets published about him keeps a place in the most lovingly curated segment of my mind. So it is with great sadness that I am forced to issue a yellow card on this simile from The Athletic's recent story on Jokic, written by Fred Katz:\nEarly in Brown’s season in Denver, the guard went into a handoff play with Jokić. Once the MVP received the basketball, both his defender and Brown’s followed him, which left Brown open. Brown screamed out the proper terminology.\n“Wolf! Wolf!” he yelled, the Nuggets’ alert that a double team was coming.\nWith no one on him, Brown then cut to the basket, figuring Jokić could hit him for an easy layup. Instead, Jokić tossed a no-look pass far behind him and out of bounds. Later in the game, Jokić explained why.\n“Don’t cut,” he told Brown. “I’m listening to your voice.”\nJokić, like a bat, can tell where people are just by where sound waves originate. From that point on, Brown never cut after yelling for the ball; Jokić hit him with no-look dimes constantly.",
          "link": "https://defector.com/everyone-can-do-that",
          "publishedOn": "2025-04-17T15:47:05.000Z",
          "wordCount": 5508,
          "title": "Everyone Can Do That",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2207522862.jpg"
        },
        {
          "id": "https://defector.com/?p=187256",
          "author": "Luis Paez-Pumar",
          "description": "Despite a comfortable 3-0 home victory in the first leg of its Champions League quarterfinal against Real Madrid, Arsenal must have still felt in danger on Wednesday. Call it the Real Madrid Effect, or call it the Arsenal Had Only Been To Two Champions League Semifinals Ever Conundrum, but nothing felt safe as the Gunners tried to build on their monumental win last week in hopes of advancing. They needn't have worried, though. Despite a couple of ominous mistakes, Arsenal continued to prove that it was just the better team in this match-up, and one that can not only make a semifinal but actually win the whole tournament. The Gunners left the Estadio Santiago Bernabeu with a 2-1 victory, and a 5-1 aggregate romp, that felt as fair as any Real Madrid loss can.\n\nhttps://www.youtube.com/watch?v=hEZDGBlptss",
          "link": "https://defector.com/arsenal-was-perfect-when-it-had-to-be",
          "publishedOn": "2025-04-17T15:29:44.000Z",
          "wordCount": 8194,
          "title": "Arsenal Was Perfect When It Had To Be",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210618529.jpg"
        },
        {
          "id": "https://defector.com/?p=187051",
          "author": "Eva Holland",
          "description": "“I am a modern Inuk woman,” says the actress Anna Lambe, in the opening moments of her new sitcom, North of North. “…Whatever that means.” Lambe plays Siaja, a twenty-something undergoing a quarter-life crisis in her tiny Arctic hometown: Ice Cove, a fictional place built on the realities of life in Nunavut’s two dozen far-flung hamlets. \nAs the pilot episode unfolds, Siaja decides that she’s spent too much time putting other people first. She was forced to self-parent during the years before her single mom, Neevee, got sober; then she married right after high school and had a daughter soon after. Now she’s a stay-at-home mother, the wife to an oblivious husband, and she desperately needs a change. Across the eight short episodes of the show’s first season, Siaja tries to remake her life—often while spinning from one awkward disaster into another.",
          "link": "https://defector.com/north-of-north-is-an-arctic-comedy-that-will-warm-your-heart",
          "publishedOn": "2025-04-17T14:12:48.000Z",
          "wordCount": 7553,
          "title": "‘North Of North’ Is An Arctic Comedy That Will Warm Your Heart",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/AAAAQW1EX_YQYuFfZXuljlYraX7DzdUH5oh9otuClUKDx562Mi37DhDmda1PPGfxBT9zzgVIBEAv7wpmgGt3p_9QskOi4Eq2eye3btml45cOQHYB8Qa10lkS_pXU698urol8qbutNRWHzSG72Nq3-3RL4PHNnOk.jpg"
        },
        {
          "id": "https://defector.com/?p=187252",
          "author": "Tom Ley",
          "description": "If the play-in tournament is good for anything, it's throwing an annual spotlight on some of the NBA's most stuck-in-the-mud franchises. Whereas 9- and 10- seeds used to be able to slink into the offseason in relative anonymity, they are now dragged into the light for one more nationally televised, win-or-go-home game that is sure to leave everyone who watches muttering something like, \"Oh boy, this is a mess.\"\nThis year, it's the Sacramento Kings whose asses are in the jackpot. This is thanks to the humiliating 120-106 loss they suffered to the post-Luka Mavericks on Wednesday night, bringing an end to a season in which the Kings went 40-42, fired their coach, and traded their best player. A casual observer tuning into last night's game, checking in on the Kings for maybe the first time all season, would have been confronted with some alarming developments: DeMar DeRozan needed 28 shots to score his 33 points; Domantas Sabonis could muster only 11 points while committing five turnovers; Zach LaVine is on this team now.",
          "link": "https://defector.com/extinguish-the-beam-sacramento-kings",
          "publishedOn": "2025-04-17T13:11:52.000Z",
          "wordCount": 6901,
          "title": "Extinguish The Beam",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210653934.jpg"
        },
        {
          "id": "https://defector.com/?p=186982",
          "author": "Maitreyi Anantharaman",
          "description": "On the morning of the WNBA draft, Dominique Malonga stepped out onto the observatory deck of the Empire State Building, sporting a huge, winsome smile and a tiny camcorder in her hand. Against a canvas of groggy faces in matching hoodies, Malonga’s own bright face stood out. She and her fellow draft prospects were midway through a tiring multi-day circuit of media engagements and rookie orientation meetings. (At the draft that night, the writer Mel Greenberg called this procession “the car wash.”) So you could forgive them all for looking less than enthused to ceremonially “light” a building that would not actually be lit for many more hours because it was 9:00 a.m.\nMaybe it was the smile that won me over. Maybe it was the tiny camcorder. Maybe I felt some extra affection on account of Malonga’s youth. International pros are subject to looser age restrictions than players drafted from the NCAA. At 19, the French center is one of the youngest members of this rookie class. Someone from the league’s in-house media staff asked Malonga a few questions about her game and her WNBA goals for a video. With the city skyline behind her, the 6-foot-6 Malonga spoke about her versatility and said she was most excited to discover American culture. (I have some bad news, Dominique.) She was then asked what she wanted fans to know about her. “That I’m, like, a smiley person,” she said—how else?—smiling.",
          "link": "https://defector.com/dominique-malonga-is-ready-to-light-up-the-wnba",
          "publishedOn": "2025-04-16T20:45:00.000Z",
          "wordCount": 6926,
          "title": "Dominique Malonga Is Ready To Light Up The WNBA",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2209775439.jpg"
        },
        {
          "id": "https://defector.com/?p=187196",
          "author": "Tom Ley",
          "description": "Chuck Grassley, Iowa's 91-year-old Republican Senator, held a town hall with some of his constituents yesterday in Fort Madison, Iowa. After reviewing eight minutes of footage from the meeting, I have to say that the people of Fort Madison were really getting Chuck's ass.\n\nhttps://www.youtube.com/watch?v=gbfPt8o8h5A",
          "link": "https://defector.com/angry-interjections-from-chuck-grassleys-chippy-town-hall-meeting-ranked",
          "publishedOn": "2025-04-16T18:35:47.000Z",
          "wordCount": 5152,
          "title": "Angry Interjections From Chuck Grassley’s Chippy Town Hall Meeting, Ranked",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/Chuch-Grassley-getting-owned.png"
        },
        {
          "id": "https://defector.com/?p=187154",
          "author": "Kathryn Xu",
          "description": "On March 30, fencer Stephanie Turner was disqualified from the Cherry Blossom Open, a minor Division I-A tournament in Maryland, for kneeling and refusing to compete against her opponent, college fencer Red Sullivan, who is a trans woman. The incident was recorded and immediately posted to Twitter; shortly afterward, Turner participated in an interview with Fox News, stating, \"I looked at the ref and I said, 'I'm sorry, I cannot do this. I am a woman, and this is a man, and this is a women's tournament. And I will not fence this individual.'\" The referee then gave Turner, who is 31 years old, a black card for refusing to fence, in accordance with the International Fencing Federation rules, which was later upheld by USA Fencing. Sullivan, who is 19 and a self-described \"mid\" competitor, went on to place 24th out of 39 fencers at the competition, winning two out of her six bouts.\nThe incident has predictably ballooned far outside of the original event's scope or results. J.K. Rowling, whose primary vocation nowadays is spamming posts about trans issues on Twitter, quote-tweeted the video with \"What a heroine looks like.\" After stating that her stunt would temporarily ruin her life, Turner received a $5,000 \"Courage Wins Champions\" prize from XX-XY Athletics, a sportswear brand centered around \"protecting women's sports.\" Most eye-wateringly, on Tuesday, Congresswoman and DOGE subcommittee chair Marjorie Taylor Greene announced a hearing on USA Fencing's policy allowing trans women to compete in women's events, and invited Turner to testify. The hearing is scheduled for May 7.",
          "link": "https://defector.com/the-doge-fencing-hearing-reveals-the-latest-in-anti-trans-grift",
          "publishedOn": "2025-04-16T17:46:34.000Z",
          "wordCount": 6329,
          "title": "The DOGE Fencing Hearing Reveals The Latest In Anti-Trans Grift",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/mtg.jpeg"
        },
        {
          "id": "https://defector.com/?p=187156",
          "author": "Patrick Redford",
          "description": "The competitive dynamic of Tuesday night's Grizzlies–Warriors play-in was brutally simple: The Warriors were more skilled and generally better, but the Grizzlies were bigger, more athletic, and nastier. The winner would be the team that could enforce its style of play, and while Golden State eventually did so, there was a solid 24 or so minutes spanning the back half of the second quarter through most of the fourth when they couldn't do a thing against Memphis's physicality. I was particularly enamored of—and the Warriors were particularly plagued by—Zach Edey.\nEdey is a curious player. His considerable strengths (vertical) and weaknesses (horizontal) are evident to anyone who watches him move around the court for one single play, and the Warriors made hay early by repeatedly isolating him and having Jimmy Butler and Steph Curry attack him in space. That was often the right play, though Edey is so huge and so rugged that he warps the space on the court in a way no other player in the league does. Butler would feint and flex his way into the paint, beating Edey to the spot, or Curry would drive past an overplaying defender and into the paint, and neither superstar would convert on the sort of easy opportunity they have for a collective 30 seasons, due to Edey forcing a miss. Curry destroyed the Kings for 50 points in 2023 with these sorts of drives, but Edey, slow as he is, is just too big.",
          "link": "https://defector.com/zach-edey-is-a-force",
          "publishedOn": "2025-04-16T17:02:26.000Z",
          "wordCount": 6808,
          "title": "Zach Edey Is A Force",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210503726.jpg"
        },
        {
          "id": "https://defector.com/?p=187101",
          "author": "Post-Postdoc",
          "description": "I was actually having a pretty good conversation with the avatar interviewer. We had discussed my current work, my PhD thesis, and recent research developments I found compelling. It only took a few seconds to adjust to the reality: that this was the interview, that I would talk only to this avatar, that this avatar had accurately regurgitated some of the more arcane phrases related to particularly new research techniques that it probably hadn't heard before, that this avatar was steering this conversation in predetermined directions about as well as some human \"recruiters\" I'd spoken to. I thought back to previous conversations I'd had, at similar phases of similar job applications, and, honestly, this wasn't so different. \"There's a formula,\" I'd been told, and it pretty much was that way. Now it had been formalized, finalized, and rendered.\nAnd then it asked me some questions I hadn't gotten before in an interview like this: What made a good multiple choice question? And if I were to write a multiple choice question, what would make for a difficult incorrect answer?",
          "link": "https://defector.com/how-i-became-highly-educated-grist-for-the-ai-mill",
          "publishedOn": "2025-04-16T16:43:17.000Z",
          "wordCount": 15139,
          "title": "How I Became Highly Educated Grist For The AI Mill",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/AI-Gig-Work.jpg"
        },
        {
          "id": "https://defector.com/?p=187114",
          "author": "Luis Paez-Pumar",
          "description": "Over the last 10 years or so, no team has suffered more heartbreaking collapses in the Champions League than Paris Saint-Germain. The Ligue 1 monolith has, on three separate occasions, held a two-goal advantage at some point in the second leg of a tie, only to lose in demoralizing fashion. The list doubles as a horror story for PSG fans: First was the famous Barcelona comeback in 2017, in which PSG blew a four-goal lead, then came a two-goal disintegration by Manchester United two seasons later. Finally, in 2022, PSG gave up a hat trick to Karim Benzema and Real Madrid in 17 minutes, turning a 2–0 overall lead into a 3–2 aggregate defeat.\nGiven all that history, there's no way PSG should have felt comfortable heading into Tuesday's second leg of the Champions League quarterfinals against Aston Villa with a 3–1 lead. Something like comfort may have started to creep in after PSG scored the first two goals of Tuesday's game, giving them a 5–1 lead on aggregate. After all, the Parisians trounced Liverpool in the previous round, and Aston Villa is, on paper, no Liverpool. And yet, fear and panic arrived right on schedule, and it took every single bit of resilience PSG had, along with a healthy dose of Gianluigi Donnarumma goalkeeping heroics, to hang onto narrow a 5–4 aggregate victory.",
          "link": "https://defector.com/paris-saint-germain-escaped-its-past-for-now",
          "publishedOn": "2025-04-16T15:33:45.000Z",
          "wordCount": 8131,
          "title": "Paris Saint-Germain Escaped Its Past, For Now",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2209873635.jpg"
        },
        {
          "id": "https://defector.com/?p=187141",
          "author": "Jae Towle Vieira",
          "description": "Much has been said about small towns. As someone with the dubious pleasure of living in a small town from birth to college, I think small towns have earned every aspect of their reputation. But when you’ve got a small town on a remote island, all those pressures double. Everyone knows everyone else’s business, and it’s harder to escape! Hell is even more hell and other people are even more other people. \nThis week, we’ve brought you a story from the beating heart of one such island town: the volunteer firefighting squad. Get ready for a juicy power struggle featuring nepotism, inept boyfriends, and goji berries.",
          "link": "https://defector.com/lit-up-on-bleep-island",
          "publishedOn": "2025-04-16T15:13:38.000Z",
          "wordCount": 5469,
          "title": "Lit Up On Bleep Island",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2023/03/Normal_Gossip_16-9_V2.png"
        },
        {
          "id": "https://defector.com/?p=186894",
          "author": "Sabrina Imbler",
          "description": "When Joel Runnels graduated from college, he followed the age-old tradition of young people who don't quite know what they want to do with their lives, which is to say he applied to the Peace Corps. Runnels had studied American Sign Language in college and, as someone who grew up with a speech impediment, he also had a lifelong affinity for working with people with disabilities. The Peace Corps, under the mistaken impression that there's one universal sign language, invited him to pioneer their Deaf Education Program in Kenya. Runnels only knew ASL, so he had to learn Swahili and Kenyan Sign Language as well.\nIn Kenya, Runnels's students kept asking him if he'd heard of an African-American educator and missionary named Andrew Foster, who is often called the father of Deaf education in Africa. Runnels hadn't, and back in the U.S. he found no books about Foster's life or legacy. \"I thought, if I want to read the book, I have to write it,\" he said. Runnels ended up getting a PhD so that he could write a biography of Foster as his dissertation. \"I felt, if he has served as a bridge between America and Africa for 30 years, I can give up a few of my years to give his life and legacy a scholarly treatment,\" he said.",
          "link": "https://defector.com/an-interview-with-a-fired-usaid-education-officer",
          "publishedOn": "2025-04-16T14:43:08.000Z",
          "wordCount": 14742,
          "title": "An Interview With A Fired USAID Education Officer",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/IMG_5316-e1744809494962.jpeg"
        },
        {
          "id": "https://defector.com/?p=187117",
          "author": "Ray Ratto",
          "description": "It was a game with a hundred turning points, each more compelling than the one before it, building to a crescendo that ended with…an inbound violation? Well, that's something else for the Memphis Grizzlies to work on before Friday, we suppose.\nIn a mesmerizing yet jagged game to determine which of the two top play-in teams was better suited to deal with the precocious Houston Rockets this weekend in the first round of the actual Western Conference playoffs, the Golden State Warriors out-experienced the Grizz, 121-116. That experience and the steady relentlessness it made was the one thing Memphis could not overcome. They refused to take the knee after a befuddled start and then just kept on refusing, forcing the Warriors to draw 75 points from Jimmy Butler and Stephen Curry in order to survive the kind of scare they are both too old to endure too often. The correct team won, but only after working far harder than they either had meant to or logically can be expected to do repeatedly.",
          "link": "https://defector.com/the-warriors-really-had-to-work-for-it",
          "publishedOn": "2025-04-16T13:39:26.000Z",
          "wordCount": 7593,
          "title": "The Warriors Really Had To Work For It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210501742.jpg"
        },
        {
          "id": "https://defector.com/?p=187081",
          "author": "Barry Petchesky",
          "description": "Objectively speaking, the Minnesota Wild's final regular-season game against the Ducks Tuesday was a crucial one. They needed to gain a single standings point, by hook or by crook, to clinch one of the West's suddenly competitive wild card spots. The Blues won their game, clinching their own spot, and a regulation loss for the Wild would've left their fate in the hands of the pursuing Flames, who have one more game left. Subjectively speaking, it was even more important for everyone involved that the Wild lock down that point so that Marc-Andre Fleury could get a proper home send-off.\nFleury, 40 years old and playing his 21st and final season, has been on something of a farewell tour as Minnesota's backup. He's been honored in every city, and opponents have formed handshake lines just for him. He's a one-man NHL institution, the rare first-overall goaltender pick way back in 2003, and one of just two players left who played before the lockout. He's been a rock: second all-time in wins and games played. He won three Cups with the Penguins, though, for my money, his most impressive feat was having a career year at age 36 with Las Vegas, winning his first Vezina after most of his contemporaries had already hung up their pads. He's also (and this is a technical term) a good dude, beloved by teammates, fans, and media. He was never truly a dominant netminder, and I think that humanity only made him more endearing as he handled various goaltender controversies and benchings and one unceremonious Vegas eviction with nothing but equanimity. He easily could have retired then, but he still enjoyed playing hockey and so put in the work for a woeful Chicago team, and was rewarded with a third lease on life in Minnesota. The Twin Cities embraced him, as had all his previous homes, and it was as good a situation as any to go out on.",
          "link": "https://defector.com/one-last-nice-moment-for-marc-andre-fleury-who-deserves-them-all",
          "publishedOn": "2025-04-16T13:14:55.000Z",
          "wordCount": 7014,
          "title": "One Last Nice Moment For Marc-Andre Fleury, Who Deserves Them All",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210498342.jpg"
        },
        {
          "id": "https://defector.com/?p=187061",
          "author": "Tom Ley",
          "description": "Tomorrow, the Dallas Mavericks will be tipping off a play-in game against the Sacramento Kings. Win, and their hopes of making the postseason stay alive. Lose, and their season ends. Obviously, today was the perfect day for the front office to orchestrate a strange, semi-secretive sit-down with selected members of the local media, the purpose of which seems to have been getting everyone really agitated about the Luka Doncic trade again.\nThe meeting was organized by Mavs general manager Nico Harrison and CEO Rick Welts. According to DLLS Sports reporter Tim Cato, there were about 15 people present at the meeting, including several Mavericks staffers. The reporters who attended the meeting had to agree not to record any audio, and were told that no video cameras would be allowed into the room. Surely these restrictions were put in place because Harrison and Welts had something new to say to the media, perhaps even a piece of information so explosive that it could not be appropriately revealed without strict messaging controls in place. Surely these two bozos did not drag a dozen or so reporters down to the team facility this morning so that they could sit there and say \"Defense wins championships\" over and over again.",
          "link": "https://defector.com/nico-harrison-picks-ideal-moment-to-piss-off-everyone-again",
          "publishedOn": "2025-04-15T21:11:24.000Z",
          "wordCount": 6237,
          "title": "Nico Harrison Picks Ideal Moment To Piss Off Everyone Again",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2209448222.jpg"
        },
        {
          "id": "https://defector.com/?p=186041",
          "author": "Rick Paulas",
          "description": "The idea came in a flash while I was on a barstool in Bed-Stuy’s Do Or Dive. The bartender snapped off the music to swap in the Jeopardy! theme, but I couldn’t find Trebek until I followed my fellow bargoers' gaze to the top of a fridge, where the smallest black and white TV I’ve ever seen rested. In no way was it an appropriate size to show anything, but for a show based mostly in audio it worked fine enough. I wanted my own right away. \nI went to eBay, steering clear of those with DVD players because they felt wrong, and eventually finding one with a VCR built-in because that felt right. It was from Sylvania, with a whopping 9-inch screen, and came with a power source that hooks up into your car’s cigarette lighter for when the grid goes down and we’re fucked. It cost me $120, and it’s the best thing I’ve ever purchased.",
          "link": "https://defector.com/the-best-thing-i-own-is-my-tiny-tv-vcr",
          "publishedOn": "2025-04-15T19:53:15.000Z",
          "wordCount": 7930,
          "title": "The Best Thing I Own Is My Tiny TV/VCR",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/image1-4.jpeg"
        },
        {
          "id": "https://defector.com/?p=186986",
          "author": "Albert Burneko",
          "description": "On Monday, the singer Katy Perry, the TV personality Gayle King, Fight Club star Lauren Sánchez, and a few others took a 10-minute, 21-second ride aboard the New Shepard rocket operated by Jeff Bezos's Blue Origin aerospace company. For some brief period of time—a mere fraction of the flight's overall duration—the rocket and its inhabitants reportedly reached or exceeded 330,000 feet of altitude, or what is known as the Kármán Line, a popular but by no means universally agreed-upon definition of the \"edge of space.\" Bezos himself has made this trip before, as have a few others with his Blue Origin company or with competing outfits; each time, the press deferentially reports that the travelers went \"to space\" or \"to outer space.\"\nCharitably, let's grant that the Kármán Line does in fact represent the edge of space. The line's namesake, scientist Theodore von Kármán, chose it as a rough estimate of the altitude at which a vehicle in flight would no longer be kept aloft by aerodynamic lift, but rather entirely by inertia. OK! Fine. Works for me. Grant that the Kármán Line really is a line, and is the edge of space, and grant that the vehicle bearing Katy Perry, Gayle King, et. al. traveled to and possibly past it. Have they \"been to space\"?",
          "link": "https://defector.com/at-what-point-has-one-actually-been-to-space",
          "publishedOn": "2025-04-15T18:52:44.000Z",
          "wordCount": 8378,
          "title": "At What Point Has One Actually “Been To” Space?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/blueorigin.jpeg"
        },
        {
          "id": "https://defector.com/?p=186985",
          "author": "Patrick Redford",
          "description": "Bill Belichick's University of North Carolina football team, college sports' strongest argument for open records laws, began spring practices this past weekend. As the 72-year-old head coach sorts through position battles and figures out who's going to play quarterback, the real fun for outside observers is in getting a sense of how much Jordon Hudson, his 24-year-old girlfriend, will be doing for the program.\nBelichick stocked his coaching ranks with various unsuccessful friends and associates, all of whom seem to understand this might be their final opportunity to harvest a salary from the putrescent corpse of the ex–New England Patriots coach's legacy. According to emails uncovered by The Assembly in March, Belichick is farming out correspondence duties to Hudson, asking a UNC administrator to copy her on all emails sent to him. This week, the Athletic revealed some of those emails, which are pretty funny. Hudson does not work for the university, but she's operating as some sort of professional liaison for her septuagenarian boyfriend and his big-headed son.",
          "link": "https://defector.com/bill-belichicks-girlfriend-asks-that-her-boyfriends-son-receive-the-upmost-respect",
          "publishedOn": "2025-04-15T18:00:46.000Z",
          "wordCount": 6252,
          "title": "Bill Belichick’s Girlfriend Asks That Her Boyfriend’s Son Receive The “Upmost Respect”",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2198457470.jpg"
        },
        {
          "id": "https://defector.com/?p=186969",
          "author": "Tom Ley",
          "description": "During Monday's White House visit by the FCS national champion Ohio State Buckeyes, former Ohio Senator and current Vice President JD Vance attempted to pick up the National Championship trophy and did not succeed. Vance fumbled both the top and the bottom of the trophy, the base of which tumbled to the ground. Here, Defector presents two perspectives on the incident.\n\nhttps://www.youtube.com/watch?v=YwOa4m0WRps",
          "link": "https://defector.com/point-counterpoint-jd-vance-drops-the-national-championship-trophy",
          "publishedOn": "2025-04-15T17:40:59.000Z",
          "wordCount": 10397,
          "title": "Point/Counterpoint: JD Vance Drops The National Championship Trophy",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2209746962.jpg"
        },
        {
          "id": "https://defector.com/?p=186915",
          "author": "Kathryn Xu",
          "description": "My computer recently prompted me to \"look back at your memories!\" along with a photo of a woman, who was not me, sitting down on a nondescript swath of pavement, surrounded by garbage. Now, while I did not personally attend the Grand National at Aintree, just outside of Liverpool, last year, it is true that I have fond memories of my time spent going through photos of that event. The Grand National is ostensibly a horse race, but after conducting my second detailed survey of Getty Images, I can conclusively say that it is actually an excuse for English people to get extremely drunk and sit on nondescript swaths of pavement whilst surrounded by garbage. And sometimes in shrubs. Here is the evidence.",
          "link": "https://defector.com/please-enjoy-these-photos-of-drunk-people-at-an-english-horse-race-2",
          "publishedOn": "2025-04-15T13:37:34.000Z",
          "wordCount": 8470,
          "title": "Please Enjoy These Photos Of Drunk People At An English Horse Race",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2207842014.jpg"
        },
        {
          "id": "https://defector.com/?p=186951",
          "author": "Jen Vafidis",
          "description": "I am going to start with a confession: I used to do theater. I say “do theater,” because I did it all: I acted, I directed, I wrote. I designed costumes, I studied the Meisner technique, I rolled around on the floor in a leotard—I even made puppets. None of this was professional, it mainly took place in black boxes for hire, school auditoriums, and the workshops of eager hobbyists. But theater was my first love, and like it is with many first loves, my former feelings now often embarrass me—not just because I no longer feel them, but because falling out of love was so decisive, so shattering, so apocalyptic that the person I was when I did theater is a person who will never exist again.    \nIf this sounds dramatic, well, I did just confess to being a theater kid, and what prevented me from becoming a theater adult was character actor Richard Kind. You might be a little confused, wondering how someone who is fairly successful and otherwise innocuous could be an instigator for such discouragement. I can assure you that he did nothing bad; in fact, what he did was beautiful. I heard what he said to me very loudly and clearly at first, then more subtly over the course of my life, as I’ve returned to it and understood it differently at new ages, while he probably gave it less than two seconds of thought at the time.",
          "link": "https://defector.com/how-meeting-richard-kind-changed-the-course-of-my-life",
          "publishedOn": "2025-04-15T13:06:37.000Z",
          "wordCount": 9681,
          "title": "How Meeting Richard Kind Changed The Course Of My Life",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2190366948.jpg"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=849164",
          "author": "Steve Adams",
          "description": "The Royals announced Monday that minor league righty Cesar Espinal has been traded to the Brewers. He’s the player to be named later from the swap that sent Mark Canha from Milwaukee to K.C. late in spring training. Espinal is just 19 years old, but this is already the second time in his career that…",
          "link": "https://www.mlbtraderumors.com/2025/04/brewers-royals-mark-canha-trade-ptbnl-cesar-espinal-pitcher.html",
          "publishedOn": "2025-04-21T16:51:51.000Z",
          "wordCount": 3161,
          "title": "Brewers Acquire Cesar Espinal To Complete Mark Canha Trade",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/04/mark-canha-royals-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=849119",
          "author": "Mark Polishuk",
          "description": "With four outfielders already on the injured list, the Tigers might’ve lost another key contributor when Kerry Carpenter left today’s 4-3 loss to the Royals with what manager A.J. Hinch described as right hamstring soreness.  As Hinch told the Detroit News’ Chris McCosky and other reporters, Carpenter suffered the injury while running out an infield…",
          "link": "https://www.mlbtraderumors.com/2025/04/al-central-notes-carpenter-erceg-meidroth.html",
          "publishedOn": "2025-04-21T03:18:38.000Z",
          "wordCount": 3358,
          "title": "AL Central Notes: Carpenter, Erceg, Meidroth",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/04/KerryCarpenter2025-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=848937",
          "author": "Mark Polishuk",
          "description": "The Royals announced that outfielder MJ Melendez has been optioned to Triple-A Omaha.  The move opens up a roster spot for Mark Canha, as the veteran outfielder/first baseman was reinstated from the 10-day injured list. More to come…",
          "link": "https://www.mlbtraderumors.com/2025/04/royals-option-mj-melendez-to-triple-a-activate-mark-canha-from-10-day-il.html",
          "publishedOn": "2025-04-19T14:07:31.000Z",
          "wordCount": 3073,
          "title": "Royals Option MJ Melendez To Triple-A, Activate Mark Canha From 10-Day IL",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/04/MJMelendez-2025-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=848721",
          "author": "Steve Adams",
          "description": "The increasing popularity of opt-outs/player options as a means to close the gap in free agent signings and extensions has changed the face of free agency entirely. Not long ago, opt-outs were perks reserved for the game’s truly elite stars — a benefit to help differentiate nine-figure offers and secure the game’s top stars. In…",
          "link": "https://www.mlbtraderumors.com/2025/04/player-option-opt-out-update-april-edition.html",
          "publishedOn": "2025-04-18T23:25:14.000Z",
          "wordCount": 6059,
          "title": "Player Option/Opt-Out Update: April Edition",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/04/USATSI_25938284-1024x683.jpg"
        }
      ]
    },
    {
      "title": "Flaming Hydra",
      "feedUrl": "https://flaminghydra.com/rss/",
      "siteUrl": "https://flaminghydra.com/",
      "articles": [
        {
          "id": "68095cf70d4ed500016123dd",
          "author": "The Editors",
          "description": "Ana Marie Cox on death and salvation",
          "link": "https://flaminghydra.com/issue-305/",
          "publishedOn": "2025-04-24T00:51:45.000Z",
          "wordCount": 575,
          "title": "Death watch",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/rolex-edit-IMG_3041-1.jpg"
        },
        {
          "id": "6808f2590d4ed500016122f9",
          "author": "Ana Marie Cox",
          "description": "I’ve known since she died that the horror of my mother’s death was a gift. The images of my beautiful mother with her hands drawn up into claws, her lips pale and unrouged, the light out in her eyes, the soft and hesitant way she looked",
          "link": "https://flaminghydra.com/inheritance/",
          "publishedOn": "2025-04-24T00:49:54.000Z",
          "wordCount": 631,
          "title": "Inheritance",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/rolex-edit-IMG_3041.jpg"
        },
        {
          "id": "6807fcfae515060001208f95",
          "author": "The Editors",
          "description": "Talia Lavin on finding the words; Carrie Frye talks The Awl: The Book",
          "link": "https://flaminghydra.com/issue-304/",
          "publishedOn": "2025-04-23T00:03:09.000Z",
          "wordCount": 698,
          "title": "Cold and empty",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/drifts-16w-1.jpg"
        },
        {
          "id": "68080c71e515060001208fda",
          "author": "Talia Lavin",
          "description": "In Russian, writer’s block is known as “fear of the white page.” Or the white screen, in my case. When I sat down to write, my hands shook, in time with the blinking cursor. In the days after Donald Trump’s second inauguration, the sense",
          "link": "https://flaminghydra.com/wordless/",
          "publishedOn": "2025-04-23T00:02:43.000Z",
          "wordCount": 730,
          "title": "Wordless",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/drifts-16w.jpg"
        },
        {
          "id": "68082425e515060001209044",
          "author": "Carrie Frye",
          "description": "Maria Bustillos gabs with Carrie Frye about The Awl and the new THE AWL: THE BOOK! Joe MacLeod pressed the RECORD button.\nListen on Apple/Spotify/RSS/plus more options at pod.link\n\nEpisode 8: Internet pals\nCarrie Frye and Maria Bustillos talk about THE AWL",
          "link": "https://flaminghydra.com/podcast-round-table-episode-8-internet-pals/",
          "publishedOn": "2025-04-23T00:02:20.000Z",
          "wordCount": 429,
          "title": "PODCAST Round Table! Episode 8: Internet Pals",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/awl-IMG_2310.jpg"
        },
        {
          "id": "68082425e515060001209044",
          "author": "Carrie Frye",
          "description": "Maria Bustillos gabs with Carrie Frye about The Awl and the new THE AWL: THE BOOK! Joe MacLeod pressed the RECORD button.\nListen on Apple/Spotify/RSS/plus more options at pod.link\n\nEpisode 8: Internet pals\nCarrie Frye and Maria Bustillos talk about THE AWL",
          "link": "https://flaminghydra.com/podcast-round-table-episode-3-internet-pals/",
          "publishedOn": "2025-04-23T00:02:20.000Z",
          "wordCount": 429,
          "title": "PODCAST Round Table! Episode 3: Internet Pals",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/awl-IMG_2310.jpg"
        },
        {
          "id": "680697fc105fa700014c04e3",
          "author": "The Editors",
          "description": "Maria Bustillos on 'Sinners'",
          "link": "https://flaminghydra.com/issue-303/",
          "publishedOn": "2025-04-21T23:40:45.000Z",
          "wordCount": 622,
          "title": "White fangs",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/sinners-2160-edit-16x9-2.jpg"
        },
        {
          "id": "680654e1105fa700014c0360",
          "author": "Maria Bustillos",
          "description": "Sinners, the new vampire horror movie directed by Ryan Coogler and starring Michael B. Jordan, opened this weekend to boffo reviews and impressive global box office receipts of $61 million. Coogler’s films have made more than $2.4 billion at the box office, according to Variety, giving him",
          "link": "https://flaminghydra.com/music-in-the-blood/",
          "publishedOn": "2025-04-21T23:28:59.000Z",
          "wordCount": 706,
          "title": "Music in the Blood",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/sinners-2160-edit-16x9.jpg"
        },
        {
          "id": "680294b3105fa700014bef72",
          "author": "The Editors",
          "description": "Jennie Rose Halperin on the life and work of Michael Hurley",
          "link": "https://flaminghydra.com/issue-302/",
          "publishedOn": "2025-04-18T21:49:40.000Z",
          "wordCount": 594,
          "title": "Easy listening",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/hurley-cover-detail-1.png"
        },
        {
          "id": "6802b4ed105fa700014befdb",
          "author": "Jennie Rose Halperin",
          "description": "YOU CAN SHARE THIS POST ON BLUESKY THANK YOU\nI first heard Michael Hurley play in a small, mostly empty venue in Berlin in 2013. It was an early set; the bar was muted, brown, and dingy in dusty late spring light, but when he came in he lit up",
          "link": "https://flaminghydra.com/goodbye-to-the-godfather-of-freak-folk/",
          "publishedOn": "2025-04-18T21:48:49.000Z",
          "wordCount": 668,
          "title": "Goodbye to the Godfather of Freak Folk",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/hurley-cover-detail.png"
        },
        {
          "id": "680180bd105fa700014bddd3",
          "author": "The Editors",
          "description": "Arwa Mahdawi nears the end of an investigation",
          "link": "https://flaminghydra.com/issue-301/",
          "publishedOn": "2025-04-17T23:40:06.000Z",
          "wordCount": 569,
          "title": "Trouble at home",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/police-information-only-1.png"
        },
        {
          "id": "68017557105fa700014bddaa",
          "author": "Arwa Mahdawi",
          "description": "In July 1996, 36-year-old Susan Walsh supposedly left her house in New Jersey and never came back. She is presumed dead but a body has never been found. This is Part Three of a series on my five-year investigation into her unsolved disappearance.\nTo catch up, here are Part One",
          "link": "https://flaminghydra.com/how-to-solve-a-murder-part-five/",
          "publishedOn": "2025-04-17T23:39:54.000Z",
          "wordCount": 628,
          "title": "How to Solve a Murder: Part Five",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/police-information-only.png"
        },
        {
          "id": "68001b35105fa700014bcac0",
          "author": "The Editors",
          "description": "Nathan Munn on Canadian medicine, and Hollywood gossip on the road with Jack Pendarvis",
          "link": "https://flaminghydra.com/issue-300/",
          "publishedOn": "2025-04-16T22:54:05.000Z",
          "wordCount": 616,
          "title": "Film a hand / Break a leg",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/abe-vigoda-jury-duty-duo-16x9-crop-1.png"
        },
        {
          "id": "68001b35105fa700014bcac0",
          "author": "The Editors",
          "description": "Nathan Munn on Canadian medicine, and Hollywood gossip on the road with Jack Pendarvis",
          "link": "https://flaminghydra.com/film-a-hand-break-a-leg/",
          "publishedOn": "2025-04-16T22:54:05.000Z",
          "wordCount": 612,
          "title": "Film a hand / Break a leg",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/abe-vigoda-jury-duty-duo-16x9-crop-1.png"
        },
        {
          "id": "67ffcf22105fa700014bc9bc",
          "author": "Jack Pendarvis",
          "description": "Ace Goes to Hollywood is a continuing transcript of a ride from Oxford, Mississippi, to Memphis, Tennessee, during which Jack Pendarvis interviewed Ace Atkins about his work on the Pauly Shore film Jury Duty.\nEpisode 4: Bring Me the Hands of Abe Vigoda\nAce has just answered his phone, and",
          "link": "https://flaminghydra.com/ace-goes-to-hollywood-episode-4/",
          "publishedOn": "2025-04-16T22:52:12.000Z",
          "wordCount": 636,
          "title": "Ace Goes to Hollywood: Episode 4",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/abe-vigoda-jury-duty-duo-16x9-crop.png"
        },
        {
          "id": "680007dd105fa700014bca4e",
          "author": "Nathan Munn",
          "description": "If you, a Canadian, should catastrophically break your femur and dislocate your hip doing something stupid, as I did 20 years ago, you’ll quickly find your screaming, shivering form scooped up by friendly paramedics, delivered to hospital, triaged, X-rayed, repaired by world-class surgeons (alongside radiologists, nurses, anaesthesiologists, etc.",
          "link": "https://flaminghydra.com/health-care-you-can-trust/",
          "publishedOn": "2025-04-16T22:50:12.000Z",
          "wordCount": 570,
          "title": "Health Care You Can Trust",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/Screenshot-2025-04-16-at-5.23.29-PM.jpg"
        },
        {
          "id": "67fead90b249b300019cbb7b",
          "author": "The Editors",
          "description": "Ben Ehrenreich sweeps forward; dance class with Amy Chu",
          "link": "https://flaminghydra.com/issue-299/",
          "publishedOn": "2025-04-15T23:15:02.000Z",
          "wordCount": 766,
          "title": "New life / Aging legs",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/trees-16x9-IMG_2928-1.jpg"
        },
        {
          "id": "67febb68b249b300019cbbd9",
          "author": "Amy Chu",
          "description": "a collective of 60 writers, on fire and hard to kill",
          "link": "https://flaminghydra.com/adult-ballet-class/",
          "publishedOn": "2025-04-15T23:14:47.000Z",
          "wordCount": 297,
          "title": "Adult Ballet Class",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/Church.jpg"
        },
        {
          "id": "67fe93d9b249b300019cbb3c",
          "author": "Ben Ehrenreich",
          "description": "At some point in the next few days or even hours, my partner will give birth to a child. Her delivery date came and went earlier in the week, but with so much going on and the markets all yippy, who has time for the miracle of life? I’",
          "link": "https://flaminghydra.com/soon/",
          "publishedOn": "2025-04-15T23:14:26.000Z",
          "wordCount": 806,
          "title": "Soon",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/trees-16x9-IMG_2928.jpg"
        }
      ]
    },
    {
      "title": "Today in Tabs",
      "feedUrl": "https://rss.beehiiv.com/feeds/ZRiesnGI0u.xml",
      "siteUrl": "https://www.todayintabs.com/",
      "articles": []
    },
    {
      "title": "Bad Faith Times",
      "feedUrl": "https://bad-faith-times.ghost.io/rss/",
      "siteUrl": "https://bad-faith-times.ghost.io/",
      "articles": [
        {
          "id": "680a4e47db769a000141c602",
          "author": "Denny Carter",
          "description": "Mockery, not viciousness and mean-spiritedness, has proven far more effective in beating back autocracy",
          "link": "https://bad-faith-times.ghost.io/the-fatal-flaw-of-dark-woke/",
          "publishedOn": "2025-04-24T15:19:20.000Z",
          "wordCount": 2689,
          "title": "The Fatal Flaw Of 'Dark Woke'",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/size/w1200/2025/04/31020496355_cb17578a91_h.jpg"
        },
        {
          "id": "68079a95c3c2590001577733",
          "author": "Denny Carter",
          "description": "In three months we've seen Elon Musk go from planning a thousand year autocratic regime to retreating to play with his rockets and cars",
          "link": "https://bad-faith-times.ghost.io/these-guys-are-so-soft/",
          "publishedOn": "2025-04-22T16:39:21.000Z",
          "wordCount": 1409,
          "title": "These Guys Are So Soft",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/04/Screenshot-2025-04-22-at-12.38.12-PM.png"
        },
        {
          "id": "68028ec00951470001ef0769",
          "author": "Denny Carter",
          "description": "The United States can't be saved unless SCOTUS is saved first",
          "link": "https://bad-faith-times.ghost.io/imagine-a-pro-democracy-supreme-court-if-you-can/",
          "publishedOn": "2025-04-18T18:51:16.000Z",
          "wordCount": 1713,
          "title": "Imagine A Pro-Democracy Supreme Court – If You Can",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/04/2894165178_1b3be5fac1_b.jpg"
        },
        {
          "id": "680118e20951470001ef01a7",
          "author": "Denny Carter",
          "description": "Rejecting the civil libertarian interpretation of the First Amendment is more important than ever",
          "link": "https://bad-faith-times.ghost.io/we-need-a-new-concept-of-free-speech-and-we-need-it-now/",
          "publishedOn": "2025-04-17T15:32:33.000Z",
          "wordCount": 2846,
          "title": "We Need A New Concept Of Free Speech, And We Need It Now",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/04/6219961958_e15d5cdec6_b.jpg"
        },
        {
          "id": "67fe72d8040a00000123f9a7",
          "author": "Denny Carter",
          "description": "Know that these nightmare alterations were done for one man.",
          "link": "https://bad-faith-times.ghost.io/mutilating-your-face-for-big-daddy-dictator/",
          "publishedOn": "2025-04-15T15:36:08.000Z",
          "wordCount": 910,
          "title": "Mutilating Your Face For Big Daddy Dictator",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/04/Screenshot-2025-04-15-at-10.33.42-AM-1.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}