{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": [
        {
          "id": "https://blogs.fangraphs.com/?p=466829",
          "author": "Kiri Oler",
          "description": "Which teams follow the BaseRuns rule and which ones are the exception?",
          "link": "https://blogs.fangraphs.com/built-different-or-skill-issue-a-baseruns-game-show-offense-edition/",
          "publishedOn": "2025-06-27T16:00:04.000Z",
          "wordCount": null,
          "title": "Built Different or Skill Issue? A BaseRuns Game Show: Offense Edition",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=194082",
          "author": "Giri Nathan",
          "description": "Damian Lillard's tenure as a star almost certainly fell apart when his left Achilles tendon did in late April. Now his tenure as a Milwaukee Buck is over, too. The team announced Tuesday that it will waive Lillard and stretch the remaining $113 million on his contract over the next five years, thus concluding the oddly unsatisfying Giannis-Dame era.\nOn paper, it was a perfect fit; on the court, it never cohered. Lillard will receive all that money he's due without having to play another basketball game. Surely he wants to play more, however. He also turns 35 in two weeks, and will be 36 by the time he's ready to log serious minutes again, on a repaired tendon, as a 6-foot-2 guard already toeing the line of athletic viability.",
          "link": "https://defector.com/the-bucks-and-damian-lillard-end-their-brief-forgettable-relationship",
          "publishedOn": "2025-07-01T20:06:47.000Z",
          "wordCount": 7467,
          "title": "The Bucks And Damian Lillard End Their Brief, Forgettable Relationship",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2212314444.jpg"
        },
        {
          "id": "https://defector.com/?p=193977",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about farmers markets, vibrators, dogs in mild peril, and more.\nYour letters:",
          "link": "https://defector.com/all-i-want-is-to-live-in-a-world-where-people-talk-normal",
          "publishedOn": "2025-07-01T17:36:14.000Z",
          "wordCount": 17868,
          "title": "All I Want Is To Live In A World Where People Talk Normal",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2219195445.jpg"
        },
        {
          "id": "https://defector.com/?p=194030",
          "author": "Lauren Theisen",
          "description": "You might think that the coolest place to hit a baseball is over the fence. But Red Sox outfielder Wilyer Abreu is here to prove you wrong. In a Boston win where he also smashed a grand slam the traditional way, Abreu earned an inside-the-park dong with a trick shot off Fenway Park's centerfield wall.\nThe Sox attacked Reds rookie Chase Burns early, scoring seven in the first inning. By the time the bottom of the fifth came around, Cincinnati had plated four of their own to make the game a little more interesting. Abreu was the lead-off hitter, and he had a chance to tie his ex-teammate Rafael Devers for most dingers by a Red Sock this season. On 0-2, he got a juicy fastball up in the zone and turned on it, knocking the ball to that little angled nook in the deepest part of his 113-year-old ballfield. The Sock's sock was a few feet from a slow trot around the bases. Instead, he had to race the whole way, benefiting from a dramatic ricochet that sent the ball rolling along the warning track. Its path was so mischievous that the Reds couldn't even throw the ball back to the infield before Abreu slid head-first across the plate.",
          "link": "https://defector.com/wilyer-abreu-hit-it-to-the-most-fun-spot-in-fenway",
          "publishedOn": "2025-07-01T16:38:43.000Z",
          "wordCount": 6981,
          "title": "Wilyer Abreu Hit It To The Most Fun Spot In Fenway",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2222229588.jpg"
        },
        {
          "id": "https://defector.com/?p=194034",
          "author": "Ray Ratto",
          "description": "The kneejerk response to the Ohio legislature helping Cleveland Browns owner Jimmy Haslam to stop being the Cleveland part of that descriptor was a marvelous bit of cynicism-driven political powerlifting that, in its own way, is exactly what Ohio, the Browns, and particularly the Haslams deserve.\nWith three deft moves, the lawmakers cleared the track for the Haslams, Jimmy and Dee, to move the team out of Cleveland to the suburb of Brook Park, in contravention of the Modell Law, named after the bankrupted cur who moved the original Browns to Baltimore, by changing the wording of the law to undermine it entirely; they also claimed to find their $600 million share of the new stadium nut by seizing some treasure trove of unclaimed money; they then allowed the Haslams to continue to collect on their share of county's taxes against beer, hard liquor and cigarettes because, well, Deshaun Watsons don't come cheap.",
          "link": "https://defector.com/ohio-caves-to-the-haslams-tells-cleveland-to-eat-dirt",
          "publishedOn": "2025-07-01T16:16:35.000Z",
          "wordCount": 8000,
          "title": "Ohio Caves To The Haslams, Tells Cleveland To Eat Dirt",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2217996579.jpg"
        },
        {
          "id": "https://defector.com/?p=193865",
          "author": "Owen Lewis",
          "description": "In 2019, while in Peru as a camp counselor, Tyler Andrews set his first Fastest Known Time (FKT) on the 37.9-mile Salkantay Inca Trail, which leads to the summit of Machu Picchu. Andrews’s time beat the previous mark by more than two hours. He identified primarily as a distance runner back then—he’d earned a spot at the U.S. Olympic trials for the marathon in 2016, would do so again in 2020, and had a personal best of 2:15:52—but his performance on the Salkantay Inca Trail kickstarted a new athletic career as a full-fledged mountaineer ascending the tallest mountains in the world in pursuit of various speed records. In May, he aimed to set one on the loftiest setting of all: Mount Everest. \nAndrews exploded into elite-level running from inauspicious beginnings. He was a music and theater head in his younger years and didn’t crack 18 minutes in the 5K in high school. But he was fiercely hardworking, discovered he had an enormous VO2 max, and improved steadily all the way into the professional ranks. Like with his running career, once Andrews started making inroads into the mountaineering world and claiming FKTs, he didn’t stop. Since the Salkantay speed record, Andrews posted several new FKTs each year, setting new standards on Mount Fuji, Kilimanjaro, and the towering, 26,781-foot monster Manaslu, among many others.",
          "link": "https://defector.com/a-lot-can-go-wrong-while-attempting-a-speed-record-on-mount-everest",
          "publishedOn": "2025-07-01T15:45:10.000Z",
          "wordCount": 17369,
          "title": "A Lot Can Go Wrong While Attempting A Speed Record On Mount Everest",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/Ty-running-up-mountain.jpg"
        },
        {
          "id": "https://defector.com/?p=193969",
          "author": "Kelsey McKinney",
          "description": "A little less than 320 feet away, the ball leaves Matt Waldon's right hand. All night, it has been ornery. It has misbehaved. The ball is Waldron's enemy. It's supposed to knuckle, and instead it rebels, skittering out of his hand like it's possessed by some force other than the pitcher's arm. The strike zone? The ball doesn't care for that. Tonight, it wants the backstop. It needs it. It will do any thing to get to it.\nMatt Waldron is the only pitcher in Major League Baseball who even bothers trying to throw the bewitched knuckleball, and still it betrays him. By the time the bottom of the third inning arrives, the ball has run away again and again. It's scurrying past the catcher, walking a man, letting him take second base while it visited (who else?) the backstop again. And then just to prove its dominance, it walks a second man to prove the wild pitch never mattered anyway.",
          "link": "https://defector.com/it-feels-so-good-to-be-a-robber",
          "publishedOn": "2025-07-01T14:34:59.000Z",
          "wordCount": 7896,
          "title": "It Feels So Good To Be A Robber",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2222989821.jpg"
        },
        {
          "id": "https://defector.com/?p=193967",
          "author": "Barry Petchesky",
          "description": "It should be impossible—water-from-a-stone impossible, faster-than-light-travel impossible—to make a bad movie about scary dinosaurs. And yet, according to reviews for Jurassic World Rebirth, out this week, they have done just that for the fourth time in a row.\nSomething is amiss here. These are dinosaurs: the biggest, meanest fuckers to ever walk the Earth—the demons and dragons of nightmare and legend, surely the source of some deep mammalian atavistic fear in the basest parts of our brainstem. If filmmakers can't squeeze two hours of excitement out of being chased by these horrors of tooth and nail, filmmakers need to look at themselves in the mirror and ask, How am I failing the dinos? The answer is that they are not respecting them properly, and trying to invent, new, bigger, smarter, scarier versions of dinosaurs. This is pathetic. Stick to saurians!",
          "link": "https://defector.com/just-give-me-some-normal-damn-dinosaurs",
          "publishedOn": "2025-07-01T14:13:47.000Z",
          "wordCount": 7778,
          "title": "Just Give Me Some Normal Damn Dinosaurs",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2222010428.jpg"
        },
        {
          "id": "https://defector.com/?p=193957",
          "author": "Barry Petchesky",
          "description": "The morning after the Panthers raised the Stanley Cup, some idiot wrote that it would be \"nearly impossible\" for Florida to re-sign its two top pending free agents, forward Sam Bennett and defenseman Aaron Ekblad. That idiot didn't even include mention of Brad Marchand in the same sentence, because only a giant mega mondo idiot would even consider the possibility that they could bring back all three. Well. About that. You see. The thing is. \nThe thing is that the Panthers and GM Bill Zito have done basically everything right over the last three years, and been rewarded with back-to-back Cups, and a roster that adores each other and winning and Florida's lack of income tax, and a bunch of stars willing to take less than their open-market value to keep all that going. So, in a huge blow to the rest of the league's chances next year, and to the potential for drama as true free agency opens up today, the Panthers locked down all three guys to long-term extensions.",
          "link": "https://defector.com/the-panthers-are-bringing-back-all-their-guys",
          "publishedOn": "2025-07-01T13:05:14.000Z",
          "wordCount": 7964,
          "title": "The Panthers Are Bringing Back All Their Guys",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2211979139.jpg"
        },
        {
          "id": "https://defector.com/?p=193886",
          "author": "Maitreyi Anantharaman",
          "description": "The WNBA announced on Monday that it will expand to 18 teams by 2030, adding franchises in Cleveland, Detroit and Philadelphia. By the end of this transformative round of expansion, the league will have added six teams in six years. The Golden State Valkyries joined the WNBA as its 13th team this season; teams in Toronto and Portland will begin play next summer. \nBefore the 2024 draft, WNBA commissioner Cathy Engelbert said the league’s goal was to expand to 16 teams by 2028. Sports Business Journal’s Tom Friend reported this past February that Cleveland would be awarded the 16th team. But he also reported that the WNBA had reevaluated its initial 16-team target and was now eyeing 18. “How do you walk away from three quarters of a billion dollars?” a source told Friend. These three new teams all have NBA ownership groups, and each indeed reportedly paid an expansion fee of $250 million, a ginormous increase from the $50 million fee Valkyries owner Joe Lacob paid to join the WNBA in late 2023.",
          "link": "https://defector.com/the-wnba-and-its-expansion-fees-are-getting-bigger",
          "publishedOn": "2025-06-30T20:22:38.000Z",
          "wordCount": 7579,
          "title": "The WNBA And Its Expansion Fees Are Getting Bigger",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2221971856.jpg"
        },
        {
          "id": "https://defector.com/?p=193871",
          "author": "Lauren Theisen",
          "description": "CM Punk ruled as the coolest guy in North American professional wrestling in a few different eras. An indie firebrand in the first half of the 2000s, the straight-edge icon signed with WWE in 2005 and built himself into an avatar for fans frustrated by the company's de facto monopoly on big-time wrestling. He cemented this position during a feud with quintessential company man John Cena in 2011. Punk (the on-screen character) spoke out against WWE's corporate incompetence; then, in front of a rabid Chicagoland crowd, he beat Cena for his championship to climax probably the best match in company history (even if it's sullied by the presence of Vince McMahon and John Laurinaitis).\nA few years later, Punk became a man who spoke out against WWE without getting paid by them to do it, leaving the company acrimoniously in 2014 because of the toll his work for them took on his body. He went over seven years without a match, in any promotion, and in that time his name became a thing that WWE audiences chanted when they didn't like what they were seeing. Capitalizing on that increasing discontent with the main provider of wrestling in the U.S., All Elite Wrestling launched in 2019, and after it emerged from the limited crowds of the social-distancing era, they signed Punk. He debuted to an unforgettable ovation in the Bulls' arena, furthering the company's upstart momentum, then proceeded to have basically one good year and one year marred by injury and workplace drama. Punk was fired after a backstage altercation at Wembley Stadium in 2023, and he returned to a WWE that was no longer run by his old nemesis McMahon. He's been a wrestler there without off-screen incident ever since.",
          "link": "https://defector.com/cm-punk-loves-saudi-arabia",
          "publishedOn": "2025-06-30T18:40:57.000Z",
          "wordCount": 8461,
          "title": "CM Punk Loves Saudi Arabia",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2221868108.jpg"
        },
        {
          "id": "https://defector.com/?p=193862",
          "author": "Kathryn Xu",
          "description": "Without Max Verstappen, Red Bull Racing would be last in the 2025 Constructors' Championship. Assume that whoever takes Verstappen's seat would perform on par with Red Bull's second drivers so far, and Red Bull can upgrade that to a tidy second-to-last place. So long as the car is not a rocket and the team no longer has Adrian Newey, Red Bull needs Max Verstappen; unfortunately for Red Bull, it also becomes harder and harder for them to keep Max Verstappen.\nThe prospect of Verstappen, currently third in the Drivers' Championship behind the two McLarens, leaving Red Bull was inconceivable even last year, during the height of Christian Horner's misconduct allegations. Though there's no such thing as loyalty in Formula 1, the idea is as aesthetically unimaginable as, say, Lewis Hamilton in a Ferrari. But at some point the noise becomes too much to deny. Two months ago, George Russell, who does not have a contract extension for next year, stated that it would be \"totally understandable\" for Mercedes to pursue Verstappen; just prior to the weekend's Austrian Grand Prix, Mercedes team boss Toto Wolff confirmed that he was having conversations with Verstappen behind closed doors; and on Saturday, Verstappen's was out-qualified by Liam Lawson in a VCARB, Red Bull's sister team.",
          "link": "https://defector.com/red-bull-stares-into-the-abyss",
          "publishedOn": "2025-06-30T16:46:41.000Z",
          "wordCount": 7352,
          "title": "Red Bull Stares Into The Abyss",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/maxVerstappenAntonelliAustrianGP.jpg"
        },
        {
          "id": "https://defector.com/?p=193892",
          "author": "Ray Ratto",
          "description": "One of the reasons there are so many games in any league's season is, well, greed. In fact, that's all the reasons because how else can we turn Caitlin Clark into sorghum futures on the hoof? \nBut one of the hidden benefits of this conglomoglut of games is that every team can go on a heater every year, if only to momentarily lie to their fans about the rosy future they neither deserve nor will achieve. The Colorado Cleveland Spiders Of The New Millennium have won four in a row this season, for the love of the galactic pixies, so like we said, anyone can do it.",
          "link": "https://defector.com/they-let-the-fish-get-hot",
          "publishedOn": "2025-06-30T15:33:16.000Z",
          "wordCount": 7409,
          "title": "They Let The Fish Get Hot!!",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2222776634.jpg"
        },
        {
          "id": "https://defector.com/?p=193863",
          "author": "Maitreyi Anantharaman",
          "description": "It's time to to wrap up the month with a challenging themeless. Keep an eye out for tricky clues and fun wordplay. This week’s puzzle was constructed by Brandon Koppy and edited by Hoang-Kim Vu. Brandon lives in Dripping Springs, Texas, just outside Austin, with his wife and two little girls. You can also find his puzzles in The New York Times or on his blog, see17across.com.\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE. Note that our submissions are closed through July 31.",
          "link": "https://defector.com/the-crossword-june-30-my-girls-themeless",
          "publishedOn": "2025-06-30T15:00:00.000Z",
          "wordCount": 5871,
          "title": "The Crossword, June 30: My Girls (Themeless)",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2182034297.jpg"
        },
        {
          "id": "https://defector.com/?p=193882",
          "author": "Ray Ratto",
          "description": "Luis Severino signed a three-year, $67 million deal this past winter to serve at the whims of the West Sacramento Athletics Of Yolo County. He knew he was signing with the A's because that's what they told him he was doing, but he had not sufficiently considered the West Sacramento Of Yolo County part, and is now miserable because of it.\nIn a chat with The Athletic's Yankees beat writer Brendan Kuty, Severino, who left New York last year to sign the largest contract in A's history, emptied out his grievances when asked why his road splits (2-2, 3.23, etc.) are so much better than his home splits (0-7, 6.79, etc.), and his analysis boils down to this: West Sac sucks.",
          "link": "https://defector.com/luis-severino-and-the-as-cant-wait-for-luis-severino-to-leave",
          "publishedOn": "2025-06-30T14:32:37.000Z",
          "wordCount": 7716,
          "title": "Luis Severino And The A’s Can’t Wait For Luis Severino To Leave",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2222095664.jpg"
        },
        {
          "id": "https://defector.com/?p=193855",
          "author": "Ray Ratto",
          "description": "We haven't had a good philosophical whinge about the intentional walk in a while, mostly because we all have lives to attend to, but in the aftermath of Sunday's Nationals-Angels game (and speaking of philosophical whinges, can any Nats-Halos game truly ever matter enough to have an aftermath?) we can re-engage this mostly frivolous time-suck over extra cold-and-frothies. What else is a summer heat wave for if not that?\nJames Wood is today's protagonist, the young and sprightly centerpiece of the Washington Baseball Consortium in this, another mostly abandoned zinc mine of a season. A Judge-level mass of coiled talent nearly a year to the day since his promotion from the minor leagues, he was known mostly as a key component in the trade that sent Juan Soto to San Diego but has now reached full fright stage, as proven by his Sunday afternoon's work—a single, a grounder to second, and four intentional walks, the first time a hitter has been so overtly feared since Barry Bonds ate the planet in 2004.",
          "link": "https://defector.com/james-wood-if-theyd-let-him",
          "publishedOn": "2025-06-30T14:00:02.000Z",
          "wordCount": 7953,
          "title": "James Wood If They’d Let Him",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2222095363.jpg"
        },
        {
          "id": "https://defector.com/?p=193848",
          "author": "Tom Ley",
          "description": "Rockies interim manager Warren Schaeffer works out. This is something you can tell just by looking at him. The 40-year-old former minor leaguer carries himself in a way that is meant to broadcast that he still gets after it in the gym. You just know the squat rack absolutely hates to see this guy coming.\nLooking like Gabe Kapler hasn't previously had much of a positive effect on any MLB manager's performance, not even Gabe Kapler's. But during Sunday's game against the Brewers, Schaeffer found a way to put all the strength and dexterity contained in his haunches to good use. After home plate umpire Ramon De Jesus hit Tyler Freeman with a quick-trigger ejection for arguing a third-strike call in the top of the third inning, Schaeffer came charging out of the dugout to stick up for his player.",
          "link": "https://defector.com/warren-schaeffer-hit-a-crazy-stance",
          "publishedOn": "2025-06-30T13:37:41.000Z",
          "wordCount": 6346,
          "title": "Warren Schaeffer Hit A Crazy Stance",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/Schaeffer-stance.png"
        },
        {
          "id": "https://defector.com/?p=193832",
          "author": "Tom Ley",
          "description": "The New York Mets are no strangers to the players-only meeting. Astute readers will remember the fellas coming together for one such meeting in May 2024, when the team was 11 games under .500 and the season seemed to be slipping away. Those Mets ended up winning 89 games and making the playoffs, so clearly a lot of important issues were ironed out during that meeting. Perhaps it was the memory of that meeting's effectiveness that brought the players together for another confab before Sunday's series finale against the Pirates.\n\"At least they have the Pirates coming up,\" typed one unnamed Defector staffer into our workplace communication platform on June 23. The next day, the Mets lost to the Braves, despite the best efforts of Dicky Lovelady, to continue a slump had seen them lose 10 of 11 games. Two consecutive wins against the Braves followed, which set up the Mets to cruise into a potentially healing three-game series against the crap-filled Pirates.",
          "link": "https://defector.com/players-only-meeting-return-of-dicky-lovelady-not-enough-to-turn-mets-fortunes-around",
          "publishedOn": "2025-06-30T13:05:47.000Z",
          "wordCount": 8111,
          "title": "Players-Only Meeting, Return Of Dicky Lovelady Not Enough To Turn Mets’ Fortunes Around",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2222005427.jpg"
        },
        {
          "id": "https://defector.com/?p=193834",
          "author": "Dave McKenna",
          "description": "After a weekend of quarterfinal crackers at Croke Park and a Sunday evening draw at GAA headquarters in Dublin, the Final Four of the 2025 All-Ireland football championships is set. Meath will face Donegal, and Kerry will take on Tyrone. \nMore than 132,000 folks flocked to the mythically fab Croker for the four games over two days to see who would stay alive in the run for the Sam Maguire Cup, and who would be sent home Sam-less. In a topsy-turvy quarterfinal played at Croke Saturday afternoon, Donegal was down seven points to Monaghan at the half. But graybeard forward Michael Murphy, who was retired and working as a sports pundit for Irish TV for the last two years before un-retiring, and the rest of the surging Forgotten County squad blitzed their Ulster province rivals coming out of the break on the way to six-point win, 1-26 to 1-20.",
          "link": "https://defector.com/the-all-ireland-football-quarterfinals-were-a-real-hoot",
          "publishedOn": "2025-06-29T21:12:22.000Z",
          "wordCount": 9340,
          "title": "The All-Ireland Football Quarterfinals Were A Real Hoot",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2221970807.jpg"
        },
        {
          "id": "https://defector.com/?p=193822",
          "author": "Tom Ley",
          "description": "Malik Beasley had a career year with the Detroit Pistons this past season, during which he became one of the best high-volume three-point shooters in the league. That fabulous campaign, in which he made 319 threes and scored 16 points per game, came at a great time for Beasley's finances, as he is set to enter free agency tomorrow. Unfortunately, his career might now be over.\nThat grim possibility is brought to us by ESPN's Shams Charania, who reports that Beasley is currently the subject of a federal investigation into allegations of gambling on NBA games and prop bets. According to Charania, the investigation is focused on bets that were made during the 2023–24 NBA season, when Beasley was a member of the Milwaukee Bucks. According to ESPN's David Purdum, at least one U.S. sports book detected unusual betting interest on Beasley's statistics in January 2024.",
          "link": "https://defector.com/malik-beasleys-gambling-scandal-arrives-at-worst-possible-time-for-malik-beasley",
          "publishedOn": "2025-06-29T17:31:36.000Z",
          "wordCount": 6602,
          "title": "Malik Beasley’s Gambling Scandal Arrives At Worst Possible Time For Malik Beasley",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2212280739.jpg"
        },
        {
          "id": "https://defector.com/?p=193816",
          "author": "Dave McKenna",
          "description": "In what will someday rightly be known as boxing’s Jake Paul Era, it’s not how you fight that matters, it’s who you fight. \nPaul, a Disney kid turned punchfluencer, was at it again last night, beating another opponent whose name recognition outweighed his current level of abilities. The latest tomato can of the month was Julio Cesar Chavez Jr., a guy who despite holding the world middleweight title back in 2012 has always only gotten noticed for what comes before “Jr.”; his father, Julio Sr., who had a career 107-6-2 ring record and held belts in three weight classes, is perhaps the most popular Mexican athlete of all time.",
          "link": "https://defector.com/nobodys-better-at-selling-shitty-fights-than-jake-paul",
          "publishedOn": "2025-06-29T16:42:56.000Z",
          "wordCount": 8920,
          "title": "Nobody’s Better At Selling Shitty Fights Than Jake Paul",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2221928666.jpg"
        },
        {
          "id": "https://defector.com/?p=193805",
          "author": "Tom Ley",
          "description": "Current Chargers and former Michigan head coach Jim Harbaugh was added as a defendant on Friday in a class-action lawsuit against former Wolverines assistant coach Matt Weiss. The suit, filed by 11 anonymous women, is just one of more than a dozen civil cases that have been brought against Weiss and the University of Michigan since Weiss was indicted in March on 14 counts of unauthorized access to computers and 10 counts of aggravated identity theft.\nAccording to the federal case against Weiss, he gained access to student-athlete databases at more than 100 universities that were maintained by a third-party vendor. From about 2015 to 2023, Weiss allegedly used that access to download athletes' personal identifying information, which he then used to hack into email, social media, and cloud storage accounts belonging to more than 2,000 athletes. After accessing these accounts, Weiss is alleged to have downloaded personal and intimate videos and photos belonging to his victims.",
          "link": "https://defector.com/jim-harbaugh-sued-in-expanded-hacking-case",
          "publishedOn": "2025-06-29T15:13:18.000Z",
          "wordCount": 6494,
          "title": "Jim Harbaugh Sued In Expanded Hacking Case",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-1910724024.jpg"
        },
        {
          "id": "https://defector.com/?p=193737",
          "author": "Samer Kalaf",
          "description": "Zohran Mamdani's victory in the New York City mayoral primary has led to a lot of vile reactions from across the political spectrum. That'd be expected from any Republican, but plenty of liberals are willing to go against their own party and attack a Muslim who supports Palestinians. So it was surprising, but not that surprising, to hear a high-ranking Democrat like New York Senator Kirsten Gillibrand lose her mind over Mamdani on Thursday's edition of The Brian Lehrer Show.\nWNYC host Brian Lehrer began the interview by asking Gillibrand if she would endorse Mamdani in November's general election. \"Not today, but I did speak with him yesterday,\" the senator said. \"I congratulated him on his victory, and I raised some issues that, if he does become the mayor, will be very important that we not only work on together, but I raised some concerns that I had.\"",
          "link": "https://defector.com/kirsten-gillibrand-has-a-racist-meltdown-over-zohran-mamdani-on-public-radio",
          "publishedOn": "2025-06-27T19:54:35.000Z",
          "wordCount": 9976,
          "title": "Kirsten Gillibrand Has A Racist Meltdown Over Zohran Mamdani On Public Radio",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2214926415.jpg"
        },
        {
          "id": "https://defector.com/?p=193730",
          "author": "Brandy Jensen",
          "description": "As I started the recently released Hulu two-part documentary, Call Her Alex, about the outlandishly successful host of the podcast Call Her Daddy, I knew only a handful of facts about Alex Cooper: She's very popular with young women, she’s beautiful in a way I strongly associate with posting Instagram stories from a yacht, and she talks about sex a lot. At the same time, I knew hundreds of facts about the world as it has existed for the past few decades. What this documentary hopes for is that I would be willing to set those aside.\n\"Part One\" opens in 2023, as Cooper is preparing to embark on her first live tour. She’s excited but nervous about delivering a great show for her legions of devoted fans. It’s immediately clear that her success is the result not just of personal charisma, which she undoubtedly has, but a shrewd sense of what her audience wants, and the drive to make it happen. While she’s surrounded by a team, including husband and business partner Matt Kaplan, Cooper is very much in charge of the empire she’s created over the last six years.",
          "link": "https://defector.com/call-her-on-her-bullshit",
          "publishedOn": "2025-06-27T15:59:06.000Z",
          "wordCount": 8565,
          "title": "Call Her On Her Bullshit",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2188252104.jpg"
        },
        {
          "id": "https://defector.com/?p=193516",
          "author": "Israel Daramola",
          "description": "Welcome to Listening Habits, a column where I share the music I’ve been fixated on recently.\nIt's hard for music to feel as exciting and urgent today as it used to, back when it was central to pop culture. Today, music feels like that thing you hear playing at your favorite coffee shop or you listen to while at the gym when you can't find a podcast that blathers on for two hours. It's background noise for another activity rather than the activity itself. Unless you're a nerd about it, people don't seem to engage with it with much depth anymore.",
          "link": "https://defector.com/how-leaks-became-the-last-vestige-of-communal-music-discovery",
          "publishedOn": "2025-06-27T15:18:59.000Z",
          "wordCount": 10316,
          "title": "How Leaks Became The Last Vestige Of Communal Music Discovery",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/admin-ajax-1.png"
        },
        {
          "id": "https://defector.com/?p=193699",
          "author": "Barry Petchesky",
          "description": "The NHL and the Players' Association are reportedly close to announcing agreement on a new collective bargaining agreement, ensuring extended labor peace in a league that hasn't had much of that in the last couple decades. Some smallish things are set to change: the season expanding to 84 games; contracts being limited to seven years; the closing of the long-term IR loophole that allows teams to exceed the salary cap in the playoffs. One change, however, is the smallest of them all, yet also the ending of an era. If negotiations go as expected, we have already seen the last true emergency backup goaltender.\nNHL teams can carry only two active goaltenders, but there has to be a contingency plan in place if both get hurt, to prevent games from turning into farces. The new CBA will allow teams to carry a permanent EBUG, who will practice and travel with the team, but not count against their roster. Previously, teams just sort of figured it out when needed—they'd designate as their EBUG for a given game a staffer who had played goal in college, or an adult league netminder in whatever city they were playing in, that sort of thing. It was thrillingly close to picking up a guy off the street and shoving him into an actual NHL game; a novelty and a dream come true for some hockey lifer who had never made the big show. If it was a stopgap solution, it was a fun one.",
          "link": "https://defector.com/the-end-of-ebugs-means-the-end-of-dreams-coming-true",
          "publishedOn": "2025-06-27T14:41:22.000Z",
          "wordCount": 9239,
          "title": "The End Of EBUGs Means The End Of Dreams Coming True",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-1202662360.jpg"
        },
        {
          "id": "https://defector.com/?p=193607",
          "author": "Kelsey McKinney",
          "description": "Welcome to Ask The Book Doctor, a recurring series about books and reading them.\nI like to put on my gym clothes nine hours before I actually go. I wake up, dress for the gym, and then sit at my desk blogging all day, because I know that if I do this, the likelihood of me actually going to the gym increases by 500 percent. If I put on another outfit, there is no way I will go to the gym, because this would require me to change into my gym clothes, and my brain hates me. My evil brain will accept any excuse to keep me from doing things that are good for me. So in an attempt to usurp my own brain, I outplay it. I lower the barriers to entry and make it as easy for me to go to the gym as possible. This is how I win.",
          "link": "https://defector.com/my-new-glasses-have-ruined-my-ability-to-read-help-me",
          "publishedOn": "2025-06-27T14:15:00.000Z",
          "wordCount": 8921,
          "title": "My New Glasses Have Ruined My Ability To Read! Help Me!",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/bookdoctor3.jpg"
        },
        {
          "id": "https://defector.com/?p=193280",
          "author": "Albert Burneko",
          "description": "Indiana Pacers backup guard T.J. McConnell exemplifies a type of basketball player I generally regard with disgust: the Skittering Little Rat Guy. This is the frenzied little gremlin always very visibly going 40 percent harder than anybody else at every single moment, constantly poking for steals, throwing himself theatrically to the floor (on his back to draw charges against better players, on his front after every halfway-loose ball he can turn into a monument to his own commitment), fouling a degree too hard, sprinting and yelling and gesticulating. Slapping the floor, even. Skittering Little Rat Guys are far more common in college basketball than in the NBA—some mid-major colleges start entire lineups of fifth-year Skittering Little Rat Guys—but they are found at all levels of the sport.\nI regard the Skittering Little Rat Guy as basketball's most objectionable player type, both ethically and in simple visceral terms. For one thing, the Skittering Little Rat Guy's whole deal, his very presence on the court, is antithetical to the best, most breathtaking basketball stuff—and to the very idea of basketball as a stylish, expressive, creative game. He gunks up the works. He is an intruder into the cool sport from Mike Krzyzewski's vision of what it should be; not coincidentally, some of the most hateful Skittering Little Rat Guys in living memory—Bobby Hurley, Steve Wojciechowski, Grayson Allen—made themselves famous at Coach K's Duke program.",
          "link": "https://defector.com/fine-to-hell-with-it-a-t-j-mcconnell-appreciation-blog",
          "publishedOn": "2025-06-27T13:28:54.000Z",
          "wordCount": 11750,
          "title": "Fine, To Hell With It: A T.J. McConnell Appreciation Blog",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/tj-mcconnell.jpeg"
        },
        {
          "id": "https://defector.com/?p=193236",
          "author": "Luis Paez-Pumar",
          "description": "Welcome to The Backlog, a series in which we will take a look back at 12 games from 2020 that, in one way or another, had a lasting impact on the video game industry. \nOne of the more exhausting arguments you can have about video games grapples with the idea of value. Specifically, can video games be valuable as an art form? Truly, this doesn't matter at all. Enjoy what you enjoy and if you get value from it, then hell yeah, that rocks. And if someone tells you that video games are stupid or worthless or whatever else, then don't let that take away from your enjoyment and connection to a specific game.",
          "link": "https://defector.com/the-last-of-us-part-ii-insists-theres-artistry-in-all-of-its-violence",
          "publishedOn": "2025-06-27T13:03:42.000Z",
          "wordCount": 12636,
          "title": "‘The Last Of Us Part II’ Insists There’s Artistry In All Of Its Violence",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/mobc8z5fnxljhadccvy6.png"
        },
        {
          "id": "https://defector.com/?p=193588",
          "author": "David Roth",
          "description": "As a general rule, if we are talking about politics on the podcast it is not going to be about good news. That just isn't the way that people talk about politics, but more to the point our politics just have not generated a lot of good news of late. This hasn't kept us from talking about it, for better and worse, but it has generally kept episodes with even trace amounts of political content in a specific emotional lane. That lane, which is basically Heated Dissatisfaction, would seem to be a good fit for a Ray Ratto guest spot, but while this week's episode does feature our beloved Grumpsville Bureau Chief, it also begins with nearly a half hour of shockingly sunny politics talk. Listening back over it, I found it more reassuring than anything else—a reminder that, if circumstances provide, I can actually talk about this stuff without sounding like someone shouting from atop a milk crate outside a public park.",
          "link": "https://defector.com/the-agony-of-victory-with-ray-ratto",
          "publishedOn": "2025-06-26T19:41:17.000Z",
          "wordCount": 7593,
          "title": "The Agony Of Victory, With Ray Ratto",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2220897537.jpg"
        },
        {
          "id": "https://defector.com/?p=193615",
          "author": "Kathryn Xu",
          "description": "On Thursday, ESPN's Jeff Passan published a blog about Jacob Wilson, the West Sacramento A's rookie shortstop currently having a very impressive offensive season of the Luis Arráez variety. He is rocking the second-lowest strikeout rate in the league (behind Arráez) and the second-highest squared-up contact rate in the league (behind Arráez), and, perhaps expected of a man born in the Year of our Lord 2002, Wilson attributes his success to Fortnite.\n\"Kids are going to love this one. Parents are going to hate me,\" Wilson said. \"I am a big believer in video games. It's fast decision-making strategy. I think that gets me ready for the game, because when you're in the box, you have to process a lot.\"",
          "link": "https://defector.com/i-am-sick-and-tired-of-these-normie-gamer-athletes",
          "publishedOn": "2025-06-26T17:42:42.000Z",
          "wordCount": 7225,
          "title": "I Am Sick And Tired Of These Normie Gamer Athletes",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/jacobWilsonNormieGamer2.jpg"
        },
        {
          "id": "https://defector.com/?p=193617",
          "author": "Patrick Redford",
          "description": "The run-up to every NBA Draft has a pleasant, familiar rhythm. Some prospects distinguish themselves in workouts, while some leap up or crash down draft boards after their wingspans and standing reaches are measured. People deploy some of the most fluorescent comparative language you will ever see. Every year, one or two mysterious prospects—Shaedon Sharpe a few years ago, Cedric Coward this year—will vault from the fringes into the lottery despite precious little tape. Mock drafts are never correct in their particulars, though the rough mosaic they form serves well enough as a guide and a baseline to measure all the surprises against. If you listen to what scouts and insiders say, there is always a pivot point early in the draft, a team with obscure intentions or a notably polarizing prospect who terrifies both the teams that pass on him and the team that ends up taking him in equal measure. This year, the hinge of the draft was the fifth pick, which the Utah Jazz used to select Ace Bailey out of Rutgers.\nBailey came into his lone season of college basketball with sky-high expectations. He was the second-ranked recruit in his class behind only Cooper Flagg, and it was pretty obvious why: He's a spindly, athletic 6-foot-8, possessed of rare shooting and shot-creation abilities for someone that big and athletic. No player in college could stop him from getting to his spots and pulling up. Bailey made his defenders look like so many flailing nephews as he confidently dribbled through traffic, bumped his way into an inch of space, and pulled up with one of the sweetest gathers you'll ever see in an 18-year-old player. He was also a pretty nasty rebounder, which tends to be one of the more translatable NBA skills, and he also showed some real flashes as a defensive playmaker. If you squinted, you could see the outline of a multi-time all-star.",
          "link": "https://defector.com/after-all-that-ace-bailey-ends-up-in-utah",
          "publishedOn": "2025-06-26T17:15:18.000Z",
          "wordCount": 8920,
          "title": "After All That, Ace Bailey Ends Up In Utah",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2222172302.jpg"
        },
        {
          "id": "https://defector.com/?p=193595",
          "author": "Chris Thompson",
          "description": "I want Jacob Misiorowski's internet. This fresh-faced child gets wholesome baseball. \"I feel like everything I swiped was me and Skenes, me and Skenes, me and Skenes,\" said Milwaukee's fire-breather of a rookie pitcher, of the days before his start Wednesday, the third of his career. \"I had to mute it, turn it off.\" You dear sweet lad, whatever algorithm you're plugged into beats the hell out of mine: Everything I swiped was, well, the entire rest of reality, which sucks turbo ass. Imagine muting the only remotely bitchin' thing left in the universe: A mid-week duel of 23-year-old phenoms, featuring baseball's scariest pitcher versus some damn kid from out of nowhere who is somehow even scarier. Before last week I think I had never even heard of Jacob Misiorowski. Whitney Tilson? Israel Katz? Thomas Fugate? If I cannot plug into Misiorowski's web, the very next best thing would be someone splitting my head right down the middle with a wood ax.\nFor a dog-days rubber match in the dreaded NL Central, this Pirates-Brewers tilt was a pretty big deal. For one thing, all Paul Skenes starts are events, even if the sad-sack Pirates have gotten next to nothing this season from his brilliance. Skenes entered Wednesday's start one of just four qualified pitchers in baseball with an earned-run average below 2.00; he was also in the top five in innings pitched, WHIP, and fielding-independent pitching, and was best in baseball in pitching wins above replacement, per Baseball Reference. The other two starting pitchers in the majors who began Wednesday allowing fewer than two earned runs per nine innings have a combined record of 18–5. Skenes, meanwhile, was 4–7, and the Pirates had played to a morally unacceptable 8–8 record in his starts. It's an embarrassment, is what it is.",
          "link": "https://defector.com/mighty-brewers-lad-out-duels-paul-skenes",
          "publishedOn": "2025-06-26T16:43:26.000Z",
          "wordCount": 10408,
          "title": "Mighty Brewers Lad Out-Duels Paul Skenes",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2222179165.jpg"
        },
        {
          "id": "https://defector.com/?p=193605",
          "author": "Tom Ley",
          "description": "The first round of the NBA draft on Thursday was pretty boring, with a few exceptions. Ace Bailey's strange, oafish attempts to get himself on an East Coast team of his choosing ended with him going to the Utah Jazz at No. 5. The New Orleans Pelicans made what appears to be a very dumb trade in order to take Derik Queen at No. 13. The Brooklyn Nets drafted one million guards. But nothing was as exciting as the arrival of Yang Hansen.\nYang, projected to be taken in the late first or second round, ended up going to the Portland Trail Blazers at No. 16. The 20-year-old, 7-foot-2 center has spent the last few seasons playing pro ball in the Chinese league. He's the kind of player who generally profiles as a long-developing project, which makes the Blazers' decision to take him in the middle of the first round something of a historic reach. So what gives? How did Yang jump so many spots?",
          "link": "https://defector.com/the-nba-draft-provides-blessed-phrases-like-chinese-jokic",
          "publishedOn": "2025-06-26T16:17:09.000Z",
          "wordCount": 6662,
          "title": "The NBA Draft Provides Blessed Phrases Like “Chinese Jokic”",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2222181956.jpg"
        },
        {
          "id": "https://defector.com/?p=193327",
          "author": "Annie Howard",
          "description": "“In 20 yrs, this will all be commonplace.”\nThese words were first penned in 2008 by Chloe Dzubilo. A trans femme, recovered heroin addict, and long-term HIV survivor who had stayed alive more than three decades after she was first diagnosed with a virus that killed her partner in the late ‘80s, Chloe knew what it meant to play the long game, to endure trials that nobody should have to face. By 2008, she’d lived many lives: champion show-horse jumper, drug addict, lead singer of a band called the Transsisters, and advocate for younger trans women and sex workers. Looking two decades into the future—still three incomprehensible years from where we stand today—she envisioned a world where trans life was obvious and indisputable. Still, she knew that the future required a fight. In a life marked by long-term disability and routine dehumanization by medical professionals, Chloe held her head high, the act of daily survival elevated to an artful refusal to accept the world’s hostile terms. The challenges she wove into her life and left behind in her art are ones we still face today, making her a critical teacher for troubled times.",
          "link": "https://defector.com/chloe-dzubilo-and-the-perilous-path-forward-for-trans-life",
          "publishedOn": "2025-06-26T15:21:55.000Z",
          "wordCount": 12773,
          "title": "Chloe Dzubilo And The Perilous Path Forward For Trans Life",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/Chloe-Dzubilo-–-Untitled-Crossed-the-Street.jpg"
        },
        {
          "id": "https://defector.com/?p=193508",
          "author": "Samer Kalaf",
          "description": "If there is one takeaway from Zohran Mamdani's victory in the New York City Democratic mayoral primary on Tuesday, it's that there is no one takeaway. The democratic socialist and his wide-ranging canvassing team built a coalition that brought in voters of all backgrounds, leading to a defeat of Andrew Cuomo by a significant margin. There wasn't one sole factor that handed Mamdani the win, and everyone will have their own opinions on which campaign promise or tactic mattered the most. That said, it feels safe to say that one familiar opposition strategy resoundingly did not work.\nMamdani's primary agenda on his platform is to make New York City more affordable for its residents, through specific initiatives: freezing rent, free buses, no-cost childcare. While many of his opponents took time to pick at these progressive policies, they also relentlessly attacked his Muslim faith and support for Palestinians. In a race for mayor of New York City, they tried to make fealty to the state of Israel a strict qualification.",
          "link": "https://defector.com/the-politics-of-fear-dont-work-against-a-candidate-who-isnt-scared",
          "publishedOn": "2025-06-26T13:16:19.000Z",
          "wordCount": 9587,
          "title": "The Politics Of Fear Don’t Work Against A Candidate Who Isn’t Scared",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2221992032.jpg"
        },
        {
          "id": "https://defector.com/?p=193208",
          "author": "Diana Moskovitz",
          "description": "LOS ANGELES — Few have been spared in the raids. They’ve taken people who came to Southern California from Mexico, El Salvador, Guatemala, Cambodia, Laos, and Vietnam. They’ve taken people from garment shops, street carts, farms, packinghouses, taquerias, big-box stores, home-improvement stores, and car washes. They've taken a union president (since released) and multiple U.S. citizens. They’ve taken people from what feels like every zip code, from the far-flung Coachella Valley to the manicured lawns of Pasadena, which shut down multiple city programs on Saturday after people got taken from a local park, to the grimy streets of Hollywood, where masked agents targeted a Home Depot in the heart of the city—just off a freeway, two blocks from local TV news station KTLA, and pretty widely known as one of the easiest spots in town to find a day laborer.\nThe fear of more raids has bled into everyday life, and led countless people to stay home. Even if you aren't afraid, you have friends or family or coworkers who are and it's impossible to avoid the constant warnings about the latest ICE raids springing up across social media. There is the sense of communities trying to stand up an immune system under duress, the better to warn vulnerable people in time.",
          "link": "https://defector.com/the-dodgers-are-disappointing-the-people-who-want-to-love-them-the-most",
          "publishedOn": "2025-06-25T20:18:10.000Z",
          "wordCount": 15434,
          "title": "The Dodgers Are Disappointing The People Who Want To Love Them The Most",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2221397688-smaller-e1750646930528.jpeg"
        },
        {
          "id": "https://defector.com/?p=193528",
          "author": "Kelsey McKinney",
          "description": "In the winter, my television mostly stays off. The winter is when my brain is at its best. I am reading. I am writing. I am maybe watching a couple episodes of a show a week. But this feels crazy to type right now, at this moment in the summer, because I currently have a minimum of four hours of television I must watch every single day. I do not have time to read or have hobbies or do anything else, because I am too busy being locked the hell in. \nTelevision has been my best friend for several weeks because of two shows that come on every day. The first show is baseball. I am a Phillies fan, and baseball teams play 162 games over the course of six months every year. I watch most of them. But then I am also committed to another kind of sport, called Love Island.",
          "link": "https://defector.com/i-love-my-daily-sports-shows-baseball-and-love-island",
          "publishedOn": "2025-06-25T19:27:58.000Z",
          "wordCount": 8236,
          "title": "I Love My Daily Sports Shows: Baseball And ‘Love Island’",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/Screenshot-2025-06-25-at-2.28.10 PM.png"
        },
        {
          "id": "https://defector.com/?p=193393",
          "author": "Billy Haisley",
          "description": "Like many great Brazilian funk albums, pressing play on Halc DJ's Bruxaria Não É Phonk is a little like fitting a jackhammer bit into your ear canal and waiting for the impending sonic onslaught to render you utterly, blissfully destroyed. Surprisingly, Halc makes you wait a bit for it. The album begins with \"Phonk É o Caralho,\" a tour de force of funkery that, with no less than eight beat switch-ups across just three minutes, takes you on a breakneck journey through the breadth of the DJ/producer's talents and of the genre's possibilities. But you have to get a little more than 30 seconds into the opener, when its second beat-switch fades, an appropriately ominous voice belches the word \"bruxaria,\" and a shrill whistle—these kinds of tinnital chirps are known as \"tuim/tuin,\" the prevalence of tuim being one of the hallmarks of the bruxaria subgenre—rings steadily and then begins to strobe overtop a ratty, red-lining bass pulse. It's only then that Halc really drags you into the depths of the underworld where this type of joyously brain-scrambling funk lives and thrives.\n\nhttps://www.youtube.com/watch?v=jQSwEBAryu8",
          "link": "https://defector.com/halc-djs-brazilian-funk-album-fights-a-righteous-war-against-the-algorithms",
          "publishedOn": "2025-06-25T17:22:16.000Z",
          "wordCount": 13267,
          "title": "Halc DJ’s Brazilian Funk Album Fights A Righteous War Against The Algorithms",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/halc-good.jpg"
        },
        {
          "id": "https://defector.com/?p=193480",
          "author": "Lauren Theisen",
          "description": "It's the hottest week of the year in New York City, but the Mets have been ice cold. Leaders of the NL East by five-and-a-half games less than two weeks ago, the boys from Queens now trail the Phillies by 1.5 because of a putrid ongoing stretch where they've lost 10 of 11. That slide includes Tuesday night's fall-from-ahead defeat at home, where even the much-anticipated team debut of 29-year-old reliever Richard \"Dicky\" Lovelady didn't provide the fans any pleasure.\nPart of the sting of the Mets' slump has come from the fact that they're losing to three of the most frustrating and annoying franchises on the schedule. They got swept by the Rays in three by a combined score of 24-9. They managed one win in Philly to break up 10-2 and 7-1 drubbings. And if you didn't know already, I bet you can guess the remaining tormentor: the Atlanta Braves.",
          "link": "https://defector.com/not-even-dicky-lovelady-could-rescue-the-mets",
          "publishedOn": "2025-06-25T15:49:07.000Z",
          "wordCount": 7083,
          "title": "Not Even Dicky Lovelady Could Rescue The Mets",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2221263267.jpg"
        },
        {
          "id": "https://defector.com/?p=193479",
          "author": "Chris Thompson",
          "description": "Ketel Marte was 23 years old when his mother died in July 2017. He'd recently been summoned to the Arizona Diamondbacks from Triple-A Reno, where he'd been clobbering to smithereens the best pitching of the minor leagues. Marte had already played an accumulated season-plus of major-league games as a member of the Seattle Mariners, but following a trade to Arizona he was initially blocked at his positions of choice by veterans, and so the Diamondbacks made the unusual decision to ship a productive top prospect back to the minors for half a season. Marte's call-up came at the end of June; on July 29, in his 24th game with the big club, Marte took a mighty rip at a 2–0 pitch from Cardinals reliever Kevin Siegrist and crushed a laser of a dong over the wall in left, his fourth homer as a Diamondback. The moment carried some personal significance, as it was Marte's 10th home run at two combined levels that season, a benchmark he'd circled with a little inspiration from mom.\n\"When I was playing softball in the Dominican with my friend, she saw me hit a long homer,\" Marte told the Arizona Republic, back in 2017. \"One day, before I came to spring training, she said, 'I want 10 homers this year.' Now, I’ve got 10 homers. When I hit my last homer, I called her. She had watched the game. I said, 'Now you’ve got 10 homers, how about that?' She was crying.\" Marte spoke again to his mother the following day, Sunday, after the rubber match in St. Louis and before boarding a plane for a short team flight to Chicago. While Marte and the Diamondbacks were in the air, a vehicle struck Marte's mother, Elpidia Valdez, as she drove a moped in the Dominican Republic. Marte learned of the accident when the team flight landed, but was given the impression that it was minor and that Elpidia would recover. That evening, at a team dinner, he received a phone call and was told that she'd died.",
          "link": "https://defector.com/simply-dont-be-a-shithead",
          "publishedOn": "2025-06-25T15:14:44.000Z",
          "wordCount": 9129,
          "title": "Simply Don’t Be A Shithead",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/Ketel-Marte-Upset.png"
        },
        {
          "id": "https://defector.com/?p=191659",
          "author": "Joshua Needelman",
          "description": "A yoga empire struggles to reckon with its past after its guru is named as an abuser.",
          "link": "https://defector.com/what-the-guru-left-behind",
          "publishedOn": "2025-06-25T13:06:03.000Z",
          "wordCount": 25522,
          "title": "What The Guru Left Behind",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/Yoga-guru-sex-abuse-smaller.jpeg"
        },
        {
          "id": "https://defector.com/?p=193426",
          "author": "Barry Petchesky",
          "description": "Eagle-eyed trackheads following the Ostrava Golden Spike in Czechia might have noticed American hurdler Chris Robinson, an NCAA champion at Alabama, winning the 400 meters with some unorthodox form. Midway through the event, Robinson began reaching, after every hurdle, to adjust himself in a way familiar to any penis-haver. Surely even a top track athlete would not be able to win a race, let alone in a season-best 48.05 seconds, with his dong flapping around. Going balls out usually does not lend itself to going balls out.\nSome research was needed. Track's not a huge deal here in the States, and the only video existed as a livestream on a subscription service. So we turn to the Swedes, who you'd expect to be all over a penis if one presented itself in Lane 3. From national sport newspaper Sportbladet:",
          "link": "https://defector.com/hurdler-wins-400-meter-race-despite-his-dick-and-balls-falling-out-several-times",
          "publishedOn": "2025-06-24T19:39:11.000Z",
          "wordCount": 6874,
          "title": "Hurdler Wins 400-Meter Race Despite His Dick And Balls Falling Out Several Times",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2217397672.jpg"
        },
        {
          "id": "https://defector.com/?p=193406",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about socks, mowing the lawn, filth, and more.\nMy apologies for a shorter than usual bag today. I’m just coming off of a week of work in the field for SF Gate, and I’ve already started in on Why Your Team Sucks, the debut which is on the horizon. So I’ve been a touch squeezed. But fear not, the take lab is still bustling and ready to produce more sterling content for you in the coming weeks and months.",
          "link": "https://defector.com/fuck-sore-losers",
          "publishedOn": "2025-06-24T18:48:32.000Z",
          "wordCount": 14835,
          "title": "Fuck Sore Losers",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2192542155-1.jpg"
        },
        {
          "id": "https://defector.com/?p=193385",
          "author": "Tom Ley",
          "description": "Back in January, an arbitration case between the NFL and the NFL Players' Association came to a quiet end. The case was initiated by a grievance filed by the NFLPA in 2022, which argued that NFL owners had colluded with each other to deny players fully guaranteed contracts. The arbitrator's final ruling, that the league's owners had not engaged in collusion, was public, but the details of his ruling were not. The arbitrator's full report was published today by Meadowlark Media's Pablo Torre, and it reveals how the NFL's corporate structure makes it possible for owners to openly discuss collusion without technically breaking any rules.\nThe full ruling, which Torre covers at length in his latest podcast episode, is primarily concerned with a March 2022 meeting between NFL owners and the NFL Management Council (NFLMC). This meeting occurred just a few weeks after Deshaun Watson signed an unprecedented five-year, $230 million contract with the Cleveland Browns that was fully guaranteed. The NFLPA argued that during this meeting the owners conspired to ensure that Watson's contract would be the last of its kind, and that evidence of this conspiracy can be found in part by the fact that quarterbacks Lamar Jackson, Kyler Murray, and Russell Wilson were not offered fully guaranteed deals upon entering free agency after Watson's deal was signed.",
          "link": "https://defector.com/how-the-nfl-gets-away-with-it",
          "publishedOn": "2025-06-24T17:44:52.000Z",
          "wordCount": 8112,
          "title": "How The NFL Gets Away With It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2213573511.jpg"
        },
        {
          "id": "https://defector.com/?p=193348",
          "author": "Patrick Redford",
          "description": "In the hours before Game 7 of the NBA Finals on Sunday, ESPN desk analyst Kendrick Perkins fielded a contrived gambling question about whether or not Chet Holmgren would score 15 points. His reasoning was that Holmgren would, since the Oklahoma City Thunder big had expressed frustration with his previous performance. Or anyway, that's all the reasoning Perkins could fit in before Stephen A. Smith cut him off to scream about how his co-host was annoying him, because things are different in the NBA Finals. Right before the segment mercifully cut to commercial, Bob Myers mounted a defense of Perkins that wound up being a scathing indictment of the whole operation. \"Just because you yell something, doesn't mean it's true,\" he said.\n\nhttps://www.youtube.com/watch?v=2ztug-Ebgss",
          "link": "https://defector.com/espns-nba-finals-coverage-was-a-pretty-rough-watch",
          "publishedOn": "2025-06-24T16:45:32.000Z",
          "wordCount": 8515,
          "title": "ESPN’s NBA Finals Coverage Was A Pretty Rough Watch",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/nbadesk.jpg"
        },
        {
          "id": "https://defector.com/?p=193267",
          "author": "Maitreyi Anantharaman",
          "description": "The Las Vegas Aces are bad. Not “bad by their championship standards\"—just kind of bad. Two years ago, they lost six games total. In less than a quarter of this season, they have lost seven. By the grace of the incredibly forgiving WNBA playoff system, they are, with a 6-7 record, the last team in. So it was actually kind of heartening to see them gut out a win at home on Sunday afternoon, rallying in the fourth quarter to beat the Indiana Fever and avoid their first four-game losing streak since 2018. Ahead of what could be some morale-boosting games against Connecticut and Washington this week, here was proof that the Aces can still lock in. \nIt was not looking that way at halftime this weekend, after what might have been A’ja Wilson’s worst half of professional basketball. Missed layups, contested pull-ups and battles with Aliyah Boston had kept her to 2-of-12 shooting. “I just want to apologize to everybody that was watching. That was not a normal A’ja Wilson night,” she said in the postgame interview on ESPN. Spinning to the cup and timing up big blocks on the defensive end, she had already played the second half like an apology. At the end of the night, Wilson's line was a sightlier 8-of-21, but she apologized again for good measure. “Sorry if you had to see that, but we got the dub.”",
          "link": "https://defector.com/can-you-count-out-the-aces",
          "publishedOn": "2025-06-24T16:10:17.000Z",
          "wordCount": 9149,
          "title": "Can You Count Out The Aces?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2221621505.jpg"
        },
        {
          "id": "https://defector.com/?p=193380",
          "author": "Ray Ratto",
          "description": "Look at that image above. Really look at it. Now. And do not avert your eyes. Satan went to a lot of work to make this happen, and that work must be honored with your attention.\nYes, that is Rob Manfred and John Fisher, shown commemorating the upcoming 70th anniversary of the creation of The Jetsons, in Las Vegas. These two came complete with ill-fitting hard hats jammed unconvincingly onto their hydrocephalic heads, just in case lightning finally, belatedly strikes them down. They are there to celebrate the production of a sign that says a baseball field will be built on a specific site, and they are smiling to celebrate their mutual refusal to consider the evil and greed and stupidity and general imperviousness to failure that they are honoring this day. They look happy, all told.",
          "link": "https://defector.com/take-a-look-at-these-ghouls",
          "publishedOn": "2025-06-24T15:44:42.000Z",
          "wordCount": 7900,
          "title": "Take A Look At These Ghouls",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2221756409.jpg"
        },
        {
          "id": "https://defector.com/?p=192765",
          "author": "Sarah Brouillette",
          "description": "In July of 2022, Joyce Carol Oates tweeted that her literary agent friend told her editors are no longer interested in reading first novels by young white male writers, “no matter how good.” She was saying this in support of an article by former New York Times columnist Pamela Paul, who argued that the publishing industry is being destroyed by “illiberal scolds” keen to stifle free speech. Among Paul’s examples are the industry’s recourse to sensitivity readers, who ostensibly scold authors, and the backlash against 2020 bestseller American Dirt on the grounds that its white author Jeanine Cummins was not the right person to tell the story of poor Mexican migrants. Paul is implying, in other words, that calls for publishing to address its whiteness problem amount to a form of woke censorship. In sharing Paul’s piece and adding her own anecdote about young white men being overlooked, Oates was connecting their fate to Paul’s complaint: White men are the victims of the industry’s takeover by the DEI mafia.\nThe idea that white male writers today face diminishing opportunities has since occasioned considerable debate and several attempts to lay out in greater detail the forces behind their recent marginalization. Jacob Savage’s explanation is that they are “vanishing” because, having been castigated as toxic masculinists and told there are no “Good White Men,” they no longer feel that they are allowed to have a voice. Tim Lott argues that an industry now dominated by women editors and agents, who are naturally biased toward manuscripts that center their own experiences, is guilty of the same inequality that women once complained about, except now it is men who are excluded.",
          "link": "https://defector.com/the-plight-of-the-white-male-novelist",
          "publishedOn": "2025-06-24T15:19:58.000Z",
          "wordCount": 12744,
          "title": "The Plight Of The White Male Novelist",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-53272364.jpg"
        },
        {
          "id": "https://defector.com/?p=193250",
          "author": "David Roth",
          "description": "There is a specific and lacerating shame that comes with talking about New York City politics in places where people who do not live in New York City can hear you. This is not just because the people involved are so often so embarrassing. The alpha goofiness of current Mayor Eric Adams, for instance, actually helps with this, if only because the existence of a luridly corrupt and grandiose elected official with a half-dozen Livestrong-style motivational bracelets on each wrist, who has governed more or less as Influencer Cop, is at least strange enough that it might interest someone whose experience of public life does not depend, to some extent, on that particular Influencer Cop's moods, rivalries, and federal legal entanglements.\nIt is accurate, if not quite sufficient, to say that the j…",
          "link": "https://defector.com/andrew-cuomo-is-a-future-of-the-democratic-party",
          "publishedOn": "2025-06-24T12:44:16.000Z",
          "wordCount": 12611,
          "title": "Andrew Cuomo Is A Future Of The Democratic Party",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2220753701.jpg"
        },
        {
          "id": "https://defector.com/?p=193191",
          "author": "Billy Haisley",
          "description": "The base, corrupting, disenchanting influence of money has allegedly been right on the cusp of ruining everything good, noble, and just plain fun about soccer for almost a century and a half now. An easy year to point to here would be 1885, when England FA's settled the roaring debate about amateurism by allowing soccer players to be paid to play. So much of the game's history since then—the development of the great clubs, the existence of the great leagues and tournaments, the emergence and movement of the great players—has been determined first and foremost by the pursuit of the almighty dollar. Rather than a point of departure, the current, baldly avaricious version of the Club World Cup is but the latest instantiation of trends that have dominated soccer for forever.\nClearly, soccer has not yet been ruined. In spite of everything—the widening gap between teams at the tippity top and those below, clubs getting coopted as money- and reputation-laundering fronts, the steady distancing between clubs and their local fan bases, globalization's concentration of talent and homogenization of the once richly diverse panoply of styles and strategies, overloaded schedules and overburdened players—the game still produces amazing games, amazing players, and amazing competitions, thrilling its enormous, rapt audience with incredible stories. It's not that the money-mindedness has actually been a good thing, nor that all those who've complained about it since 1885 were necessarily wrong. Rather, it's that even in inauspicious conditions, after decisions that seem to fly directly in the face of what has made soccer what it is, the game itself and the people who care about it usually endure.",
          "link": "https://defector.com/south-america-rules-the-club-world-cup",
          "publishedOn": "2025-06-23T19:02:57.000Z",
          "wordCount": 11492,
          "title": "South America Rules The Club World Cup",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2221217069.jpg"
        },
        {
          "id": "https://defector.com/?p=193297",
          "author": "Tom Scocca",
          "description": "Welcome to Margin of Error, a politics column from Tom Scocca, editor of the Indignity newsletter.\nFive days and multiple government-inflicted catastrophes ago, Senate Minority Leader Chuck Schumer tried to tell people to get their priorities straight. The Supreme Court had just ruled that Tennessee could ban medical treatment for trans youth, in a decision that Justice Sonia Sotomayor described in dissent as \"indefensible\" and having \"no constitutional justification.\" In response to that news, Schumer put up a post on Bluesky:",
          "link": "https://defector.com/no-time-for-theatrics",
          "publishedOn": "2025-06-23T17:56:10.000Z",
          "wordCount": 11613,
          "title": "No Time For Theatrics",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/masked-federal-agents.jpeg"
        },
        {
          "id": "https://defector.com/?p=193262",
          "author": "Alex Shultz",
          "description": "In January 2024, Semafor media reporter Max Tani published a small scoop: Pennsylvania Senator John Fetterman and writer Buzz Bissinger (most famous for authoring Friday Night Lights) were working together on Fetterman’s memoir, which was to be titled Unfettered and focus on his “political rise and struggles with mental health.”\nMuch has changed since then. Fetterman’s warmongering—he just proudly endorsed President Trump’s psychotic decision to bomb Iran—is one of many reasons his popularity has nosedived among Democratic voters over the last year-and-a-half. He's isolated himself from fellow senators and hemorrhaged staffers, many of whom have departed from his office and then spoken to the press, both on the record and anonymously, about his reportedly erratic behavior and his obsession with supporting Israel’s genocide against the people of Gaza. A New York magazine investigation published in May assigned a much darker definition of “unfettered”: a senator who cannot be reasoned with, who suffers from an addiction to social media, who texts and Facetimes while driving, and is plainly unfit for office.",
          "link": "https://defector.com/nobody-wants-to-talk-about-john-fetterman-and-buzz-bissingers-pricey-memoir-project",
          "publishedOn": "2025-06-23T16:38:39.000Z",
          "wordCount": 12032,
          "title": "Nobody Wants To Talk About John Fetterman And Buzz Bissinger’s Pricey Memoir Project",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2218334216.jpg"
        },
        {
          "id": "https://defector.com/?p=193252",
          "author": "Patrick Redford",
          "description": "I was convinced it was happening again. \nWith 7:41 left in Sunday night's NBA Finals Game 7, the Oklahoma City Thunder took a 22-point lead, a lead that would have felt insurmountable against any other team in the league. But there is no other team in the league like the Indiana Pacers, and they took control, pressuring the inbounds pass, springing double- and triple-teams at ball-handlers, and letting Bennedict Mathurin bash his way into the lane. OKC wobbled and the lead tumbled to 12 in three short minutes. The Thunder, playing prevent offense, did not make another basket for the remainder of the game. The pressure forced Shai Gilgeous-Alexander into committing his fifth foul, and Alex Caruso into calling the team's final timeout with over four minutes left. You could feel the arena hold its collective breath. How fitting it would have been, for a postseason defined more by the Pacers doing the impossible than by anything else, for them to win Game 7 on the road by turning on the blender.",
          "link": "https://defector.com/the-pacers-were-too-cool-to-make-sense",
          "publishedOn": "2025-06-23T16:09:39.000Z",
          "wordCount": 7895,
          "title": "The Pacers Were Too Cool To Make Sense",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2218786904.jpg"
        },
        {
          "id": "https://defector.com/?p=193247",
          "author": "Maitreyi Anantharaman",
          "description": "No soap operas, just crosswords. This week's puzzle was constructed by Matthew Stock and edited by Hoang-Kim Vu. Matthew is a crossword constructor in Gainesville, Fla., where he is pursuing a master’s degree in counseling. His puzzles have been published in the New York Times, USA Today, and the New Yorker, among other venues. When he’s not making puzzles, Matthew enjoys cooking, birdwatching and playing ultimate frisbee.\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE. Note that our submissions are closed through July 31.",
          "link": "https://defector.com/the-crossword-june-23-lines-of-business",
          "publishedOn": "2025-06-23T15:00:00.000Z",
          "wordCount": 5931,
          "title": "The Crossword, June 23: Lines Of Business",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-1984269042.jpg"
        },
        {
          "id": "https://defector.com/?p=193253",
          "author": "Ray Ratto",
          "description": "There are a lot of things we deserve as people. A rational world in which killing civilians for amusement is not an acceptable instrument of foreign policy, as just one farfetched example. But for sports fans, \"deserve\" is one of those verbs that works way too hard for its weight class, an advert for entitlement based on the notion that the next thing you see must by definition be more spectacular than the last thing you saw. Five-year-olds spit on your shoes in revulsion.\nBecause, and this will surely surprise all of you who have ever used the phrase \"in my lifetime\" as a useful metric for any athletic achievement, \"deserve\" isn't a word that means anything around here. You get what you get, the way you get it, and there's no refund for dissatisfaction unless you decide to get off your collective hinder and stop watching, attending, and paying. Until that moment, well, the polite way to put it is \"You bought it, so eat it. And on your way out, settle up your bill.\"",
          "link": "https://defector.com/thunder-pacers-game-7-deserve-has-nothing-to-do-with-it",
          "publishedOn": "2025-06-23T14:45:05.000Z",
          "wordCount": 8998,
          "title": "“Deserve” Has Nothing To Do With It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2221575233.jpg"
        },
        {
          "id": "https://defector.com/?p=193207",
          "author": "Chris Thompson",
          "description": "Richard Jefferson's exact words—so help me God—were, \"If Tyrese Haliburton was still playing, and it was a 15-point lead with six minutes to go, that's right where the Pacers like it.\" Neither Mike Breen nor Doris Burke seized the opportunity to club Jefferson over the head with a folding chair, which was a shame, but there followed five seconds of awkward silence. Indiana's deficit was, at that moment, 14 points, and the clock showed 5:38. The Oklahoma City home crowd was chanting \"O-K-C\" at ear-splitting decibels, but the mood was not yet celebratory. The Pacers were mounting a 9–1 run, fueled by free-throws at one end and grinding, ineffective isolation ball at the other. Jalen Williams threw away a possession on hero shit on the right wing, but Lu Dort skittered into the paint for the …",
          "link": "https://defector.com/the-thunder-finished-the-job",
          "publishedOn": "2025-06-23T12:57:48.000Z",
          "wordCount": 11343,
          "title": "The Thunder Finished The Job",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2220897806.jpg"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=857269",
          "author": "Nick Deeds",
          "description": "Royals fans received some tough news today regarding their rotation depth. As noted by Anne Rogers of MLB.com, right-hander Alec Marsh has been shut down from throwing after the shoulder injury he’s been nursing all season did not respond well to his throwing progression. Meanwhile, Kyle Wright was scratched from his start for Triple-A Omaha…",
          "link": "https://www.mlbtraderumors.com/2025/06/royals-notes-marsh-wright-harvey.html",
          "publishedOn": "2025-06-29T02:26:20.000Z",
          "wordCount": 3884,
          "title": "Royals Notes: Marsh, Wright, Harvey",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/03/alec-marsh-royals-1024x658.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=856973",
          "author": "Steve Adams",
          "description": "The Royals dropped their fifth straight game last night, falling 4-0 to the Rays. They’re now 38-43, dropping into fourth place in the AL Central behind a Twins club that has also struggled mightily over the past couple weeks. After playing winning baseball in both April and May, the Royals are 7-15 in June, due…",
          "link": "https://www.mlbtraderumors.com/2025/06/royals-rumors-trade-deadline-controllable-bat-hitter.html",
          "publishedOn": "2025-06-26T23:38:49.000Z",
          "wordCount": 4350,
          "title": "Royals’ Picollo On Trade Deadline Approach",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/06/j-j-picollo-royals-gm-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=856904",
          "author": "Darragh McDonald",
          "description": "The latest episode of the MLB Trade Rumors Podcast is now live on Spotify, Apple Podcasts, and wherever you get your podcasts! Make sure you subscribe as well! You can also use the player at this link to listen, if you don’t use Spotify or Apple for podcasts. This week, host Darragh McDonald is joined by Anthony Franco of…",
          "link": "https://www.mlbtraderumors.com/2025/06/mlbtr-podcast-the-braves-say-they-wont-sell-jeimer-candelario-dfad-and-injured-d-backs.html",
          "publishedOn": "2025-06-25T14:48:40.000Z",
          "wordCount": 3362,
          "title": "MLBTR Podcast: The Braves Say They Won’t Sell, Jeimer Candelario DFA’d, And Injured D-Backs",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/05/USATSI_23293408-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=856839",
          "author": "Darragh McDonald",
          "description": "Longtime infielder/outfielder Whit Merrifield has announced his retirement, via his agency at Warner Sports Management. “Hey guys,” Merrifield says, “You all should know that I decided a while back to retire. When it came down to it, it was an easy decision. Many factors played a role in my decision, but the main one was…",
          "link": "https://www.mlbtraderumors.com/2025/06/whit-merrifield-announces-retirement.html",
          "publishedOn": "2025-06-24T21:55:38.000Z",
          "wordCount": 4046,
          "title": "Whit Merrifield Announces Retirement",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2021/07/whitmerrifield-2021-1024x660.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=856739",
          "author": "Darragh McDonald",
          "description": "The Royals announced today that right-hander Kyle Wright has been reinstated from the 15-day injured list and optioned to Triple-A Omaha. He had been pitching on a rehab assignment but the club has decided to have him stick in the minors a while longer, as opposed to adding him to the big league roster. As…",
          "link": "https://www.mlbtraderumors.com/2025/06/royals-option-kyle-wright.html",
          "publishedOn": "2025-06-23T21:52:19.000Z",
          "wordCount": 3849,
          "title": "Royals Option Kyle Wright",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/06/Kyle_Wright_Royals-copy-scaled-e1750712978353-1024x653.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=856652",
          "author": "Nick Deeds",
          "description": "While days off and postponements leave each clubs around the league without a uniform number of games played, one of the games in this week’s slate will represent the halfway point in the season for every team across MLB. With an MVP set to be crowned in both leagues after the season, that means two…",
          "link": "https://www.mlbtraderumors.com/2025/06/poll-al-mvp-race-check-in.html",
          "publishedOn": "2025-06-23T20:55:24.000Z",
          "wordCount": 5553,
          "title": "Poll: AL MVP Race Check-In",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/11/Aaron_Judge_Yankees-copy-1024x683.jpg"
        }
      ]
    },
    {
      "title": "Flaming Hydra",
      "feedUrl": "https://flaminghydra.com/rss/",
      "siteUrl": "https://flaminghydra.com/",
      "articles": [
        {
          "id": "686459cbcd718d000107c48e",
          "author": "The Editors",
          "description": "Yemisi Aribisala on a questionable insurance policy",
          "link": "https://flaminghydra.com/issue-352/",
          "publishedOn": "2025-07-02T01:03:52.000Z",
          "wordCount": 698,
          "title": "Global citizens",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/IMG_5696-1.jpg"
        },
        {
          "id": "68645012cd718d000107c3dc",
          "author": "Yemisi Aribisala",
          "description": "I visited a friend who was babysitting some relatives’ children, one Saturday afternoon 23 years ago. During the course of the visit, the children began to fight. One little boy had been called Nigerian, and as a consequence had become very offended. It emerged that they’d been",
          "link": "https://flaminghydra.com/born-in-the-usa/",
          "publishedOn": "2025-07-02T01:03:36.000Z",
          "wordCount": 764,
          "title": "Born in the USA",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/IMG_5696.jpg"
        },
        {
          "id": "68645ac4cd718d000107c49d",
          "author": "The Editors",
          "description": "Subscribe to Flaming Hydra to play HYDRANYM! It's bizarrely fun, plus you get to read the newsletters each weekday AND participate in the Comments Section.  YES.\nTHIS GAME ENDS MIDNIGHT PST WEDNESDAY, JULY 3\n\nTHE RULES\nCreate an ENTERTAINING and APT acronym from the letters provided. Use only",
          "link": "https://flaminghydra.com/hydranym-no-6/",
          "publishedOn": "2025-07-02T01:03:08.000Z",
          "wordCount": 493,
          "title": "HYDRANYM No. 6",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/HYDRANYM.jpg"
        },
        {
          "id": "686280b5e9904f0001974b1d",
          "author": "The Editors",
          "description": "Anna Merlan's golden hours, and Brian Hioe’s adventures as a feline baker",
          "link": "https://flaminghydra.com/issue-351/",
          "publishedOn": "2025-06-30T22:22:06.000Z",
          "wordCount": 350,
          "title": "Old gold / Kitten kitchen",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/divazus-fabric-store-Qe0txR7VKUU-unsplash.jpg"
        },
        {
          "id": "686059c2e9904f0001974870",
          "author": "Brian Hioe",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/pizza-cat/",
          "publishedOn": "2025-06-30T22:03:50.000Z",
          "wordCount": 326,
          "title": "Pizza Cat",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/pizzac.jpg"
        },
        {
          "id": "6862e97ce9904f0001974c40",
          "author": "Anna Merlan",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/mellow-yellow/",
          "publishedOn": "2025-06-30T22:03:12.000Z",
          "wordCount": 321,
          "title": "Mellow Yellow",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/divazus-fabric-store-Qe0txR7VKUU-unsplash-1.jpg"
        },
        {
          "id": "685ee54ee9904f00019732c0",
          "author": "The Editors",
          "description": "Amy Chu on shopping at Daily Table",
          "link": "https://flaminghydra.com/issue-350/",
          "publishedOn": "2025-06-27T22:56:54.000Z",
          "wordCount": 492,
          "title": "Super market",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/image9-2.png"
        },
        {
          "id": "685ef6e3e9904f00019732fd",
          "author": "Amy Chu",
          "description": "When I finished undergrad in 2021, I quickly discovered that “rent eats first,” as housing costs gobbled up half of my $4,500 income from a summer internship at the Museum of Fine Arts. Later I found a full-time job working for the Massachusetts state government, where I",
          "link": "https://flaminghydra.com/daily-table-the-nonprofit-grocery-story/",
          "publishedOn": "2025-06-27T22:53:40.000Z",
          "wordCount": 564,
          "title": "Daily Table: the Nonprofit Grocery Story",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/image9-1.png"
        },
        {
          "id": "685dddaee9904f0001971ce2",
          "author": "The Editors",
          "description": "A New York Times film reviewed by Maria Bustillos; vote for the Hydranym",
          "link": "https://flaminghydra.com/issue-349/",
          "publishedOn": "2025-06-27T02:05:17.000Z",
          "wordCount": 344,
          "title": "All-seeing eye",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/ross2-2.jpg"
        },
        {
          "id": "685dd7c7e9904f0001971cb8",
          "author": "Maria Bustillos",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/movie-review-peter-thiel-and-the-antichrist/",
          "publishedOn": "2025-06-27T01:50:46.000Z",
          "wordCount": 352,
          "title": "MOVIE REVIEW: Peter Thiel and the Antichrist",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/ross2-1.jpg"
        },
        {
          "id": "685df148e9904f0001971dc6",
          "author": "The Editors",
          "description": "Friends, it is your solemn task to vote for Hydranym No. 5.\nHYDRANYM is a word game for Flaming Hydra subscribers. Please join in by subscribing! It’s fun, and you will also receive our glorious email newsletter each weekday AND support press freedom.",
          "link": "https://flaminghydra.com/hydranym-no-5-vote/",
          "publishedOn": "2025-06-27T01:47:44.000Z",
          "wordCount": 409,
          "title": "HYDRANYM No. 5: Vote!",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/HYDRANYM-13.jpg"
        },
        {
          "id": "685c4f4ce9904f00019707c5",
          "author": "The Editors",
          "description": "Laurie Woolever talks with Michael Shaikh, author of 'The Last Sweet Bite'",
          "link": "https://flaminghydra.com/issue-348/",
          "publishedOn": "2025-06-25T23:13:45.000Z",
          "wordCount": 719,
          "title": "Fugitive food",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/cooking-1.jpg"
        },
        {
          "id": "685c08e4e9904f0001970679",
          "author": "Laurie Woolever",
          "description": "A conversation with Michael Shaikh",
          "link": "https://flaminghydra.com/cooking-to-survive/",
          "publishedOn": "2025-06-25T23:13:30.000Z",
          "wordCount": 682,
          "title": "Cooking to Survive",
          "imageUrl": "https://flaminghydra.com/content/images/2025/06/cooking-edit.jpg"
        },
        {
          "id": "685af870e9904f000196f107",
          "author": "The Editors",
          "description": "David Moore visits a DIY data market",
          "link": "https://flaminghydra.com/issue-347/",
          "publishedOn": "2025-06-24T23:58:11.000Z",
          "wordCount": 334,
          "title": "Personal data",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/papaya-1.jpg"
        },
        {
          "id": "685ac9253bb39300017f8db6",
          "author": "David Moore",
          "description": "Above the near-deserted streets of Manhattan’s Financial District, one Sunday a few weeks back, a market was held high in a tower office building; but instead of buying artisanal butter or fresh-cut flowers, visitors could buy, and make, art derived from homegrown datasets. \nAt one table, collaborators",
          "link": "https://flaminghydra.com/the-internet-you-make/",
          "publishedOn": "2025-06-24T23:57:22.000Z",
          "wordCount": 515,
          "title": "The Internet You Make",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/papaya.jpg"
        },
        {
          "id": "685b2a94e9904f000196f1f4",
          "author": "The Editors",
          "description": "PLAY the word game just for Flaming Hydra subscribers. \nSubscribe to Flaming Hydra to play HYDRANYM! It's bizarrely fun, plus you get to read the newsletter each weekday AND participate in the Comments Section, whoohooo!\n\nTHE RULES\nCreate an ENTERTAINING and APT acronym from the letters provided. Use",
          "link": "https://flaminghydra.com/hydranym-no-5/",
          "publishedOn": "2025-06-24T23:56:46.000Z",
          "wordCount": 543,
          "title": "HYDRANYM No. 5",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/HYDRANYM-12.jpg"
        },
        {
          "id": "6840c47130ca9b00011015e3",
          "author": "Luke O'Neil",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/the-little-vacuum-hose/",
          "publishedOn": "2025-06-24T00:06:19.000Z",
          "wordCount": 329,
          "title": "The little vacuum hose",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/luke1.jpg"
        },
        {
          "id": "68595e4c2be0680001c60ce2",
          "author": "The Editors",
          "description": "Kọ́lá Túbọ̀sún on Minnesota, a land of contrasts; new fiction from Luke O’Neil",
          "link": "https://flaminghydra.com/issue-346/",
          "publishedOn": "2025-06-24T00:04:40.000Z",
          "wordCount": 370,
          "title": "Lake effect / Wreck yourself",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/timwalz-1.jpg"
        },
        {
          "id": "685999932be0680001c60d67",
          "author": "Kọ́lá Túbọ̀sún",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/minnesota-vice/",
          "publishedOn": "2025-06-24T00:01:04.000Z",
          "wordCount": 333,
          "title": "Minnesota Vice",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/timwalz.jpg"
        }
      ]
    },
    {
      "title": "Today in Tabs",
      "feedUrl": "https://rss.beehiiv.com/feeds/ZRiesnGI0u.xml",
      "siteUrl": "https://www.todayintabs.com/",
      "articles": [
        {
          "id": "https://www.todayintabs.com/p/capri-sun-the-long-way-6ca4",
          "author": "Rusty Foster",
          "description": "The Long 1860s demand an equally long juice.",
          "link": "https://www.todayintabs.com/p/capri-sun-the-long-way-6ca4",
          "publishedOn": "2025-06-27T20:06:01.000Z",
          "wordCount": 11826,
          "title": "Capri Sun The Long Way",
          "enclosure": {
            "url": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/96596d27-cce2-4164-877f-334e94f23a08/84261068007-sp-ig-2-45.jpg",
            "length": "112625",
            "type": "image/jpeg"
          },
          "imageUrl": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/96596d27-cce2-4164-877f-334e94f23a08/84261068007-sp-ig-2-45.jpg"
        },
        {
          "id": "https://www.todayintabs.com/p/completely-gunked-up-with-cortisol-c288",
          "author": "Rusty Foster",
          "description": "Two prototype thnickels in my hand.",
          "link": "https://www.todayintabs.com/p/completely-gunked-up-with-cortisol-c288",
          "publishedOn": "2025-06-24T20:00:45.000Z",
          "wordCount": 9536,
          "title": "Completely Gunked Up With Cortisol",
          "enclosure": {
            "url": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/e1b5807a-1ad5-4cde-82cf-669edfcc51ce/labubu-1750346198-1000x1500.jpg",
            "length": "177750",
            "type": "image/jpeg"
          },
          "imageUrl": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/e1b5807a-1ad5-4cde-82cf-669edfcc51ce/labubu-1750346198-1000x1500.jpg"
        }
      ]
    },
    {
      "title": "Bad Faith Times",
      "feedUrl": "https://bad-faith-times.ghost.io/rss/",
      "siteUrl": "https://badfaithtimes.com/",
      "articles": [
        {
          "id": "6863efde22d8620001268bb7",
          "author": "Denny Carter",
          "description": "The left has to accept that we have entered a post-materialist age, whether we like it or not",
          "link": "https://badfaithtimes.com/vibes-are-all-that-matter-now/",
          "publishedOn": "2025-07-02T12:04:45.000Z",
          "wordCount": 2309,
          "title": "Vibes Are All That Matter Now",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/07/Screenshot-2025-07-01-at-10.56.23---AM.png"
        },
        {
          "id": "6862ca99d663ab0001f84064",
          "author": "Denny Carter",
          "description": "The most radical reforms of the Great Redo were reserved for America's immigration policy",
          "link": "https://badfaithtimes.com/blog-posts-from-the-glorious-future-the-breaking-of-the-man-with-the-iron-heart/",
          "publishedOn": "2025-06-30T17:55:21.000Z",
          "wordCount": 1890,
          "title": "Blog Posts From The Glorious Future: The Breaking Of The Man With The Iron Heart",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/06/Screenshot-2025-06-30-at-1.54.29---PM.png"
        },
        {
          "id": "685d45eed663ab0001f832e2",
          "author": "Denny Carter",
          "description": "\"Democrats who promise policy initiatives but don’t discuss court reform are living in a land of make believe.\"",
          "link": "https://badfaithtimes.com/this-u-s-senate-candidate-wants-to-fix-the-rogue-supreme-court/",
          "publishedOn": "2025-06-26T14:43:41.000Z",
          "wordCount": 1889,
          "title": "This U.S. Senate Candidate Wants To Fix The Rogue Supreme Court",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/06/Screenshot-2025-06-26-at-10.31.09---AM-1.png"
        },
        {
          "id": "6859906f4380030001a5f4aa",
          "author": "Denny Carter",
          "description": "Curtis Yarvin refuses to say what he means.",
          "link": "https://badfaithtimes.com/bft-podcast-americas-leading-monarchist-seems-unwell/",
          "publishedOn": "2025-06-24T11:59:46.000Z",
          "wordCount": 511,
          "title": "BFT Podcast: America's Leading Monarchist Seems Unwell",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/06/Screenshot-2025-06-23-at-2.07.49---PM.png"
        },
        {
          "id": "685980734380030001a5eef0",
          "author": "Denny Carter",
          "description": "Being an asshole is a choice.",
          "link": "https://badfaithtimes.com/self-censorship-is-actually-good/",
          "publishedOn": "2025-06-23T17:19:08.000Z",
          "wordCount": 2603,
          "title": "Self Censorship Is Actually Good",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/06/Screenshot-2025-06-23-at-1.15.04---PM.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}