{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": [
        {
          "id": "https://blogs.fangraphs.com/?p=452943",
          "author": "David Laurila",
          "description": "Plus Mike Elias on Gary Sánchez, Scott Harris on Detroit's catching combo, a Triston Casas-Luis Castillo poll, facts and stats galore, and more.",
          "link": "https://blogs.fangraphs.com/sunday-notes-garrett-crochet-changes-sox-pitch-usage-conversation-to-come/",
          "publishedOn": "2024-12-15T12:30:23.000Z",
          "wordCount": null,
          "title": "Sunday Notes: Garrett Crochet Changes Sox, Pitch Usage Conversation To Come",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Pitch",
      "feedUrl": "https://www.thepitchkc.com/feed/",
      "siteUrl": "https://www.thepitchkc.com/",
      "articles": [
        {
          "id": "https://www.thepitchkc.com/?p=865484",
          "author": "Tim Carpenter",
          "description": "The Kansas Department of Health and Environment says the number of abortions performed in Kansas during 2023 climbed to 19,467, which was 58% greater than the 12,319 total in 2022. Three-fourths of last year’s abortion patients lived in other states and traveled to Kansas for the procedure. (Tim Carpenter/Kansas Reflector) TOPEKA — Demand for abortion in Kansas skyrocketed by 58%...",
          "link": "https://www.thepitchkc.com/kansas-abortions-rise-58-in-2023-amid-tight-restrictions-in-nearby-states/",
          "publishedOn": "2024-12-14T18:11:58.000Z",
          "wordCount": 2184,
          "title": "Kansas abortions rise 58% in 2023 amid tight restrictions in nearby states",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/12/f/r/screenshot-2024-12-14-at-120726pm-1024x644.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=865392",
          "author": "Eli Ralls",
          "description": "Kansas City Mavericks versus Savannah Ghost Pirates on Wednesday, Dec. 11, 2024 at Cable Dahmer Arena. // Photo by Eli Ralls The Kansas City Mavericks continue to roll ECHL talent to the side, as they claim their fifth straight victory, taking a 3-1 match from the Savannah Ghost Pirates on Wednesday, Dec. 11 at Cable Dahmer Arena. Both teams got...",
          "link": "https://www.thepitchkc.com/photos-kc-mavericks-slide-to-five-straight-wins-after-a-3-1-victory-over-savannah/",
          "publishedOn": "2024-12-13T15:00:06.000Z",
          "wordCount": 1855,
          "title": "Photos: KC Mavericks slide to five straight wins after a 3-1 victory over Savannah",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/m/f/kc-mavericks-v-ghost-piriates-12-11-24-02.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864098",
          "author": "Beth Lipoff",
          "description": "Photo Courtesy of Rebel Song Academy Writing a song and performing it yourself in front of an audience can seem daunting, but the kids in Art as Mentorship’s Rebel Song Academy have plenty of stepping stones to help them strut to the stage. In the academy, it doesn’t matter if you’re 9 or 19—You’re getting guidance on the process of...",
          "link": "https://www.thepitchkc.com/kc-cares-rhyme-reason-rebel-song-academy-is-streamlining-students-to-the-center-stage/",
          "publishedOn": "2024-12-13T14:00:01.000Z",
          "wordCount": 2332,
          "title": "KC Cares: Rhyme & Reason: Rebel Song Academy is streamlining students to the center stage",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/j/l/rebel-song-1-scaled.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=865494",
          "author": "Allison Kite",
          "description": "Kansas City Mayor Quinton Lucas, center, participates in a meeting with regional leaders and Gov. Mike Parson in 2019. Lucas claimed not to know who paid for a poll seemingly designed to sink an effort to place a Kansas City Royals baseball stadium in North Kansas City, but documents show his campaign requested it. (photo courtesy of the Missouri Governor’s...",
          "link": "https://www.thepitchkc.com/campaign-committee-controlled-by-kc-mayor-requested-poll-he-denied-involvement-in/",
          "publishedOn": "2024-12-13T13:30:34.000Z",
          "wordCount": 3867,
          "title": "Campaign committee controlled by KC mayor requested poll he denied involvement in",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/12/f/w/screenshot-2024-12-14-at-121558pm-1024x604.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=865379",
          "author": "Abby Olcese",
          "description": "Courtesy A24 The main character of William S. Burroughs’ novels Junkie, Queer and Naked Lunch is a literary alter-ego for Burroughs himself. In film, the character first appeared in David Cronenberg’s adaptation of Naked Lunch, where he was played by Peter Weller. Now, in Luca Guadagnino and Justin Kuritzkes’s adaptation of Queer, he’s back again, played by Daniel Craig.  Lee,...",
          "link": "https://www.thepitchkc.com/queer-uses-daniel-craig-for-a-lonely-and-introspective-look-at-william-s-burroughs/",
          "publishedOn": "2024-12-13T03:32:11.000Z",
          "wordCount": 2162,
          "title": "Queer uses Daniel Craig for a lonely and introspective look at William S. Burroughs",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/12/h/u/screenshot-2024-12-12-at-83629pm.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=865326",
          "author": "Sarah Sipple",
          "description": "Art by Cassondra Jones Life in KC is pretty delicious. In fact, there is often so much going on that it can be hard to decide where to go and what to try. That’s where I come in.  I’ve curated this weekly list of events, openings, deals, and celebrations to keep you in-the-know. Cheers! Something New Cocktail Week: The Pitch...",
          "link": "https://www.thepitchkc.com/kc-sipps-half-price-cocktails-operation-meatball-and-more-restaurant-news/",
          "publishedOn": "2024-12-12T19:00:38.000Z",
          "wordCount": 2064,
          "title": "KC Sipps: Half-price cocktails, Operation Meatball, and more restaurant news",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2023/08/v/i/kc-sipps-1024x538-1.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864305",
          "author": "Nick Spacek",
          "description": "Illustrated by Katelyn Betz Christmas is in less than three weeks. You’ve already checked out from your job and are only pretending to work. Why not skip that Zoom webinar and instead watch these wonderful new music videos from some of the area’s most talented acts? We have a whole lot of angry music to keep you awake and energized,...",
          "link": "https://www.thepitchkc.com/hellevate-lone-stranger-flora-from-kansas-and-more-of-the-best-local-music-videos/",
          "publishedOn": "2024-12-12T17:00:50.000Z",
          "wordCount": 2223,
          "title": "Hellevate, Lone Stranger, Flora From Kansas, and more of the best local music videos",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/y/u/screenshot-2024-12-06-at-103151pm.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=865361",
          "author": "Adrian Torres",
          "description": "This has been a big (read: long) year for Sony Spider-Man offshoots. The year began with the meme-friendly Madame Web, and continued with a lackluster third entry in the Venom trilogy. The latest (and hopefully last) outing in this experiment in intellectual property ownership, director J.C. Chandor’s Kraven the Hunter, is one of the better entries, but that’s not saying...",
          "link": "https://www.thepitchkc.com/kraven-the-hunter-is-yet-another-forgettable-sony-superhero-misfire/",
          "publishedOn": "2024-12-12T00:51:36.000Z",
          "wordCount": 2039,
          "title": "Kraven the Hunter is yet another forgettable Sony superhero misfire",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/12/x/y/screenshot-2024-12-11-at-50805pm.png"
        }
      ]
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=176281",
          "author": "Drew Magary",
          "description": "Conclave, currently playing both in theaters and on demand, is the kind of movie that will generate almost all of its long-term business from its ending. Yes, it will be nominated for, and perhaps win, a whole shitload of Oscars. And yes, DOP Stephane Fontaine’s camerawork deserves one of those Oscars. If you want two hours of sumptuous Vatican porn (and the mood strikes me more often than you’d imagine), Fontaine and director Edward Berger deliver a movie with multiple frames that are literally suitable for framing. Put those shots in a fucking museum.\nBut that ain’t what anyone’s gonna talk about coming out of the theater. What everyone is gonna talk about is, “Oh wow, can you believe that ending?” And if you haven’t seen it Conclave yet, you’ll be besieged by satisfied customers encouraging you to experience its endgame for yourself. We’re still in the Spoiler Zone for this film, so I can’t and won't talk more about how Conclave’s plot resolves itself. Nor do I want to, because my opinion—and it’s only mine—is that it was corny and stupid.",
          "link": "https://defector.com/the-ending-of-conclave-was-cheap-and-stupid",
          "publishedOn": "2024-12-15T20:47:16.000Z",
          "wordCount": 7236,
          "title": "The Ending Of ‘Conclave’ Was Cheap And Stupid",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/ConclaveTrailerStill.png"
        },
        {
          "id": "https://defector.com/?p=176303",
          "author": "David Roth",
          "description": "There's a kind of hush that is specific to old-growth suburbs, a quietness that is more vast and more inherent than any disturbance that kind of place can kick up. The place where I grew up is different in some ways than it was when I was growing up there, but that fundamental quiet is undisturbed. Things happen and make their various sounds—you'll hear a quick blurt of music when someone steps out of a bar to smoke or as people come and go from one of the restaurants downtown, cars go by and dogs get bossy on their walks and freight trains chug and honk over the New Jersey Transit lines when the commuter trains aren't running. People still live there, and people make noise. The part that is striking, and which is striking to me whenever I go back to see my parents in the house where I grew up, is how the totality of that suburban quiet swallows all this up. It's there and then it is gone, and there is maybe the wind in the trees or just nothing at all.\nI have lived in noisy places for longer than I ever lived in all that quiet, but the appeal of it isn't lost on me. I like how dark it gets at night there, and I like walking back from the train station down those quiet sidewalks and through all the old extraneous shortcuts of my youth. The last few times I've done this I have startled some deer standing around in a parking lot, as aimless and wary as I was when I did the same thing as a teenager; they stared at me but did not run. I am aware that it is a nice place to live and it was on balance a perfectly fine place to grow up. I understand why people live there. I am also under no illusions about how quickly and how thoroughly I would go insane if I were to try to do it again.",
          "link": "https://defector.com/its-time-for-a-little-recreational-mental-illness-in-new-jersey",
          "publishedOn": "2024-12-15T19:49:25.000Z",
          "wordCount": 9752,
          "title": "It’s Time For A Little Recreational Mental Illness In New Jersey",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-1610008098.jpg"
        },
        {
          "id": "https://defector.com/?p=176293",
          "author": "Drew Magary",
          "description": "In accordance with New York Athletic Club bylaws, any defensive player who wins the Heisman must be a dual threat player: one who also takes enough snaps on offense to remind voters of the QBs and RBs those voters like to vote for, and who normally win this award. That’s how legendary Michigan CB Charles Woodson secured the Heisman in 1997 (over betting favorite Peyton Manning), and it’s how Colorado CB/WR Travis Hunter edged out Boise State RB Ashton Jeanty for the honor on Saturday night. Hunter is even more of an offensive threat than Woodson was, amassing 92 receptions and 1,152 yards on offense this season while also serving as the Buffaloes’ shutdown corner. This man is a special talent, and the NFL Draft will reward him for it.\nNow let’s talk about Hunter’s coach, who’s a total asshole.",
          "link": "https://defector.com/travis-hunter-wins-heisman-hopefully-wont-become-like-his-coach",
          "publishedOn": "2024-12-15T16:59:00.000Z",
          "wordCount": 6822,
          "title": "Travis Hunter Wins Heisman, Hopefully Won’t Become Like His Coach",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2189350822.jpg"
        },
        {
          "id": "https://defector.com/?p=176284",
          "author": "Drew Magary",
          "description": "I’ve decided that it’s the year of the fat guy in the sport of football. This is mostly because I’ve already watched Detroit Lions RT Penei Sewell be tasked this season with executing both a hook-and-lateral and an option pass (he couldn’t find an open man and had to take the sack). Those are two jobs that professional fat guys are never entrusted with, although Sewell is a talented guy who has already proven himself a capable receiver. More to the point, who doesn’t get off seeing a 300-pound man doing shit normally reserved for men 100 pounds lighter?\nNavy head coach Brian Newberry knows what I’m talking about. That’s why, up 21-13 against a ranked Army team that had just cut the lead down to a single possession, Newberry had the Midshipmen run this fake punt on fourth-and-5 from his own side of the field:",
          "link": "https://defector.com/navy-consecrates-footballs-year-of-the-fat-guy-with-decisive-fake-punt",
          "publishedOn": "2024-12-15T15:31:52.000Z",
          "wordCount": 6563,
          "title": "Navy Consecrates Football’s Year Of The Fat Guy With Decisive Fake Punt",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2189971731.jpg"
        },
        {
          "id": "https://defector.com/?p=176223",
          "author": "Maitreyi Anantharaman",
          "description": "Watch enough Hannah Hidalgo games on TV, and you’ll grow used to hearing that she plays with “joy.” Glee, I could see. Abandon, sure. But joy feels too clean and delicate a word to describe the way Hidalgo conducts herself on a basketball court: the mean mug, the wagged tongue, after a parabolic pull-up three. The screams. The screams! There is so much screaming: when she finds a teammate on the run, when she launches into someone’s shoulder at the rim, topples to the ground, and draws a foul. They convince me less of her “love for the game” than of her pure, uncut hatred for opponents.\nForget shoulder shrugs or sly smiles; Hidalgo exists on a higher plane of expression. Never has a player been so delighted to demoralize. (Perhaps I’m projecting this malevolence on account of her Instagram stories, which range from bland disavowals of same-sex marriage to the somewhat more intriguing claim that Britney Spears, Katy Perry, Beyoncé and Ariana Grande “ARE ALL WITCHES” whose music is “satanic inspired” and “designed to pull you away from the creator.” Give her credit for consistency: She’s a nut on and off the court.)",
          "link": "https://defector.com/hannah-hidalgo-plays-like-a-woman-possessed",
          "publishedOn": "2024-12-13T19:36:34.000Z",
          "wordCount": 6929,
          "title": "Hannah Hidalgo Plays Like A Woman Possessed",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2189667718.jpg"
        },
        {
          "id": "https://defector.com/?p=175531",
          "author": "Billy Haisley",
          "description": "One of the most surprising signings of the summer transfer window was also one of the quietest. Coming off of three unremarkable but respectable seasons in Spain, and at a crossroad of sorts in a career nearing but not yet in its final leg, Memphis Depay went left. Rather than join any of the usual suspects in one of Europe's major leagues, the Dutch forward opted instead to go to Brazil to play for Corinthians.\nIt is true that it wasn't exactly clear what the next logical step for Memphis's career would be. If redemption in the eyes of the greater soccer world was what he'd been after at Barcelona and Atlético Madrid, a chance to return to the elite and avenge himself for the lasting damage his Manchester United flameout did to his reputation, he didn't get it. So where to next? His fame, pedigree, age, status with the national team, and ambitions made for a peculiar mix, narrowing his potential options.",
          "link": "https://defector.com/memphis-depay-was-made-for-brazil",
          "publishedOn": "2024-12-13T19:19:28.000Z",
          "wordCount": 12094,
          "title": "Memphis Depay Was Made For Brazil",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187555248.jpg"
        },
        {
          "id": "https://defector.com/?p=176238",
          "author": "Tom Ley",
          "description": "Yesterday, I ran into a problem. At around 4:00 p.m. ET, I poured myself a fresh cup of coffee. Then I had a brief video call with a colleague, for 15 or 20 minutes. Once the call was over, I went to take a sip of my coffee. It wasn't there. It wasn't anywhere. I couldn't find my coffee.",
          "link": "https://defector.com/i-lost-my-coffee",
          "publishedOn": "2024-12-13T18:43:46.000Z",
          "wordCount": 6847,
          "title": "I Lost My Coffee",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-1240717875.jpg"
        },
        {
          "id": "https://defector.com/?p=176180",
          "author": "Alan Kluegel",
          "description": "Gladiator II, Ridley Scott's sequel to Ridley Scott's Gladiator, is neither a good movie nor a bad movie—instead, it is easily one of the most movies in recent memory. Overstuffed and overacted (these are not complaints, mind you), Gladiator II has so much going on that the presence of (spoilers beyond this point) frickin' sharks in the frickin' Colosseum doesn't even make its Wikipedia summary. But look beyond the excesses of the film—easier said than done, given that a gladiator riding a rhinoceros like a surfboard appears not even halfway through—and there's another story here, one about how the politics of these films changed dramatically between the 2000 original and its 2024 sequel, and what that change says about the stories that America can still believe about itself.\nIn Gladiator, Rome is a civilizing force (the opening battle is a victory over barbarian tribes), and is on the verge of peacefully transitioning back to a republic. This version of Rome is a fundamentally virtuous nation that is threatened when Commodus, a vain and selfish degenerate, takes the reins of power instead of Maximus, the Cincinnatus-like humble general chosen by the dying emperor to return republicanism to the empire, who is subsequently exiled. It is essentially a late–Clinton-era narrative about America: A proud state has been brought low by the peccadillos of a flagrantly libertine leader who habitually disrespects the military, and the only way to return the nation to glory is for a morally upstanding political outsider (not one of those hated \"career politicians\") to defeat and remove this dishonorable interloper. And when Maximus completes his task and lays dying—term limited by Commodus's dagger—he demands that power be returned to the Senate. Even in death, Maximus was an institutionalist.",
          "link": "https://defector.com/ii-decadent-ii-decrepit-the-politics-of-gladiator-ii",
          "publishedOn": "2024-12-13T17:01:46.000Z",
          "wordCount": 8387,
          "title": "II Decadent II Decrepit: The Politics Of ‘Gladiator II’",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/gladiiator.jpg"
        },
        {
          "id": "https://defector.com/?p=176220",
          "author": "Tom Ley",
          "description": "Why is Bill Belichick the new head football coach for the University of North Carolina? Reporting done by The Athletic's Jeff Howe, combined with the fact that no professional team offered Belichick a job last offseason, would indicate that Belichick was forced into a college job because the NFL no longer wants him. But sources close to the man himself would like to tell a different story, and have done so through ESPN's Seth Wickersham. No, the NFL didn't turn its back on Belichick; he turned his back on it. \"This is a big fuck you to the NFL,\" is how one of Belichick's confidants described the decision to Wickersham.\nOK, sure. It doesn't really matter if any of us believe that a guy who is just 15 victories away from breaking Don Shula's all-time wins record willingly walked away from the NFL in order to coach football at a basketball school. What matters is that Belichick, and the people around him, seem to truly believe that.",
          "link": "https://defector.com/its-a-good-time-be-one-of-bill-belichicks-lackeys",
          "publishedOn": "2024-12-13T16:39:06.000Z",
          "wordCount": 6511,
          "title": "It’s A Good Time Be One Of Bill Belichick’s Lackeys",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2189629093.jpg"
        },
        {
          "id": "https://defector.com/?p=176191",
          "author": "Lauren Theisen",
          "description": "I want to tell you about Walt Whitman in denim cutoffs doing Lana Del Rey karaoke. I also want to tell you about the goldfish puppet who monologued about his existence for about three times as long as I was expecting. But first I should probably explain at least the basics.\nGive Me Carmelita Tropicana!, the final production for Soho Rep in its extremely intimate space on Walker Street, is a delirious supernatural caper written by Alina Troyano and Branden Jacobs-Jenkins. Troyano plays herself and Ugo Chukwu plays Jacobs-Jenkins as they chase the incorporeal title character—a real-life performance persona of Troyano's—through both New York City and a fantasy universe inhabited by Troyano's past characters. Both of the psychedelic experiences I mentioned appear before you in its intermission-free two hours (a good thing; you won't want to escape), along with so much more that can't be done justice as written words, and maybe shouldn't. The momentum and elements of surprise never falter. This is a kaleidoscopic celebration of freedom, of all you can do with craftsmanship, imagination, and an audience willing to join you on the journey.",
          "link": "https://defector.com/give-me-carmelita-tropicana-revels-in-the-full-potential-of-theater",
          "publishedOn": "2024-12-13T15:27:10.000Z",
          "wordCount": 6390,
          "title": "‘Give Me Carmelita Tropicana!’ Seizes The Full Potential Of The Theater",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/241107_CTropicana_SetUps-464_png.jpg"
        },
        {
          "id": "https://defector.com/?p=176201",
          "author": "Ray Ratto",
          "description": "You can tell a lot about people simply from watching how they experience schadenfreude. Actually, to be honest, there's only one thing you can tell about people based on their capacity for reveling in others' misery, and that's how much of a bastard they are. But it’s very good for that.\nWith that in mind, our tale. Our niece traveled from Oregon with her son so that they could take in Thursday's Rams-49ers game in Santa Clara, a sort of family treat gone amusingly wrong. That should explain the schadenfreude thing. Sure, being at that soggy and miserable slog was awful for them, but at least we stayed dry and warm and drank for free. You have to take your victories as they present themselves.",
          "link": "https://defector.com/that-was-just-awful",
          "publishedOn": "2024-12-13T14:53:34.000Z",
          "wordCount": 7031,
          "title": "That Was Just Awful",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2189681700.jpg"
        },
        {
          "id": "https://defector.com/?p=176162",
          "author": "Ben Tippett",
          "description": "Gukesh D is the 18th world chess champion at just 18 years of age. His heart-stopping title match against Ding Liren came down to an inexplicable endgame blunder in the 14th and final game. The challenger had taken the match lead in Game 11 only to lose in Game 12, as Ding looked set to once again come from behind to win in a world championship match. All tied up going into final classical game, we looked inevitably headed for the simplest of draws when Ding blundered a technical endgame win. Gukesh took advantage and now stands astride the chess world, $1.35 million richer, as its new king. \nLet’s recap Games 8-14, notating moves which actually occurred during the games in bold, and hypothetical variations which did not occur but could have in italics. If you missed out, check out our preview piece and recap of Games 1-7.",
          "link": "https://defector.com/gukesh-d-unleashed-the-zugzwang-to-become-the-youngest-world-chess-champion-in-history",
          "publishedOn": "2024-12-13T14:18:09.000Z",
          "wordCount": 20808,
          "title": "Gukesh D Unleashed The Zugzwang To Become The Youngest World Chess Champion In History",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2188905178.jpg"
        },
        {
          "id": "https://defector.com/?p=176014",
          "author": "David Roth",
          "description": "It is hard to know what middle age looks like for a podcast. The medium itself isn't that old, although the form in which it exists—people talking, about something, in some kind of shape and to some sort of end—is not merely ancient but one of the most fundamental aspects of what it means to be human. So if you consider the fact that this is the 100th episode of The Distraction with Multitude, and that we also recorded more than 100 episodes during our previous engagement with Stitcher, and also that we had a very similar podcast before that at the old site—hold on, I need to lie down for a minute. This'll just be a minute. Just give me a minute.",
          "link": "https://defector.com/one-hundred-distractions-deep-with-eric-silver",
          "publishedOn": "2024-12-12T20:29:08.000Z",
          "wordCount": 6724,
          "title": "One Hundred Distractions Deep, With Eric Silver",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2180005466.jpg"
        },
        {
          "id": "https://defector.com/?p=176127",
          "author": "Giri Nathan",
          "description": "The Knicks fans' fixation on Trae Young had become unseemly. Why were packs of feral bridge-and-tunnelers chanting the name of the Atlanta Hawks guard, unprompted, in regular-season blowouts of unrelated opponents? It had been three years since Young had humiliated their team in the postseason, and yet the phrase \"Fuck Trae Young\" had never left their lips. Sure, he held up his end of the bargain, telling visiting Knicks fans to \"take y'all ass home\" after a win in Atlanta last month, but their hatred still seemed disproportionate. Young seemed to have taken up residence in their heads without paying all that much in rent. At least the Hawks' 108-100 win over the Knicks in Wednesday's NBA Cup quarterfinal gave them something worth beefing about.\nThe Knicks seem to have specifically sought out that matchup, too. In the last game of the group stage, a front-to-back rout of the Orlando Magic, the specific point differential would determine their next opponent. If they won that game by at least 37 points—which they were capable of doing—the Knicks would have faced the Boston Celtics. So they sandbagged the last stretch of the game, letting the Magic outscore them by 16 points in the last six minutes, to line up a quarterfinal against the Hawks instead. The sarcasm from Knicks swingman Josh Hart indicated that the team knew what it was doing.",
          "link": "https://defector.com/trae-young-goes-for-cheap-heat-in-the-knicks-house",
          "publishedOn": "2024-12-12T20:07:37.000Z",
          "wordCount": 6797,
          "title": "Trae Young Goes For Cheap Heat In The Knicks’ House",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2189499275.jpg"
        },
        {
          "id": "https://defector.com/?p=176122",
          "author": "Patrick Redford",
          "description": "In the final NBA Cup quarterfinal, Houston hosted and beat Golden State in an objectively ugly, subjectively very fun 91-90 grindhouse win defined by incredible defense on both sides, yet another late-game Warriors meltdown, and Steve Kerr going totally ballistic after the loss. The game was a pretty illustrative example of a number of larger-order trends in the league this year, from both a gameplay level and broadcasting standpoint, especially at the end.\nWhat happened is the Warriors blew it. They ripped off a trademark third-quarter burst, the only frame in which either team scored more than 25, and nursed a small lead throughout the fourth. The dynamic when the Warriors had the ball involved Golden State desperately running around trying to use Steph Curry's gravity to unzip something somewhere else in the airtight Houston defense before the Rockets forced a shot-clock violation, which they did an incredible eight times on the night (they also forced an eight-second violation). Golden State only so much as hit the rim once in the final three minutes. Houston's offense, by contrast, centered around giving Alperen Sengun the ball and letting him operate in the post. It was honest, physically punishing stuff, old-school principles applied against and alongside hypermodern basketball. Both teams are winning this year with defense and depth, which to me are the two big league-wide stories this season.",
          "link": "https://defector.com/steve-kerr-flips-out-after-latest-warriors-meltdown",
          "publishedOn": "2024-12-12T18:42:38.000Z",
          "wordCount": 6942,
          "title": "Steve Kerr Flips Out After Latest Warriors Meltdown",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2189509705-1.jpg"
        },
        {
          "id": "https://defector.com/?p=176090",
          "author": "Lauren Theisen",
          "description": "While cheering for the Buffalo Sabres has been the bleakest of all possible NHL fan choices over the past 13 years, the experience hasn't been without a few recent glimmers. Despite the league-leading playoff drought, the Sabres have managed to avoid the absolute dregs of the East by putting together a few scrappy hot streaks here and there, inspiring a bit of hope that they can steal an eight seed soon. With big-shot draft picks in Rasmus Dahlin and Owen Power, a strong vet acquired for a former big-shot draft pick in Alex Tuch, the breakout stardom of tall center Tage Thompson, the arrival of yet another young and talented defender in Bowen Byram, and an apparent solution in goal named Ukko-Pekka Luukkonen, there was a scenario in which the Sabres could perhaps take advantage of the Atlantic Division's aging top half and underachieving bottom half.\nFor the first chunk of this season, Buffalo didn't disabuse anyone of that notion. The Sabres won most of their games against worse teams and got breaks in a few others, which, combined with a slow start from the Boston Bruins, had them top-eight by points percentage in the East at Thanksgiving. But ever since they returned from a perfect West Coast trip for eight straight games in the state of New York, they have dutifully undone all that good work. The Sabres have lost every one of these N.Y. games, including seven in Buffalo, with the chilly spell culminating in a 3-2 defeat to the Rangers on Wednesday.",
          "link": "https://defector.com/sabres-still-bad",
          "publishedOn": "2024-12-12T18:24:38.000Z",
          "wordCount": 7805,
          "title": "Sabres Still Bad",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2188843119.jpg"
        },
        {
          "id": "https://defector.com/?p=175974",
          "author": "Chris Thompson",
          "description": "The state of New Jersey requires that online gambling operators notify gamblers when their lifetime deposits have crossed a certain dollar threshold. Small bets add up: A user might think they are wagering reasonably and not fully appreciate that over too short a period of time they've pumped a few paychecks or more into their account. So New Jersey regulations require that gambling operators freeze a user's gambling activity until the user has been confronted with the option \"to self-impose responsible gaming limits\" or close their account, has once again been reminded of the existence of a problem-gambling hotline, and has clicked their way through an acknowledgment. The threshold is $2,500, which seems reasonable enough. Certainly I would want to know if I'd deposited more than two thousand of my own dollars into a DraftKings account, so that I could immediately hurl myself off of a skyscraper.\nA DraftKings user in New Jersey with the handle MDallo1990 hit the $2,500 deposit threshold on or about Feb. 1, 2020, according to attorney Matthew Litt, who represents the user's \"separated spouse\" and two children. MDallo had at that point been on DraftKings for about a month; though this would not have been his first encounter with the problem-gambling hotline number, this would've been the first time that the encounter came with a mandatory freeze on gambling, and a prompt. Unfortunately, MDallo did not immediately \"self-impose responsible gaming limits\" or close his account.",
          "link": "https://defector.com/how-much-protection-do-online-sportsbooks-owe-their-patrons",
          "publishedOn": "2024-12-12T17:12:20.000Z",
          "wordCount": 8259,
          "title": "How Much Protection Do Online Sportsbooks Owe Their Patrons?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/08/GettyImages-1433395204.jpg"
        },
        {
          "id": "https://defector.com/?p=176030",
          "author": "Annie Howard",
          "description": "If you’ve only ever listened to Godspeed You! Black Emperor’s recorded output, you’ve probably never heard “Hope Drone.” The song has no fixed form; instead, it is an evolving being, seemingly fated to live solely in the domain of live performance. You can find ample evidence of the track’s changing character online; fan-recorded bootlegs trace its many manifestations as the band’s opening number since 2010, when the Montreal-based collective reunited after a seven-year hiatus. Through those 15 years, with five recorded albums and countless live performances, “Hope Drone” has been, at once, the most consistent and ever-changing facet of the collective’s repertoire.\nThe word HOPE faded into view as a low bass hum emerged over the loudspeaker, announcing the imminent arrival of the band on stage at Chicago’s Salt Shed on the night of Nov. 8. Over the next dozen minutes, that one word flickered in and out on a piece of looping celluloid as the band began to shape the droning sound into something specific, imbuing the open concept with meaning. If hope is a discipline, as longtime abolitionist Mariame Kaba has taught us, then “Hope Drone” is a persistent exercise in renewing faith in a better world—the Sisyphean act of inching the boulder upwards, only to watch it fall into an abyss of violence that seems to expand each day.",
          "link": "https://defector.com/godspeed-you-black-emperor-works-hard-to-hope",
          "publishedOn": "2024-12-12T16:52:42.000Z",
          "wordCount": 8917,
          "title": "Godspeed You! Black Emperor Works Hard To Hope",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2175063883.jpg"
        },
        {
          "id": "https://defector.com/?p=176034",
          "author": "Drew Magary",
          "description": "Drew Magary’s Thursday Afternoon NFL Dick Joke Jamboroo runs every Thursday at Defector during the NFL season. Got something you wanna contribute? Email the Roo. And buy Drew’s book, The Night The Lights Went Out, through here.\nThe 2024 Minnesota Vikings are not going to win the Super Bowl. Mathematically speaking, they have a definitive chance (4.4 percent, according to FTN) of pulling the feat off, but they remain something of an afterthought among title contenders because of the teams above them (Detroit and Kansas City, most notably), because of their history of coming up short in big moments, and because of their current starting quarterback. This starting quarterback.",
          "link": "https://defector.com/sam-darnold-brought-me-to-football-nirvana",
          "publishedOn": "2024-12-12T16:13:08.000Z",
          "wordCount": 15006,
          "title": "Sam Darnold Brought Me To Football Nirvana",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2188893437.jpg"
        },
        {
          "id": "https://defector.com/?p=175735",
          "author": "Kelsey McKinney",
          "description": "Books take a long time. Writing, editing, and publishing one is slow, laborious work. A book that is sold today probably won’t come out until 2027 at the earliest. So it makes sense that money-grubbing innovator boys have taken aim at book publishing, which is an industry full of words, and decided that the way to disrupt it is by using AI. The dweebiest of these operations is a company called Spines, whose marketing materials feature four men wearing high V-neck branded T-shirts, looking like they are about to ask you if you’re ready for your massage. Spines is planning to disrupt the book industry by publishing—say it with me—EIGHT THOUSAND BOOKS in 2025 using artificial intelligence. \nTheir goal, they say, is to shrink the distance between a book being written and being published by using AI to \"automate proofreading, cover design, metadata optimization and limited translation services.\" For $5,000, Spines claims it can have a manuscript published in three weeks. They have secured $16 million in series A funding. “We want to publish up to 8,000 books next year. The goal is to help a million authors publish their books,” Yehuda Niv, the CEO of Spines, told The Bookseller.",
          "link": "https://defector.com/theres-no-shortcut-to-publishing-a-book",
          "publishedOn": "2024-12-12T14:17:29.000Z",
          "wordCount": 9817,
          "title": "There’s No Shortcut To Publishing A Book",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-1541008831.jpg"
        },
        {
          "id": "https://defector.com/?p=176052",
          "author": "Patrick Redford",
          "description": "City councilors are some of our most straightforwardly American politicians, capable of breathtaking feats of narcissism and corruption, often actively at war with their own constituents, and willing to jump through any hoop as long as the real-estate lobbies and cops tell them to. The relatively low status of the office does nothing to blunt anyone's kookier tendencies, and in fact, it makes them funnier. Someone as stupid as Tito Ortiz makes sense as a city councilor.\nAnyway, I learned about Minneapolis city council member LaTrisha Vetaw today because she pulled off a hell of a performance at a meeting Tuesday night when she tearily read into the record the names of nine police horses who had recently lost their jobs. A quick search yields three other Vetaw facts: she refused to put on the same T-shirt as every other person in the crowd at a Timberwolves playoff game last year; AIPAC wanted her to run against Ilhan Omar; and she had a meltdown this past January when she yelled at fellow city councilors and activists about how horrible unhoused people are.",
          "link": "https://defector.com/they-defunded-the-ponies",
          "publishedOn": "2024-12-11T22:51:26.000Z",
          "wordCount": 5048,
          "title": "They Defunded The Ponies",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-534288872.jpg"
        },
        {
          "id": "https://defector.com/?p=175899",
          "author": "Sabrina Imbler",
          "description": "Imagine, if you would, that a clam was a church. Most of the walls are thick and opaque, protecting the animal's soft insides. But in certain clams called heart cockles, pricks of sunlight stream through the top shell like stained glass, illuminating the tiny organisms dwelling inside the clam. When Dakota McCoy, a biophysicist at the University of Chicago, first shone a light through the upper shell of a heart cockle, she was struck by this comparison. \"Once I lit up that beautiful pinkish shell, I immediately thought, I've seen this before in the U Chicago chapel,\" McCoy wrote in an email.\nThe cockle Corculum cardissa is best known for its profile—the two shells come together to form a heart shape. But McCoy was most intrigued by the clam's celestial skylights, which let in sunlight to sustain the microscopic algae that live inside the mollusk's tissue. McCoy and colleagues recently published a paper in Nature Communications describing how these windows manage to act like fiber optic cables that beam in the good light and keep out the bad, long before any human engineer cracked the code.",
          "link": "https://defector.com/there-are-clam-cathedrals-everywhere-for-those-with-the-eyes-to-see",
          "publishedOn": "2024-12-11T20:59:27.000Z",
          "wordCount": 8379,
          "title": "There Are Clam Cathedrals Everywhere For Those With The Eyes To See",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/IMG_1962_RuiqiLi.jpg"
        },
        {
          "id": "https://defector.com/?p=175946",
          "author": "Giri Nathan",
          "description": "Many people conceive of a favorite restaurant as a place of comfort. You walk in and they remember your order. Maybe they make you feel “at home,” let you go off-menu, indulge you with a free glass of wine or piece of cake. Sounds nice, but I went to my favorite restaurant to be bullied—all my senses battered and burnt out, before I was handed the check and hustled unceremoniously out the door. That was the beauty of Ugly Baby.",
          "link": "https://defector.com/i-loved-how-much-ugly-baby-hated-me",
          "publishedOn": "2024-12-11T20:07:46.000Z",
          "wordCount": 11227,
          "title": "I Loved How Much Ugly Baby Hated Me",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/ugly-baby-salad.jpg"
        },
        {
          "id": "https://defector.com/?p=176006",
          "author": "Defector Staff",
          "description": "Defector is correctly recognized as an authority on hideously expensive holiday wares, but we are also a purveyor of sensible gifting options ourselves! Consider giving someone the gift of blogs this holiday season: Reader and Pal subscriptions can be purchased HERE, and Friend and Friend-of-a-Friend subscriptions to Normal Gossip can be purchased HERE. Like your […]",
          "link": "https://defector.com/give-some-blogs-get-a-calendar",
          "publishedOn": "2024-12-11T19:25:00.000Z",
          "wordCount": 5643,
          "title": "Give Some Blogs, Get A Calendar",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/them-you-defector-gift-guide.jpg"
        }
      ]
    },
    {
      "title": "Joe's Weather Blog | In-depth Kansas City forecasts | FOX4KC",
      "feedUrl": "http://fox4kc.com/category/weather/weather-blog/feed/",
      "siteUrl": "https://fox4kc.com",
      "articles": [
        {
          "id": "https://fox4kc.com/?p=3758740",
          "author": "Joe Lauria",
          "description": "A mix of clouds and some sunshine is starting our cold morning here in KC as temperatures expectedly tanked overnight into the teens again are greeting our Friday morning. The good news is that temperatures, especially this afternoon and overnight will warm nicely into the 40° range (or warmer overnight), so milder air to the [...]",
          "link": "https://fox4kc.com/email-alerts/joes-weather-blog-email-alerts/joes-blog-ice-for-some-rain-for-others-fri-12-13/",
          "publishedOn": "2024-12-13T15:37:32.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Ice for some...rain for others (FRI-12/13)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/12135.png?w=900",
            "type": "image/png",
            "length": "2229470"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/12135.png?w=900"
        },
        {
          "id": "https://fox4kc.com/?p=3757660",
          "author": "Joe Lauria",
          "description": "It's a chilly grayish start to the day in the region but hopefully we'll see more sunshine to bring temperatures above freezing later today. These colder air masses that have been moving through the area are somewhat impressive considering no snow is on the ground anywhere around the region. IF there would've been snow cover, [...]",
          "link": "https://fox4kc.com/email-alerts/joes-weather-blog-email-alerts/joes-blog-active-pattern-but-still-no-snow-12-12/",
          "publishedOn": "2024-12-12T15:43:59.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Active pattern but still no snow (12/12)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/12128.png?w=900",
            "type": "image/png",
            "length": "671249"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/12128.png?w=900"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=834094",
          "author": "Darragh McDonald",
          "description": "The 2024 Rule 5 draft took place this afternoon at the Winter Meetings in Dallas. The results of the draft are below. As a refresher, the Rule 5 draft is a way for players potentially talented enough for the big leagues but blocked by their current clubs to find opportunities elsewhere. Any players that were…",
          "link": "https://www.mlbtraderumors.com/2024/12/2024-rule-5-draft-results.html",
          "publishedOn": "2024-12-11T19:35:13.000Z",
          "wordCount": 7622,
          "title": "2024 Rule 5 Draft Results",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/12/Shane_Smith_Brewers-1024x720.jpg"
        }
      ]
    },
    {
      "title": "local food",
      "feedUrl": "https://www.kcur.org/tags/local-food.rss",
      "siteUrl": "https://www.kcur.org/tags/local-food",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}