{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": []
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=183098",
          "author": "Ray Ratto",
          "description": "Steve Kerr has visibly aged in his time as an NBA coach, which makes sense given that (a) he will turn 60 during his next training camp, and (b) Thursday's game in Brooklyn will be his 1,000th between regular and postseason, give or take the 55 games he missed but was given credit for while recovering from back surgery. He has also been a general manager for three years in Phoenix under noted loonball Bob Sarver, worked alongside Marv Albert at ESPN, which is to say listened to Marv Albert, nearly took the Knicks job when they were embarking on a seven-year stretch of .315 basketball, voiced himself on an episode of Clone High scouting for something called \"Tropical Hospital,\" and has worked alongside all the versions of Draymond Green for more than a decade. Hell, with all that he should look like Dick Van Dyke sticking his head out of a speeding car window, spaniel-style.\nBut Kerr has managed all this while seeming like a much younger fellow in spirit, which in the industry is almost as revivifying as casting your get-out-of-jail-free-card lot with Stephen Curry.",
          "link": "https://defector.com/its-not-a-real-nba-season-until-steve-kerr-complains-about-traveling",
          "publishedOn": "2025-03-04T20:50:27.000Z",
          "wordCount": 6573,
          "title": "It’s Not A Real NBA Season Until Steve Kerr Complains About Traveling",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2202758044.jpg"
        },
        {
          "id": "https://defector.com/?p=183022",
          "author": "Sabrina Imbler",
          "description": "Tate McRae has a brand new album out called So Close To What. This is a very popular album, but you may be asking yourself the same questions that we were asking ourselves a mere week ago—questions like Who is Tate McRae? and What other song does this Tate McRae song remind me of? and Why are people mad at Tate McRae? These are all good and important and valid questions to be asking. Thank you so much for asking them.\nLuckily, the two of us are garbage monsters who eat garbage all day long, so we are qualified to introduce you to Tate McRae and all of her mundane scandals.",
          "link": "https://defector.com/two-tate-mcrae-fans-explain-everything-they-know-about-tate-mcrae",
          "publishedOn": "2025-03-04T19:55:00.000Z",
          "wordCount": 11583,
          "title": "Two Tate McRae Fans Explain Everything They Know About Tate McRae",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2190499563.jpg"
        },
        {
          "id": "https://defector.com/?p=183046",
          "author": "Barry Petchesky",
          "description": "Watching Space Ghost Coast to Coast always felt like I was getting away with something. I just wasn't sure what. Staying up past my bedtime, both my parents asleep, sitting in the dark and watching this bizarre cartoon on a cable channel ostensibly for children, not quite getting many of the jokes, or anti-jokes, but understanding on some level that it was all very funny. I assumed I wasn't old enough to understand it, which at that age is one of the most thrilling feelings in the world.\nIt was a talk show, featuring actual famous guests, and if I had more laughs at the obvious humor of Zorak (evil mantis; bandleader) and Moltar (somewhat less evil lava man; director), none of it would have worked without the straight man—dimwitted host/former superhero Space Ghost—grounding everything with his signature authoritative idiocy. And Space Ghost as a character owed everything to the commanding voice of George Lowe.",
          "link": "https://defector.com/george-lowe-had-to-be-brilliant-to-make-space-ghost-that-stupid",
          "publishedOn": "2025-03-04T19:28:30.000Z",
          "wordCount": 6865,
          "title": "George Lowe Had To Be Brilliant To Make Space Ghost That Stupid",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/TSDSPGH_EC006.jpeg"
        },
        {
          "id": "https://defector.com/?p=183029",
          "author": "Patrick Redford",
          "description": "Ten minutes into the first quarter of the Dallas Mavericks' Monday night blowout loss to the Sacramento Kings, Kyrie Irving maneuvered around a Kai Jones screen and into the lane, where he split two help defenders, took a bump, and landed oddly on his left foot. His knee crumpled and he immediately went to the floor, calling for the Mavs' athletic training staff. That unit is as used to this sort of thing as any in the NBA. Irving's insistence on staying in the game to shoot his free throws (he made them both) was initial cause for optimism, but ESPN's Shams Charania reported on Tuesday morning that Irving had torn his ACL. The Mavericks, who were already screwed, are now totally terminal.\nThe theory of the Luka Doncic-Anthony Davis trade, or at least the most coherent available rationalization, was that the Mavericks were trying to win a championship right now, this year. In L.A., Davis had begun agitating to play alongside a true center (touching; was the Boogie Cousins experiment really so formative?), and he'd finally get his wish in Dallas. The Mavs could play their new do-it-all big man alongside either Daniel Gafford or Dereck Lively II and reliably beat the crap out of opponents while Irving shouldered the majority of the shot-creation burden. One could look around at the rest of the Western Conference and credibly think this formula could win three playoff series, provided P.J. Washington and the newly acquired Caleb Martin could hit their threes.",
          "link": "https://defector.com/the-mavericks-are-staring-into-the-abyss",
          "publishedOn": "2025-03-04T18:52:33.000Z",
          "wordCount": 6991,
          "title": "The Mavericks Are Staring Into The Abyss",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2203163644.jpg"
        },
        {
          "id": "https://defector.com/?p=183011",
          "author": "Alex Sujong Laughlin",
          "description": "Daily life can be so boring in its predictability, the ways we are forced to feed and clothe these bodies we are responsible for. So on its face, playing a game like The Sims should be miserable. You're just playing god as you watch little people try to fit all their bodily functions into one day and still feel spiritually fulfilled. There's something satisfying in achieving full green bars for your little digital people, even as your human body aches from poor posture and not enough exercise because it's still too cold outside.\nIt's funny how talking about your Sims' lives can feel a bit like when a child is in therapy acting out their complicated emotions with a doll. The Sims themselves have their own sort of agency and desires separate from the player, but you can override them in your power as all-powerful god/player. This week Sabs realized they were diverting one Sim away from their true calling to be a comedian. It was surprising how much their realization sounded like a Julia Cameron anecdote out of The Artist's Way.",
          "link": "https://defector.com/the-artists-way-week-8-we-are-burnt-out-sims",
          "publishedOn": "2025-03-04T17:58:18.000Z",
          "wordCount": 12053,
          "title": "‘The Artist’s Way’ Week 8: We Are Burnt-Out Sims",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-102155436-e1741110896126.jpg"
        },
        {
          "id": "https://defector.com/?p=182995",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about shitty teenagers, the end of Playboy, penis tattoos, and more.\nYour letters:",
          "link": "https://defector.com/you-cant-arrest-me-for-drowning-my-burger-in-ketchup",
          "publishedOn": "2025-03-04T17:01:15.000Z",
          "wordCount": 16340,
          "title": "You Can’t Arrest Me For Drowning My Burger In Ketchup",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-564045715.jpg"
        },
        {
          "id": "https://defector.com/?p=182675",
          "author": "Sabrina Imbler",
          "description": "A week into February, Kaesee Bourne was nervous about her job. Last August, she had joined the U.S. Fish and Wildlife Service as a fish and wildlife biologist working in California and Nevada. \"What should have been a stable job had started to become very unstable,\" she said. After Donald Trump took office, Bourne and her colleagues begun receiving a barrage of concerning emails, memorandums, and instructions—not from their supervisors, or even people who were a part of the Fish and Wildlife leadership, but from representatives of the United States Office of Personnel Management (OPM). This obscure federal agency has been tasked with the campaign of mass firings of federal workers led by Elon Musk's Department of Government Efficiency, or DOGE.\nWhen Bourne saw an OPM email asking for a list of probationary employees at Fish and Wildlife—a status that refers to recently hired employees, or employees recently moved into a new position—she asked her supervisor about it. But Bourne's supervisor had no additional insight; they had both received the email at the same time. \"I've been hearing that the goal of the new administration was to make people feel stressed out and just make them feel the chaos,\" Bourne said. \"It definitely worked.\"",
          "link": "https://defector.com/an-interview-with-a-fired-usfws-biologist",
          "publishedOn": "2025-03-04T15:20:58.000Z",
          "wordCount": 12092,
          "title": "An Interview With A Fired USFWS Biologist",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/kaesee-bourne.png"
        },
        {
          "id": "https://defector.com/?p=182874",
          "author": "Lauren Theisen",
          "description": "A lot of fear in this country is directly caused by guns. According to the CDC, there were over 48,000 firearm-related deaths in the U.S. in 2022, and the specific way in which a gun can kill you—without warning, painfully, at any age, in basically any place—only multiplies the dread. I grew up inundated with stories of mass murder: Columbine, Virginia Tech, Aurora, Sandy Hook. The worst nightmares come when it hits home—when the people shot are from your community (Pulse), your roots (Oxford, Michigan), or a critical part of your everyday life (the NYC subway). But gun violence is no less devastating when it doesn't make national news: a child shot on the street in your neighborhood, a friend's older brother's suicide, domestic violence taken to lethal extremes. The capacity to destroy bestowed by a gun on whoever holds it—a cop, a kid, a hunter—is a power that should be regarded with horror.\nOver the past several months, another fear has increased in prevalence among trans people in particular: the fear of a government that is not just ignorant or apathetic about our existence but is actively working to eradicate us from public life. It is the position of the Trump administration that trans people do not exist, and therefore do not have rights. Confronted with the inconvenient fact of our ongoing lives, the President, Elon Musk, and their cronies are fighting to block our access to healthcare, fire us from our jobs, threaten our safety, and limit our ability to leave the country.",
          "link": "https://defector.com/dont-buy-a-gun-even-if-it-comes-in-rainbow",
          "publishedOn": "2025-03-04T14:04:16.000Z",
          "wordCount": 8951,
          "title": "Don’t Buy A Gun, Even If It Comes In Rainbow",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-1216630064.jpg"
        },
        {
          "id": "https://defector.com/?p=182912",
          "author": "Dave McKenna",
          "description": "THE NOSEBLEEDS AT BARCLAYS CENTER — A fighter can’t call a timeout in boxing. Unless, that is, you’re Gervonta \"Tank\" Davis. \nBecause in the heat of battle during the ninth round of a shockingly fabulous and dramatic WBA lightweight title fight Saturday night, against underdog challenger Lamont Roach in Brooklyn, Davis did just that. And he got away with it. Then again, this fight was full of the unexpected, not least of which was the majority draw the judges gave the fight after 12 fascinating rounds. The Barclays Center crowd, which was very pro-Davis at the beginning of the night, booed loudly when the decision was announced, knowing the champ had been saved by the referee and feeling Roach was robbed on the scorecards.",
          "link": "https://defector.com/gervonta-davis-escapes-with-a-draw-after-hair-care-debacle",
          "publishedOn": "2025-03-03T22:08:50.000Z",
          "wordCount": 9268,
          "title": "Gervonta Davis Escapes With A Draw After Hair Care Debacle",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2202769752-e1741035866582.jpg"
        },
        {
          "id": "https://defector.com/?p=182965",
          "author": "Tom Scocca",
          "description": "Welcome to Margin of Error, a politics column from Tom Scocca, editor of the Indignity newsletter, examining the apocalyptic politics, coverage, and consequences of Campaign 2024.\nShould Democrats attend Donald Trump's address to the joint session of Congress Tuesday night? The party can't decide what to do. Some Democratic senators and representatives want to boycott the event, to deny Trump's frenetic and lawless program of misrule any of the ceremonial trappings of the presidency. Others want to show up and participate as a rebuke to Trump—including the party's leaders in both chambers, Hakeem Jeffries and Chuck Schumer, who, Axios wrote, \"want members to attend and bring special guests who have been negatively affected by the administration.\"",
          "link": "https://defector.com/this-is-uvalde",
          "publishedOn": "2025-03-03T21:51:48.000Z",
          "wordCount": 8730,
          "title": "This Is Uvalde",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/schumer-and-jeffries.jpeg"
        },
        {
          "id": "https://defector.com/?p=182901",
          "author": "Patrick Redford",
          "description": "This might feel somewhat discordant, given that JD Vance's most prominent physical feature is a golf-ball head that makes his body look like a tee, but the administration he's part of is one that understands the value of performance. How else are you supposed to read Vance aligning himself with a broccoli-cut racist and against his own children? Or Vance joining Marco Rubio and Donald Trump to stage an ambush on Ukraine President Volodymyr Zelenskyy this past Friday? That they invited him to the Oval Office to call him an ungrateful broke boy is itself pretty nasty and evil, though the most striking aspect of the airing of grievances was its staging. It was less a forum for diplomacy and more a show for the public, captured by several cameras and conducted in front of a jeering press corps. The point was not just to humiliate a soon-to-be former ally, but to be seen humiliating him by a public who is being told that this counts as action.\nThat sort of geopolitical kabuki feels maddening and somewhat abstract, and while the nature of Vance's arrangement with political power and capital is such that he is largely insulated from consequences, the good news is that Vance still can be told to fuck off when he deigns to be among the people. That is not the same as meaningfully fucking off, but it must have felt so good to be among the gathered Vermonters who protested Vance's planned ski getaway this past weekend. Vance and his family went up to Sugarbush Resort in Vermont's Mad River Valley—if you ever find yourself there, check out Canteen Creemee—and instead of the peaceful vacation they imagined for themselves, they got screamed at. Around 1,000 people lined the streets of Waitsfield, and several people skiing alongside Vance on the mountain brought signs and yelled at him when they got the chance. Enough people were annoying or troublesome enough that the Vance family moved their planned stay from a resort to a private residence and eventually cut short their planned four-day trip.",
          "link": "https://defector.com/jd-vance-screamed-out-of-planned-ski-vacation-in-vermont",
          "publishedOn": "2025-03-03T21:05:48.000Z",
          "wordCount": 6701,
          "title": "JD Vance Screamed Out Of Planned Ski Vacation In Vermont",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2202530023.jpg"
        },
        {
          "id": "https://defector.com/?p=182899",
          "author": "Israel Daramola",
          "description": "The Academy Awards are goofy. Always have been. A combination of theater-kid pageantry overload and an earnest celebration of Hollywood, or maybe just of the people working in Hollywood. The show has never had its finger on the pulse of the art form, settling instead on keeping its foot on the sternum, and the movies that lose usually say more about the state of the medium than the movies that win.\nThis year's slate of nominees featured very few truly great movies, but also very few truly bad ones. So a lukewarm Oscars telecast is exactly what everyone should've expected. A few laughs, a couple surprises, and no one walks away feeling particularly good or bad about any of it in totality. Good work!",
          "link": "https://defector.com/society-cant-quit-the-oscars",
          "publishedOn": "2025-03-03T19:38:12.000Z",
          "wordCount": 7067,
          "title": "Society Can’t Quit The Oscars",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2202480497.jpg"
        },
        {
          "id": "https://defector.com/?p=182875",
          "author": "Alex Sujong Laughlin",
          "description": "11:59 a.m. The tiny clock at the bottom of the screen counts down to the top of the hour, and like a bizarre bell chime from a digital clocktower, large pink text overtakes the Whitney Museum’s website. \n\"A quick bus ride and transfer to the F gets us into the city nice and swiftly at noon, where I’m greeted by this food truck.\"",
          "link": "https://defector.com/taking-the-life-out-of-day-in-the-life",
          "publishedOn": "2025-03-03T17:31:12.000Z",
          "wordCount": 8723,
          "title": "Taking The Life Out Of “Day In The Life”",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/large_ARealisticDayInMyLifeLivingInNewYorkCity_FinalScreenshot_MayaMan-e1741022839777.png"
        },
        {
          "id": "https://defector.com/?p=182888",
          "author": "Ray Ratto",
          "description": "On an otherwise calm day for the president (only blaming one country for being invaded is a light day by his standards), he announced his intention to pardon Pete Rose. For what, we're not sure, and with jurisdiction he does not have, he has decided that Rose needs to be reintegrated into America's good graces in the way Rose expressly said he didn't want it: posthumously.\nBut as the master of the grand and clumsy gesture, the Snickers-bar-in-chief said he was going to pardon him anyway, claiming with syntactical shoes-on-the-wrong-feet grace that Rose \"never betted against himself, or the other team. He had the most hits, by far, in baseball history, and won more games than anyone in history.\" How Rose's betting slips or his Baseball Reference page covers his conviction for tax evasion is hard to parse, as is the claim that he \"never betted against himself or the other team\" unless he was trying to middle every bet he ever made by betting both ways.",
          "link": "https://defector.com/pete-rose-will-spend-the-afterlife-as-a-cudgel",
          "publishedOn": "2025-03-03T16:34:30.000Z",
          "wordCount": 7251,
          "title": "Pete Rose Will Spend The Afterlife As A Cudgel",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-515218066.jpg"
        },
        {
          "id": "https://defector.com/?p=182870",
          "author": "Maitreyi Anantharaman",
          "description": "They say March comes in like a lion, which is why we thought it appropriate to BEGIN the month with a challenging themeless. That is the reason you are getting a themeless puzzle this week and did not get one last week to end the month as you normally do! It has nothing to do with a total puzzle post scheduling mistake on my part, for which I am very sorry. This week's puzzle was constructed by Trent Evans and edited by Hoang-Kim Vu. Trent has been constructing crossword puzzles since 2018. His work has appeared in the New York Times, Los Angeles Times, Wall Street Journal, and other major publications and independent puzzle venues. He publishes free puzzles at gridtherapy.com. He is a clinical psychologist in private practice in Catonsville, Md., where he lives with his wife Beth and their dog Donut. A rotating cast of five young adult children breeze in and out at their leisure, much to Trent and Beth’s delight. \nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE.",
          "link": "https://defector.com/the-crossword-march-3-think-again-themeless",
          "publishedOn": "2025-03-03T16:00:00.000Z",
          "wordCount": 5299,
          "title": "The Crossword, March 3: Think Again (Themeless)",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2178005867-e1741013210447.jpg"
        },
        {
          "id": "https://defector.com/?p=182857",
          "author": "Ray Ratto",
          "description": "Three years ago, Deebo Samuel changed the nature of offensive football. This weekend, he was traded from San Francisco to Washington for a fifth-round draft choice, not long after his 29th birthday. In the NFL, life comes at you fast and aims for your legs with a pipe wrench.\nSamuel was the signature piece at the zenith of the Kyle Shanahan Experience, the 49ers' ringless dynasty that looks like it might be ninja-stalking its sell-by date. He was the intriguing pass-catcher who became significantly more when he was unleashed as a running threat from the wideout position midway through the 2021 season. They solved their average-but-not-much-more-than-that quarterbacking problem, code-named Jimmy Garoppolo, by doubling down on an already run-dependent offense (they won the NFC championship game two years earlier by deliberately throwing only eight passes) with Samuel breaking down defenses by attacking with verve and sparkle from the outside back toward the maelstrom of the tackle box. He was named All-Pro, and teams across the league started thinking about wide receivers as running backs waiting for their moment.",
          "link": "https://defector.com/deebo-samuel-and-the-offensive-revolution-that-never-was",
          "publishedOn": "2025-03-03T14:39:50.000Z",
          "wordCount": 6243,
          "title": "Deebo Samuel And The Offensive Revolution That Never Was",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2192204114.jpg"
        },
        {
          "id": "https://defector.com/?p=182513",
          "author": "Brent Rose",
          "description": "There can be many nuances to ski, snowboard, and skateboard tricks that are lost on the average viewer. Was that a mute grab or an indy grab? What’s the difference? Which one is harder? Most of us will never know. Pure rotation, however, is easy to grasp. That's why during this year’s Winter X Games in Aspen this past January, everybody lost their minds when Japanese 19-year-old Hiroto Ogiwara pulled off the world’s first 2340 on his snowboard.\n\nhttps://www.youtube.com/watch?v=DNlPnAnWvq0",
          "link": "https://defector.com/how-big-can-big-air-go",
          "publishedOn": "2025-03-03T13:59:49.000Z",
          "wordCount": 8607,
          "title": "How Big Can Big Air Go?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-2195811992.jpg"
        },
        {
          "id": "https://defector.com/?p=182818",
          "author": "Kelsey McKinney",
          "description": "As an ass-appreciator, certain sports carry more intrigue than others. The benefit of baseball is the pants, which are tight and stretchy. The benefit of football is that sometimes they are pushing each other's tushes. The benefits of soccer and basketball are currently unknown to me, but I am willing to learn. But of all the sports, it is hockey which rewards the ass appreciator the most.\nHockey players are known to be unbelievably jacked in their lower body. Their quads are huge! Their hamstrings are made of steel! Their calves are as big as my thigh! The effort of pushing yourself around on skates for your entire life is a perfect formula for building a beautiful, ginormous butt. One of my favorite hockey articles of all time is an ESPN The Magazine story where Emily Kaplan interviewed a bunch of NHL players about how hard it is for them to buy jeans. Which is why I was stunned, horrified even, to see my king the menswear critic Derek Guy calling this butt a \"prominent seat.\"",
          "link": "https://defector.com/please-do-not-lie-to-me-about-hockey-butts",
          "publishedOn": "2025-03-02T23:29:13.000Z",
          "wordCount": 6376,
          "title": "Please Do Not Lie To Me About Hockey Butts",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-1973405004.jpg"
        },
        {
          "id": "https://defector.com/?p=182813",
          "author": "Justin Ellis",
          "description": "As far as memorabilia auctions go, a Victor Wembenyana jersey selling for $73,200 is a modest, if unremarkable sum. Granted, it's better than, say, a Malachi Flynn in-season tournament jersey going for the cost of a nightstand at Crate & Barrel, but already in his early career Wembenyama's jerseys have cleared $700,000 in the sports trinket market. \nBut the reason this is notable is because the jersey in question was at the center of a bit of fan theater that went viral and subsequently boomeranged faster than anyone could have guessed. No sooner had Wembenyama swapped jerseys with a kid—Comme c'est merveilleux! It looks like Wemby's uni got left in the dryer too long—than it wound up for auction, finally ending in a sale on Feb. 22.",
          "link": "https://defector.com/wemby-jersey-auction-dispute",
          "publishedOn": "2025-03-02T19:38:08.000Z",
          "wordCount": 6915,
          "title": "Maybe Trading Childhood Memories For Profit Is Not A Market Advantage",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2190095682.jpg"
        },
        {
          "id": "https://defector.com/?p=182806",
          "author": "Kelsey McKinney",
          "description": "I was in Chicago for a book event this weekend with some time on my hands in the space between doing some publicity things and preparing for an event. After stopping for Cuban sandwiches with my publicist Brittani, we decided to pop into the Art Institute of Chicago for a hot second.\nMost museums are very large. There are so many things in there, and most of them you won't care about at all. Many people view excursions to see art as a chore that must be completed the way homework must be completed. You have to see everything. You have to read all the plaques. You have to appreciate that which you do not and cannot understand. This, I think, is stupid.",
          "link": "https://defector.com/you-dont-have-to-see-everything-in-the-museum",
          "publishedOn": "2025-03-02T18:23:21.000Z",
          "wordCount": 7846,
          "title": "You Don’t Have To See Everything In The Museum",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/default.jpg"
        },
        {
          "id": "https://defector.com/?p=182748",
          "author": "Giri Nathan",
          "description": "National radio host and beleaguered basketball coach Doug Gottlieb is living a life full of grim men's evenings, based on two well-written profiles published recently.",
          "link": "https://defector.com/doug-gottlieb-is-immersed-in-the-grim-mens-lifestyle",
          "publishedOn": "2025-02-28T19:50:37.000Z",
          "wordCount": 6618,
          "title": "Doug Gottlieb Is Immersed In The Grim Men’s Lifestyle",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-2186113817.jpg"
        },
        {
          "id": "https://defector.com/?p=182768",
          "author": "Brandy Jensen",
          "description": "This week we're running a small package of essays on the topic of nuisances. Why? That's an annoying question.",
          "link": "https://defector.com/i-will-take-an-annoying-world-over-a-sterile-one",
          "publishedOn": "2025-02-28T19:26:52.000Z",
          "wordCount": 6716,
          "title": "I Will Take An Annoying World Over A Sterile One",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-879714038-1.jpg"
        },
        {
          "id": "https://defector.com/?p=182750",
          "author": "Abigail Segel",
          "description": "In January, Emma Hayes called in 50 players to train with the USWNT. Twenty-six were with the senior national team, and the rest were part of a Futures camp, which was meant to develop and scout young prospects. It was all part of Hayes’s mission to revamp the American women’s soccer system at all levels. Since then, she’s laid out a far-reaching plan that details how she hopes to push the American soccer world to reframe its goals from matching the men’s game to doing instead whatever is best for female players specifically. The effects of that blueprint, or “The WNT Way” as she calls it, will only be evident years down the line. But where Hayes does have total control, and where results are more prompt, is with the senior national team. Most immediately, she would have to select a 23-player roster for the SheBelieves Cup.\nU.S. Soccer created the poorly named tournament in 2016 as an alternative to the Algarve Cup. It’s not a tournament that means much on its face, other than being a guaranteed three games against strong opposition at a regular lull in the international soccer calendar. With more than two years to go before the next major tournament, this SheBelieves Cup provided a good opportunity for the USWNT to tinker with its roster and tactics.",
          "link": "https://defector.com/emma-hayes-shows-us-the-uswnt-she-believes-in",
          "publishedOn": "2025-02-28T18:28:17.000Z",
          "wordCount": 11770,
          "title": "Emma Hayes Shows Us The USWNT She Believes In",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-2201564768.jpg"
        },
        {
          "id": "https://defector.com/?p=182714",
          "author": "Dave McKenna",
          "description": "The top public school boys basketball program in Prince George’s County, Md., which by any objective measure (or if you just ask me) is the best basketball county in the country, went 0-20 this season. Or anyway the official record book says so now, thanks to punishments doled out in yet another high school sports cheating scandal.",
          "link": "https://defector.com/maryland-high-school-boys-basketball-scandal",
          "publishedOn": "2025-02-28T18:02:58.000Z",
          "wordCount": 7297,
          "title": "High School Basketball Team Forfeits Season Over Violation, Is Still Eligible For State Championship",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/louis-wilson-pg-county.jpg"
        },
        {
          "id": "https://defector.com/?p=182725",
          "author": "Israel Daramola",
          "description": "The Magic are a fun, flawed team. Evidence of both attributes could be seen on Thursday night, when, after leading by 17 at one point in a game against Golden State, Orlando looked poised for a statement win against a surging Warriors squad. But God had other plans, and by God I mean the 6-foot-2 demon with No. 30 on his chest who goes by the name Steph Curry.\nCurry scored a personal season-high 56 points on 16-of-25 shooting, 12 of those makes coming from three-point range. He hit one shot from well behind the half-court line shot to end the first half, and scored 22 points in the third quarter alone, outscoring the entire Magic team in that period. Whether it's invigoration from the arrival of Jimmy Butler (the Warriors have won seven of their last eight), or if he just had the juice flowing last night, Curry put on a prime performance, the likes of which we haven't often seen from him this year. The Warriors needed every bit of it to overcome Butler's off night and the aforementioned double-digit deficit.",
          "link": "https://defector.com/steph-curry-still-has-the-nuclear-button",
          "publishedOn": "2025-02-28T17:34:51.000Z",
          "wordCount": 6102,
          "title": "Steph Curry Still Has The Nuclear Button",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-2202407292.jpg"
        },
        {
          "id": "https://defector.com/?p=182730",
          "author": "Matene Toure",
          "description": "While Emilia Perez star Karla Sofía Gascón’s racist tweets, and blackface allegations related to I’m Still Here lead actress Fernanda Torres have been grabbing headlines, the more overlooked 2025 Oscars scandal continues to be egregious nomination snubs for Black-led performances. The most notable omissions were Marianne Jean-Baptiste for Mike Leigh’s Hard Truths, Danielle Deadwyler for Malcolm Washington’s The Piano Lesson, Clarence Maclin for Greg Kwedar’s Sing Sing, and Aunjanue Ellis-Taylor for RaMell Ross’s Nickel Boys. And while Nickel Boys did receive Best Picture and Adapted Screenplay nominations, the most baffling Oscar oversights were in the technical categories: Jomo Fray for Nickel Boys' cinematography and RaMell Ross for directing and film editing. Nickel Boys is a masterpiece, and it’s here where the film is the most experimental, inventive, and alive to the possibilities of cinema. \nRoss's 2018 debut feature, the unconventional, Oscar-nominated documentary, Hale County This Morning, This Evening, follows the life of two Black high school students from Hale County, Ala., where the documentarian and visual artist spent five years immersed in the rural Black communities as a photography teacher, capturing footage. The film bends time and linearity to craft a communal tapestry of the banality and nuance of life in the Black Belt region, as well as early Black cinema (e.g., Lime Kiln Club Field Day). Ultimately, what emerges is what Ross names his “source code” for the recordkeeping of Black southern life liberated from the dominant ways of seeing. Ross’s second feature builds upon the “empowered black data” laid forth in the contemporary through Hale County to attend to the forgotten Black boys of the Jim Crow South and its afterlives.",
          "link": "https://defector.com/nickel-boys-deserves-best-picture",
          "publishedOn": "2025-02-28T16:40:39.000Z",
          "wordCount": 9583,
          "title": "‘Nickel Boys’ Deserves Best Picture",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/nickelboys_050c0d.jpg"
        },
        {
          "id": "https://defector.com/?p=182571",
          "author": "Sabrina Imbler",
          "description": "The clownfish spawn in the anemone, and their feces fertilize their host with ammonia. The fish also aerate the anemone at night, offering their hosts fresh oxygen. They remove waste and other unwanted materials. And in certain situations, they deliver tasty meals right to the anemone's door.",
          "link": "https://defector.com/clownfish-fatten-up-their-best-buddies-to-upgrade-their-homes",
          "publishedOn": "2025-02-28T15:58:05.000Z",
          "wordCount": 6895,
          "title": "Clownfish Fatten Up Their Best Buddies To Upgrade Their Homes",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/Pez_payaso_de_cola_amarilla_Amphiprion_clarkii_en_una_anemona_burbuja_Entacmaea_quadricolor_islas_Ad_Dimaniyat_Oman_2024-08-16_DD_27.jpg"
        },
        {
          "id": "https://defector.com/?p=182652",
          "author": "Dennis M. Hogan",
          "description": "In a presidential administration with an unlimited capacity for chaos, colleges and universities have become targets of this early phase of right-wing assault. This is not so surprising: Many of the key political threads that comprise today’s Trumpism share an opposition to the academy and all it represents. Chris Rufo has presided over the dismantling of New College of Florida and succeeded in smuggling his bespoke interpretations of concepts like “DEI” and “critical race theory” into state law and now federal policy. JD Vance has appeared at gatherings of national conservatives to say that “professors are the enemy.”\nTrump’s newest allies in Silicon Valley may worship a narrow idea of intelligence, but they view the long apprenticeship, not to mention the still-broad education required of the traditional college student, as a waste of time. And then there is Trump’s traditional base, which splits decisively along educational lines: educational attainment now reliably predicts support for the Democratic Party. Trump, for his part, has said that he loves “the poorly educated”—and they love him back! From another quarter, the battle is joined by MAHA types, COVID skeptics, and Big Pharma truthers who see the country’s medical research apparatus as a machine for laundering money into dubiously valuable experiments that make Americans sicker and the pharmaceutical companies that sell medical remedies richer. What Americans really need, in their view, is raw milk, beef tallow, and a few weeks on the happy farm.",
          "link": "https://defector.com/the-nih-cuts-are-part-of-an-all-out-war-on-higher-education",
          "publishedOn": "2025-02-28T15:28:48.000Z",
          "wordCount": 11232,
          "title": "The NIH Cuts Are Part Of An All-Out War On Higher Education",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/uchicago-getty-image.jpg"
        },
        {
          "id": "https://defector.com/?p=182304",
          "author": "Dan McQuade",
          "description": "Ali's stint in a Miami jail was also part of a promotion for his new hamburger joint, Champburger, which was set to open its first location at the end of the the month. “To his credit,” the Miami Herald’s Ray Crawford wrote, “he didn’t try to snow the press. He admitted he was looking for publicity.” Indeed, Ali was quite direct: “My main reason for coming here is to open our new Champburger headquarters here.”",
          "link": "https://defector.com/the-tale-of-the-early-round-ko-of-muhammad-alis-champburger",
          "publishedOn": "2025-02-28T14:58:59.000Z",
          "wordCount": 15974,
          "title": "The Tale Of The Early-Round KO Of Muhammad Ali’s Champburger",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/champburger-ali-collage.jpg"
        },
        {
          "id": "https://defector.com/?p=178653",
          "author": "Barry Petchesky",
          "description": "Pay attention to the things around you! Be aware of the space you take up, and the space other people take up, and when those two things might come into conflict!",
          "link": "https://defector.com/there-are-other-people-in-the-world",
          "publishedOn": "2025-02-28T14:21:17.000Z",
          "wordCount": 6919,
          "title": "There Are Other People In The World",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/01/GettyImages-200273236-001.jpg"
        },
        {
          "id": "https://defector.com/?p=182604",
          "author": "Giri Nathan",
          "description": "To a casual fan who might enjoy Wimbledon and the U.S. Open, it isn’t obvious that the sport is also happening in the intervening months, all year long, or that those intervening tournaments are operated by the WTA. That’s the essential challenge of trying to sell the WTA: crafting a coherent identity for a highly decentralized game played by solitary athletes locked in zero-sum competition.",
          "link": "https://defector.com/with-everyone-watching-womens-sports-the-wta-tries-another-rebrand",
          "publishedOn": "2025-02-27T22:01:00.000Z",
          "wordCount": 10587,
          "title": "With Everyone Watching Women’s Sports, The WTA Tries Another Rebrand",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/wta-logo.jpg"
        },
        {
          "id": "https://defector.com/?p=182601",
          "author": "David Roth",
          "description": "Much of the fun of talking to an expert comes in finding out how much more they know about that subject than you do. That gap, for better and worse, is also where the terror of it resides. If I had my way, I would simply say \"what even is this thing?\" and then sit there criss-cross-applesauce for an hour while having it explained to me. But on a podcast, everybody has to talk.\nThis was what I worried about when we had on Nathan Grayson, our old GMG coworker, Aftermath co-founder, and author of the new book Stream Big: The Triumphs and Turmoils of Twitch and the Stars Behind the Screen to talk about that embattled, huge-but-not-profitable streaming platform. I find Twitch fascinating, but I am not a Man Of Game, and I am old, and I know astonishingly little about this particular economy; Drew, by his own admission, knows even less. I was worried that I wouldn't even know enough to get to the interesting stuff.",
          "link": "https://defector.com/streams-and-nightmares-with-nathan-grayson",
          "publishedOn": "2025-02-27T21:47:55.000Z",
          "wordCount": 6761,
          "title": "Streams And Nightmares, With Nathan Grayson",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-2173412476.jpg"
        },
        {
          "id": "https://defector.com/?p=182647",
          "author": "Defector Staff",
          "description": "Hello! We're trying an innovative flavoring behavior in the staff chat genre. Ask us questions about movies, new or old, in the comments below.",
          "link": "https://defector.com/lights-camera-staff-chat-lets-talk-movies",
          "publishedOn": "2025-02-27T20:00:00.000Z",
          "wordCount": 4612,
          "title": "Lights, Camera, Staff Chat! Let’s Talk Movies.",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-517292720.jpg"
        },
        {
          "id": "https://defector.com/?p=182164",
          "author": "Billy Haisley",
          "description": "For a team that scores goals by the bucketful, it's interesting that Barcelona's game is designed first and foremost around the pass. It's not that the squad doesn't have finishers: Old Man Robert Lewandowski remains a (silver) fox in the box; Ferran Torres, Fermín López, and Dani Olmo all, as they say, have goals in them; and, by some sort of arcane ethno-numerological magic, Barça's current Brazilian No. 11, Raphinha, has this year transformed into Barça's former Brazilian No. 11, Rivaldo. But the three players who form Barça's foundation in this unexpectedly amazing season are Pau Cubarsí, Lamine Yamal, and Pedri. And each of them individually, and therefore the team collectively, is defined by their genius for passing.\nLamine's passing is naturally the showiest. Of all the skills that make up the teenager's world-class present and his limitless future potential, it's his gift for the final ball that stands out as the most differential today. At just 17 years old he already has a trademark move, the trivela pass, one of the most difficult and visually arresting techniques in the game. Cubarsí's passing is maybe the most readily identifiable. There are passes he hits—be they bombs over the top of the opposition back line, jackknifed balls that cut through tiny crevices to find teammates between enemy lines, or disguised ones that his body shapes toward one direction until at the last second he swivels his action-figure hips and sends them off at a completely different angle—that look more like what a Pirlo-style midfielder might try than a central defender. There's genuinely no other center back right now who's executing complicated passes like Cubarsí, who is himself only 18 years old. But while those two certainly play a major role in forming the team's style, the true orchestrator of all the pretty little passes that bypass pressure, unbuckle defenses, and tee up Lewandowski and Raphinha and the rest for the goals that have made Barça one of the two standout teams in Europe this season, is Pedri.",
          "link": "https://defector.com/pedris-got-the-whole-world-at-his-feet",
          "publishedOn": "2025-02-27T18:55:50.000Z",
          "wordCount": 9969,
          "title": "Pedri’s Got The Whole World At His Feet",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-2202247074.jpg"
        },
        {
          "id": "https://defector.com/?p=182614",
          "author": "Ray Ratto",
          "description": "Nuisance takes multiple forms and thrives in almost any environment, which is why it is like kudzu. But all of it has a unifying basic structure: It lures the targeted victim into thinking about the nuisance itself. The solution is in deciding to reject the initial lure.",
          "link": "https://defector.com/nuisance-is-that-which-you-cannot-escape",
          "publishedOn": "2025-02-27T18:14:14.000Z",
          "wordCount": 6924,
          "title": "Nuisance Is That Which You Cannot Escape",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-2193579536.jpg"
        },
        {
          "id": "https://defector.com/?p=181909",
          "author": "Becky Ferreira",
          "description": "These three competitors demonstrate intelligence, cosmopolitan distribution, an aptitude for survival, and near-human levels of cheeky boldness. They are already eating our lunch—both metaphorically and literally, in some cases. To confirm or refute this hypothesis, I asked smart people with expertise on rats, raccoons, gulls, and evolutionary transitions to vet my candidates—as well as the premise of the thought experiment.",
          "link": "https://defector.com/which-pests-shall-inherit-the-earth",
          "publishedOn": "2025-02-27T16:25:06.000Z",
          "wordCount": 10104,
          "title": "Which Pests Shall Inherit The Earth?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-979698686-e1740000772792.jpg"
        },
        {
          "id": "https://defector.com/?p=181886",
          "author": "Sarah Brouillette",
          "description": "Readers of young adult fiction, who have long been drawn to stories that combine relatable characters and fantastical elements (think Twilight or The Hunger Games), have been aging into new reading levels and more adult content. Enter Romantasy, which combines romance and fantasy elements. It is currently one of the fastest growing publishing genres and a “massive focus” for TikTok fandoms. No small part of the popularity of Romantasy is owing to the fact that the genre has associations beyond its mix of romance plots with otherworldly imaginative settings and characters. These associations are … sexual. Romantasy usually has what fans call “spice.” Readers can expect detailed, extended, and—naturally—extraordinary sex scenes. Extraordinary how, exactly?\nA remarkable range of popular contemporary romantasy series feature relationships between human women and non-human males, from dragons to mermen. There is Sarah J. Maas’s A Court of Thorns and Roses and its sequels, in which women commingle with immortal faeries; Carissa Broadbent’s The Serpent and the Wings of Night, featuring a female protagonist who is the only human daughter of a vampire king, or Tentacle Entanglement, a “monster mates” book by “Siggy Shade,” the title of which tells you what you need to know. Often these relationships involve “fated mates,” with the males unable to escape an exorable drive to love the women with the utmost passionate devotion. All of these are huge on BookTok. What is the appeal of these novels, and why do they seem to be proliferating now?",
          "link": "https://defector.com/alien-pleasures",
          "publishedOn": "2025-02-27T14:46:45.000Z",
          "wordCount": 10757,
          "title": "Alien Pleasures",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/romance-books-collage.jpg"
        },
        {
          "id": "https://defector.com/?p=182499",
          "author": "Lauren Theisen",
          "description": "I love when a team has distinct flaws but isn't irredeemable. It's one of my favorite things in sports, actually—that extended fight to minimize weaknesses and maximize strengths in a journey from \"slightly below average\" to \"slightly above average.\" I don't want a perfect protagonist. The work that goes into moderate improvement is what satisfies me. For that reason, we turn our attention to the Emma Woodhouses of the NHL.\nAfter the extended 4 Nations break, it's a bit of a jolt to realize that so many teams are suddenly back to high-stakes action on a schedule that feels pretty scrunched. Out in the West, six playoff spots read as extremely secure, while the remaining two look like a battle among Colorado, Calgary, and Vancouver, with perhaps Utah as a dark horse. I want to focus on the East, however, because that's where the drama already has me biting my nails. Six teams are reasonably comfortable, but below them, we've got five squads auditioning for the two wild card roles. Three of these teams would see a playoff berth as a relieving breakthrough after a long struggle; the other two would be severely disappointed in themselves if they let this year go to waste. Here is a quick guide to them all, starting with seventh place and working our way down.",
          "link": "https://defector.com/a-quick-and-dirty-guide-to-the-eastern-conference-wild-card",
          "publishedOn": "2025-02-27T14:16:55.000Z",
          "wordCount": 9086,
          "title": "A Quick And Dirty Guide To The Eastern Conference Wild Card",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-2194262968.jpg"
        },
        {
          "id": "https://defector.com/?p=182503",
          "author": "Drew Magary",
          "description": "It’s so much easier being a tourist when you’re alone. I have touristed my way around many cities with my wife and children in tow, which meant negotiating air travel, hotel reservations, restaurant reservations, museum reservations, shopping excursions, and every other tourist chore with their needs in mind. Truly exhausting shit. This explains why I’m the sort of person who treats business travel as a meditative experience. When I’m off the clock in any new city, I take full advantage. I go where I want. I see what I want. And, most vital, I eat what I want.\nWhich brings us to Pittsburgh. I was in the Steel City for my first time, on a super top secret assignment for Defector Media. I was told by people I trusted that, despite the presence of multiple Steelers fans, Pittsburgh is a surprisingly cool place to hang. They were right. The city’s downtown is alive. The Pirates ballpark is so perfectly situated along the banks of the Allegheny River that the home team doesn’t even have to win to give you your money’s worth (and it doesn’t). And the Andy Warhol Museum contains some of the most arresting works of art I’ve ever had the pleasure of beholding. One of my favorite pieces inside of it was the one that Warhol and his friends pissed on.",
          "link": "https://defector.com/primanti-bros-the-defector-review",
          "publishedOn": "2025-02-26T19:15:04.000Z",
          "wordCount": 8105,
          "title": "Primanti Bros.: The Defector Review",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/Sandwich.jpeg"
        },
        {
          "id": "https://defector.com/?p=182453",
          "author": "Patrick Redford",
          "description": "One of my brightest childhood memories was experiencing the Grand Canyon of the Yellowstone for the first time. My mom spent a few summers working in a cafeteria at Mammoth Hot Springs by the north entrance, so she knew the park well enough to have me and my brother look down at our feet through the short hike to the observation platform. She knew that the experience of all that empty air and angry water was one worth having as suddenly and forcefully as possible. I remember distinctly how small it made me feel, how awestruck I was that it was merely a grand canyon, not even one to merit the definite article. It is important to feel small, overjoyed, or fascinated by the outdoors, and to learn about the world and one's place in it through those feelings.\nEight decades into the gradual privatization of once-public postwar spoils, and despite climate change frenzying the competition for land, more than a third of the land in the United States is administered by federal agencies, mostly the Bureau of Land Management and the Forest Service. The vast majority of this land is west of the Rockies, in areas of low population density on the old American frontier. That includes almost two-thirds of Nevada (and my namesake I-80 exit); the second-largest desert preserve in the world; and the highest and lowest points in the continental United States, which are separated by less than 100 miles' worth of one of the most beautiful regions of California. These lands are the only parts of the country that both are for everyone and whose chief utility is, well, nothing. You can camp for 14 nights without a permit on most BLM land. There are economies built around them—tourism and all manner of gear companies—though the land itself is only faintly capitalized by private industry. Logging companies do harvest a bit of timber from Forest Service land, and there's some agriculture, but only enough to underscore how much of it is just kind of sitting there. That is to say: Most of the land is administered as if it's useless.",
          "link": "https://defector.com/what-are-public-lands-for",
          "publishedOn": "2025-02-26T18:08:47.000Z",
          "wordCount": 9939,
          "title": "What Are Public Lands For?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/yellowstone.jpeg"
        },
        {
          "id": "https://defector.com/?p=182460",
          "author": "Rachelle Hampton",
          "description": "David Roth: I will start by saying something nice about Parable Of The Sower, which is that it really is as prescient as advertised. So much so, in fact, that I found it pretty punishing to read. I wasn’t expecting escapism, obviously, but I found it difficult at times to appreciate how well Octavia E. Butler anticipated what America would be like after three decades of social and political atrophy, from my vantage point here in the future that she anticipated.\nBrandy Jensen: I have to say, this was not exactly a pleasant reading experience for me.",
          "link": "https://defector.com/octavia-e-butlers-parable-of-the-sower-confronts-what-comes-after-the-end",
          "publishedOn": "2025-02-26T17:43:16.000Z",
          "wordCount": 12604,
          "title": "Octavia E. Butler’s ‘Parable Of The Sower’ Confronts What Comes After The End",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-2152785226.jpg"
        },
        {
          "id": "https://defector.com/?p=182466",
          "author": "Giri Nathan",
          "description": "After having triumphed at every level of competition, from college to the WNBA to international play, Diana Taurasi is ending one of the best basketball careers ever.",
          "link": "https://defector.com/diana-taurasi-retires-after-winning-everything-there-is-to-win",
          "publishedOn": "2025-02-26T16:53:14.000Z",
          "wordCount": 5879,
          "title": "Diana Taurasi Retires After Winning Everything There Is To Win",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-2166368978.jpg"
        },
        {
          "id": "https://defector.com/?p=181836",
          "author": "Alex Sujong Laughlin",
          "description": "This week we're running a small package of essays on the topic of nuisances. Why? That's an annoying question.",
          "link": "https://defector.com/an-interview-with-my-cat-about-his-most-annoying-behaviors",
          "publishedOn": "2025-02-26T15:35:10.000Z",
          "wordCount": 8047,
          "title": "An Interview With My Cat About His Most Annoying Behaviors",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/IMG_3469.jpg"
        },
        {
          "id": "https://defector.com/?p=182297",
          "author": "Sabrina Imbler",
          "description": "While reading a series of titles of new scientific papers, I came across an unnatural series of words: Innovative Flavoring Behavior. The phrase sounded alienating, like the impossible promise of some doomed startup or the way Meta might refer to the advent of tongues. But these words appeared, in this order, in a report recently published in the journal Current Biology titled \"Innovative flavoring behavior in Goffin’s cockatoos,\" which only made me feel intrigued. A cockatoo innovation, you say? Regarding flavoring? Tell me more!\nAs I read the abstract, I realized that the key innovation of this new paper was innovated by nine cockatoos, all of whom had learned to drag a noodle through a puddle of blueberry-flavored soy yogurt. The innovation, the researchers contend, is not the daring idea of creamy blueberry noodles—although this seemed the most radical recipe I'd encountered in years—but rather the flavoring behavior itself, which is rare in the animal kingdom.",
          "link": "https://defector.com/i-tried-a-cockatoos-innovative-new-snack",
          "publishedOn": "2025-02-26T15:05:39.000Z",
          "wordCount": 8713,
          "title": "I Tried A Cockatoo’s Innovative New Snack",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/Screenshot-2025-02-25-at-1.38.20 PM.jpg"
        },
        {
          "id": "https://defector.com/?p=182495",
          "author": "Chris Thompson",
          "description": "The Los Angeles Lakers eked out a win Tuesday night over the visiting Dallas Mavericks, 107–99. The win keeps the rising Lakers a scant few percentage points up on the Houston Rockets for the West's fourth seed; the loss leaves Dallas perilously close to the bottom of the conference play-in. Neither team will have to scrounge around too desperately for encouragement: The Lakers played choppy, underwhelming basketball, but got the hero stuff they needed from their best guys and eventually took care of business; the Mavericks looked sharper and better organized but were handicapped by injuries and doomed by an off-shooting night. In basketball terms, this was not a memorable game, just one of those February work-nights where no one has it going but someone has to win.\nBecause it was the first contest between these two teams since the Luka Doncic trade, assessing it solely in basketball terms misses quite a lot of context. \"It was just a lot of emotions and not much sleep,\" said a wrung-out and relieved Doncic, who had an off night despite posting a triple-double. \"It was a different game ... I'm just glad it's over, honestly.\" Tension was high, at least in the early going: Doncic picked up a technical foul in the game's third minute for objecting to a swallowed whistle. Later in the quarter, when he bombed home a deep three-pointer and turned to glare at Dallas's bench, television cameras picked up several of his former teammates grinning and laughing in what appeared to be sincere appreciation. They're bigger men—literally and figuratively—than I: Being mean-mugged by a former colleague for an unpopular decision made by management would cause me to boil with indignation; if Tom Ley trades Luis Paez-Pumar to Wired, Luis had better direct his vengeful showboating at Tom damn Ley, or summon a competent second and face me in a duel at sunrise! I will have satisfaction, by God.",
          "link": "https://defector.com/luka-doncic-rubs-the-mavericks-noses-in-their-own-mess",
          "publishedOn": "2025-02-26T14:30:06.000Z",
          "wordCount": 8063,
          "title": "Luka Doncic Rubs The Mavericks’ Noses In Their Own Mess",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-2201427553.jpg"
        },
        {
          "id": "https://defector.com/?p=182418",
          "author": "Alex Sujong Laughlin",
          "description": "When researchers look at what effects astronauts could face on long-term missions, exploring Mars or beyond, one thing they tend to focus on something called the \"third-quarter\" effect. It's a sports-y sounding name for something we all might be familiar with, that feeling when morale tends to hit a low point in the third quarter of long missions. It makes sense that the middle is always the roughest time. The beginning and end benefit from excitement, either from just beginning or from being almost done. Right in the middle of a process is usually where morale sags the most, so if you can get through that period, things will almost certainly start to feel better. \nWe are smack dab in the middle of the third quarter of The Artist's Way, and morale is sagging, predictably. Luckily we are not astronauts and can blog from right here on Earth. If you're following along with us, maybe you're feeling the drag too. The good news is that the fourth quarter is in sight.",
          "link": "https://defector.com/the-artists-way-week-7-the-third-quarter-slump",
          "publishedOn": "2025-02-25T20:58:47.000Z",
          "wordCount": 11671,
          "title": "‘The Artist’s Way’ Week 7: The Third-Quarter Slump",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-1147637128-e1740517040935.jpg"
        },
        {
          "id": "https://defector.com/?p=182422",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about whisks, comedy karaoke, the Chicago Bulls, and more.\nYour letters:",
          "link": "https://defector.com/lets-remember-some-toys",
          "publishedOn": "2025-02-25T18:41:16.000Z",
          "wordCount": 16666,
          "title": "Let’s Remember Some Toys",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-542241040.jpg"
        },
        {
          "id": "https://defector.com/?p=182313",
          "author": "Patrick Redford",
          "description": "The Oklahoma City Thunder just split two games in two days against the Minnesota Timberwolves. Shai Gilgeous-Alexander was incredible in both, notching 76 total points, 18 rebounds, and 16 assists. If you wanted to understand what makes SGA so good and cool, Sunday night's 130-123 gem was the ideal one-game sample; if you want to understand why he matters so much and why the largely untouchable Thunder still face so many big questions, Monday night's horrific loss was equally instructive.\nSo much of what makes the Thunder special is collective: their heat-seeking defense, unmatchable depth, team-wide shooting. As team setups go, having a dozen players who can defend as if armed and who generally play basketball at what appears to be 1.25x speed is certainly more unusual and interesting than surrounding one or two superstars with a roster purpose-built to their talents. The Thunder's formula does, however, rely on a number of stylistic hallmarks that tend to be marginalized by the differences between regular and postseason hoops. Can they still force turnovers on like every third possession in the playoffs? Will their depth really matter when they have to play against opposing rotations stripped of all their weak players?",
          "link": "https://defector.com/the-thunder-need-shai-gilgeous-alexanders-greatness-to-be-enough",
          "publishedOn": "2025-02-25T16:09:20.000Z",
          "wordCount": 7766,
          "title": "The Thunder Need Shai Gilgeous-Alexander’s Greatness To Be Enough",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-2201385176.jpg"
        },
        {
          "id": "https://defector.com/?p=182074",
          "author": "Samer Kalaf",
          "description": "In his own words, Pankaj Mishra wrote his latest book not to describe the atrocities in Gaza, which have been well documented, but \"to ask some very basic questions: How can human beings treat other human beings this way? And to also ask people today, or readers today: How can we allow this to happen? How could we allow something like Gaza to happen?\"\nThe World After Gaza, based off Mishra's 2024 essay for the London Review of Books, uses the historical context following World War II to deliver a meaningful reminder: The West did not welcome Holocaust survivors with open arms. In fact, the global powers treated them as a nuisance and looked to relocate them elsewhere. The current-day narrative, that the West immediately recognized the Holocaust was an atrocity, is a comforting fiction. As is, Mishra argues, the idea that the international standard of laws and norms set in 1945 can remain legitimate after having been abandoned in service to Israeli objectives.",
          "link": "https://defector.com/the-world-after-gaza-pankaj-mishra-interview",
          "publishedOn": "2025-02-25T15:24:31.000Z",
          "wordCount": 16560,
          "title": "Pankaj Mishra On Gaza, The Memory Of The Holocaust, And The “Very Dark World” To Come",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-2196849294.jpg"
        },
        {
          "id": "https://defector.com/?p=182310",
          "author": "Israel Daramola",
          "description": "In 2016, when Donald Trump was elected president the first time, people felt scared but also called to action. Protests began instantly, starting literally the day after the election. People were hyper aware of Trump's attempts to lie to the public, were vigilant about his racist, xenophobic, homophobic, and sexist policies, and were vocal in their opposition throughout his term in office. Within that storm of dissent, rap music echoed its revolutionary past by sounding off against Trump. Artists like Snoop Dogg and Jay-Z voiced their anger. Acts like A Tribe Called Quest and YG wrote protest songs. Any given verse of the era was likely to include at least one stray line aimed at the president; my personal favorite was Young Thug's \"I'll slap the shit out Donald Trump any day\" on Swae Lee's \"Offshore.\"\nThis seemed to genuinely bother Trump. Trump had long been a folk hero for rappers, as rappers have a tendency to be our most vocal champions of ruthless capitalism. Trump's combination of wealth, outsized bravado, attention-hungry charisma, and over-the-top egomania put him on similar terms with Ric Flair and Tony Montana, two characters who are also exalted in rap songs. Plenty of rappers never bought into his persona certainly, but he was a source of inspiration for many, as proven by how often he was name-checked. Rappers turning on him had to feel like a betrayal to a creature as vain as Trump.",
          "link": "https://defector.com/how-donald-trump-won-rap-back",
          "publishedOn": "2025-02-25T15:07:51.000Z",
          "wordCount": 8003,
          "title": "How Donald Trump Won Rap Back",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-1059657306.jpg"
        },
        {
          "id": "https://defector.com/?p=182280",
          "author": "Tom Ley",
          "description": "This week we're running a small package of essays on the topic of nuisances. Why? That's an annoying question.",
          "link": "https://defector.com/the-cranks-next-door",
          "publishedOn": "2025-02-25T14:39:50.000Z",
          "wordCount": 8532,
          "title": "The Cranks Next Door",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/IMG_7399.jpg"
        },
        {
          "id": "https://defector.com/?p=181677",
          "author": "Lauren Theisen",
          "description": "PITTSBURGH — I've known the names of hockey players for as long as I've known my own. I was lucky enough to be born in Michigan in 1995, just before the Red Wings restored their old glory with back-to-back Stanley Cup wins, and the state's enthusiasm for that team implanted in me a love for the sport that's inextricable from my sense of self. There's video evidence to prove this—me sitting on the floor, lording over a rink symbolized by an oval-shaped train track, using blocks as players while I played PA announcer for an imaginary game at Joe Louis Arena. When I was a few years older, I remember making use of a big, bench-like windowsill at the front of our house, orchestrating games with action figures of guys like Brendan Shanahan, Sergei Fedorov, Paul Kariya, and Peter Forsberg. In the basement, I'd watch VHS recaps of the Wings' '98 Cup triumph, or a compilation of interviews and player profiles for stars like Chris Chelios and Pavel Bure.\nWhat all those players had in common, from my perspective, was that they were established greats, and my knowledge had to catch up to their careers. But that all changed in 2005, when a pair of heavily hyped young prospects each made their debut in the aftermath of a season-cancelling lockout. Alex Ovechkin, first overall in 2004, and Sidney Crosby, picked No. 1 in 2005, were the future. They were the first NHLers I was conscious of knowing before they were actually in the NHL. And as their careers inch closer to the finish line, and I creep closer to my 30th birthday, I'm extra aware of the conduit that these two provide to the person I was two decades ago. I watched them excel then as I do now, but on Saturday, I saw them both play live for the very first time.",
          "link": "https://defector.com/a-pittsburgh-pilgrimage",
          "publishedOn": "2025-02-25T14:07:15.000Z",
          "wordCount": 13141,
          "title": "A Pittsburgh Pilgrimage",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-632957162.jpg"
        },
        {
          "id": "https://defector.com/?p=182281",
          "author": "Luis Paez-Pumar",
          "description": "After 26 matchdays, the Premier League goalscoring leaderboard looks quite familiar. At the top is Mohamed Salah, Liverpool's star winger who is in the midst of what could wind up being the best attacking season in league history, with 25 goals and 16 assists while still in February. Next comes Erling Haaland, who has been able to notch 19 goals despite some injury trouble and Manchester City's whole deal. But third is a bit of a surprise, if only because Newcastle United's Alexander Isak has put it all together to become (depending on how one feels about Haaland) arguably the best striker in the Premier League.\n\nhttps://www.youtube.com/watch?v=mfCf_VkJ8UA",
          "link": "https://defector.com/alexander-isak-has-reached-the-mountaintop",
          "publishedOn": "2025-02-24T20:26:19.000Z",
          "wordCount": 7690,
          "title": "Alexander Isak Has Reached The Mountaintop",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-2200964642.jpg"
        },
        {
          "id": "https://defector.com/?p=182269",
          "author": "Kelsey McKinney",
          "description": "Welcome to the Scorebug Snuggery, that place we all know of and recognize, where we discuss the artistic merit of scorebugs on sports television broadcasts. Today, we look at NBC Sports Philadelphia's new Phillies scorebug.\nBaseball is still waking up. The players at spring training do not even have names on the backs of their jerseys. They are here to earn that right.",
          "link": "https://defector.com/the-scorebug-snuggery-the-phillies-abandon-p00p",
          "publishedOn": "2025-02-24T19:14:00.000Z",
          "wordCount": 8602,
          "title": "The Scorebug Snuggery: The Phillies Abandon “P00P”",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/Screenshot-2025-02-24-at-11.11.21 AM.png"
        },
        {
          "id": "https://defector.com/?p=182293",
          "author": "Chris Thompson",
          "description": "Twice already this regular season the website Defector has posted blogs about how the horrid and miserable Philadelphia 76ers might be stabilizing and revving up for a charge up the standings. Ridiculous, foolish, irresponsible blog behavior. No more of this! The 76ers are cooked. A last-second bucket Saturday by Nic Claxton of the aimless Brooklyn Nets sent Philly to its seventh consecutive loss and ninth in 10 games, dropping them to a season-worst 16 games below .500. They now hold the 12th seed in the Eastern Conference, one game in the loss column out of the bottom of the play-in and a whopping 10.5 games from the sixth seed. Do not stop with a single fork: Empty your silverware drawer into a cannon, aim the cannon at their cowering forms, and fire away. It would be a mercy.\nIt is possible to drop a game to a bad team without necessarily being a very bad team yourself. The 76ers are very bad. Their core was in place Saturday and was roundly outplayed by the various fungible goobers presently filling out Brooklyn's rotation. Tyrese Maxey was his usual heroic self, but Paul George was in Tobias Harris mode, and Joel Embiid was history's saddest statue. Brooklyn led most of the way, and very comfortably through the middle quarters, until a spell of sloppy offense and a Philly rebounding edge allowed the otherwise punchless 76ers back into the game late. Notably, Embiid touched the court not at all in the fourth quarter, which head coach Nick Nurse chalked up unconvincingly to the chemistry of the lineup on the floor. To their credit, the 76ers played with spirit down the stretch, but they needed a pair of missed freebies to stay within a bucket, and the game-winner came on an embarrassingly anticlimactic put-back of what should've been an easy defensive rebound for George.",
          "link": "https://defector.com/the-grim-reaper-is-headed-to-philadelphia",
          "publishedOn": "2025-02-24T18:45:13.000Z",
          "wordCount": 7837,
          "title": "The Grim Reaper Is Headed To Philadelphia",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-2198414428.jpg"
        },
        {
          "id": "https://defector.com/?p=182196",
          "author": "Lauren Theisen",
          "description": "PITTSBURGH — I was a little surprised by the seriousness of The Andy Warhol Museum. For an artist I associate with playful experimentation, the seven-story building off the northwest bank of the Allegheny is more a tribute to the professionalism, work ethic, and marketing acumen that made Warhol the most recognizable artist of his era—or any that's come since. The layout is tightly chronological, with the four main floors each representing a decade in its patron saint's career. The information presented is devoid of tabloid gossip, keeping Warhol's international fame completely incidental to the narrative of his artistic output. And the only time I laughed out loud was at these deadpan info boxes next to Oxidation, which never break character even as they describe the process of creation through urination, and note ongoing study of the piss painting with a straight-faced \"Conservation Challenge.\"",
          "link": "https://defector.com/lost-at-the-warhol",
          "publishedOn": "2025-02-24T18:27:00.000Z",
          "wordCount": 8920,
          "title": "Lost At The Warhol",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/20250223_090307.jpg"
        },
        {
          "id": "https://defector.com/?p=182260",
          "author": "Dave McKenna",
          "description": "“Leave ‘em wanting more” is a good show biz tenet. So Dmitry Bivol vs. Artur Beterbiev was good show biz. And great boxing.\nBivol got a majority decision over the previously undefeated Beterbiev after 12 rounds of near-perfect punches from both on Saturday in Riyadh to capture the undisputed light heavyweight championship, meaning Bivol now has all the 175 lbs. belts that matter: WBA, WBC, IBF, WBO and The Ring. But more to the point: Damn, are these guys great.",
          "link": "https://defector.com/well-take-more-bivol-vs-beterbiev-less-of-everything-else",
          "publishedOn": "2025-02-24T17:58:07.000Z",
          "wordCount": 8514,
          "title": "We’ll Take More Bivol Vs. Beterbiev, Less Of Everything Else",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-2200687670.jpg"
        },
        {
          "id": "https://defector.com/?p=182273",
          "author": "Maitreyi Anantharaman",
          "description": "How about a crossword puzzle for a change of pace? This week's puzzle was constructed by Matt Forest, and edited by Hoang-Kim Vu. Matt is a Boise State alum and lifelong Broncos fan, who also makes crossword puzzles from time to time. Outside of the usual publications, he posts free indie puzzles at mattsword.com.\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE.",
          "link": "https://defector.com/the-crossword-feb-24-counter",
          "publishedOn": "2025-02-24T16:00:00.000Z",
          "wordCount": 4854,
          "title": "The Crossword, Feb. 24: Counter",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-2197307101.jpg"
        },
        {
          "id": "https://defector.com/?p=180429",
          "author": "Sabrina Imbler",
          "description": "This week we're running a small package of essays on the topic of nuisances. Why? That's an annoying question.",
          "link": "https://defector.com/the-year-of-no-dishwasher",
          "publishedOn": "2025-02-24T15:41:14.000Z",
          "wordCount": 9532,
          "title": "The Year Of No Dishwasher",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-1958135322.jpg"
        },
        {
          "id": "https://defector.com/?p=182254",
          "author": "Ray Ratto",
          "description": "Coaches and managers have a tenuous relationship with the veracity of the spoken word, which is to say that when they speak in public, they are generally either lying or setting up their next lie. Frankness rarely serves them well in any context, which is why they avoid it like a pair of anthrax-infused burlap compression shorts. Everything is a message meant for someone else—to confound or mislead opponents, to placate a dungheaded boss, to motivate a slothful player—and the public exists mostly as a conduit through which that message can find its intended target.\nAnd then there's Ruben Amorim, currently having his pants filled daily with red ants as the coach at Manchester United. He finds his inherited team perpetually irksome and clearly cannot wait for the offseason when he can remake it in his tactical image and likeness. This is not speculation, to be clear. It was obvious from the middle of January, when Amorim said this might be the worst Manchester United team of all time. I mean, that's prime talk show stuff right there, and until United either get better or fire him, it will have a resonance that rivals Bill Parcells' \"You are what your record says you are,\" or Jim Mora's \"Playoffs? Playoffs?\"",
          "link": "https://defector.com/does-manchester-united-exist-its-managers-answer-may-surprise-you",
          "publishedOn": "2025-02-24T15:22:43.000Z",
          "wordCount": 7472,
          "title": "Does Manchester United Exist? Its Manager’s Answer May Surprise You",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-2201306265.jpg"
        },
        {
          "id": "https://defector.com/?p=182263",
          "author": "Ray Ratto",
          "description": "Sunday was what the NBA should have advertised as its All-Star Weekend. Grizzlies-Cavaliers, Thunder-Timberwolves, Knicks-Celtics, even the we-don't-play-any-defense-here-either arcana of Pistons-Hawks—every game on the slate explained different chunks of the league's true future in ways that the reconstituted Lakers cannot.\nBut then what to do with the Golden State Warriors? They have become an entirely new thing in their six games with Jimmy Butler—please don't forget the III—and suddenly the tired old saying about the past being prelude to the future is ringing out in the most unexpected of places.",
          "link": "https://defector.com/the-warriors-might-be-onto-something",
          "publishedOn": "2025-02-24T14:33:38.000Z",
          "wordCount": 7022,
          "title": "The Warriors Might Be Onto Something",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/GettyImages-2201552451.jpg"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=843421",
          "author": "Steve Adams",
          "description": "The Royals showed interest in Starling Marte earlier in the offseason, per Joel Sherman of the New York Post. Those talks obviously didn’t produce a deal, but Sherman adds that Kansas City hasn’t completely closed the door on the possibility. There’s no indication talks are active, but it’s nevertheless notable that the Royals are still…",
          "link": "https://www.mlbtraderumors.com/2025/03/mets-trade-rumors-royals-starling-marte.html",
          "publishedOn": "2025-03-04T16:46:41.000Z",
          "wordCount": 4504,
          "title": "Mets, Royals Discussed Starling Marte Earlier This Offseason",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/03/starling-marte-mets-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=843397",
          "author": "Anthony Franco",
          "description": "Adam Duvall remains unsigned a few weeks into Spring Training. That was also the case last offseason. It wasn’t until March 14 that the veteran outfielder inked a $3MM contract with the Braves. Duvall is evidently seeking a similar or better deal this time around. Joel Sherman of The New York Post reports that the…",
          "link": "https://www.mlbtraderumors.com/2025/03/adam-duvall-seeking-3mm-in-free-agency.html",
          "publishedOn": "2025-03-04T01:42:28.000Z",
          "wordCount": 5713,
          "title": "Adam Duvall Seeking $3MM+ In Free Agency",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/03/USATSI_23833847-1024x682.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=843393",
          "author": "Darragh McDonald",
          "description": "The Royals announced that they will have a ceremony on May 31st to honor Mike Moustakas as he retires as a Royal. Presumably, he will sign a ceremonial one-day contract to retire with the club with whom he spent most of his career. Moustakas, now 36, was selected second overall in the 2007 draft. Taken…",
          "link": "https://www.mlbtraderumors.com/2025/03/mike-moustakas-to-retire.html",
          "publishedOn": "2025-03-03T23:40:49.000Z",
          "wordCount": 5335,
          "title": "Mike Moustakas To Retire",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2016/02/USATSI_8880053-1024x701.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=842980",
          "author": "Steve Adams",
          "description": "One of the most interesting elements of spring training every year, at least for those of us who feast on roster construction minutiae, is the collection of players who are out of minor league options. MLBTR just released a full list of such players earlier today. In many instances, a player being out of minor…",
          "link": "https://www.mlbtraderumors.com/2025/02/10-out-of-options-players-mlb-spring-training.html",
          "publishedOn": "2025-02-28T20:36:52.000Z",
          "wordCount": 3828,
          "title": "10 Out Of Options Players To Watch This Spring",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/02/Yoendrys_Gomez_Yankees-copy-2-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=842986",
          "author": "Anthony Franco",
          "description": "Lucas Erceg got his first legitimate run as a closer after the Royals acquired him from the A’s at last year’s deadline. The flamethrowing righty took to that role, working to a 2.88 earned run average while striking out 32% of opponents over 25 regular season innings. Erceg recorded 11 saves and six holds while…",
          "link": "https://www.mlbtraderumors.com/2025/02/royals-notes-erceg-massey-blanco.html",
          "publishedOn": "2025-02-27T05:53:48.000Z",
          "wordCount": 3222,
          "title": "Royals Notes: Erceg, Massey, Blanco",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/02/USATSI_24680193-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=842924",
          "author": "Steve Adams",
          "description": "Every offseason, the primary focus for baseball fans is on trades and free agent activity. Naturally, major league free agent signings garner the majority of the attention and generate the most buzz. Minor league signees come with less fanfare, typically with good reason. They tend to be older veterans who are looking to extend their…",
          "link": "https://www.mlbtraderumors.com/2025/02/salary-details-for-several-minor-league-deals.html",
          "publishedOn": "2025-02-26T18:32:46.000Z",
          "wordCount": 4116,
          "title": "Salary Details For Several Minor League Deals",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/02/jesse-chavez-rangers-1024x683.jpg"
        }
      ]
    },
    {
      "title": "Flaming Hydra",
      "feedUrl": "https://flaminghydra.com/rss/",
      "siteUrl": "https://flaminghydra.com/",
      "articles": [
        {
          "id": "67c77ff41901c800015de619",
          "author": "The Editors",
          "description": "A.J. Daulerio considers coaching, Anna Merlan watches bird watchers",
          "link": "https://flaminghydra.com/issue-269/",
          "publishedOn": "2025-03-04T23:24:20.000Z",
          "wordCount": 722,
          "title": "Ball leaguers / Bald eagles",
          "imageUrl": "https://flaminghydra.com/content/images/2025/03/original-edit-sepia-3.png"
        },
        {
          "id": "67c738c81901c800015de54a",
          "author": "A.J. Daulerio",
          "description": "by A.J. Daulerio\n\nLittle League 1989\nMy seven-year-old began Little League a few weeks ago, and even though the thought of him competing with anyone at this age infuriates me, I have made peace with the idea that maybe, perhaps, it is time he does realize that the world",
          "link": "https://flaminghydra.com/what-can-i-teach-these-young-boys/",
          "publishedOn": "2025-03-04T23:23:00.000Z",
          "wordCount": 760,
          "title": "What Can I Teach These Young Boys?",
          "imageUrl": "https://flaminghydra.com/content/images/2025/03/original-edit-sepia.png"
        },
        {
          "id": "67c7789e1901c800015de5e5",
          "author": "Anna Merlan",
          "description": "by Anna Merlan\nImage: Friends of Big Bear Valley\nFor the past few days, thousands of people have been watching a live camera aimed at a bald eagle nest in Big Bear Valley, California, where a mated pair named Jackie and Shadow are sitting on three eggs. While the nest",
          "link": "https://flaminghydra.com/pip-watch/",
          "publishedOn": "2025-03-04T23:22:30.000Z",
          "wordCount": 653,
          "title": "Pip Watch",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/03/eagle1-1.jpg"
        },
        {
          "id": "67c608c32412be0001c60579",
          "author": "The Editors",
          "description": "Brian Hioe on the #(*$&! geopolitics; a Brooklyn community gallery visit with David Moore",
          "link": "https://flaminghydra.com/issue-268/",
          "publishedOn": "2025-03-04T00:14:31.000Z",
          "wordCount": 446,
          "title": "Without exception / Developing community",
          "imageUrl": "https://flaminghydra.com/content/images/2025/03/vac-2-72-bright-2.jpg"
        },
        {
          "id": "67c613832412be0001c605d4",
          "author": "Brian Hioe",
          "description": "a collective of 60 writers, on fire and hard to kill",
          "link": "https://flaminghydra.com/an-abhorrent-vacuum/",
          "publishedOn": "2025-03-04T00:14:02.000Z",
          "wordCount": 282,
          "title": "An Abhorrent Vacuum",
          "imageUrl": "https://flaminghydra.com/content/images/2025/03/vac-2-72-bright.jpg"
        },
        {
          "id": "67c5e7f72412be0001c6049b",
          "author": "David Moore",
          "description": "a collective of 60 writers, on fire and hard to kill",
          "link": "https://flaminghydra.com/my-local-gallery/",
          "publishedOn": "2025-03-04T00:13:37.000Z",
          "wordCount": 293,
          "title": "My Local (Gallery)",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/03/000221630028.jpg"
        },
        {
          "id": "67c21363fd76390001aa4a1b",
          "author": "The Editors",
          "description": "Amy Chu considers the future",
          "link": "https://flaminghydra.com/issue-267/",
          "publishedOn": "2025-02-28T21:35:33.000Z",
          "wordCount": 302,
          "title": "A sound faintly like Seth Rogen laughing",
          "imageUrl": "https://flaminghydra.com/content/images/2025/02/top-cupid-bow-crop-16x9-2.jpg"
        },
        {
          "id": "67c1f8e2fd76390001aa496f",
          "author": "Amy Chu",
          "description": "by Amy Chu\nThe time has come for us to reimagine everything. We have to reimagine work and go away from labor. We have to reimagine revolution and get beyond protest. We have to think not only about change in our institutions, but changes in ourselves. We are at the",
          "link": "https://flaminghydra.com/the-best-worst-case-scenario/",
          "publishedOn": "2025-02-28T21:31:50.000Z",
          "wordCount": 552,
          "title": "The Best Worst Case Scenario",
          "imageUrl": "https://flaminghydra.com/content/images/2025/02/top-cupid-bow-crop-16x9.jpg"
        },
        {
          "id": "67c0d7a9fd76390001aa319d",
          "author": "The Editors",
          "description": "In the lobby with Zito Madu",
          "link": "https://flaminghydra.com/issue-266/",
          "publishedOn": "2025-02-27T23:59:33.000Z",
          "wordCount": 620,
          "title": "Ascending and descending",
          "imageUrl": "https://flaminghydra.com/content/images/2025/02/old-IMG_1631-1-2.jpg"
        },
        {
          "id": "67c0cb40fd76390001aa3183",
          "author": "Zito Madu",
          "description": "by Zito Madu\n\n\nBefore I moved to New York City, I didn't think about elevators much. When I first started looking at apartments I began with three requirements: the apartment must be next to the park, be quiet, and have a garage (though I wasn't even",
          "link": "https://flaminghydra.com/the-elevators/",
          "publishedOn": "2025-02-27T23:52:19.000Z",
          "wordCount": 665,
          "title": "The Elevators",
          "imageUrl": "https://flaminghydra.com/content/images/2025/02/old-IMG_1631.jpg"
        },
        {
          "id": "67bf5f4a81a38c00017e5473",
          "author": "The Editors",
          "description": "Josephine Riesman on Pink Floyd and surrender",
          "link": "https://flaminghydra.com/issue-265/",
          "publishedOn": "2025-02-26T20:29:09.000Z",
          "wordCount": 2814,
          "title": "Thought control",
          "imageUrl": "https://flaminghydra.com/content/images/2025/02/pink_floyd_wall_hammers_16x9_letterbox_720.jpg"
        },
        {
          "id": "67bf497781a38c00017e5415",
          "author": "Josephine Riesman",
          "description": "by Josephine Riesman\n\nPink Floyd: The Wall (1982)\nBy my sophomore year at Harvard, I was studying the social sciences, editing for the school newspaper, participating in a Jewish fellowship, keeping up a busy social schedule, and feeling so dedicated to my education that I petitioned the school to let",
          "link": "https://flaminghydra.com/mother-should-i-build-a-wall/",
          "publishedOn": "2025-02-26T20:26:44.000Z",
          "wordCount": 2827,
          "title": "Mother, Should I Build a Wall?",
          "imageUrl": "https://flaminghydra.com/content/images/2025/02/PINK-FLOYD-WALL-HAMMERS-16x9-letterbox.jpg"
        },
        {
          "id": "67be2df981a38c00017e352f",
          "author": "The Editors",
          "description": "Luke O’Neil sings, and Harry Siegel unearths a troubling prophecy",
          "link": "https://flaminghydra.com/issue-264/",
          "publishedOn": "2025-02-26T01:04:12.000Z",
          "wordCount": 540,
          "title": "Scraps of love / Fists of the future",
          "imageUrl": "https://flaminghydra.com/content/images/2025/02/PUZZLE-CLOSE-IMG_1785-2.jpg"
        },
        {
          "id": "67be077181a38c00017e34c7",
          "author": "Luke O'Neil",
          "description": "Fiction by Luke O’Neil\n\nPhoto: Joe MacLeod\nI was sitting on the porch in the dark with a friend who had stopped by to tell me he was getting a divorce. No no no he didn’t want to come inside and disturb the kids he said.",
          "link": "https://flaminghydra.com/believing-you-will-receive/",
          "publishedOn": "2025-02-26T01:01:19.000Z",
          "wordCount": 560,
          "title": "Believing you will receive",
          "imageUrl": "https://flaminghydra.com/content/images/2025/02/PUZZLE-CLOSE-IMG_1785.jpg"
        },
        {
          "id": "67be181d81a38c00017e34ed",
          "author": "Harry Siegel",
          "description": "a collective of 60 writers, on fire and hard to kill",
          "link": "https://flaminghydra.com/what-the-king-of-comics-saw-coming/",
          "publishedOn": "2025-02-26T01:00:55.000Z",
          "wordCount": 296,
          "title": "What The King (of Comics) Saw Coming",
          "imageUrl": "https://flaminghydra.com/content/images/2025/02/001-top-startling-16x9-1.png"
        },
        {
          "id": "67bcbef41fb91c0001f2b23d",
          "author": "The Editors",
          "description": "Ben Ehrenreich watches the neighbors; Trevor Alixopulos might be someone's type",
          "link": "https://flaminghydra.com/issue-263/",
          "publishedOn": "2025-02-24T21:27:22.000Z",
          "wordCount": 486,
          "title": "House of horrors / Bar flies",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/02/idiocracy-white-house-1274_-3.jpg"
        },
        {
          "id": "67bcb67e1fb91c0001f2b1a9",
          "author": "Ben Ehrenreich",
          "description": "by Ben Ehrenreich\nIdiocracy (2006)\nHoly shit, President Whatsisname is tearing up the White House lawn. He’s out there with a rototiller, a gang of Secret Service agents muttering into their lapels a couple of yards behind him. He’s got a shovel now. He’s",
          "link": "https://flaminghydra.com/yardwork/",
          "publishedOn": "2025-02-24T21:25:36.000Z",
          "wordCount": 499,
          "title": "Yardwork",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/02/idiocracy-white-house-1274_.jpg"
        },
        {
          "id": "67bcba201fb91c0001f2b212",
          "author": "Trevor Alixopulos",
          "description": "a collective of 60 writers, on fire and hard to kill",
          "link": "https://flaminghydra.com/4-classic-bar-types/",
          "publishedOn": "2025-02-24T21:23:40.000Z",
          "wordCount": 283,
          "title": "4 Classic Bar Types",
          "imageUrl": "https://flaminghydra.com/content/images/2025/02/barguysthumb.png"
        }
      ]
    },
    {
      "title": "Today in Tabs",
      "feedUrl": "https://rss.beehiiv.com/feeds/ZRiesnGI0u.xml",
      "siteUrl": "https://www.todayintabs.com/",
      "articles": [
        {
          "id": "https://www.todayintabs.com/p/bad-opinions",
          "author": "Rusty Foster",
          "description": "I give up.",
          "link": "https://www.todayintabs.com/p/bad-opinions",
          "publishedOn": "2025-03-04T21:19:06.000Z",
          "wordCount": 10468,
          "title": "Bad Opinions",
          "enclosure": {
            "url": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/7ba011f6-a691-4a3b-88b0-87acc22765b3/lfd-1.jpg",
            "length": "172342",
            "type": "image/jpeg"
          },
          "imageUrl": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/7ba011f6-a691-4a3b-88b0-87acc22765b3/lfd-1.jpg"
        },
        {
          "id": "https://www.todayintabs.com/p/the-backlash-to-the-backlash-to-the-thing-that-s-just-begun",
          "author": "Rusty Foster",
          "description": "Where are the Mangiones of yesteryear?",
          "link": "https://www.todayintabs.com/p/the-backlash-to-the-backlash-to-the-thing-that-s-just-begun",
          "publishedOn": "2025-02-27T20:41:34.000Z",
          "wordCount": 10711,
          "title": "The Backlash To The Backlash To The Thing That's Just Begun",
          "enclosure": {
            "url": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/988dd5b9-e3a0-4f44-b821-0484b1c63b16/Screenshot_2025-02-27_at_3.30.59_PM.png",
            "length": "1096519",
            "type": "image/png"
          },
          "imageUrl": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/988dd5b9-e3a0-4f44-b821-0484b1c63b16/Screenshot_2025-02-27_at_3.30.59_PM.png"
        },
        {
          "id": "https://www.todayintabs.com/p/the-gulf-of-bees",
          "author": "Rusty Foster",
          "description": "Long live the real king.",
          "link": "https://www.todayintabs.com/p/the-gulf-of-bees",
          "publishedOn": "2025-02-24T17:26:51.000Z",
          "wordCount": 9361,
          "title": "The Gulf of Bees",
          "enclosure": {
            "url": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/8b8a6fcd-711e-4959-bc9c-f5420b4839f2/image.png",
            "length": "242018",
            "type": "image/png"
          },
          "imageUrl": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/8b8a6fcd-711e-4959-bc9c-f5420b4839f2/image.png"
        }
      ]
    },
    {
      "title": "Bad Faith Times",
      "feedUrl": "https://bad-faith-times.ghost.io/rss/",
      "siteUrl": "https://bad-faith-times.ghost.io/",
      "articles": [
        {
          "id": "67c5d7bc4d6c7b0001e1b60d",
          "author": "Denny Carter",
          "description": "It's fun to pretend elected leaders in charge of a nation of 350 million people can handpick who suffers and who does not.",
          "link": "https://bad-faith-times.ghost.io/the-leopards-are-getting-fat/",
          "publishedOn": "2025-03-03T19:04:41.000Z",
          "wordCount": 2920,
          "title": "The Leopards Are Getting Fat",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/03/Screenshot-2025-03-03-at-2.03.07-PM.png"
        },
        {
          "id": "67c1b09fe121bc0001a107af",
          "author": "Denny Carter",
          "description": "'A clownish South African reaper figuratively chainsaws me, a human being, to cheers from a rapturous crowd.'",
          "link": "https://bad-faith-times.ghost.io/elon-musk-unreality/",
          "publishedOn": "2025-02-28T14:55:14.000Z",
          "wordCount": 1081,
          "title": "'We'll Never Be The Same': The Victims Of Elon Musk's Unreality",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/size/w1200/2025/02/Screenshot-2025-02-28-at-9.53.34-AM.png"
        },
        {
          "id": "67bc8ebd9788010001e9b3be",
          "author": "Denny Carter",
          "description": "Democratic messaging can be very simple: No kings.",
          "link": "https://bad-faith-times.ghost.io/we-dont-have-kings-in-america/",
          "publishedOn": "2025-02-24T15:55:01.000Z",
          "wordCount": 1788,
          "title": "We Don’t Have Kings In America",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/02/Screenshot-2025-02-24-at-10.49.29-AM.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}