{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": [
        {
          "id": "https://blogs.fangraphs.com/?p=463997",
          "author": "Davy Andrews",
          "description": "With two more starters out hurt, the team's rotational depth could turn from a question mark into one of those question marks that's directly followed by an exclamation point.",
          "link": "https://blogs.fangraphs.com/injuries-are-really-starting-to-crank-on-the-royals-rotation/",
          "publishedOn": "2025-05-20T15:00:16.000Z",
          "wordCount": null,
          "title": "Injuries Are Really Starting To Crank on the Royals Rotation",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://blogs.fangraphs.com/?p=463614",
          "author": "Michael Baumann",
          "description": "The Royals lefty has a new UCL and a new breaking ball, and he's out for blood.",
          "link": "https://blogs.fangraphs.com/kris-bubic-sweepers-all-before-him/",
          "publishedOn": "2025-05-16T14:00:16.000Z",
          "wordCount": null,
          "title": "Kris Bubic Sweepers All Before Him",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://blogs.fangraphs.com/?p=463521",
          "author": "Davy Andrews",
          "description": "Rich Hill says he feels 100%. Rich Hill is 45 years old. The math may not add up, but how good are his chances to play for his 14th big league club?",
          "link": "https://blogs.fangraphs.com/rich-hill-starts-yet-another-climb-this-time-with-the-royals/",
          "publishedOn": "2025-05-14T17:00:24.000Z",
          "wordCount": null,
          "title": "Rich Hill Starts Yet Another Climb, This Time With the Royals",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=189963",
          "author": "Drew Magary",
          "description": "For over four decades, I was terrified of Slayer. This isn’t terribly surprising because Slayer is Slayer and, more important, I was a child of the 1980s. We 80ennials were taught to fear many things: strangers with candy, masked serial killers, drugs, drug dealers, and hot sex. Anything in the cultural firmament that wasn’t a rerun of Happy Days could corrupt your innocence permanently.\nPopular music wasn’t immune to this cultural puritanism. The Tipper Gores of the country were barnstorming the media throughout that whole decade, warning American families that Ozzy Osbourne was biting the heads off of bats, that Judas Priest was encouraging kids to commit suicide, and that Madonna was dry humping award show stages. These artists were poisoning young minds, and something had to be done to prevent it. Perhaps a very small warning label on every album cover would do the trick.",
          "link": "https://defector.com/are-we-human-or-are-we-slayer",
          "publishedOn": "2025-05-20T19:34:54.000Z",
          "wordCount": 9167,
          "title": "Are We Human, Or Are We Slayer?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2210558450.jpg"
        },
        {
          "id": "https://defector.com/?p=190271",
          "author": "Albert Burneko",
          "description": "Over this past weekend, the Chicago Sun-Times and Philadelphia Inquirer's weekend editions included identical huge \"Best of Summer\" inserts; in the Inquirer's digital edition the insert runs 54 pages, while the entire rest of the paper occupies 36. Before long, readers began noticing something strange about the \"Summer reading list for 2025\" section of the insert. Namely, that while the list includes some very well-known authors, most of the books listed in it do not exist.",
          "link": "https://defector.com/chicago-sun-times-and-philadelphia-inquirer-publish-huge-summer-insert-of-pure-uncut-chatbot-slop",
          "publishedOn": "2025-05-20T17:57:01.000Z",
          "wordCount": 8830,
          "title": "Chicago Sun-Times And Philadelphia Inquirer Publish Huge Summer Insert Of Pure, Uncut Chatbot Slop",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/robowriter.jpeg"
        },
        {
          "id": "https://defector.com/?p=190268",
          "author": "Amos Barshad",
          "description": "Tottenham Hotspur has lost 21 times this season and sits 17th in the Premier League table—unimaginable for a club of its size and resources. While attempting to play the progressive attacking game mandated by their second-season manager Ange Postecoglou—an enigmatic style known as Angeball—Spurs’ players have often looked like they have forgotten, and possibly never knew, how to pass at all. Against Chelsea in April, Tottenham's own fans chanted \"you don't know what you're doing\" at the manager. For months, the pundits have screeched a common refrain: \"Why hasn’t Ange been fired already?\"\nAnd on Wednesday, when Tottenham plays Manchester United in the Europa League final, Ange has a chance to salvage it all. A win would be the club’s first trophy in 17 years, its first European trophy since 1984, and would spell a return to the Champions League. It’s a ridiculous situation made even more so by the manager’s early-season reference to his track record: at every team he’s ever managed for multiple years—Australian clubs South Melbourne and Brisbane Roar, the Australian national team, Japan’s Yokohama F. Marinos, and Scotland’s Celtic—he’s won something in his second year. To the last few hardcore Angeball defenders still out there among Spurs fandom, myself among them, it would be sweet redemption.",
          "link": "https://defector.com/ange-postecoglou-tottenhams-lovably-embattled-idealist-stands-on-the-brink-of-redemption",
          "publishedOn": "2025-05-20T17:31:00.000Z",
          "wordCount": 9933,
          "title": "Ange Postecoglou, Tottenham’s Lovably Embattled Idealist, Stands On The Brink Of Redemption",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2216096212.jpg"
        },
        {
          "id": "https://defector.com/?p=190262",
          "author": "Patrick Redford",
          "description": "With the NBA conference finals matchups set, the most interesting narrative question of these playoffs has been answered. Would the veteran-laden squads who'd done it before triumph again, or would the new generation put their elders out to pasture? The second round was a clear referendum in favor of the zoomer uprising, with the last three champions—the Boston Celtics, Denver Nuggets, and Golden State Warriors—getting eliminated. \nWhen the confetti falls a month from now, the seventh different champion in as many years will hoist the trophy. The four remaining teams have won one title between them—two if you feel that the 1979 Seattle SuperSonics title travels (the Oklahoma City Thunder themselves don't wear the gold patch)—and that one was over 50 years ago. Something new is going to happen.",
          "link": "https://defector.com/two-of-basketballs-brightest-young-stars-will-compete-for-more-than-a-trip-to-the-finals",
          "publishedOn": "2025-05-20T17:04:59.000Z",
          "wordCount": 8543,
          "title": "Two Of Basketball’s Brightest Young Stars Will Compete For More Than A Trip To The Finals",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2034212624.jpg"
        },
        {
          "id": "https://defector.com/?p=190264",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about weed, old man smell, dying in a tornado, and more.\nBen:",
          "link": "https://defector.com/put-pete-rose-in-the-hall-of-fame-so-that-i-can-forget-about-him",
          "publishedOn": "2025-05-20T16:19:04.000Z",
          "wordCount": 16735,
          "title": "Put Pete Rose In The Hall Of Fame So That I Can Forget About Him",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-1007885572.jpg"
        },
        {
          "id": "https://defector.com/?p=190256",
          "author": "Abigail Segel",
          "description": "In the 74th minute of Angel City’s May 9 game against the Utah Royals, Angel City defender Savy King collapsed on the field. She was immediately tended to by medical staff, who performed chest compressions. Once she was stable, she was carted off the field and transported to a hospital by ambulance. Other players appeared emotional during the stoppage of play. Ten minutes after King collapsed, the match continued. \nAfter the game finally ended, players hugged and cried. Utah player Alex Loera, who was teammates with King last year at Bay FC, led the teams in a prayer circle. Shortly after that, Christen Press was interviewed on the broadcast. She had scored her first goal of the season—it was a signature Press how’d you make that ball move like that? shot—just a few minutes before King collapsed. But her focus wasn’t on the win at all. “I think this game has been very emotional, very tough. All of us are praying for Savy, our teammate. … She is on our hearts and minds and that’s really all I can think about right now,” Press said. “It was a really, really emotional game.”",
          "link": "https://defector.com/jessica-berman-makes-her-priorities-clear",
          "publishedOn": "2025-05-20T14:03:45.000Z",
          "wordCount": 9119,
          "title": "Jessica Berman Makes Her Priorities Clear",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2215098291.jpg"
        },
        {
          "id": "https://defector.com/?p=190233",
          "author": "Emily Bice",
          "description": "METRO DETROIT — It’s early Sunday evening on the last weekend of April, and I’m perched beside a currently-out-of-use lane in a dimly lit section of Thunderbowl Lanes in Allen Park, Mich. On this particular weekend, Thunderbowl was the site of the Professional Bowlers Association’s Battle of the Brands, and after a raucous finale, the hubbub has subsided. The crew members are switching off the bright lights that illuminated the lanes for TV. Pro bowlers quietly weave in and out of the event zone to collect their ball bags. Most of the adoring fans who packed the stands have headed home. A few remain, eagerly waiting along the edge of barricaded lanes with signs and jerseys, hoping for a parting memory with their bowling heroes. Then there is my mother, sunken into the bleachers, heart heavy with history as she takes in the scene. But we’ll get back to that.\nMy gaze wanders across the massive bowling center—in modern-day bowling parlance, bowling alley is out, and bowling center is in. Thunderbowl Lanes is a curious convergence of future and past. The laneside computers are up-to-date, the screens work, the place is clean and more than equipped to host events like Battle of the Brands. But the carpet has a busy retro pattern, the bartop tables whisper echoes of the 70s, and the lettering out front eschews modern minimalism for a nostalgic chunky design.",
          "link": "https://defector.com/ten-frames-of-time-travel",
          "publishedOn": "2025-05-20T13:05:36.000Z",
          "wordCount": 14747,
          "title": "Ten Frames Of Time Travel",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/bowling-e1747686206961.jpg"
        },
        {
          "id": "https://defector.com/?p=190126",
          "author": "Chris Thompson",
          "description": "Tony Mansolino has been put in a tough position. It is his job today to engineer a turnaround for the most disappointing team in baseball. The Baltimore Orioles fired manager Brandon Hyde Saturday morning, after the team played sloppily and stranded a billion baserunners in a loss Friday night, their fourth in a row and 10th in 12 games. No one on earth could credibly claim that Hyde is bad at managing a baseball team: He took over in Baltimore when they were hopeless garbage, stuck it out through years of deliberate organizational ass-shitting, and then notched a dominant 100-win season the very first time he was handed a genuinely professional-grade roster. Along the way Hyde earned some managerial accolades and helped the O's to just their second first-place finish of this millennium. There is no question that Hyde can lead a very good baseball team.\nThe Orioles of 2025 stink real bad. They're 10th-worst in the majors by team OPS, and are second-worst in the majors by team ERA. Hunt around in the cool math if you must—Orioles hitters are generally underperforming their perfectly respectable expected numbers, per Statcast—but the very basic formula there is pretty straightforward: Baltimore's pitching staff allows too many runs, and their vaunted lineup is not doing anywhere near enough slugging to make up the difference. This team was talked-up as a World Series contender. With their eerily homogenized core of ultra-hyped position players, 2025 should be safely inside the early part of a long championship-or-bust era. Instead they are a last-place team, 11.5 games back of the Yankees and with a run differential that is second-worst in the majors, ahead of only the Colorado Rockies, who are a blight on the sport.",
          "link": "https://defector.com/the-orioles-are-nowhere",
          "publishedOn": "2025-05-19T17:21:39.000Z",
          "wordCount": 10604,
          "title": "The Orioles Are Nowhere",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2215768769.jpg"
        },
        {
          "id": "https://defector.com/?p=190127",
          "author": "Luis Paez-Pumar",
          "description": "Across Europe's so-called top five men's leagues—the Premier League, La Liga, Serie A, Ligue 1, and the Bundesliga—there is little intrigue left in the season. Germany and France both wrapped up their 34-match leagues this past weekend, crowning familiar champions in Bayern Munich and Paris Saint-Germain with plenty of time left over. Liverpool clinched the Premier League title at the end of April, and Barcelona claimed its trophy last Thursday.\nWhile there are still some battles to be had over Champions League qualification in England—where five teams vie for three spots—and a relegation struggle between Espanyol and Leganés in Spain, there's not much action at the top of European soccer heading into the final weekend of the season, save for in Italy, where there's a title race, a fight for the Champions League places, and a five-team brawl to escape relegation. The best drama coming up in this final weekend of domestic soccer will be in Italy, and there's so much to play for.",
          "link": "https://defector.com/the-stage-is-set-for-a-wild-serie-a-finale",
          "publishedOn": "2025-05-19T17:03:17.000Z",
          "wordCount": 8533,
          "title": "The Stage Is Set For A Wild Serie A Finale",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2215774342.jpg"
        },
        {
          "id": "https://defector.com/?p=190148",
          "author": "Lauren Theisen",
          "description": "We're down to four teams in the NHL playoffs, and they are without a doubt deserving contenders. Before I get too excited about the hockey to be contested in Stars-Oilers and Hurricanes-Panthers, however, I want to briefly look back at every squad that got knocked out in the second round. Here they are, in chronological order of the ends of their seasons.\nVegas Golden Knights",
          "link": "https://defector.com/a-short-farewell-to-the-nhls-second-round-losers",
          "publishedOn": "2025-05-19T16:43:10.000Z",
          "wordCount": 7530,
          "title": "A Short Farewell To The NHL’s Second-Round Losers",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-846077684.jpg"
        },
        {
          "id": "https://defector.com/?p=190174",
          "author": "Owen Lewis",
          "description": "Carlos Alcaraz’s shotmaking style is of the gonzo variety: He’ll opt for the unlikely winner attempt whenever possible, even when safe options are available. As a consequence, Alcaraz at his best is among the most viscerally thrilling spectacles in sports. At his worst, he could play against a potted plant and enable convincing arguments that the plant has better court sense. Through six points of his first-set tiebreak with No. 1-ranked Jannik Sinner in the Italian Open final on Sunday, Alcaraz had seemingly heeded his critics and pursued reliable patterns. He opened up a 4-2 lead with a backhand pass just good enough to force an error, then a few big serves sprinkled on top. Very effective, nothing that made the highlight reel. \nThen the players switched ends of the court, and Alcaraz couldn’t help reverting to type. He double faulted. He mashed an errant forehand down the line instead of hitting the appropriate, neutral ball crosscourt. But on set point, Alcaraz conjured a masterpiece. He took immediate control of the point despite Sinner landing a first serve, slashing heavy forehands deep into the court that forced Sinner back. He fired a backhand down the line, stretching Sinner out just a bit, then pranced to the net. While running to his right, Alcaraz chopped his volley short and gentle to his left, working against all his forward momentum. Airborne on the follow-through, his right foot flew up almost to head-height. Nothing about it looked right. It worked perfectly. Alcaraz won the tiebreak with that on-brand brilliance, then tore through the second set, 6-1, to win his first Italian Open title.",
          "link": "https://defector.com/carlos-alcaraz-keeps-smiling-at-jannik-sinners-expense",
          "publishedOn": "2025-05-19T15:25:52.000Z",
          "wordCount": 8292,
          "title": "Carlos Alcaraz Keeps Smiling At Jannik Sinner’s Expense",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2215799368.jpg"
        },
        {
          "id": "https://defector.com/?p=190122",
          "author": "Barry Petchesky",
          "description": "Everything you need to know about the last decade of Maple Leafs hockey can be found in the Panthers' third and backbreaking goal of Florida's Game 7 shitkicking. Toronto was getting outskated, and under fire in a barrage unequaled by any team all year. They had held, until they hadn't: two goals four minutes apart had stunned the building into a queasy silence. The next one felt like the decider for this game—and this series, this season, this era. A Leafs goal would put them right back in it; a Cats tally the bursting of floodgates. The deluge did not let up, Florida's relentless forecheck making it an ordeal to simply exit one's own zone.\nJohn Tavares, who was the expensive but inevitable \"final piece\" seven long years ago, handed off the \"C\" before this season, and is now officially back on the market, was harassed by a pair of Panthers as he tried to bring the puck out. A sloppy and precarious pass along the boards was swiped by a hustling Seth Jones, who cleverly avoided triggering an offside call until Jonah Gadjovich touched up. Then, doing a U-turn to get back on defense, Morgan Rielly, the blueline representative of Toronto's homegrown core four, just ... fell down? For no reason?",
          "link": "https://defector.com/somethings-over-in-toronto",
          "publishedOn": "2025-05-19T15:10:54.000Z",
          "wordCount": 7192,
          "title": "Something’s Over In Toronto",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2215808242.jpg"
        },
        {
          "id": "https://defector.com/?p=190157",
          "author": "Maitreyi Anantharaman",
          "description": "Be first out of the box to solve our Monday crossword! This week's puzzle was constructed by Hannah Slovut-Einertson and edited by Hoang-Kim Vu. Hannah works in data and lives in Minnesota with her wife, cat, and dog.\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE.",
          "link": "https://defector.com/the-crossword-may-19-squared-away",
          "publishedOn": "2025-05-19T15:00:00.000Z",
          "wordCount": 4929,
          "title": "The Crossword, May 19: Squared Away",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2191334683.jpg"
        },
        {
          "id": "https://defector.com/?p=190110",
          "author": "Ray Ratto",
          "description": "The lure of a Game 7 is typically so much more appealing than its actual delivery. Hockey manages this better than basketball, to be sure (the seventh games in the NBA Playoffs this decade have an average final score of 113-95), but it still has the Toronto Maple Leafs and their self-administered crises of confidence with which to contend. With all due respect to the Washington Wizards, Miami Marlins, and New York Jets, nobody does fatalism like the Leafs, because nobody fails the big moments like the Leafs.\nThat said, Sunday night's 6-1 loss to the blatantly superior Florida Panthers came as a blow to even the most easily disillusioned Leaf supporters. Even if those fans were skeptical at best about their heroes' chances going into the arena, they still crashlanded midway through the second period into the standard Torontonian response to games gone bad and hopes turned sad—19,000 people sitting in pouty silence, at least until the end of the game when their silence turned to boos.",
          "link": "https://defector.com/seven-is-the-leafs-unlucky-number",
          "publishedOn": "2025-05-19T13:58:56.000Z",
          "wordCount": 6402,
          "title": "Seven Is The Leafs’ Unlucky Number",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2215302566.jpg"
        },
        {
          "id": "https://defector.com/?p=190109",
          "author": "Tom Ley",
          "description": "It took the Oklahoma City Thunder about four minutes to kill the Denver Nuggets dead. With just over three minutes left to play in the second quarter of Sunday's Game 7, the Thunder were leading, 42-41. By the time there was 10:59 left to play in the third quarter, they were up 66-46 and the game was undeniably over.\nThe Thunder do this a lot. A team will start out fairly well against them, maybe even keep the game close all the way into the fourth quarter, but then OKC will turn on what Patrick Redford calls the steals-and-dunks machine, which does exactly what it says on the box. The Thunder will pick a moment in the game to raise their always-high defensive intensity to another level, and before the other team can really understand what's happening, they have been buried under an avalanche of turnovers and transition buckets. The Thunder turned Denver over five times during that four-minute stretch of Game 7, shot 9-of-10 from the field, and outscored them 24-5. It just kept going like that for the rest of the game, until the Nuggets emptied the bench and voluntarily initiated garbage time with 9:36 left to play.",
          "link": "https://defector.com/the-thunder-tried-really-hard",
          "publishedOn": "2025-05-19T12:58:45.000Z",
          "wordCount": 7524,
          "title": "The Thunder Tried Really Hard",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2215278180.jpg"
        },
        {
          "id": "https://defector.com/?p=190061",
          "author": "Diana Moskovitz",
          "description": "My life has always included cats. Even before owning a cat, I played with all the cats at the pet store inside the local mall and relentlessly begged my parents for one, who finally gave in somewhere in the early 1990s and let me adopt an orange tabby. As a young woman in my early 20s, I stumbled into owning not one but two cats and didn't adopt any more mostly because one of them, the fierce gray tabby Katharine Graham, made it clear my apartment actually was her queendom and, outside of her adopted sister, Lilly, she would not share. Katharine passed in 2020, and Lilly in 2024, putting me in a position I had not been in for about two decades—catless woman. \nIt had its perks. Mr. Diana and I never had to worry about finding a cat sitter when we traveled. We didn't have to obsess over making sure no food fell on the floor. If we wanted to sleep in, we did. But at some point after the Los Angeles wildfires, I decided it was time to let cats back into our lives. Rescue groups all over the region were getting flooded with new volunteers offering to foster animals after the fires burned more than 40,000 acres, destroyed more than 12,000 buildings, forced about 200,000 people to be evacuated, and killed 30. It seemed the least we could do as people who were fortunate enough to still have a home was open it up to new cats.",
          "link": "https://defector.com/meet-chuck-and-purrle-the-newest-members-of-the-defector-pet-family",
          "publishedOn": "2025-05-18T22:38:25.000Z",
          "wordCount": 8541,
          "title": "Meet Chuck And Purrle, The Newest Members Of The Defector Pet Family",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/IMG_5585-e1747592819270.jpg"
        },
        {
          "id": "https://defector.com/?p=190068",
          "author": "Dave McKenna",
          "description": "Irish sporting authorities are now having a serious debate about one of the most anachronistic and misogynistic (though not necessarily in that order) rules in all of athletics. Later this week, a dumbass mandate that camogie players must play in a skirt might finally be tossed. And just in time, give or take a century! \nThe no-shorts rule (skorts are permitted) has long been on the books of the Camogie Association, one of the primary sanctioning bodies of the Irish sport, which is essentially hurling played by women. There are slight variations in the playing rules between the two games–more contact is allowed in hurling, for example—but none of the differences are as glaring as the disparate dress codes. Hell, the fact that the sports have different names seems as much a symptom of the Irish sporting realm’s gender-based dysfunction as any.",
          "link": "https://defector.com/ireland-to-consider-ending-sexist-dress-code-for-one-of-its-most-popular-sports",
          "publishedOn": "2025-05-18T21:09:44.000Z",
          "wordCount": 6626,
          "title": "Ireland To Consider Ending Sexist Dress Code For One Of Its Most Popular Sports",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2215058142-e1747602193530.jpg"
        },
        {
          "id": "https://defector.com/?p=190002",
          "author": "Diana Moskovitz",
          "description": "The New York Knicks defeated the Boston Celtics 119-81 on Friday to advance to the Eastern Conference Finals and, as expected, New York City celebs filled in courtside to watch as one of the league's most beloved (though far from winningest) franchises moved closer to that elusive first NBA championship in more than 50 years. There was Spike Lee, as effusive as ever, along with Bad Bunny, Lenny Kravitz, Ice Spice, and Ben Stiller. But no other celebrity there Friday night quite holds our current zeitgeist, at least among the average reader of this website, quite like Timothée Chalamet, and that's before you factor in he's dating a member of the Kardashian family.\nA born-and-bred New Yorker, Chalamet's Knicks fandom makes perfect sense. If anything, he is living every New Yorker's dream, hamming it up with Lee afterward on the court, then getting caught on video leaning out of a black car, high-fiving, screaming, and losing his mind with his fellow Knicks fans—until he almost gets pulled out. The video ends with another person in the vehicle makes a move to bring the 29-year-old actor back in.",
          "link": "https://defector.com/timothee-chalamet-is-in-his-sports-bro-era",
          "publishedOn": "2025-05-18T18:08:43.000Z",
          "wordCount": 6719,
          "title": "Timothée Chalamet Is In His Sports Bro Era",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2214786645-e1747536493519.jpg"
        },
        {
          "id": "https://defector.com/?p=190021",
          "author": "Dave McKenna",
          "description": "Horse racing has been on death watch forever. But the sport’s future has never been more up in the air than it was heading into this year’s Preakness Stakes. The lead storyline before the race was the state of Pimlico, a Baltimore race track that’s been open since 1870 and has hosted the Preakness for more than 150 years, but has gone completely to hell. The track closes after this weekend, and the whole compound is scheduled to be demolished by the state.\nBut for however long Pimlico and the Preakness are talked about, the 2025 version of the old race will be remembered. It was that damn good.",
          "link": "https://defector.com/journalism-finally-meets-its-deadline-wins-the-preakness",
          "publishedOn": "2025-05-18T17:01:07.000Z",
          "wordCount": 8278,
          "title": "Journalism Finally Meets Its Deadline, Wins The Preakness",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2215626272-e1747585742568.jpeg"
        },
        {
          "id": "https://defector.com/?p=189984",
          "author": "Samer Kalaf",
          "description": "A second Bill Belichick interview has hit the morning-show circuit. On Friday's episode of ABC's Good Morning America, the North Carolina football coach returned to demonstrate that his disastrous CBS interview last month was an anomaly, and that he does know how to display emotion of a mildly jovial nature. The encore wasn't nearly as bad as his sitdown with Tony Dokoupil—this time, he wore a hole-free suit—but the results were still mixed.\nOn this occasion, NFL Hall of Famer Michael Strahan was asking the questions, which made for a more football-friendly environment. Once again the bulk of the conversation focused on Belichick's new book, but it was very funny to watch Strahan clearly signal to his guest that he would eventually address the 24-year-old girlfriend in the room. A couple of times in the nine-minute interview, Strahan references Belichick's \"personal life.\"",
          "link": "https://defector.com/bill-belichick-gives-proof-of-life-stops-by-another-morning-show",
          "publishedOn": "2025-05-16T20:09:15.000Z",
          "wordCount": 5944,
          "title": "Bill Belichick Gives Proof Of Life, Stops By Another Morning Show",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/bill-belichick-gma.jpg"
        },
        {
          "id": "https://defector.com/?p=189056",
          "author": "David Roth",
          "description": "At some level, reading some sort of purpose over or onto the ongoing vandalism of the American state is doing a favor to the vandals. Picture a parent holding a screaming toddler on a crowded bus, looking that toddler in the eye, and calmly asking that yowling little booger to explain himself. A tantrum is a tantrum, and it is the nature of things like that to be both unreasonable and unreasoning; in this case, the noisy and furious protagonist of the tantrum is, depending upon your perspective, either the single worst and dumbest member of one generation or the single richest person on earth. \nNone of this is what you want, but it also just is what it is: incomplete and unreasonable people demonstrating the limits of their capacity to self-regulate in a way that makes everything worse for everyone else, without really offering the tantrum-author much beyond the satisfaction of turning all that un-understood inner chaos outward. You can't give a child melting down like that what they want, because they do not know what that is. And so thinking about it at all means that you are already thinking about it more than the person thrashing around at the center of it.",
          "link": "https://defector.com/a-dumb-new-way-to-think-about-the-dismantling-of-the-federal-government",
          "publishedOn": "2025-05-16T19:51:56.000Z",
          "wordCount": 10482,
          "title": "A Dumb New Way To Think About The Dismantling Of The Federal Government",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2213229935.jpg"
        },
        {
          "id": "https://defector.com/?p=189962",
          "author": "Sabrina Imbler",
          "description": "Sabrina Imbler: I’m so delighted to convene today to talk about one of the most European events of the year: the Eurovision Song Contest. It is a hallowed occasion, where a smattering of European countries (and some oddballs, like Australia) gather to sing some of the most European songs you’ve ever heard. Some are very good, many are mediocre, and some are memorably strange. \nThis year’s contest has been relatively free of controversy, especially compared to last year’s contest, where fan favorite “Europapa” by Joost (The Netherlands) was unexpectedly disqualified after the semifinals, and crowds of people outside the arena protested Israel’s participation in the contest. We’ll get to the countries, the songs, and the controversies soon, but first I wanted to ask all of the experts on this panel, what is your relationship to the Eurovision Song Contest? Longtime fan or first-time watcher?",
          "link": "https://defector.com/can-you-do-racism-against-italians-a-eurovision-roundtable",
          "publishedOn": "2025-05-16T19:04:27.000Z",
          "wordCount": 16783,
          "title": "Can You Do Racism Against Italians? A Eurovision Roundtable",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/eurovision-roundtable.jpg"
        },
        {
          "id": "https://defector.com/?p=189926",
          "author": "Samer Kalaf",
          "description": "The house style of the New York Times is severely outdated. Depending on the topic, the newspaper's purportedly impartial tone instead reads as smug, self-amused, and deeply lazy. The results are disastrous when applied to a recent article which sincerely considers the idea that Rachel Griffin-Accurso, the popular children's entertainer known as Ms. Rachel, might be financially compensated by Hamas.\nGriffin-Accurso's grave sin is that she wants Israel to stop starving and killing Palestinian children in Gaza. For this, she has become the target of a pro-Israel contingent so committed to suppressing any support for Palestine that they have abandoned basic human dignity. Griffin-Accurso has spoken out on the crisis for a while on her Instagram page, and in the past week, she posted a number of statements that promote organizations which aid children suffering from violence and hunger, including malnutrition in Gaza and famine in Sudan.",
          "link": "https://defector.com/the-new-york-times-really-asked-ms-rachel-if-shes-paid-by-hamas",
          "publishedOn": "2025-05-16T16:55:56.000Z",
          "wordCount": 7495,
          "title": "The New York Times Really Asked Ms. Rachel If She’s Paid By Hamas",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/ms-rachel-elmo.jpg"
        },
        {
          "id": "https://defector.com/?p=189851",
          "author": "Patrick Redford",
          "description": "The Minnesota Timberwolves closed out the Golden State Warriors with ease on Wednesday night, winning Game 5 in the same smothering fashion they'd won the previous three games. The box score doesn't tell the story, nor do the highlights, save for one little easter egg. \nLate in the second quarter, Julius Randle nailed a three from the top of the key to give his team the double-digit lead they would hold onto until the game was well in hand. Randle sashayed back on defense with the ease of a man who is assured of his good fortune, hands flapping, beyond comfortable. The broadcast then cut to a shot of Steph Curry, who appeared in a daze, staring unfocused through the court with his lips parted, shaking his head in disbelief. His season, another great year even by his standards, one of the last ones he might ever have, was over. The NBA's greatest basketball comedian couldn't do anything but watch the grim drama wind to its concluding act.",
          "link": "https://defector.com/for-a-limited-time",
          "publishedOn": "2025-05-16T15:28:10.000Z",
          "wordCount": 8922,
          "title": "For A Limited Time",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2214785486.jpg"
        },
        {
          "id": "https://defector.com/?p=189763",
          "author": "Dave McKenna",
          "description": "Pimlico Race Course, the second-oldest racetrack in the country, will close after Saturday’s 150th running of the Preakness Stakes. Last week, Maryland Gov. Wes Moore signed off on a plan to demolish the Baltimore track beginning this spring. That's the first step in what’s being billed as a two-year, $400 million publicly funded project to rebuild the historic but decayed racing compound.\nI worked at Pimlico for several years in the late 1990s while covering Maryland racing. The track has been hosting thoroughbreds and taking wagers since 1870 (only Saratoga has been around longer), and its allegedly imminent demise was an evergreen story the whole time I worked there, and ever since. The place was a dump with charm in my day. Now, it’s just a dump. A couple days after Gov. Moore signed the demolition order, I went to opening day of Pimlico’s 2025 spring meet and saw the plight first-hand. The main elevator in the clubhouse broke a few years ago and never got fixed. The track operators put up a rickety looking construction lift in the back parking lot at some point, but that was out of commission, also. The only way to get to the press box, my old hangout located on top of the grandstand, was to walk up several flights of stairs in a decrepit stairwell, where the floors at every level were severely water damaged.",
          "link": "https://defector.com/one-last-trip-to-pimlico-a-dead-and-damned-racetrack",
          "publishedOn": "2025-05-16T15:01:27.000Z",
          "wordCount": 10815,
          "title": "One Last Trip To Pimlico, A Dead And Damned Racetrack",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/IMG_3181.jpeg"
        },
        {
          "id": "https://defector.com/?p=189810",
          "author": "Robert Rubsam",
          "description": "Gareth Evans is the patron saint of people getting their shit wrecked. In films like Merantau, Apostle, and The Raid diptych, people get chopped by machetes, whacked with broom handles, tossed through floors, kicked into toilets, cracked across concrete tables, and fried on open griddles. His fights are geographic, tracking large numbers of combatants as they fight up, across, and through confined spaces, taking care to note landmarks—windows, doorframes, loose hangnails, and glass-fronted cabinets—before working them into the flow of violence. At his best, his fight scenes marry the chaos of a street brawl with the control of a martial arts tournament match, cranking up the energy without ever losing clarity.\nHavoc, his latest Netflix release, has two spectacular brawls: the first in a crowded nightclub, the second in a remote lakeshore cabin. Spanning much of the film’s second half, these fights find Walker (Tom Hardy) fending off corrupt cops and huge crowds of Triad goons—he must leave at least a hundred people dead, wasted by shotgun blasts, hatchet blows, and, in one particularly nasty kill, pierced through the neck by a spear gun. It’s spectacular stuff, visceral and inventive, and infinitely more exciting than any of the John Wick clones that Havoc superficially resembles.",
          "link": "https://defector.com/netflix-keeps-ruining-action-movies",
          "publishedOn": "2025-05-16T13:43:08.000Z",
          "wordCount": 9082,
          "title": "Netflix Keeps Ruining Action Movies",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/Havoc.jpg"
        },
        {
          "id": "https://defector.com/?p=189030",
          "author": "Maitreyi Anantharaman",
          "description": "When the 2025 WNBA season tips off tonight, so much will be new: a new team, eight new head coaches, veterans in new places, and legions of new fans who saw the stupid fights we had online last year and thought, I need to be a part of that.\nOne ancient institution is strong enough to withstand these winds of change. No, not Diana Taurasi; she retired. I’m talking about the annual Defector WNBA season preview! The 13 teams are listed below in order from oldest to newest.",
          "link": "https://defector.com/2025-wnba-season-preview",
          "publishedOn": "2025-05-16T12:59:14.000Z",
          "wordCount": 19971,
          "title": "An Old Grudge, A New Team, A Swole Caitlin: The 2025 WNBA Season Preview",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2180275009.jpg"
        },
        {
          "id": "https://defector.com/?p=189824",
          "author": "Dan McQuade",
          "description": "“When Mitchell finally reaches the tube,” Boston Globe movie critic Kevin Kelly wrote in his review of the 1975 film, “you can alleviate its unending boredom by looking forward to the commercials.” Kelly was right that the movie needed an upgrade, and that TV would provide it. But it turns out there was a better way to alleviate the unending boredom of Mitchell.\nThe movie, in which Baker plays the slobbish cop who gives the film its name, is shown in one of the funniest episodes of Mystery Science Theater 3000. In Joel Hodgson’s last episode, he and the bots absolutely ravage Mitchell star Joe Don Baker. They mock his weight. They howl in disgust at a sex scene. “He looks like a middle-aged Chucky.” Tom Servo says. The phrase “chubby blue line” is spoken.",
          "link": "https://defector.com/mitchell-is-part-of-joe-don-bakers-legacy-for-better-or-worse",
          "publishedOn": "2025-05-15T19:44:35.000Z",
          "wordCount": 8382,
          "title": "‘Mitchell’ Is Part Of Joe Don Baker’s Legacy, For Better Or Worse",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/mitchell-joe-don-baker.jpg"
        },
        {
          "id": "https://defector.com/?p=189736",
          "author": "David Roth",
          "description": "Lately we have been on a little run of decently substantive episodes of The Distraction. Not all of them are substantive in a classically Substantive way: Last week's episode was about online and offline media, but about a quarter of it was about a truly horrifying regional sandwich; the NBA playoffs and NFL draft episodes were about the NBA playoffs and the NFL draft, but were about those things in a more focused and informed way than some of our previous installments. This week, in welcoming Culture Editor Brandy Jensen to the podcast, we managed to keep the quality streak going while also bringing back the dumb stuff.",
          "link": "https://defector.com/hands-like-small-turkeys-with-brandy-jensen",
          "publishedOn": "2025-05-15T19:26:15.000Z",
          "wordCount": 6469,
          "title": "Hands Like Small Turkeys, With Brandy Jensen",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2199986182.jpg"
        },
        {
          "id": "https://defector.com/?p=189545",
          "author": "Kelsey McKinney",
          "description": "There is nothing I find more annoying than the fact that exercise makes your brain feel better. Every time I am grumpy and miserable and depressed but still drag my ass off the couch and to the gym, I am filled with annoyance after I'm done. Why does picking up a few heavy things and setting them back down make me feel so much better? Why can't I be rewarded for simply lying down on my couch and watching television? Why do brains work like this? What is the point in having a body?\nThese questions haunt me, so I was thrilled to read Casey Johnston's new book A Physical Education: How I Escaped Diet Culture and Gained the Power of Lifting. Johnston is a beloved writer for the swole community. She has written about lifting weights for almost a decade, founded a program for people trying to learn how to lift, and now has written the book on why it all matters. She encouraged me almost five years ago to begin lifting, and it quickly became the only form of exercise that did not make me so miserable I wanted to quit it immediately.",
          "link": "https://defector.com/swole-woman-casey-johnston-has-written-a-swole-book",
          "publishedOn": "2025-05-15T19:06:00.000Z",
          "wordCount": 12336,
          "title": "Swole Woman Casey Johnston Has Written A Swole Book",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/A9A6806-1-copy.png"
        },
        {
          "id": "https://defector.com/?p=189791",
          "author": "Albert Burneko",
          "description": "Did you know that there's a white genocide happening in South Africa? Me neither. We can give ourselves a break, I think: This is less a matter of gross ignorance than it is a simple epistemological deal. Namely, we can't really know that there's a white genocide happening in South Africa, because there isn't one. A person certainly could, however, think or believe that there's a white genocide happening in South Africa. Elon Musk's chatbot spent much of Wednesday working to accomplish that, with all the uncanny ineptitude implied by the terms \"Elon Musk\" and \"chatbot\" and \"Elon Musk's chatbot.\"",
          "link": "https://defector.com/elon-musks-idiot-chatbot-goes-full-boer",
          "publishedOn": "2025-05-15T18:38:43.000Z",
          "wordCount": 10426,
          "title": "Elon Musk’s Idiot Chatbot Goes Full Boer",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/grok.jpeg"
        },
        {
          "id": "https://defector.com/?p=189768",
          "author": "Violet Lucca",
          "description": "Aisles of locked plastic cabinets in drug stores. Audiologists in the UK whose videos of cleaning skin and wax out of patients’ ears amass millions of views. James Woods, who starred in Videodrome as a man who was sent hallucinations by a CIA cutout, claimed a photo of a crowd gathered to see Kamala Harris was AI generated because one man had a very long neck. While none of these things have appeared in David Cronenberg’s films, they’re all reminiscent of the darkly comic, clinical, technoskeptic essence of his work. Cronenberg never set out to predict the future, but here we are, 26 years after eXistenZ—a film that clocked the immersiveness of video games and the fanaticism of gamer culture—living through the inevitable perils of the technological extension of the human mind and body. His…",
          "link": "https://defector.com/the-shrouds-is-david-cronenbergs-typically-prescient-epitaph-for-our-present-and-his-career",
          "publishedOn": "2025-05-15T17:31:10.000Z",
          "wordCount": 13553,
          "title": "‘The Shrouds’ Is David Cronenberg’s Typically Prescient Epitaph For Our Present And His Career",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/Shrouds_3.jpg"
        },
        {
          "id": "https://defector.com/?p=189782",
          "author": "Lauren Theisen",
          "description": "For the first 20 or so minutes of The Picture Of Dorian Gray, the Broadway adaptation of the Oscar Wilde novel as a one-woman show starring Sarah Snook, the production asks a genuinely disturbing question: \"What if you were watching TV, instead?\" At the top of the hour, Snook enters the stage without fanfare, surrounded by crew members—really, they should be considered performers, too—who will spend the next two hours filming her with compact cameras. She takes a seat behind the gigantic vertical screen in the middle of the stage, looks into a lens, and speaks to the audience two-dimensionally.\nWhat follows is a by-heart reading of the start of the book—I'm pretty sure, at least, because I've never read it. Snook does the narration and the dialogue, and then the scope expands, but only sort of. Soon, Snook is costumed as Dorian—one of many characters she plays—and moves around the stage giving, basically, just that performance, as the young man poses for and then desperately admires a painting of himself. Filling out the show is prerecorded work: other Snook performances superimposed on screen or piped in as audio. In a dinner party sequence, for example, she performs live as Lord Henry while portraying the guests—all with their own elaborate costumes and ways of speaking—on the Broadway Jumbotron. In an adaptation of a story about vanity, the actress is playing with nobody but larger-than-life versions of herself.",
          "link": "https://defector.com/the-picture-of-dorian-gray-is-a-digital-monument-to-vanity",
          "publishedOn": "2025-05-15T17:04:58.000Z",
          "wordCount": 7406,
          "title": "‘The Picture Of Dorian Gray’ Is A Digital Monument To Vanity",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/slider-6_jpg.jpg"
        },
        {
          "id": "https://defector.com/?p=189275",
          "author": "Soraya Roberts",
          "description": "Would you be into watching a 100-minute I Think You Should Leave sketch? Because that’s basically what Friendship is—a Tim Robinson sketch stretched out way past its welcome. Robinson stars as Craig Waterman, that familiar everyman that Robinson is so good at portraying, a middle-of-the-road dude in literal beige who basically becomes undone by his own squareness. The guest star in this one is Paul Rudd, as hammy as ever as Austin Carmichael, the cheesy-unless-you-don't-know-what's-cheesy weatherman with the hidden hairpiece, the loud band, and the cowboy-kerchief attitude. The premise? Craig seems incapable of making friends while everyone around him—from the jerks at work who can't stop talking about the new Marvel movie he hasn't seen yet, to his wife (straight woman Kate Mara) and son …",
          "link": "https://defector.com/friendship-cant-sustain-the-relationship",
          "publishedOn": "2025-05-15T15:21:45.000Z",
          "wordCount": 7439,
          "title": "‘Friendship’ Can’t Sustain The Relationship",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/FRIENDSHIP_01.png"
        },
        {
          "id": "https://defector.com/?p=189779",
          "author": "Barry Petchesky",
          "description": "I am, as a general rule, resistant to blaming a losing team for some sort of moral failing: bowing under pressure or not caring enough or whatever. Largely this is because it ignores the performance of the winning team, and most of the time sports really are as simple as one team playing better than the other. So it is with the skeptic's eye (but still the hater's temptation) that I find myself loath to credit the Maple Leafs' ongoing collapse, from up 2-0 on the Panthers to down 3-2 after a 6-1 shellacking Wednesday night, to some sort of inherent Leafiness. Do I really believe that the tension is too much for successful pro athletes like Auston Matthews, still goalless in the series? Is the second round that much more stressful than the first, in which they seemed fine? Would the most competitive people on Earth really lay a Game 5 stinker because they just happened to not feel like giving full effort that day?\nThat is for Canadian sports media to discuss all summer, and they will, and it will get very stupid. But I do find my stony resolve cracking a bit when I see what the Leafs themselves had to say about a game in which they allowed six unanswered. \"We all need to be better, me included,\" head coach Craig Berube said.",
          "link": "https://defector.com/toronto-once-again-wins-the-stanley-cup-of-angst",
          "publishedOn": "2025-05-15T14:58:06.000Z",
          "wordCount": 6751,
          "title": "Toronto Once Again Wins The Stanley Cup Of Angst",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2214513394.jpg"
        },
        {
          "id": "https://defector.com/?p=189766",
          "author": "Chris Thompson",
          "description": "Diamondbacks manager Torey Lovullo is real good at getting ejected from a baseball game. A fellow ought to get his dang money's worth; there are too many managers out there—sleepy, retiring types, or the constitutionally frail—who do not or cannot make a truly cinematic moment out of an argument. Fans and players alike appreciate a manager who kicks huge ass. At least one Washington National, for example, is reportedly chafing at the recent passivity of the team's cardiovascularly challenged head guy. Lovullo will not leave his men wanting: When he marches out there, odds are someone is going to take a reaming for the ages. \nAnd Lovullo, God bless him, doesn't need much of an invitation. Only seven active managers have been tossed more; Lovullo, in his ninth season as a manager, is already in the top-100 all-time, with 22 career ejections. By way of comparison, it took Hall-of-Famer Hughie Jennings 16 seasons to get to 24. Lovullo may not have Bobby Cox's prodigious, historic pace—a fantastic 162 career ejections in 30 seasons—but then this is a different era. As broken down in a 2019 New York Times story, the manager meltdown is considered somewhat déclassé in the modern game. \"I tell [today's umpires], 'You guys are lucky you weren’t around 20, 30 years ago,\" says Reds manager Terry Francona, who has been run just 51 times in 23-plus major-league seasons. Giving a volcanic helping of The Business to those antagonists in the blue shirts was, in earlier times, considered an important part of the job, not just to address umpire performance but to inspire one's own team out of mid-summer ennui.",
          "link": "https://defector.com/no-youre-outta-here",
          "publishedOn": "2025-05-15T13:58:56.000Z",
          "wordCount": 7595,
          "title": "No, You’re Outta Here!",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2215127516.jpg"
        },
        {
          "id": "https://defector.com/?p=189585",
          "author": "Maya Goldberg-Safir",
          "description": "Natalie Nakase is many things: a 5-foot-2 former walk-on who became the starting point guard for UCLA, a WNBA champion as an assistant coach with the Las Vegas Aces, and “a unifier,” as Golden State Valkyries general manager Ohemaa Nyanin put it in an introductory presser last October. When the Valkyries play their season opener in San Francisco this Friday, Nakase will add to that list, becoming the first head coach of the franchise, and the first Asian-American head coach in WNBA history. She is a third-generation Japanese American from Southern California, raised by a basketball-loving father who kept his daughters in the gym the way some parents bring their children to church.\nBasketball has been an integral part of Japanese-American communities on the West Coast since the early 1900s. Shaped by forcible internment during World War II, Japanese-American basketball leagues (colloquially known as the “JA leagues”) flourished for decades as a way to cultivate second- and third-generation talent, and still operate to this day. The use of digital archives dating back to the 1940s, as well as interviews with relatives and members of the JA league community, can demonstrate how the story of Natalie Nakase is the story of Japanese-American basketball. Go through her family history, and you’ll find competition and resilience that transcends the sport itself.",
          "link": "https://defector.com/how-the-japanese-american-basketball-leagues-built-natalie-nakase",
          "publishedOn": "2025-05-15T13:28:16.000Z",
          "wordCount": 14735,
          "title": "How The Japanese-American Basketball Leagues Built Natalie Nakase",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-1618844684.jpg"
        },
        {
          "id": "https://defector.com/?p=189689",
          "author": "Patrick Redford",
          "description": "After his Oklahoma City Thunder finished up a spectacular Game 5 win against the Denver Nuggets, Shai Gilgeous-Alexander fielded a question about the game's best player: Nikola Jokic. The reigning MVP put together a near-perfect game against the presumptive MVP's team, with 44 points on 25 shots, 15 rebounds, and five assists that could have been thrice as many if any single one of his teammates could have hit one single shot after halftime. \"It's a team sport,\" Gilgeous-Alexander said. \"No one guy can do it.\" In what was comfortably the best game of the whole second round, and close to the best game of the 2025 NBA playoffs, one guy very nearly did it. That he could not answers some pretty important questions.\nJokic had not had a good series before Game 5. Apart from his Game 1 masterclass, Oklahoma City has been defending the hell out him, keeping Isaiah Hartenstein glued to his right shoulder while sending their ballhawking wings down to swipe at the ball and deny him the easiest pressure-release passes. He had 21 made field goals and 16 turnovers in the middle three games of this series, often looking flustered by all the pressure.",
          "link": "https://defector.com/nikola-jokic-is-outnumbered",
          "publishedOn": "2025-05-14T18:54:44.000Z",
          "wordCount": 8379,
          "title": "Nikola Jokic Is Outnumbered",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2214380349.jpg"
        },
        {
          "id": "https://defector.com/?p=189113",
          "author": "Sabrina Imbler",
          "description": "Most years, Patricia Gibson decorates her home for Memorial Day—putting up a sign or placing some flags in her flower pots. But this year, when she saw decorations in the store, she paused in the aisle. \"Should I decorate some red, white, and blue for outside?\" Gibson remembered asking herself. \"And I'm just like, no. I'm really not feeling the miracle right now, and who's representing it.\" Because in February, after working for the federal government for 17 years, Gibson learned that she would lose her job as a contract specialist at the Office of Personnel Management, through no fault of her own.\nOPM, essentially the federal government's human resources agency, has historically flown under the radar of the general public. But this winter, Elon Musk and DOGE functionally took over the agency to carry out their campaign of mass firings. As CNN reported in March, OPM employees who previously sent communications to federal agencies watched from the sidelines as Musk's OPM sent a barrage of termination notices to federal employees. One such notice was the \"Fork in the Road\" email, which offered workers a chance to be paid through September if they left their posts—an attempt to downsize the federal workforce and remove anyone resistant to Trump's agenda.",
          "link": "https://defector.com/an-interview-with-a-fired-contract-specialist-at-the-office-of-personnel-management",
          "publishedOn": "2025-05-14T18:25:30.000Z",
          "wordCount": 12405,
          "title": "An Interview With A Fired Contract Specialist At The Office Of Personnel Management",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/1000000641-e1747232326500.jpg"
        },
        {
          "id": "https://defector.com/?p=189666",
          "author": "Drew Magary",
          "description": "Let’s check in on America’s First Couple, Bill Belichick and Jordon Hudson, aka Jordochick. There’s so much to tell you, I can hardly stand it! After the two filled their collective diaper in front of CBS cameras, Pablo Torre’s podcast reported that the University of North Carolina had banned Hudson from its football team’s facilities (which the school denied in a statement that I can poke more holes in that Belichick's formalwear). Then the Washington Post published a letter from Hudson resigning from her cheerleading gym, and the paper informed all of us that Hudson’s mother runs a “popular sex boutique” in Provincetown, Mass. Oh, and Hudson finished third in the Miss Maine USA pageant. A nation wept.\nNow that’s a lot of information to take in. I’m so wrapped up in the story of Jordon Hudson—our heroine used to give henna tattoos to customers in Provincetown while wearing her regional beauty pageant sash—that I nearly forgot about the football part of this story. Lucky for you and me, Tar Heels GM Mike Lombardi has entered the chat room to remind us that actual work of assembling a winning football team in Chapel Hill isn't going so well, either:",
          "link": "https://defector.com/bill-belichick-unc-brought-along-his-merry-band-of-losers",
          "publishedOn": "2025-05-14T17:38:26.000Z",
          "wordCount": 7389,
          "title": "Bill Belichick Brought Along His Merry Band Of Losers",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/bill-holes-2.jpg"
        },
        {
          "id": "https://defector.com/?p=189635",
          "author": "Lauren Theisen",
          "description": "This is our second blog this week about Javy Báez, because the Detroit center fielder (yes, center fielder!) has simply demanded it. There are players in MLB who can boast a higher WAR or more home runs, but nobody in baseball has surprised like Báez through his first 34 games. Once one of the sport's most exciting young talents with the Cubs, then an absolute washout who OPSed below .600 in back-to-back years, a humbled Báez returned from season-ending surgery last August to a growing team that had unexpectedly fashioned itself into a contender. But rather than be an awkward appendix on a roster that seemingly proved it was better off without him, Báez has pieced himself back together. Now, he's a leading hitter on—I swear this is real—Baseball Reference's World Series favorite. And Tuesday night's performance against the Red Sox was his most endearing yet in a Tigers uniform.\nWith some wet weather in Detroit and a Tarik Skubal start scheduled for the next day, it wasn't a big crowd that witnessed Javy's heroics live. But Michigan is following the Tigers more closely than it has in any spring for the past decade, and I could feel the reverberations from a thrilling 11th inning all the way out in Brooklyn, where I listened to Dan Dickerson on the radio call during my walk home. It was Javy who was responsible for extras in the first place, scoring from third on a botched pickoff from the Boston catcher early on and then clobbering a breaking ball to left for a three-run shot in the sixth.",
          "link": "https://defector.com/javy-baez-comes-back-for-seconds",
          "publishedOn": "2025-05-14T16:37:38.000Z",
          "wordCount": 6576,
          "title": "Javy Báez Comes Back For Seconds",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2214375978.jpg"
        },
        {
          "id": "https://defector.com/?p=189670",
          "author": "Ray Ratto",
          "description": "Here's a sentence you probably haven't imagined ever reading: The 1919 Black Sox are BACK!\nOh sure, you fell for the splashier \"Commissioner Lifts Lifetime Ban On Pete Rose Because He's Stopped Being Alive\" headlines, in part because it looks Manfred gave in to the whims expressed during a regularly scheduled unhinged rant of the current President. But Manfred went further with his favor-currying than anyone could have imagined. The commissioner’s elite constituent service expanded by sucking up to the still-new Pope by forgiving the greatest scandal in the sport's history, which just happens to have been authored by the Chicago-born Pope’s team of choice. Say what you want about baseball's place in the culture, but no other commissioner is nuzzling up to this many levels of power quite like our Robbo.",
          "link": "https://defector.com/baseball-frees-its-gambling-ghosts",
          "publishedOn": "2025-05-14T15:56:19.000Z",
          "wordCount": 7446,
          "title": "Baseball Frees Its Gambling Ghosts",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-515417342.jpg"
        },
        {
          "id": "https://defector.com/?p=189663",
          "author": "Jae Towle Vieira",
          "description": "The Normal Gossip inbox is chaotic at the best of times. We get all sorts of gossip, from all over the world, much of which isn’t remotely radio-safe. There are a few common themes: Lots of people seem to be sleeping with their coworkers. Lots of people seem to be fighting over an inheritance. And lots of people seem to be struggling with their roommates. \nToday we’ve got a special treat for you—the cream of the roommate-drama crop. Imagine a bad roommate with all the fixings: hogging the bathroom, leaving dirty dishes in the sink, not paying their fair share of a household expense. Now imagine that roommate has a passion for perpetual stew.",
          "link": "https://defector.com/stewing-in-anger",
          "publishedOn": "2025-05-14T15:01:21.000Z",
          "wordCount": 5245,
          "title": "Stewing In Anger",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2023/03/Normal_Gossip_16-9_V2.png"
        },
        {
          "id": "https://defector.com/?p=189639",
          "author": "Ray Ratto",
          "description": "The Indiana Pacers have been living in the shadow of the snobbery of others for far longer than they deserve. They don't play in a cool town, or a cool state. They don't tell a cool story. They play a fun, fluid style of basketball, but the team itself isn’t cool. They're just the team that kicks your arse more often than you kick theirs, and if it’s mostly the arse-kicking part that might make you sad, it surely adds some insult to that injury that they're not telling a fashionable story while doing it. They're a four-seed in the Eastern Conference, from the 25th-largest media market in America, and so they're easy to ignore until they aren't. Like now, and maybe only for a moment.\nAnd here they are, in this moment, back in the Eastern Conference Final for the second year in succession because, well, up yours. They don't have a better answer than that, and truthfully, they don't need one. They're here and you're not, so spin on that, you snotty, arrogant, elitist bastards.",
          "link": "https://defector.com/no-one-ever-sees-the-pacers-coming",
          "publishedOn": "2025-05-14T14:33:20.000Z",
          "wordCount": 8012,
          "title": "No One Ever Sees The Pacers Coming",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2214962380.jpg"
        },
        {
          "id": "https://defector.com/?p=189613",
          "author": "Barry Petchesky",
          "description": "On the road, they're the Loseipeg Jets. After falling 3-1 to the Stars Tuesday to go down in the series by the same tally, the Manitobans are now an incredible 0-9 in their last nine road playoff games dating back three years. They've been outscored 45-14 over that stretch, and 25-8 in their 0-5 road showing this spring. It is, frankly, kind of baffling. Can Connor Hellebuyck only see pucks against a white-out of shirts? Is having wifi too much of a distraction? \"If I had the answer to why,\" said Nik Ehlers, \"we would have gotten one at some point.\"\nThe thing is, they played fine last night. They might've been the better team on the ice: they certainly won the shot and possession battles. It's just that Jake Oettinger was near-flawless, and the Dallas power play was flowing, and Mikael Granlund, of all people, beat Hellebuyck glove-side three separate times, on his only three shot attempts.",
          "link": "https://defector.com/mikael-granlund-takes-jets-downapeg",
          "publishedOn": "2025-05-14T13:51:23.000Z",
          "wordCount": 6267,
          "title": "Mikael Granlund Takes Jets Downapeg",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2214382110.jpg"
        },
        {
          "id": "https://defector.com/?p=189372",
          "author": "Kathryn Xu",
          "description": "LE MANS, FRANCE — The MotoGP championship standings table, going into the Grand Prix de France at Le Mans, was headed by two brothers of disparate levels of previous success. Marc Márquez, one point behind in second place, suffers from the elder child's plight of being shorter than his younger brother. Álex Márquez, the championship leader, suffers from the younger child’s plight of having an older brother who is considered by many to be the greatest of all time in their sport. You know how it is.\nThey have been on the same team twice. The first time was in 2020. Before that, between 2013 and 2019, Marc Márquez cemented the end of the Valentino Rossi dynasty. He became the youngest major champion in motorcyclesport, and then won five more championships on the back of his remarkably aggressive style. In his obscene 2019 season, he had one retirement, and otherwise finished top-two in every single race of the year. He accomplished all this without much help from his machinery: The Honda was broadly considered far from the best bike on the grid at the time. Like a lot of greats, Marc Márquez is either loved or resented, though the latter is no knock on his public demeanor. He is noticeably smiley. The same wide, full-faced grin has stayed with him from then, into 2020, and onto now.",
          "link": "https://defector.com/finding-the-limit-at-le-mans",
          "publishedOn": "2025-05-14T13:19:52.000Z",
          "wordCount": 19110,
          "title": "Finding The Limit At Le Mans",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/motogp-marquez-brothers.jpeg"
        },
        {
          "id": "https://defector.com/?p=189568",
          "author": "Tom Ley",
          "description": "Perhaps it is time to coordinate an emergency delivery of some rudimentary lessons about human biology to the sportswriters of America. It was less than a month ago that The Athletic's Fred Katz mistook the basic act of \"hearing things\" for echolocation, and now we are confronted with ESPN's Ramona Shelburne forgetting how eyeballs work. \nHere is a snippet from Shelburne's most recent article, about how Russell Westbrook has fit in with the Denver Nuggets this season:",
          "link": "https://defector.com/nobody-can-do-that",
          "publishedOn": "2025-05-13T20:29:04.000Z",
          "wordCount": 6043,
          "title": "Nobody Can Do That",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2212670084.jpg"
        },
        {
          "id": "https://defector.com/?p=189566",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about wearing pajamas in public, hating REM, and more.\nJohn:",
          "link": "https://defector.com/notes-from-a-reborn-nba-fan",
          "publishedOn": "2025-05-13T19:04:20.000Z",
          "wordCount": 16185,
          "title": "Notes From A Reborn NBA Fan",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2198091246.jpg"
        },
        {
          "id": "https://defector.com/?p=189408",
          "author": "Luis Paez-Pumar",
          "description": "When I play a new video game, I am a dirty walkthrough follower. I never feel like having three monitors is more useful than when I can play the game on my main one and have a guide on a secondary screen. The reason I do this is simple: I like thoroughness in my gaming. I don't want to miss the secretly overpowered item in Act I because I didn't know where it was. I want to see it all, even if that means being guided by the hand.\nImagine my shock, then, over how I played Clair Obscur: Expedition 33, the ridiculously named role-playing game by French studio Sandfall Interactive that became one of the best reviewed games of all time shortly after its release on April 24. I had not heard of Clair Obscur before the reviews and hype started rolling in, and I immediately bought and downloaded it. A turn-based RPG that is both gorgeous and almost hilariously French? With timing-based parries and dodges, like some form of modernized, Francophile Super Mario RPG? Yes, please.",
          "link": "https://defector.com/clair-obscur-expedition-33-makes-your-wandering-worth-it",
          "publishedOn": "2025-05-13T16:05:41.000Z",
          "wordCount": 8388,
          "title": "‘Clair Obscur: Expedition 33’ Makes Your Wandering Worth It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/clairobscur.png"
        },
        {
          "id": "https://defector.com/?p=189541",
          "author": "Tom Ley",
          "description": "With just over three minutes left in Game 4 of the second-round series between the Celtics and Knicks, it was feeling pretty over for Boston, who were trailing by seven and facing a 3-1 series deficit. And then a few seconds later, it was really over.\nWe are still awaiting official word on what kind of injury Jayson Tatum suffered when he made a move for a loose ball, crumpled to the floor, and then screamed in agony while grabbing the back of his right ankle. We have all seen this particular non-contact injury enough to understand that what happened to Tatum is not good, and that a torn Achilles would keep him off the floor for at least a year.",
          "link": "https://defector.com/it-can-all-go-to-hell-in-a-hurry",
          "publishedOn": "2025-05-13T14:54:35.000Z",
          "wordCount": 6310,
          "title": "It Can All Go To Hell In A Hurry",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2214799075.jpg"
        },
        {
          "id": "https://defector.com/?p=189451",
          "author": "Billy Haisley",
          "description": "Unless you're a fan of one of the big clubs that needed a late Nottingham Forest collapse to help mask your own team's piss-poor season (we're looking at you, Man City and Chelsea), you have to feel for the Trees. Forest maintained its over-performing underdog act for so long and so admirably this year, and it was just starting to look like the team might avoid the Icarian fate that usually befalls the (relatively) low-spending high fliers of any given Premier League season. Alas, with Sunday's 2-2 draw against Leicester City, it appears that the wax is running, the feathers are falling out, and Forest has entered what could be a tailspin.\nNo one could really say it's surprising that the Tricky Trees have fallen off the pace that had them soaring in the Champions League places. Over the course of 38 matches, it's hard for the talent of the big boys, the health of your overachievers, and the god of regression not to eventually catch up with even the most brave and resilient upstarts. In Forest's case, rivals like Man City, Newcastle United, and Chelsea have started to hit some better form entering the final stretch, key Reds like Callum Hudson-Odoi and Murillo have picked up untimely injuries, and Chris Wood, the big galoot who could not stop scoring goals (he has 20), has more or less stopped scoring goals (two in his last nine games). As such, the Trees have picked up just five points from their last six matches, which has seen them drop from a comfortable third place down to seventh.",
          "link": "https://defector.com/nottingham-forest-is-missing-a-trick",
          "publishedOn": "2025-05-13T14:19:10.000Z",
          "wordCount": 7789,
          "title": "Nottingham Forest Is Missing A Trick",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2214530537.jpg"
        },
        {
          "id": "https://defector.com/?p=189511",
          "author": "Chris Thompson",
          "description": "Right now I would like to punch something, hard enough to make jelly of my fist. Not because I am a fan of the Washington Wizards! Nowadays being a fan of the Wizards means hoping they will lose—they trained me for this, by trying hard for six months to lose as much as possible—and I'll be damned if I can switch off that impulse in time for the draft lottery. Unto the Wizards I say: Ha ha! Screwed by fate, but not a cruel one: A just and righteous fate, a Rod Serling-ish fate rather than a Stephen King-ish one. Also screwed by the universe: the Utah Jazz and the Charlotte Hornets, fellow practitioners of the Vomit Arts. Owned to hell, all of you! Ha ha!\nStill this morning I would like to ram my head into one of those industrial rock smashers, because of who won the lottery. The son-of-a-gun Dallas Mavericks—those selfsame bozos who just torched their future, proudly and defiantly, for a foundation of two unreliable and rapidly eroding veteran stars—jumped an incredible 10 spots and won the top overall pick in the 2025 draft. Their odds of winning were less than two freakin' percent. A third of the damn league had better odds of landing that pick; a solid seven of those teams might even have been able to say they deserved a friendly turn from the cosmos. Instead, fortune smiled down on the asshole Mavericks, to my mind the very most odious option of all. Screw.",
          "link": "https://defector.com/the-goddamn-mavericks-won-the-goddamn-draft-lottery",
          "publishedOn": "2025-05-13T13:32:52.000Z",
          "wordCount": 8401,
          "title": "The Goddamn Mavericks Won The Goddamn Draft Lottery",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2183415360.jpg"
        },
        {
          "id": "https://defector.com/?p=188921",
          "author": "Patrick Redford",
          "description": "SAN FRANCISCO —The NBA playoffs have been going for nearly a month and everyone is suffering. Jayson Tatum awaits an MRI on a Monday night leg injury that may well have ended his playoffs and Boston's title repeat hopes; Damian Lillard's Bucks career ended with an Achilles tear; and Steph Curry is down with a strained hamstring. The headlining injuries hardly even tell the story. The eight teams still in contention look battered and out of gas: The Nuggets just scored eight points in a first quarter, the Celtics whimpered and died in two straight fourth quarters, and the ailing Cavaliers were just ground into a fine powder by the Pacers. Things are going to get worse, as we're not even halfway through the playoffs. It is hard to shake the feeling, especially after the Tatum injury, that the eventual champion will not necessarily be the best team but the least damaged. Which brings us to the word of the playoffs: physicality.\nThroughout this NBA postseason, players and coaches cannot stop talking about physicality, and the necessity of meeting it. \"I think the physicality was there,\" Magic coach Jamahl Moseley said after his team lost Game 2 against the Celtics. \"I don't think they were dirty plays, but I think it passed a line of physicality,\" Cavs coach Kenny Atkinson said after his team lost Game 1 to the Pacers. \"Our physicality was great tonight,\" Jaylen Brown said after taking a 3-1 lead against the Magic. \"If you look around the playoffs right now, it’s super physical,\" Timberwolves coach Chris Finch said in the first round of his team's series against the Lakers. \"To me, they’ve gone way too far on the physicality. [...] It feels like it’s physicality without purpose.\" After his team lost Game 3 against the Clippers, Nuggets coach David Adelman provided the diagnosis: \"Defensively, we have to meet their physicality.\"",
          "link": "https://defector.com/physicality-is-where-basketball-lives-and-careers-die",
          "publishedOn": "2025-05-13T12:59:41.000Z",
          "wordCount": 9834,
          "title": "Physicality Is Where Basketball Lives And Careers Die",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2214793351.jpg"
        },
        {
          "id": "https://defector.com/?p=189487",
          "author": "Abigail Segel",
          "description": "The whole season, win or lose, Montreal Victoire head coach Kori Cheverie and her players spouted their belief in the team. Listening to them week after week, the message started to feel tired. How sincerely can you focus on the good things after you lose? When goalie Ann-Renée Desbiens got hurt, then Kati Tabin got served a multi-game suspension, it was hard to picture this as a team that could sustain their early-season dominance. In March and April, the Victoire lost as much as they won. Come playoffs, would they show up and win games, or would they bow out suddenly and gracelessly like last year? But it really was true that every single player talked about the team’s confidence, every game. What comes first: the belief or the act of professing it? For the Victoire, maybe it doesn’t matter.\nIn Game 1, Montreal suffered from a serious case of playoff nerves. Silly mistakes saw pucks slip through Ottawa’s crease unanswered, and Montreal never led. Both the Victoire’s goals came off of power plays—a good showing for their special teams—but they couldn’t figure out how to score without l’avantage numérique. Despite outshooting Ottawa, they did what they’d always done in the playoffs: lose.",
          "link": "https://defector.com/victoire-4ot-charge-owhl-playoffs",
          "publishedOn": "2025-05-12T19:55:12.000Z",
          "wordCount": 7343,
          "title": "It Took Two Years And Four Overtimes For The Victoire To Live Up To Their Name In The Playoffs",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2196866393.jpg"
        },
        {
          "id": "https://defector.com/?p=189240",
          "author": "Maitreyi Anantharaman",
          "description": "Soon after Javier Báez signed a six-year, $140 million contract with the Detroit Tigers, he began the least productive stretch of his MLB career, and I began my new life as the world’s No. 1 Javy Báez apologist. Javy hatred, I thought, was the sign of a dull mind. It linked everything I resented in my fellow Tigers fans: their sourness; their temper; their archaic obsession with “errors”; their belief in a baseball value system that didn’t resemble mine and could never account for the singularity of Javy. It bothered me when the complaints tipped into falsehoods, the insistence that Javy was “lazy,” that he’d gotten his bag in 2022 and then stopped trying.\nOf course, I was watching the games and seeing what everyone else saw. Báez's power numbers fell to such lows that the rare home runs he did hit were kind of funny. His on-base percentages had always skewed low—the cost of a free-swinging approach—but three seasons into the contract, they were dire. In 2024, he slashed .181/.221/.294. The less he got on base, the sillier I felt defending him on the grounds of his “baserunning genius.” Like a Joe Biden aide, I had a job to do, and I would do it, but privately, I knew he was cooked.",
          "link": "https://defector.com/javier-baez-cant-do-it-all-but-he-sure-will-try",
          "publishedOn": "2025-05-12T19:34:25.000Z",
          "wordCount": 7164,
          "title": "Javier Báez Can’t Do It All, But He Sure Will Try",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2213139089.jpg"
        },
        {
          "id": "https://defector.com/?p=189229",
          "author": "Kelsey McKinney",
          "description": "My gargantuan senator is throwing a hissy fit. According to reporting by the Associated Press, Pennsylvania Sen. John Fetterman attended a meeting last week with representatives for a teachers union, at which Fetterman says that they \"had a spirited conversation about our collective frustration with the Trump administration’s cuts to our education system.\" The other people in the meeting say that the Senator started repeating himself and shouting. They say he was yelling, \"Why does everyone hate me, what did I ever do?\" and \"Why is everybody mad at me?\" A member of Fetterman's staff ended the meeting, ushered the visitors into the hallway, and then broke down crying and had to be comforted by the teachers.\nThis is toddler behavior. Why does everyone hate me? What did I ever do? Why is everyone mad at me? Sir! You are 6-foot-8 and a Senator for a purple state. By the nature of your job, something like 50 percent of the people in your own state will hate you at all times, and that's not including the people in your own party who also don't like you. Being an elected public servant is not a long red-carpet strut where everyone treats you like a pop star and bows to you and asks who you're wearing. Power is a responsibility, and with it comes the reality that not everyone is going to like you.",
          "link": "https://defector.com/what-is-my-senator-good-for",
          "publishedOn": "2025-05-12T18:59:52.000Z",
          "wordCount": 9486,
          "title": "What Is My Senator Good For?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2201242352.jpg"
        },
        {
          "id": "https://defector.com/?p=189416",
          "author": "Veronica de Souza",
          "description": "Welcome to the first official edition of Make It Nice. Each month, I’ll tackle your interior design questions and help you make your space feel beautiful. Today we have questions about storage, room dividers, and a kitchen conundrum. Let’s get into it.",
          "link": "https://defector.com/make-it-nice-bringing-order-to-chaos",
          "publishedOn": "2025-05-12T17:45:20.000Z",
          "wordCount": 9807,
          "title": "Make It Nice: Bringing Order To Chaos",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/make-it-nice-2.jpg"
        },
        {
          "id": "https://defector.com/?p=189418",
          "author": "Albert Burneko",
          "description": "Donald Trump launched a memecoin a few days before the inauguration of his second presidential term. Its sole purpose, to Trump, is unambiguous and unmistakable: It is a vehicle for him to become richer. Likewise, its only conceivable value to literally any other person or entity on the face of the earth is also quite clear: It is a way to buy favor from the president of the United States. Its very existence is an announcement: Here is how you pay President Donald Trump for stuff.\nTo wit:",
          "link": "https://defector.com/nyt-reporter-its-not-corruption-unless-the-envelope-says-bribe-on-it",
          "publishedOn": "2025-05-12T16:10:05.000Z",
          "wordCount": 6861,
          "title": "NYT Reporter: It’s Not Corruption Unless The Envelope Says “Bribe” On It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/trump-lookin-bad.jpeg"
        },
        {
          "id": "https://defector.com/?p=189441",
          "author": "Ray Ratto",
          "description": "There has been a spirited race toward Major League Baseball's Dumpster of Distinction all season, with a number of candidates trying to join the increasingly popular 100-loss club. But there are ways to fail, and then there are stylish ways to fail. Miami and Baltimore are failing, but it's pretty boilerplate stuff—the Marlins don't pitch, the Orioles don't hit. Nothing especially novel there, give or take Baltimore's 192 wins over the previous two seasons.\nIn other words, in an era in which losing 100 is no big thang—there have been 22 teams that have managed it since 2018—the way you get to 100 matters. The Chicago White Sox figured that out last year by reaching 100 in the last week of August and ending up with 121 losses, the second most defeats in baseball history. They stunk, but they found a way to do it at a rate that no other team had figured out before.",
          "link": "https://defector.com/the-colorado-rockies-cant-even-lose-right",
          "publishedOn": "2025-05-12T15:42:38.000Z",
          "wordCount": 8170,
          "title": "The Colorado Rockies Can’t Even Lose Right",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2208722314.jpg"
        },
        {
          "id": "https://defector.com/?p=189365",
          "author": "Maitreyi Anantharaman",
          "description": "Take a shot at our Monday crossword! This week's puzzle was constructed by Kate Chin Park and edited by Hoang-Kim Vu. Kate is a puzzle editor and constructor who hopes that if you enjoy crosswords, you'll consider signing up for Westwords, which will take place both virtually and in Berkeley, Calif., on Sunday, June 22! Visit the website to learn more.\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE.",
          "link": "https://defector.com/the-crossword-may-12-balls-out",
          "publishedOn": "2025-05-12T15:00:00.000Z",
          "wordCount": 5074,
          "title": "The Crossword, May 12: Balls Out",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2181102748.jpg"
        },
        {
          "id": "https://defector.com/?p=189376",
          "author": "Barry Petchesky",
          "description": "These playoff have had everything, from unlikely comebacks to huge upsets to bloody feuds to preternatural feats of athleticism. You can keep all that. We true connoisseurs of professional sports controversies have been craving a rulebook kerfuffle, and in Sunday's Stars home win over the Jets, we finally got one. This is why they play the game; it's time for some lawyerpuck.\nThe third-period, tie-breaking goal in an eventual 5-2 Dallas win was credited to Alex Petrovic, but that doesn't come close to telling the story. Petrovic, skating past the side of the net, tried to gather a rebound and directed it with his left skate into the crease. It appeared that untouched it would have slid harmlessly through the crease, but Connor Hellebuyck, trying to clear the puck, angled it into his own net. Goal? After eight minutes of video review, and no doubt the frantic flipping of rulebook pages in the NHL's Situation Room: Goal.",
          "link": "https://defector.com/stars-jets-petrovic-hellebuyck",
          "publishedOn": "2025-05-12T14:00:34.000Z",
          "wordCount": 7485,
          "title": "Rulebook Aficionados: Let’s Ride",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2214062692.jpg"
        },
        {
          "id": "https://defector.com/?p=189375",
          "author": "Tom Scocca",
          "description": "Welcome to Margin of Error, a politics column from Tom Scocca, editor of the Indignity newsletter.\nThis was how Columbia University's acting president, Claire Shipman, described what happened at a protest in the school's Butler Library on May 7:",
          "link": "https://defector.com/teachable-moment",
          "publishedOn": "2025-05-12T13:41:39.000Z",
          "wordCount": 9526,
          "title": "Teachable Moment",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/columbia-protest-arrests.jpeg"
        },
        {
          "id": "https://defector.com/?p=189374",
          "author": "Tom Ley",
          "description": "Everyone line up.\nCleveland Cavaliers",
          "link": "https://defector.com/all-of-you-motherfuckers-are-on-fraud-watch",
          "publishedOn": "2025-05-12T13:17:34.000Z",
          "wordCount": 8039,
          "title": "All Of You Motherfuckers Are On Fraud Watch",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2214400251.jpg"
        },
        {
          "id": "https://defector.com/?p=189317",
          "author": "Lauren Theisen",
          "description": "\"What's the deal with the Savannah Bananas?\"\nLike five different times over the past few months, someone at this website has posed that question to the rest of the folks who work here. For the uninitiated, I will begin with the most dispassionate, factual answer in the paragraph below.",
          "link": "https://defector.com/the-savannah-bananas-make-baseball-boring",
          "publishedOn": "2025-05-11T16:15:57.000Z",
          "wordCount": 8066,
          "title": "The Savannah Bananas Make Baseball Boring",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-22120462462-e1746972569507.jpg"
        },
        {
          "id": "https://defector.com/?p=189329",
          "author": "Chris Thompson",
          "description": "Rafael Devers did what his bosses wanted. The Red Sox went out and grabbed a big-time addition over the winter, but to maximize their investment they needed Devers to shift away from his preferred position—the one he's been playing his entire career, and the one the Red Sox extended him a nine-figure contract to continue playing off into the future. Devers wasn't happy about the request and resisted for a while. He eventually caved, and then he endured an embarrassing, historically awful start to the season while adjusting to this new deal. But he's recovered admirably and been a reliable and productive contributor for a fun and competitive Red Sox team.\nNow the team is at it again. First baseman Triston Casas, off to a hateful, miserable start of his own, nuked his left knee while trying to beat out an infield single on May 2 and has been lost for the year. The Red Sox have since tried out Romy Gonzalez, Abraham Toro, and Nick Sogard over at first, with results that you would call broadly lousy—7-for-26 at the plate with zero extra-base hits—were it not for the fact that Casas was producing an OPS+ of [awful retching noises]. It's not that these are especially terrible baseball players—although scanning Toro's Baseball Reference page is causing an alarming intensification of the retching—but certainly none of those poor bozos is the sort of guy a team is eager to get into the lineup, least of all a team with semi-credible playoff aspirations.",
          "link": "https://defector.com/red-sox-now-chasing-rafael-devers-across-the-country-waving-lineup-card",
          "publishedOn": "2025-05-11T15:04:08.000Z",
          "wordCount": 7512,
          "title": "Red Sox Now Chasing Rafael Devers Across The Country, Waving Lineup Card",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2214113128.jpg"
        },
        {
          "id": "https://defector.com/?p=189334",
          "author": "Lauren Theisen",
          "description": "It didn't matter that the Oilers jumped out to a 2–0 lead in Game 3. It didn't matter that Stuart Skinner, forced back into action after Calvin Pickard's injury, allowed fewer goals than he did in his two catastrophic starts against the Kings. And it didn't matter that, with the score 3–2 Vegas in the final few minutes, Connor McDavid unlocked the Golden Knights' defense with a little pass from the corner that went in off an enemy skate. All anyone's going to remember from Saturday night is the very last second, which is how Vegas managed to cut into Edmonton's 2–0 series lead.\nAny reasonable person would have been ready for overtime as William Karlsson broke into the offensive zone and took the puck behind the net with under five seconds to play. But in retrospect, when the VGK original sent the puck flying backward into the slot for another one of his expansion-season brethren, Reilly Smith, neither man had yet given up on the third period, and there was still enough time to inflict the knockout blow. Smith, using nearly every tenth of a second allotted to him, zoomed past a diving Oilers defender and tried to round a sliding Skinner as he fired a shot in the direction of the crease. The puck bounced so quickly that in real time, the closest official didn't see a goal. But replay review revealed the buzzer-beater, and worse, the person most responsible for it crossing the line.",
          "link": "https://defector.com/leon-no",
          "publishedOn": "2025-05-11T14:25:10.000Z",
          "wordCount": 6175,
          "title": "Leon, No!",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2213883927.jpg"
        },
        {
          "id": "https://defector.com/?p=189322",
          "author": "Chris Thompson",
          "description": "The Boston Celtics and New York Knicks have played 149 minutes across three games of their second-round playoff series. The Celtics—the higher seeded team and the defending NBA champions—have led outright for about 128 minutes of that time, and the teams have spent about another 11 minutes tied, meaning the Knicks have led in this series for a little over 10 total minutes. The Celtics have gained leads of at least 20 points in each game, while the Knicks have never led by double digits; they have, in fact, never once had a three-possession lead. This isn't a real metric, I may have just made it up while I sat here, but: If you total together New York's maximum lead from each of the three games, and then multiply the sum by the total minutes they've spent in the lead, you get 90. If you do the same for the Celtics—20 points in Game 1, another 20 in Game 2, 31 points in Game 3, added together and then multiplied by total time in the lead—you get 9,088.\nThis is very dumb, meaningless math, but for some weird reason I have always been tickled by one number being way huger than another number. The Knicks have 90 units of advantage through three games, against Boston's 9,088: Wow! And also: Ha! By my dumb metric, it would be absolutely ludicrous to guess that the team holding the overall lead in the series today is the New York Knicks. But here we are! Boston needed a win Saturday to avoid falling into a 3–0 hole in a matchup that they have otherwise absolutely dominated.",
          "link": "https://defector.com/celtics-flatten-knicks-by-sticking-to-the-formula",
          "publishedOn": "2025-05-11T13:52:59.000Z",
          "wordCount": 9203,
          "title": "Celtics Flatten Knicks By Sticking To The Formula",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2214425634.jpg"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=852571",
          "author": "Darragh McDonald",
          "description": "The Royals announced that right-hander Taylor Clarke has been reinstated from the paternity list. Catcher Luke Maile has been designated for assignment as the corresponding move. The club’s 40-man roster count drops from 39 to 38. Maile, 34, signed a minor league deal with the Royals in the offseason and was selected to the big…",
          "link": "https://www.mlbtraderumors.com/2025/05/royals-designate-luke-maile-for-assignment.html",
          "publishedOn": "2025-05-19T19:30:16.000Z",
          "wordCount": 3306,
          "title": "Royals Designate Luke Maile For Assignment",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/Luke_Maile_Royals-copy-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=852527",
          "author": "Nick Deeds",
          "description": "The Royals have purchased the contract of right-hander John Gant from the Atlantic League’s Long Island Ducks, according to a report from Robert Murray of Fansided. Gant will report to club’s Triple-A affiliate in Omaha. It’s an exciting turn of events of Gant, who last pitched in the majors back in 2021 and hasn’t pitched…",
          "link": "https://www.mlbtraderumors.com/2025/05/royals-purchase-john-gants-contract.html",
          "publishedOn": "2025-05-19T01:42:52.000Z",
          "wordCount": 4151,
          "title": "Royals Purchase John Gant’s Contract",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2021/12/john-gant-1024x725.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=852454",
          "author": "Mark Polishuk",
          "description": "The Royals announced that right-hander Chris Stratton has been designated for assignment.  Fellow righty Jonathan Bowlan was called up from Triple-A in the corresponding move. The DFA probably closes the book on what has been a disappointing season-plus for Stratton in Kansas City.  Following four solid seasons of bullpen work from 2020-23 and a World…",
          "link": "https://www.mlbtraderumors.com/2025/05/royals-designate-chris-stratton-for-assignment.html",
          "publishedOn": "2025-05-18T15:10:14.000Z",
          "wordCount": 3534,
          "title": "Royals Designate Chris Stratton For Assignment",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/ChrisStratton-2025Royals-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=852390",
          "author": "Mark Polishuk",
          "description": "The Royals announced that two of their top starters are heading to the 15-day injured list.  Cole Ragans has been sidelined due to a left groin strain, while Seth Lugo (whose placement is retroactive to May 14) is dealing with a sprained middle finger on his throwing hand.  Left-hander Noah Cameron was called up from…",
          "link": "https://www.mlbtraderumors.com/2025/05/royals-place-cole-ragans-seth-lugo-on-15-day-injured-list.html",
          "publishedOn": "2025-05-17T18:18:51.000Z",
          "wordCount": 3099,
          "title": "Royals Place Cole Ragans, Seth Lugo On 15-Day Injured List",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/ColeRagans-2025-1024x615.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=852345",
          "author": "Mark Polishuk",
          "description": "Seth Lugo was scratched from a scheduled start today against the Cardinals, as the Royals right-hander is battling inflammation in the middle finger of his throwing hand.  The hope is that Lugo will be out for just one turn in the rotation, manager Matt Quatraro told reporters (including Jaylon Thompson of the Kansas City Star)…",
          "link": "https://www.mlbtraderumors.com/2025/05/al-central-notes-lugo-ragans-castro-meadows.html",
          "publishedOn": "2025-05-17T13:59:31.000Z",
          "wordCount": 3617,
          "title": "AL Central Notes: Lugo, Ragans, Castro, Meadows",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/SethLugo-2025Royals-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=851867",
          "author": "Darragh McDonald",
          "description": "The Royals announced that they have signed left-hander Rich Hill to a minor league deal. He will report to the club’s spring training/Complex League facility in Surprise but will be heading to Triple-A Omaha soon. The veteran lefty has already defied the normal aging curves and seems determined to do so again. Now 45 years…",
          "link": "https://www.mlbtraderumors.com/2025/05/royals-sign-rich-hill-to-minor-league-deal.html",
          "publishedOn": "2025-05-13T19:10:52.000Z",
          "wordCount": 4703,
          "title": "Royals Sign Rich Hill To Minor League Deal",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/01/rich-hill-pitching-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=851816",
          "author": "Anthony Franco",
          "description": "The A’s returned Rule 5 draftee Noah Murdock to the Royals, as first reflected on the MLB.com transaction log. Kansas City assigned him to Triple-A Omaha. Murdock does not occupy a spot on their 40-man roster. This was the likeliest outcome after the A’s designated Murdock for assignment last Friday. Any team that traded for him…",
          "link": "https://www.mlbtraderumors.com/2025/05/as-return-rule-5-pick-noah-murdock-to-royals.html",
          "publishedOn": "2025-05-13T02:40:23.000Z",
          "wordCount": 3301,
          "title": "A’s Return Rule 5 Pick Noah Murdock To Royals",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/USATSI_26116278-1024x683.jpg"
        }
      ]
    },
    {
      "title": "Flaming Hydra",
      "feedUrl": "https://flaminghydra.com/rss/",
      "siteUrl": "https://flaminghydra.com/",
      "articles": [
        {
          "id": "682c914037814f000188af10",
          "author": "The Editors",
          "description": "Yemisi Aribisala on the difficulty of keeping one’s head",
          "link": "https://flaminghydra.com/issue-323/",
          "publishedOn": "2025-05-20T19:31:36.000Z",
          "wordCount": 820,
          "title": "Unkindly cut",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/IMG_5124-1.jpg"
        },
        {
          "id": "682a5c8237814f000188995d",
          "author": "Yemisi Aribisala",
          "description": "My revenge, I decided very early, would be to achieve a power which outlasts kingdoms. \t\t— James Baldwin\nThe young lady’s parents turned up on a whim to visit her. Or so it seemed, but the drive from Lagos to the university in the city of Ile-Ife was",
          "link": "https://flaminghydra.com/violence-against-hair/",
          "publishedOn": "2025-05-20T18:56:50.000Z",
          "wordCount": 889,
          "title": "Violence Against Hair",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/IMG_5124.jpg"
        },
        {
          "id": "6827a3b837814f0001889619",
          "author": "The Editors",
          "description": "Brian Hioe on the distant music scene in China; POLL results!",
          "link": "https://flaminghydra.com/issue-322/",
          "publishedOn": "2025-05-19T18:29:11.000Z",
          "wordCount": 698,
          "title": "Remote underground / Readers’ choice",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/baile-1.jpg"
        },
        {
          "id": "6827967937814f000188958f",
          "author": "Brian Hioe",
          "description": "My latest thing to listen to while working has been online Chinese underground electronic music streaming programs. I’ve always liked streaming programs, in which you can see the DJ playing live and sometimes a live crowd in the background. The most famous of them, I believe, is Boiler",
          "link": "https://flaminghydra.com/listening-from-afar/",
          "publishedOn": "2025-05-19T18:27:30.000Z",
          "wordCount": 724,
          "title": "Listening from Afar",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/baile.jpg"
        },
        {
          "id": "682b376837814f0001889a45",
          "author": "The Editors",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/poll-results/",
          "publishedOn": "2025-05-19T18:26:55.000Z",
          "wordCount": 318,
          "title": "POLL results!!",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/hydravot.jpg"
        },
        {
          "id": "682636ab37814f00018880a2",
          "author": "The Editors",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/issue-321/",
          "publishedOn": "2025-05-16T00:16:19.000Z",
          "wordCount": 341,
          "title": "READER POLL ONLINE: RELEASE the Hydra Blogs of Your Choosing",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/hero-hydra-16x9-300-dpi-cmyk.png"
        },
        {
          "id": "682652c537814f00018880ea",
          "author": "The Editors",
          "description": "Dear Hydra readers, we ask for your help in selecting five new blogs to release into the wild, in order that new readers may get a good sense of what Flaming Hydra is all about. This list is long, but not long enough, because we were forced by sheer exhaustion",
          "link": "https://flaminghydra.com/choose-your-favorite-flaming-hydra-blogs/",
          "publishedOn": "2025-05-15T23:56:56.000Z",
          "wordCount": 556,
          "title": "READER POLL: RELEASE the Hydra Blogs of Your Choosing",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/Screenshot-2025-05-15-at-5.55.26-PM.jpg"
        },
        {
          "id": "6823e2b885d28b00015c2431",
          "author": "The Editors",
          "description": "A stroll among the flowers with Emily Flake; a scandal explained by Jídé Salawu",
          "link": "https://flaminghydra.com/issue-320/",
          "publishedOn": "2025-05-14T19:19:16.000Z",
          "wordCount": 401,
          "title": "Birds and bees / Political potency",
          "imageUrl": "https://flaminghydra.com/content/images/2025/05/hero-edit-16x9.jpg"
        },
        {
          "id": "6824c55e37814f0001886b72",
          "author": "Emily Flake",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/pollinator-gardens-explained/",
          "publishedOn": "2025-05-14T19:18:44.000Z",
          "wordCount": 321,
          "title": "Pollinator Gardens Explained",
          "imageUrl": "https://flaminghydra.com/content/images/2025/05/hero-edit-16x9-1.jpg"
        },
        {
          "id": "6823e1eb85d28b00015c241d",
          "author": "Jídé Salawu",
          "description": "A few weeks ago, on March 5, Nigerian senator Natasha H. Akpoti-Uduaghan—one of only four women in the 109-member senate—submitted a petition alleging sexual misconduct against Senate President Godswill Akpabio, an act that resulted in her suspension for “misconduct” the following day, and, eventually,",
          "link": "https://flaminghydra.com/sign-of-the-father/",
          "publishedOn": "2025-05-14T19:18:16.000Z",
          "wordCount": 713,
          "title": "Sign of the Father",
          "imageUrl": "https://flaminghydra.com/content/images/2025/05/arise-clip-hand-up-Screenshot-2025-05-14-at-10.58.17-AM.jpg"
        },
        {
          "id": "6822680f74fb8d000119f328",
          "author": "The Editors",
          "description": "Seizing the megaphone with Osita Nwanevu; Nathan Munn reveals the monster in the machine",
          "link": "https://flaminghydra.com/issue-319/",
          "publishedOn": "2025-05-13T17:36:25.000Z",
          "wordCount": 350,
          "title": "Use your words / Fear your data",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/orson-3.jpg"
        },
        {
          "id": "6822821674fb8d000119f4d4",
          "author": "Osita Nwanevu",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/pivot-to-video/",
          "publishedOn": "2025-05-13T17:33:07.000Z",
          "wordCount": 315,
          "title": "Pivot to Video",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/orson-1.jpg"
        },
        {
          "id": "6822689d74fb8d000119f335",
          "author": "Nathan Munn",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/automatic-for-the-people/",
          "publishedOn": "2025-05-13T17:31:56.000Z",
          "wordCount": 306,
          "title": "Automatic for the People",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/000583-0063-000136.jpg"
        },
        {
          "id": "6822385574fb8d000119e098",
          "author": "The Editors",
          "description": "A luscious food (and book) tour with Laurie Woolever, and memories of Misha Angrist’s best friends",
          "link": "https://flaminghydra.com/issue-318/",
          "publishedOn": "2025-05-12T20:24:18.000Z",
          "wordCount": 694,
          "title": "Edible itinerary / Canine companionship",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/cakke-1.jpg"
        },
        {
          "id": "68220b1774fb8d000119df2f",
          "author": "Misha Angrist",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/my-life-in-dogs/",
          "publishedOn": "2025-05-12T20:24:01.000Z",
          "wordCount": 310,
          "title": "My Life in Dogs",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/Django-May-2008.jpeg"
        },
        {
          "id": "68222da674fb8d000119e000",
          "author": "Laurie Woolever",
          "description": "I wrote a book about food (and drinking, and sex, and marriage, and celebrity, and death) that came out in March, and for which my publisher sent me on a book tour that kicked off in New York. Before that event, I had dinner with my editor and publicist at",
          "link": "https://flaminghydra.com/what-i-ate-on-book-tour/",
          "publishedOn": "2025-05-12T20:18:21.000Z",
          "wordCount": 690,
          "title": "What I Ate on Book Tour",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/cakke.jpg"
        }
      ]
    },
    {
      "title": "Today in Tabs",
      "feedUrl": "https://rss.beehiiv.com/feeds/ZRiesnGI0u.xml",
      "siteUrl": "https://www.todayintabs.com/",
      "articles": []
    },
    {
      "title": "Bad Faith Times",
      "feedUrl": "https://bad-faith-times.ghost.io/rss/",
      "siteUrl": "https://bad-faith-times.ghost.io/",
      "articles": [
        {
          "id": "682b1bbc7bab250001b2f03b",
          "author": "Denny Carter",
          "description": "After the Great Redo reforms, conservatives begged for Roe. We said no.",
          "link": "https://bad-faith-times.ghost.io/blog-posts-from-the-glorious-future-how-abortion-became-legal-again/",
          "publishedOn": "2025-05-19T12:49:35.000Z",
          "wordCount": 2573,
          "title": "Blog Posts From The Glorious Future: How Abortion Became Legal Again",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/05/Pro-choice_demonstration_about_Whole_Woman-s_Health_v._Hellerstedt_in_front_of_SCOTUS_24.jpg"
        },
        {
          "id": "68262c5c7bab250001b2eaa9",
          "author": "Denny Carter",
          "description": "Grok isn't playing ball with Musk's effort to convince people that white South Africans are a persecuted minority",
          "link": "https://bad-faith-times.ghost.io/bft-podcast-the-machines-wont-play-elon-musks-bad-faith-game/",
          "publishedOn": "2025-05-15T18:16:06.000Z",
          "wordCount": 623,
          "title": "BFT Podcast: The Machines Won't Play Elon Musk's Bad-Faith Game",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/05/Screenshot-2025-05-15-at-2.02.26-PM.png"
        },
        {
          "id": "68235ba5761ee70001e49411",
          "author": "Denny Carter",
          "description": "Characterizing white South Africans as a persecuted minority in need of saving is a miscalculation by the bad-faith unreality creators among us",
          "link": "https://bad-faith-times.ghost.io/when-the-unreality-is-too-unreal/",
          "publishedOn": "2025-05-13T15:09:50.000Z",
          "wordCount": 1977,
          "title": "When The Unreality Is Too Unreal",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/size/w1200/2025/05/Screenshot-2025-05-13-at-11.12.15-AM-1.png"
        },
        {
          "id": "681e4abe0643d000010d39ac",
          "author": "Denny Carter",
          "description": "A critical alternate consciousness is manifesting in myriad ways. It's a hopeful development in a hopeless time.",
          "link": "https://bad-faith-times.ghost.io/this-vibe-shift-is-not-happening-by-accident/",
          "publishedOn": "2025-05-12T14:41:57.000Z",
          "wordCount": 2549,
          "title": "This Vibe Shift Is Not Happening By Accident",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/05/Black_Lodge_Twin_Peaks.jpeg"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}