{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": []
    },
    {
      "title": "The Pitch",
      "feedUrl": "https://www.thepitchkc.com/feed/",
      "siteUrl": "https://www.thepitchkc.com/",
      "articles": [
        {
          "id": "https://www.thepitchkc.com/?p=864326",
          "author": "Emily Jacobs",
          "description": "Courtesy Aiming Arrows Kansas City alternative rock band Aiming Arrows formed two-and-a-half years ago after Jared Johnson, Alec Stockman, Emilio Estrada, and Jacob Newland’s respective bands split during COVID. They loosely define themselves as “alternative rock” because they don’t want to be boxed in. “We really wanted something that was really authentic and not trying to be the cool guys...",
          "link": "https://www.thepitchkc.com/aiming-arrows-merge-genres-for-an-alt-rock-tone-all-their-own/",
          "publishedOn": "2024-12-07T18:40:45.000Z",
          "wordCount": 1996,
          "title": "Aiming Arrows merge genres for an alt-rock tone all their own",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/12/u/w/screenshot-2024-12-07-at-121401pm.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864340",
          "author": "Anna Spoerre",
          "description": "The Planned Parenthood clinic in St. Louis on June 24, 2022 (Tessa Weinberg/Missouri Independent) It’s been more than twelve hours since Amendment 3 went into effect in Missouri. No abortions have begun again at the state’s Planned Parenthood clinics. That’s because officials with Planned Parenthood, which operates health centers across the state, said they are still waiting on a judge’s...",
          "link": "https://www.thepitchkc.com/missouri-planned-parenthood-clinics-hold-off-resuming-abortions-await-court-ruling/",
          "publishedOn": "2024-12-07T18:33:47.000Z",
          "wordCount": 2421,
          "title": "Missouri Planned Parenthood clinics hold off resuming abortions, await court ruling",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/12/t/y/screenshot-2024-12-07-at-123112pm-1024x624.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864260",
          "author": "Sarah Sipple",
          "description": "Merryton // Photo by Sarah Sipple There’s a new holiday pop-up this year, and it blends pop culture and history for a family-friendly experience.  Merryton is a Bridgerton-inspired holiday theme at The Mandarin, an event space on the grounds of Vivilore in Independence. Merryton is open for reservations Thursdays through Saturdays, now through December 28. It is less of a...",
          "link": "https://www.thepitchkc.com/eat-drink-and-be-merryton-at-this-regency-themed-pop-up/",
          "publishedOn": "2024-12-06T17:00:24.000Z",
          "wordCount": 1803,
          "title": "Eat, drink, and be Merryton at this Regency-themed pop-up",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/w/z/img-4723-scaled.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=863759",
          "author": "Lane Rozin",
          "description": "Photo by Lane Rozin Three years ago, Regan Virnoche moved to Lawrence with a dream to create and share music with others. Before the end of her freshman year, Virnoche and a few new instrumentalist friends had formed Lavender Bride. Lavender Bride, also known as “LB,” is an indie-pop group that fuses elements of jazz and alternative music into their...",
          "link": "https://www.thepitchkc.com/hunter-the-prey-lfks-lavender-bride-culminates-college-collabs-with-upcoming-lp/",
          "publishedOn": "2024-12-06T14:00:10.000Z",
          "wordCount": 2319,
          "title": "LFK’s Lavender Bride culminates college collabs with upcoming LP",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/t/j/1q9a0309-2.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864284",
          "author": "Allison Kite",
          "description": "Kansas City Mayor Quinton Lucas speaks at a vaccine clinic at the Morning Star Community Center in Kansas City (photo courtesy of Missouri Governor’s Office). It cost $23,518 for Kansas City Mayor Quinton Lucas, a top aide and two police officers on his security detail to attend the Super Bowl in Phoenix last year. The day after the game, the...",
          "link": "https://www.thepitchkc.com/kansas-city-mayor-accused-of-skirting-city-gift-ban-by-using-nonprofit-to-pay-for-travel/",
          "publishedOn": "2024-12-05T22:15:31.000Z",
          "wordCount": 4388,
          "title": "Kansas City mayor accused of skirting city gift ban by using nonprofit to pay for travel",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/12/v/f/51148389616-b2b475799b-c.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=863940",
          "author": "Nick Spacek",
          "description": "Allman Betts Band. // photo courtesy the artist Making its first-ever stop in Kansas City on Sunday, December 15, at the Uptown, the Allman Betts Revival Tour is in its eighth annual go-round. Featuring Devon Allman and Duane Betts, along with a revolving cast of musicians and special guests, the tour showcases the music of the Allman Brothers Band. Each...",
          "link": "https://www.thepitchkc.com/the-allman-betts-revival-tour-celebrates-rock-legacy-when-it-hits-the-uptown/",
          "publishedOn": "2024-12-05T22:00:20.000Z",
          "wordCount": 2283,
          "title": "The Allman Betts Revival Tour celebrates rock legacy when it hits the Uptown",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/b/l/screenshot-2024-12-03-at-44313pm.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864198",
          "author": "Sarah Sipple",
          "description": "Art by Cassondra Jones Life in KC is pretty delicious. In fact, there is often so much going on that it can be hard to decide where to go and what to try. That’s where I come in.  I’ve curated this weekly list of events, openings, deals, and celebrations to keep you in-the-know. Cheers! Something New Atelier Co.: Laura Clark,...",
          "link": "https://www.thepitchkc.com/kc-sipps-news-from-cafe-corazon-the-campground-andys-and-bar-medici/",
          "publishedOn": "2024-12-05T20:00:09.000Z",
          "wordCount": 2142,
          "title": "KC Sipps: News from Café Corazón, The Campground, Andy’s, and Bar Medici",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2023/08/v/i/kc-sipps-1024x538-1.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=861794",
          "author": "Pitch Staff",
          "description": "Dumplings at Chewology // Photo by Pilsen Photo Co-op Earlier this month, we published The Pitch’s annual Best of Kansas City issue. You can take a peek at the results of the readers’ poll here. The issue also included a list, compiled and written by our editorial staff, of some local people, places, and things that we thought clearly won...",
          "link": "https://www.thepitchkc.com/best-of-kc-2024-yet-another-year-of-james-beard-award-nominations-are-a-siren-song-to-foodies-across-america/",
          "publishedOn": "2024-12-05T17:00:57.000Z",
          "wordCount": 1964,
          "title": "Best of KC 2024: Yet another year of James Beard Award nominations are a siren song to foodies across America",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/11/g/z/image1-scaled.jpeg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864208",
          "author": "Stephen Fuller",
          "description": "UMKC Roos versus Idaho Vandals on Wednesday, Dec. 4, 2024. // Photo by Stephen FullerThe UMKC Roos Men’s Basketball Team took on the Idaho Vandals on Wednesday, Dec. 4. The Roos started slowly, trailing 43-31 going into halftime, but picked it up come the second, scoring 46 in the half. Despite the high-scoring second half, UMKC would fall short to...",
          "link": "https://www.thepitchkc.com/photos-umkc-mens-basketball-falls-short-in-nailbiter-against-idaho/",
          "publishedOn": "2024-12-05T16:22:54.000Z",
          "wordCount": 1572,
          "title": "Photos: UMKC Men’s Basketball falls short in nailbiter against Idaho",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/12/q/k/2e3a2273-scaled.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864190",
          "author": "Anna Spoerre",
          "description": "Solicitor General Josh Divine called Planned Parenthood’s lawsuit seeking to unravel Missouri’s abortion restrictions “unusually aggressive” while speaking to media Wednesday, Dec. 4, 2024, outside the Jackson County Courthouse (Anna Spoerre/Missouri Independent). Missouri’s trigger law banning nearly all abortions remains in place. But at 12:01 a.m. Friday, Amendment 3 will go into effect. The constitutional amendment, which received 51.6% of...",
          "link": "https://www.thepitchkc.com/judge-could-allow-planned-parenthood-to-begin-performing-abortions-in-missouri-friday/",
          "publishedOn": "2024-12-05T14:18:13.000Z",
          "wordCount": 2832,
          "title": "Judge could allow Planned Parenthood to begin performing abortions in Missouri Friday",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/12/v/x/screenshot-2024-12-04-at-94833pm-1536x921-1-1024x614.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864179",
          "author": "Jason Hancock",
          "description": "Billy Long speaks during a press conference before filing for to be on the ballot in the Missouri GOP Senate primary on Feb. 22, 2022, in Jefferson City (Madeline Carter/Missouri Independent). Former Missouri Congressman Billy Long was tapped on Wednesday evening by President-elect Donald Trump to lead the Internal Revenue Service. Trump called Long — who served six terms representing...",
          "link": "https://www.thepitchkc.com/donald-trump-picks-missouris-billy-long-to-lead-the-irs/",
          "publishedOn": "2024-12-05T14:13:53.000Z",
          "wordCount": 2060,
          "title": "Donald Trump picks Missouri’s Billy Long to lead the IRS",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/12/c/p/candidatefilingday02222022000026-2048x1365-1.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864138",
          "author": "Scott Poore",
          "description": "Photo Courtesy of Scott Poore Meet Winnie—the longest-term shelter resident at Pleasant Hill Animal Control. This sweet girl has been waiting far too long for her forever home. She is a 40 lb., one-year-old shepherd mix that has practically grown up in the shelter. She loves kids, people, and other dogs. Her favorite things involved all of the classics: playing...",
          "link": "https://www.thepitchkc.com/creature-feature-meet-the-wonderful-winnie/",
          "publishedOn": "2024-12-05T14:00:46.000Z",
          "wordCount": 1552,
          "title": "Creature Feature: Meet the wonderful Winnie",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/c/x/screenshot-2024-12-04-112815.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=861278",
          "author": "Joe Ellett",
          "description": "Art by Keegan Hudspeth Getting your foot in the door as an owner of a licensed cannabis facility in Missouri is a lengthy process: the requirements, regulations, qualifications, and overall extensivity is unlike starting any other business.  There are already many well-known facilities around the state that have been standing since medical marijuana was legalized. But the the structure of...",
          "link": "https://www.thepitchkc.com/who-is-attempting-to-claim-stakes-by-proxy-in-missouris-cannabis-microbusinesses/",
          "publishedOn": "2024-12-04T22:30:28.000Z",
          "wordCount": 4571,
          "title": "Who is attempting to claim stakes by proxy in Missouri’s cannabis microbusinesses?",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/r/s/smokeshow-newlogo2-1-1024x571.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=863692",
          "author": "Michael Mackie",
          "description": "Photo by Jacob Ritts Just when you thought December couldn’t get any more festive, along comes The Jinkx & DeLa Holiday Show. For the last seven years, drag queen superstars Jinkx Monsoon and BenDeLaCreme have been putting their acclaimed musical theater talents to good use. The duo co-write and co-star in a new holiday-themed production each year.  When we talked...",
          "link": "https://www.thepitchkc.com/make-the-yuletide-gay-the-jinkx-dela-holiday-special-is-headed-to-kc/",
          "publishedOn": "2024-12-04T20:00:30.000Z",
          "wordCount": 3023,
          "title": "Make The Yuletide Gay: The Jinkx & DeLa Holiday Special is headed to KC",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/t/b/screenshot-2024-12-01-200635.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=861782",
          "author": "Pitch Staff",
          "description": "Photo Courtesy of Glenn Robinson Earlier this month, we published The Pitch’s annual Best of Kansas City issue. You can take a peek at the results of the readers’ poll here. The issue also included a list, compiled and written by our editorial staff, of some local people, places, and things that we thought clearly won 2024. We’ll be publishing...",
          "link": "https://www.thepitchkc.com/best-of-kc-2024-multi-hyphenate-artistic-entrepreneur-the-epitome-rebrands-and-expands/",
          "publishedOn": "2024-12-04T17:00:19.000Z",
          "wordCount": 1864,
          "title": "Best of KC 2024: Multi-hyphenate artistic entrepreneur The Epitome rebrands and expands",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/09/s/q/screenshot-2024-09-03-111014.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864011",
          "author": "Anna Spoerre",
          "description": "State Sen. Rick Brattin, a Harrisonville Republican, protests outside a Planned Parenthood clinic in Kansas City on Tuesday, Dec. 3, 2024, ahead of a hearing in a lawsuit filed by Planned Parenthood seeking to overturn the state’s TRAP laws (Anna Spoerre/Missouri Independent) On the eve of a Wednesday hearing seeking to strike down most Missouri abortion restrictions, GOP lawmakers and...",
          "link": "https://www.thepitchkc.com/anti-abortion-lawmakers-activists-call-on-missouri-court-to-rule-against-planned-parenthood/",
          "publishedOn": "2024-12-04T16:21:25.000Z",
          "wordCount": 2786,
          "title": "Anti-abortion lawmakers, activists call on Missouri court to rule against Planned Parenthood",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/12/k/w/screenshot-2024-12-04-at-101220am-1024x611.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864001",
          "author": "Michael Mackie",
          "description": "Photo by Robyn Von Swank Comedian Sarah Silverman is processing a lot right now—both on stage and in life—with hilariously deep results. And she’s putting it all out there when her well-received Postmortem Tour hits The Midland Theatre tomorrow night, Thursday, Dec. 5.  In Hollywood, the two-time Emmy Award-winner is considered a quadruple threat—comedian, actress, writer, and producer. (Or quintuple threat if...",
          "link": "https://www.thepitchkc.com/sarah-silvermans-cathartically-comedic-postmortem-tour-hits-kc-thursday/",
          "publishedOn": "2024-12-04T16:00:54.000Z",
          "wordCount": 3168,
          "title": "Sarah Silverman’s cathartically comedic Postmortem Tour hits KC Thursday",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/z/i/sarah-silverman-06-07-24-19-66633336d98e9.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=863954",
          "author": "Tiffany Watts",
          "description": "Aahaa Modern Indian Cuisine // Photo By Tiffany Watts Aahaa Indian Cuisine  For the past seven years, Aahaa Indian Cuisine has been a cornerstone for South Indian flavors in Kansas City. But recently, this once-traditional restaurant underwent a complete transformation, both in ambiance and menu, marking a new chapter for fans of Indian cuisine. From its chic new decor to...",
          "link": "https://www.thepitchkc.com/dish-drink-kc-aahaa-indian-cuisine-and-eileens-colossal-cookies/",
          "publishedOn": "2024-12-04T14:00:20.000Z",
          "wordCount": 2367,
          "title": "Dish & Drink KC: Aahaa Indian Cuisine and Eileen’s Colossal Cookies",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/v/c/aahaa-modern-indian-cuisine-photo-by-tiffany-watts-4-scaled.jpg"
        }
      ]
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=175652",
          "author": "Justin Ellis",
          "description": "Being a prophet is notoriously a risky business. One needs no small amount of charm in order to win over the masses with a sly smile and a knowing glance. It is important to be humble and never boastful. They must overcome challenges that would vex simpler beings. Maybe more than anything else a prophet is nothing without wisdom beyond their years, a knowledge so precise that it seems touched by a voice beyond our simple celestial veil. To fail as a prophet is certain doom at the hands of the devout, but in success we are rendered helpless at their spectacle.\n\"These teams are 2-2 in their last four matchups, and the Redhawks' defense looks good,\" Timothee Chalamet told the set of ESPN's College Game Day on Saturday in Atlanta. Amongst a sea of fans and a collection of back-slapping Jos. A Bank suits, he continued: \"But I'm looking at fourth-year Bobcats quarterback Parker Navarro, 65 percent completion rate. If he can get going, he'll tilt this in favor of the Bobcats. I'm going underdog Bobcats here.\"",
          "link": "https://defector.com/shocker-this-handsome-actor-is-in-fact-a-ball-knower",
          "publishedOn": "2024-12-09T00:21:22.000Z",
          "wordCount": 6850,
          "title": "SHOCKER: This Handsome Actor Is In Fact A Ball-Knower",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2188543155.jpg"
        },
        {
          "id": "https://defector.com/?p=175630",
          "author": "Luis Paez-Pumar",
          "description": "Though neither is the other's biggest rival club, Chelsea and Tottenham always seem to put on fascinating matches, at least for neutrals. Tottenham has the ability to play up to any competition—or, as it may be, play down to any competition; sorry about that jinx, Spurs—and while Chelsea has been on a relative tear this season, emerging as dark horse title contenders at absolute worst, the Blues are always good for some shenanigans. The two clubs clashing at this point in time, with Spurs reeling after a swift downturn in form following its statement win over Manchester City and Chelsea with the opportunity to get the Premier League lead gap down to four points following the storm-aided postponement of Liverpool-Everton, promised to be entertaining. What it did not promise but joyfully delivered was a mess slamming face first into a disaster.\n\nhttps://www.youtube.com/watch?v=guuUpRuF7Fk",
          "link": "https://defector.com/never-doubt-tottenhams-inability-to-capitalize-on-chaos",
          "publishedOn": "2024-12-08T21:09:56.000Z",
          "wordCount": 7846,
          "title": "Never Doubt Tottenham’s Inability To Capitalize On Chaos",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2188893846.jpg"
        },
        {
          "id": "https://defector.com/?p=175610",
          "author": "Luis Paez-Pumar",
          "description": "If there's something I did not expect from this sometimes-unpredictable, oft-chaotic, and almost always-entertaining Formula 1 season in its last race, Sunday's Abu Dhabi Grand Prix, it was a perfectly calm drive from Lando Norris. Entering the race weekend, Norris and his McLaren teammate Oscar Piastri had a tangible goal in mind: Outscore Ferrari's Charles Leclerc and Carlos Sainz by 21 points (or more), and the papaya-clad team would lift its first Constructors' Championship trophy since 1998. Given that Leclerc had a bit of a kerfuffle in qualifying on top of a 10-grid penalty for an engine swap, leaving him starting in 19th, this felt like a shoo-in for McLaren.\nThen, as he often does in good and bad ways, Max Verstappen struck. This time, he did so quite literally: On the first turn of the race, Verstappen, who started fifth, tried to overtake Piastri in typical Verstappen manner, and misjudged his dive bomb, instead hitting Piastri and spinning both drivers to the back of the grid.",
          "link": "https://defector.com/lando-norris-kept-his-cool-until-the-end",
          "publishedOn": "2024-12-08T19:23:18.000Z",
          "wordCount": 7736,
          "title": "Lando Norris Kept His Cool Until The End",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2188874047.jpg"
        },
        {
          "id": "https://defector.com/?p=175612",
          "author": "Justin Ellis",
          "description": "In the late hours of Friday afternoon the NFL quietly announced it was ending its investigation into the most recent allegations of sexual assault against Cleveland Browns quarterback Deshaun Watson. Watson was named in a lawsuit filed in Harris County (Texas) in September that accused him of sexual assault and battery in October 2020 while he was still playing for the Houston Texans. Watson denied the allegations, and the league promised to examine the case under the NFL's personal conduct policy.\n\"The matter is closed,\" a league spokesman said in an email to The Associated Press. \"There was insufficient evidence to support a finding of a violation of the personal conduct policy.\"",
          "link": "https://defector.com/nfl-quietly-drops-latest-investigation-into-sexual-assault-allegations-against-deshaun-watson",
          "publishedOn": "2024-12-08T18:10:45.000Z",
          "wordCount": 5860,
          "title": "NFL Quietly Drops Latest Investigation Into Sexual Assault Allegations Against Deshaun Watson",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/10/GettyImages-2179824581.jpg"
        },
        {
          "id": "https://defector.com/?p=175558",
          "author": "Ben Tippett",
          "description": "It’s all even halfway through the 2024 world chess championship between reigning champion Ding Liren and challenger Gukesh D, as they fight for chess’s highest title over 14 games in Singapore. The champion Ding Liren, coming off a nightmare run of form in 2024, sensationally won the first game with the black pieces, before the 18-year-old phenom Gukesh leveled the scores in Game 3. The other games have featured both exciting and pedestrian draws as the play has lurched between sublime and ridiculous.\nLet’s recap games 1-7 of the match, notating moves which actually occurred during the games in bold, and hypothetical variations which did not occur but could have in italics. If you missed out, check out our preview piece before we get started!",
          "link": "https://defector.com/ding-liren-is-putting-up-a-fight",
          "publishedOn": "2024-12-06T19:47:51.000Z",
          "wordCount": 18435,
          "title": "Ding Liren Is Putting Up A Fight",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2185932657.jpg"
        },
        {
          "id": "https://defector.com/?p=175527",
          "author": "Israel Daramola",
          "description": "Everything about that fourth-and-1 play by the Detroit Lions against the Green Bay Packers seemed ill-conceived, starting with the fact that they only needed a field goal to put the game away in the first place. Even with the defense getting lit up, 30-something seconds should be enough to hold firm. And then there's the fact that Jared Goff slips immediately upon trying to hand the ball off and nearly blows the play up. But it worked. Dan Campbell's gutsiness prevailed once again.",
          "link": "https://defector.com/the-lions-will-live-or-die-off-chance",
          "publishedOn": "2024-12-06T19:27:27.000Z",
          "wordCount": 5950,
          "title": "The Lions Will Live Or Die Off Chance",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2188481784.jpg"
        },
        {
          "id": "https://defector.com/?p=175542",
          "author": "Patrick Redford",
          "description": "Thursday night's Warriors-Rockets game was a burly, cantankerous example of one of my favorite categories of regular season NBA game: the Double Desperation game. The way it was won, specifically the player who won it, makes the outcome feel more indicative than a normal regular season game. Let me explain.\nThe regular season is interminable and every team must manage its efforts in Winter to be prepared for the games that matter in Spring, and so not all 82 games are going to be bangers, or even enlivened by extreme physical efforts or bold competitive displays. The schedule dictates that a decent number of games with big rest or travel disparities will tilt one way, and so not all games will feel as significant for both teams. But winning still matters, and like its colleagues such as the National TV Showcase and These Guys Want To Kill Each Other and Check This Shit Out: We Broke Math games, the Double Desperation game is given higher stakes by its participants' circumstances.",
          "link": "https://defector.com/jonathan-kuminga-makes-his-case",
          "publishedOn": "2024-12-06T19:10:21.000Z",
          "wordCount": 7603,
          "title": "Jonathan Kuminga Makes His Case",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2182148905.jpg"
        },
        {
          "id": "https://defector.com/?p=175550",
          "author": "Nicholas Russell",
          "description": "Michael Koresky begins his 2004 essay on M. Night Shyamalan’s The Village with a question: Is allegory in American cinema dead? Koresky, perceptive in his diagnosis of the post-millennium American audience as a stunned and stunted one, entertained the possibility that a literate Hollywood cinema was waning because few adults in the country read. Twenty years later, I wonder if there’s also the added element that allegory is difficult to swallow, at once too obvious and too subtle, nothing we haven’t heard before and nothing we want to hear again. \nIt’s a dangerous time for a critic, in the wake of an event as seismic as a presidential election, to engage with art when people are trying to inject meaning into cultural objects that don’t have any. This impulse is understandable; most reactions, as I’ve seen people reassure one another online, are understandable in the wake of a traumatic return to a worse status quo. But even that characterization, trauma, feels false, hyperbolic not because there is no threat to what is coming, but because the therapy-speak that saturates so much discourse does everything but engage with, even combat the thing that occasions trauma. To endeavor to create a substantive allegory out of the social and political elements that cause so much distress at a given time, whether the so-called Trump era or post-9/11, seems foolish, naive, but these are the same descriptors that have stalked Shyamalan’s career from the very beginning.",
          "link": "https://defector.com/the-village-still-has-questions-to-ask",
          "publishedOn": "2024-12-06T17:49:18.000Z",
          "wordCount": 11585,
          "title": "‘The Village’ Still Has Questions To Ask",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/the-village-1024x557-1.jpg"
        },
        {
          "id": "https://defector.com/?p=174897",
          "author": "Kathryn Xu",
          "description": "While I could count on zero hands the number of Chinese people I met in China who cared about baseball, I would need more than two to count the number of brick-and-mortar MLB stores I saw, simply by wandering around various cities like a normal human being. The first store I entered in Beijing explained some parts of this phenomenon: In China, as elsewhere outside the U.S., MLB is a streetwear brand, not a sports league. Subsequent research filled in the rest: MLB is licensed in East Asia by a South Korean retailer, which has successfully turned it into a billion-dollar enterprise in China.\nThis means that you can more easily find MLB-branded gear in more styles in China—handbags, puffer coats, eared beanies, puffier(?) baseball caps—than wandering around a city in the United States. The trade-off is extreme limitations in team selection. The streetwear brand's detachment from the actual sport of baseball and its attendant loyalties has odd side effects: In two separate stores, in two separate cities, I encountered window displays of mannequins wearing both Yankees and Red Sox gear. In response to this phenomenon, Barry Petchesky, Yankees fan, offered the following comments: \"Oh [no]\" and \"They love that stupid heart shirt!!\" I think it's a sweatshirt, Barry, but I agree with the sentiment. From Samer Kalaf, Red Sox fan: \"The duality / Of fan.\"",
          "link": "https://defector.com/in-search-of-a-phillies-hat-in-chinese-mlb-stores",
          "publishedOn": "2024-12-06T17:28:59.000Z",
          "wordCount": 8339,
          "title": "In Search Of A Phillies Hat In Chinese MLB Stores",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/chinaMLBStorePhillies-e1733506009337.jpg"
        },
        {
          "id": "https://defector.com/?p=175514",
          "author": "Tom Ley",
          "description": "This season's version of the Denver Nuggets appear to be a team constructed for the sole purpose of answering the question: Is it possible for a team with the best player in the world, having the best season of his career, to be kind of depressing to watch? Twenty games into the season, the answer is, \"Wow. I guess so.\"\nThe Nuggets lost to the Cleveland Cavaliers Thursday night, 126-114, in a game that neatly displayed the structural and spiritual issues that currently plague Denver. The Nuggets are 11-9 after winning a franchise-record 57 games last season, and there's no shortage of explanations for the slow start. Nikola Jokic and Aaron Gordon missing games hasn't helped, and neither has Jamal Murray playing like a whisper of his former self. Depth is an issue. The defense is an issue. There are a lot of issues. But in the wake of last night's loss, all of those potential answers feel like red herrings.",
          "link": "https://defector.com/math-is-catching-up-to-the-nuggets",
          "publishedOn": "2024-12-06T15:57:24.000Z",
          "wordCount": 7018,
          "title": "Math Is Catching Up To The Nuggets",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187797147.jpg"
        },
        {
          "id": "https://defector.com/?p=175220",
          "author": "Casey Taylor",
          "description": "Ed Hardy's historic tattoo parlor is closing. A lot more than that stands to be lost.",
          "link": "https://defector.com/how-do-you-preserve-tattoo-history-when-skin-and-memory-fail",
          "publishedOn": "2024-12-06T14:01:44.000Z",
          "wordCount": 13847,
          "title": "How Do You Preserve Tattoo History When Skin And Memory Fail?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-108433925.jpg"
        },
        {
          "id": "https://defector.com/?p=175488",
          "author": "Lauren Theisen",
          "description": "If you're a Pal-level subscriber at Defector, you get access to a premium weekday newsletter called The Cipher, which has a recap of the blog day, links to other sites, and extra takes and bits from staffers. You can change your newsletter preferences or upgrade your subscription at the My Account page. Here's a piece from the newsletter archives.\nI thought everyone knew The Popcorn Trick. But it has recently come to my attention that some people were unaware of The Popcorn Trick. Thus, I will explain The Popcorn Trick.",
          "link": "https://defector.com/you-must-know-the-popcorn-trick",
          "publishedOn": "2024-12-05T22:54:00.000Z",
          "wordCount": 5024,
          "title": "You Must Know The Popcorn Trick",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-148262726.jpg"
        },
        {
          "id": "https://defector.com/?p=175376",
          "author": "David Roth",
          "description": "It shouldn't be a strange thing to talk football—like, really get after it, talk about it like you really care about it—on a sports podcast, and I suppose on the merits it isn't. Drew, for his part and to his credit, is never self-conscious about it; he really cares about the Vikings like that, and he really follows the fine points of the sport like that, so this is a very natural way for him to talk and be. I am less that way, both because I care about my team of choice so much less and because football is a sport I've always kept at something like arm's length. So it was strange, both during the recording of this week's NFL-heavy episode and in listening back to the finished product, to hear someone who sounds so much like me so obviously enjoying Talking Football like this. Can you be highly interested in something that you're pretty sure you don't entirely like? Given how much I have written about American politics, maybe I shouldn't be surprised that the answer is yes. But I think, here, the proof is very much in the podding.",
          "link": "https://defector.com/that-afc-south-feeling-with-rivers-mccown",
          "publishedOn": "2024-12-05T21:32:37.000Z",
          "wordCount": 6743,
          "title": "That AFC South Feeling, With Rivers McCown",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187721210.jpg"
        },
        {
          "id": "https://defector.com/?p=175326",
          "author": "Maitreyi Anantharaman",
          "description": "The transfer portal may be regarded as a hub of lawlessness in college sports these days, but in Van Lith’s case, it has restored some order to her career.",
          "link": "https://defector.com/hailey-van-lith-is-getting-her-groove-back-at-tcu",
          "publishedOn": "2024-12-05T20:42:00.000Z",
          "wordCount": 7191,
          "title": "Hailey Van Lith Is Getting Her Groove Back At TCU",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2182512967.jpg"
        },
        {
          "id": "https://defector.com/?p=175319",
          "author": "Israel Daramola",
          "description": "Originally, when the Michigan Wolverines beat the Ohio State Buckeyes 13-10 and decided to plant their flag on the Buckeyes logo, I found it amusing. The fact that those Buckeyes who'd just gotten embarrassed decided to fight the Wolverines over the disrespectful gesture made me roll my eyes. You had 60 minutes to fight, don't start now.\nThis feeling lasted until later that evening however, when I watched my beloved, terrible Florida State lose to our rivals, the Florida Gators. Which was expected. But when those Gators tried to plant their flag on our logo, I felt my blood boil. And when Florida State's players started fighting to defend our field from desecration, I felt pride—although the team didn't put up much of a fight there, either. But my divergent response to identical acts forced me to ask myself why I suddenly, hypocritically got upset seeing those Gators do what I supported the Wolverines doing. The answer is simple: It's because this still matters. The game, the rivalry, the aftermath, it all matters, to the fans and the players.",
          "link": "https://defector.com/the-games-will-always-matter",
          "publishedOn": "2024-12-05T20:21:41.000Z",
          "wordCount": 7134,
          "title": "The Games Will Always Matter",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187464508.jpg"
        },
        {
          "id": "https://defector.com/?p=175448",
          "author": "Ray Ratto",
          "description": "In the impermanent world of sports you get not one but nine, 13, or eleventyjillion chances to make a first impression. This is because sports is all about the reset. Draft a star, trade a mope, fire a coach, sell the team, move the team, as many times as necessary—if you don't like something about your past, change it. People will forget, even New York Jets fans.\nThis brings us to the new Toronto WNBA franchise selecting Tempo as its nickname, and the explanation as provided by its current marketing team. As it currently exists, this is among the most objectively risible nicknames in all of North American sports. It will change, of course, but we might as well celebrate it while we can.",
          "link": "https://defector.com/theyre-really-going-with-toronto-tempo",
          "publishedOn": "2024-12-05T19:56:58.000Z",
          "wordCount": 7362,
          "title": "They’re Really Going With “Toronto Tempo”",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/TorontoTempoCP24.png"
        },
        {
          "id": "https://defector.com/?p=175411",
          "author": "Patrick Redford",
          "description": "For all the intricate sets that earned rookie coach JJ Redick tumescent praise, the confident protestations that this would be a different Los Angeles Lakers team, the relatively well-managed Bronny James circus, and another year of clean health from LeBron James Sr. and Anthony Davis, the Lakers are 22 games into the season currently looking, overall, like a slightly worse version of their derelict 2023-24 squad. Well, that whole-season view may even be slightly generous: On a narrower timeframe, they have looked like one of the worst teams in basketball for two weeks. In the eight games since L.A. has had to play real teams again after crafting a six-game win streak against the league's dross, the Lakers are 2-6 and lost those six games by an average of 21.8 points. Congrats, JJ Redick: You're only one game off the 13-9 pace set by the dearly departed Darvin Ham.\nWednesday night's 134-93 loss to the Miami Heat was the Lakers' most embarrassing effort yet, though the team found it in them to author my favorite defensive possession of the season. Basketball wisdom dictates that defense is a collective endeavor, a postulate typically proven true by good units whose five players respond to each other and move in concert, or by bad individual defenders who can be singled out and, by their individual weakness, compromise the team's solidity. What distinguishes this Lakers possession, from early in the second half, from the familiar genera of blown rotation-style errors is that its failures are genuinely collective. It takes five individuals each making a series of incorrect decisions in rapid succession to produce such an unintentional masterwork.",
          "link": "https://defector.com/the-lakers-cannot-stop-embarrassing-themselves",
          "publishedOn": "2024-12-05T19:29:26.000Z",
          "wordCount": 7679,
          "title": "The Lakers Cannot Stop Embarrassing Themselves",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187944975.jpg"
        },
        {
          "id": "https://defector.com/?p=175430",
          "author": "Chris Thompson",
          "description": "Lonzo Ball has been through hell. This is the very firm impression made by an ESPN story published Thursday and written by Ramona Shelburne and Jamal Collier. Ball has spent most of three years dealing with a persistent injury to his left knee; the knee itself spent much of that time steadily worsening. The injury was characterized by cartilage damage and sharp, overwhelming, hostile pain, the kind of malevolent invading pain that shifts around under the surface, expanding and tunneling and throbbing with its own vile heartbeat. Reading about it makes my skin crawl. Months and months of this shit. Pain that started with an innocuous jammed knee and then blossomed into a debilitating but fundamentally mysterious chronic condition, and which defeated several surgeries and thousands of hours of rehabilitation and physical therapy.\nBall had a cartilage replacement procedure in March 2023, and from that point forward his condition has been steadily improving. This was apparently a risky maneuver, and indeed his surgeon attempted to talk him out of it, on the grounds that it might not work and could even make things worse. It worked, or has worked so far, and Ball is back on the court this season for the Chicago Bulls (more or less; he's missed 16 games with wrist troubles, and has played fewer than 100 total minutes), which is great news and a feel-good story.",
          "link": "https://defector.com/do-not-wear-dads-diy-sneakers-is-a-lesson-lonzo-ball-learned-the-most-painful-possible-way",
          "publishedOn": "2024-12-05T18:50:58.000Z",
          "wordCount": 7428,
          "title": "“Do Not Wear Dad’s DIY Sneakers” Is A Lesson Lonzo Ball Learned The Most Painful Possible Way",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187945256.jpg"
        },
        {
          "id": "https://defector.com/?p=175412",
          "author": "Drew Magary",
          "description": "Drew Magary’s Thursday Afternoon NFL Dick Joke Jamboroo runs every Thursday at Defector during the NFL season. Got something you wanna contribute? Email the Roo. And buy Drew’s book, The Night The Lights Went Out, through here.\nThere didn’t used to be so many billionaires. I know because I used to keep track of them. My old man had a subscription to Forbes back when I was a kid, back when Forbes was a reputable print magazine instead of the empty branding vessel it is now. Every year, Forbes would publish a list of the 400 richest people in America. The Forbes 400. The Zagat guide of rich assholes. I read that fucker from cover to cover.",
          "link": "https://defector.com/the-price-of-the-american-dream-is-now-1-billion",
          "publishedOn": "2024-12-05T17:57:31.000Z",
          "wordCount": 14427,
          "title": "The Price Of The American Dream Is Now $1 Billion",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-1251776516.jpg"
        },
        {
          "id": "https://defector.com/?p=174997",
          "author": "Samer Kalaf",
          "description": "Biden, as a potential reader, presents a unique case: He's responsible for the history that will be written by a future Khalidi. Will he recognize himself in the echoes?",
          "link": "https://defector.com/the-next-history-book-on-palestine-will-have-joe-biden-in-it",
          "publishedOn": "2024-12-05T16:52:34.000Z",
          "wordCount": 7825,
          "title": "The Next History Book On Palestine Will Have Joe Biden In It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2186864238.jpg"
        },
        {
          "id": "https://defector.com/?p=175393",
          "author": "Barry Petchesky",
          "description": "It's Teddy Bear Toss season in juniors. If you haven't had the pleasure: Fans bring stuffed toys to the game, and when the home team scores its first goal, they are hurled en masse onto the ice, to be collected and donated to a local children's charity. It's good vibes all around. Maybe not all around. \nMichael Misa is 17 years old and projects as a lottery pick in the 2025 NHL draft; some mocks have him going as high as No. 1. The forward received a special exemption to even enter the OHL before he was old enough, and was picked first overall there by the Saginaw Spirit. He's shined, scoring a league-leading 25 goals and 49 points in 25 games.",
          "link": "https://defector.com/top-nhl-prospect-suspended-for-disrespecting-teddy-bears",
          "publishedOn": "2024-12-05T14:59:19.000Z",
          "wordCount": 5550,
          "title": "Top NHL Prospect Suspended For Disrespecting Teddy Bears",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-1186704750.jpg"
        },
        {
          "id": "https://defector.com/?p=175380",
          "author": "Lauren Theisen",
          "description": "There was plenty of eventful men's college basketball on Wednesday night. Nos. 1, 2, and 5 all lost tough road games, Mississippi St. produced a statement blowout over Pitt, Texas eked out a nail-biter over N.C. State, and UConn got themselves right with a victory over Baylor. But sometimes a blog girl just wants to have fun, and for this reason we turn our eyes to College Park.\nWhile the other major conferences were doing crossover events, the Big Ten gave fans a little early preview this week: Teams play a couple conference games, retreat for variety over the holidays, then return in the new year for the full gantlet. Ohio State, in head coach Jake Diebler's first full season, is looking to shed its underachiever reputation with an experienced roster bolstered by a couple of key transfers. Maryland, meanwhile, is hoping that the arrival of top-tier freshman Derik Queen will catapult them back into the tourney picture.",
          "link": "https://defector.com/ohio-state-suffers-most-brutal-loss-since-saturday",
          "publishedOn": "2024-12-05T14:09:16.000Z",
          "wordCount": 6292,
          "title": "Ohio State Suffers Most Brutal Loss Since Saturday",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2188286317.jpg"
        },
        {
          "id": "https://defector.com/?p=175259",
          "author": "Luis Paez-Pumar",
          "description": "During matchweeks 13 and 14 of the season, the Premier League partners with LGBT charity Stonewall for Rainbow Laces, a campaign to promote LGBT acceptance in soccer, both on the field and in the stands. In practice, this entails some minor cosmetic changes around England's top flight. The league provides clubs with rainbow corner flags, ball plinths, as well as handshake and substitute boards. Most notably, club captains during these games are given the option to wear a rainbow-colored armband, which they are free to decline. This is very much a bare minimum campaign by the Premier League, and one that it has backed away from somewhat; per The Athletic, the league cut the funding of its partnership with Stonewall by about half last December.\nHowever, even the bare minimum is too much for some, which brings us to Crystal Palace captain and England international Marc Guéhi. During Saturday's home match against Newcastle United, which ended in a 1-1 draw, Guéhi wore a rainbow armband that had \"I ♡ Jesus\" written on it in marker (pictured above). In Palace's next game, a 1-0 away win against Ipswich Town, Guéhi once again wore the rainbow armband, this time with \"Jesus ♡ You\" written on it.",
          "link": "https://defector.com/marc-guehi-avoids-punishment-for-twice-undermining-premier-leagues-lgbt-campaign",
          "publishedOn": "2024-12-04T19:27:32.000Z",
          "wordCount": 7983,
          "title": "Marc Guéhi Avoids Punishment For Twice Undermining Premier League’s LGBT Campaign",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187029179.jpg"
        },
        {
          "id": "https://defector.com/?p=175309",
          "author": "Giri Nathan",
          "description": "Let's say you want to apply a nickname to Moritz Wagner, backup center and skilled shit-stirrer of the Orlando Magic. How many letters is that nickname?",
          "link": "https://defector.com/its-moe-wagner-not-mo-wagner",
          "publishedOn": "2024-12-04T18:54:52.000Z",
          "wordCount": 5108,
          "title": "It’s Moe Wagner, Not Mo Wagner",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187235755.jpg"
        },
        {
          "id": "https://defector.com/?p=175231",
          "author": "Barry Petchesky",
          "description": "Last week, I owned a cat. Today, I own a turkey fiend.",
          "link": "https://defector.com/i-have-created-a-turkey-fiend",
          "publishedOn": "2024-12-04T18:03:20.000Z",
          "wordCount": 7679,
          "title": "I Have Created A Turkey Fiend",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/IMG_5899.jpg"
        },
        {
          "id": "https://defector.com/?p=175161",
          "author": "Kelsey McKinney",
          "description": "Welcome back to The Not-So-Great Defector Bake Off, where Kelsey and Chris attempt to complete the technical challenges from the newest season of The Great British Bake Off in their own home kitchens, with the same time parameters as the professional-grade bakers competing on the show.",
          "link": "https://defector.com/the-not-so-great-defector-bake-off-attempts-another-almost-grand-finale",
          "publishedOn": "2024-12-04T17:43:51.000Z",
          "wordCount": 44744,
          "title": "The Not-So-Great Defector Bake Off Attempts Another Almost-Grand Finale",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/Screenshot-2024-12-04-at-8.23.35 AM.png"
        },
        {
          "id": "https://defector.com/?p=175234",
          "author": "Lauren Theisen",
          "description": "I've spent the early chunk of this NHL season disproportionately watching underachieving Eastern Conference teams play listless hockey in front of crowds that seem barely engaged. So the Minnesota Wild's Tuesday night overtime win over the Canucks, against the backdrop of a lively lower bowl, was hockey heaven. Down 2-1 to start the third, a team that missed the playoffs last season and hasn't won a series since 2015 improved upon the league's best record with an equalizer from their big D-man and a last-minute game-winner from possibly the most exciting skater in the sport today. The intensity may not truly start until the new year, but this was as good as early December gets.\nThe first-period action started a little tentatively, but the Canucks used a power play to their advantage when a Quinn Hughes shot whizzed through traffic to get them on the board. The Wild found their response with a fast-break three-on-one goal off a turnover in the second, but Vancouver stole back momentum just before intermission when newly acquired scoring leader Jake DeBrusk tapped in a rebound.",
          "link": "https://defector.com/the-wild-are-running-uh-you-know",
          "publishedOn": "2024-12-04T17:26:00.000Z",
          "wordCount": 6291,
          "title": "The Wild Are Running … Uh, You Know",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187574471.jpg"
        },
        {
          "id": "https://defector.com/?p=175298",
          "author": "Jae Towle Vieira",
          "description": "My grandparents held grudges so well and so thoroughly that in the aftermath of drama, everyone knew the drill: the offending person or subject was no longer to be mentioned. This is obviously unfortunate. Lore and venting instead spread outward from each person to their own webs of acquaintances, but within the family, drama became taboo. This is neither healthy nor productive for nosy little punks like me. Fortunately for gossips everywhere, some families chatter a lot. Some even consult fortune tellers for life advice. Others simply deal with forbidden subjects in the the good ol' way: lying.\nFor the penultimate episode of season seven, prepare yourselves for a huge family lore drop. We're going One Hundred Years of Solitude mode. This is a good reminder to us all that you don’t get to be old without collecting a lifetime’s worth of secrets along the way.",
          "link": "https://defector.com/secret-family-fortune-tellers-and-other-deathbed-revelations",
          "publishedOn": "2024-12-04T17:11:08.000Z",
          "wordCount": 5372,
          "title": "Secret Family Fortune Tellers And Other Deathbed Revelations",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2023/03/Normal_Gossip_16-9_V2.png"
        },
        {
          "id": "https://defector.com/?p=175229",
          "author": "Chris Thompson",
          "description": "There was a great sequence late in the second quarter of Tuesday night's NBA Cup match between the Orlando Magic and the New York Knicks. Great for a neutral viewer, certainly great if you are a Knicks fan. Less great if you are the fan of the Orlando Magic, but still pretty fun! The Knicks were pulling away from the Magic, up 21 points at about the three-minute mark, and Magic head coach Jamahl Mosley put Moritz Wagner into the game. I assume this substitution was scheduled, but it was also appropriate to the specific moment: the offensive gravity of Knicks center Karl-Anthony Towns was tugging Magic counterpart Wendell Carter Jr. all over the court and largely negating his defensive value, and the Magic were badly losing Carter's minutes. Moe is a change-of-pace type of player, both because he exemplifies try-harderism and because he is happy to play the pest and work his way under an opponent's skin. And Mosley needed someone to upset the rhythm of the game: This may have been an early-December contest but the depleted Magic needed to manage the final margin in order to advance in the tournament, a dynamic that juiced up the competition all the way to the final buzzer.\nWagner came on, worked a dribble hand-off with his brother Franz, then immediately re-screened Franz's defender and chugged into the paint, where he received a slick feed on the go and banked in a quick layup. The set had some nice flowing Wagner-to-Wagner chemistry, and Towns, who'd been exploited by the quick screens and darting action, seemed slightly annoyed. Seconds later, on the Knicks' ensuing possession, Towns made himself a little too angular setting an off-ball screen on the wing and wiped out Franz, earning an offensive foul. Again Towns seemed annoyed. The Moe Wagner Gambit was already showing signs of promise.",
          "link": "https://defector.com/karl-anthony-towns-sees-your-gruel-and-raises",
          "publishedOn": "2024-12-04T16:19:11.000Z",
          "wordCount": 10211,
          "title": "Karl-Anthony Towns Sees Your Gruel, And Raises",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2188139156.jpg"
        },
        {
          "id": "https://defector.com/?p=175012",
          "author": "Charles P. Pierce",
          "description": "In The Game Behind The Game, his account of televising major sports events at ABC and at CBS, veteran TV sports producer Terry O’Neil writes about coming over to CBS and confronting a broadcasting culture that had pickled itself into a coma decades before. Apparently, the drinking culture at CBS Sports was even more widespread than that which O’Neil experienced working at ABC with Howard Cosell. This was plain even to the casual viewer at home, whose holiday viewing was spiced up annually by the Sun Bowl broadcast from El Paso during which Pat Summerall and Tom Brookshier regularly discussed how sockless they’d gotten themselves in Juarez the night before.\nOne of the non-alcoholic symptoms of stultification at CBS was the stubborn refusal to move its in-game cameras from their positions on the 50-yard line. ABC, as O’Neil points out, had long ago moved cameras to the 25-yard lines, as well as leaving one at the 50. This enabled ABC to show more football during its football telecasts which, for TV executives, was akin to perfecting nuclear fusion. But, as O’Neil remembers it, the issue almost came to guns and knives at CBS. People there actually made the argument that, at the 50, CBS had “the best seat in the house.” This sounded to O’Neil like they were bragging about cracking the technology of television three days before air.",
          "link": "https://defector.com/blessed-be-the-pylon-cam",
          "publishedOn": "2024-12-04T13:59:59.000Z",
          "wordCount": 10079,
          "title": "Blessed Be The Pylon Cam",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-1436597064.jpg"
        }
      ]
    },
    {
      "title": "Joe's Weather Blog | In-depth Kansas City forecasts | FOX4KC",
      "feedUrl": "http://fox4kc.com/category/weather/weather-blog/feed/",
      "siteUrl": "https://fox4kc.com",
      "articles": [
        {
          "id": "https://fox4kc.com/?p=3748773",
          "author": "Joe Lauria",
          "description": "A mild day here, a nasty cold day there, then a few more mild days there. Up and down we go with not much in the way of moisture coming towards the region for a while it appears. There is a system to sort of watch on Tuesday but data shows it more towards the south of the region",
          "link": "https://fox4kc.com/weather/weather-blog/joes-blog-very-strong-front-coming-in-wed-12-4/",
          "publishedOn": "2024-12-04T15:09:47.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Very strong front coming in (WED-12/4)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/1243.png?w=900",
            "type": "image/png",
            "length": "1977206"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/1243.png?w=900"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=832917",
          "author": "Anthony Franco",
          "description": "Royals infielder Maikel Garcia underwent surgery to remove a bone spur from his right elbow, tweets Daniel Álvarez-Montes of El Extrabase. Kansas City hasn’t announced whether the injury is expected to impact his readiness for Spring Training. Garcia had been set to play winter ball in his native Venezuela. He revealed in an X post over…",
          "link": "https://www.mlbtraderumors.com/2024/12/maikel-garcia-undergoes-surgery-to-remove-bone-spur-from-elbow.html",
          "publishedOn": "2024-12-06T03:24:48.000Z",
          "wordCount": 3316,
          "title": "Maikel Garcia Undergoes Surgery To Remove Bone Spur From Elbow",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/12/USATSI_24680185-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=832804",
          "author": "Anthony Franco",
          "description": "Former big league right-hander Al Fitzmorris has passed away at 78. The Royals announced the news on Wednesday evening. Fitzmorris was born in Buffalo but attended high school in San Diego. He signed with the White Sox as a 20-year-old. The 6’2″ righty never had an opportunity to get to the big leagues with Chicago. The…",
          "link": "https://www.mlbtraderumors.com/2024/12/al-fitzmorris-passes-away.html",
          "publishedOn": "2024-12-05T02:47:15.000Z",
          "wordCount": 3333,
          "title": "Al Fitzmorris Passes Away",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/12/USATSI_24145171-1024x683.jpg"
        }
      ]
    },
    {
      "title": "local food",
      "feedUrl": "https://www.kcur.org/tags/local-food.rss",
      "siteUrl": "https://www.kcur.org/tags/local-food",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}