{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": [
        {
          "id": "https://blogs.fangraphs.com/?p=470550",
          "author": "David Laurila",
          "description": "The 26-year-old southpaw has an old school approach and a 2.52 ERA over 93 innings.",
          "link": "https://blogs.fangraphs.com/kansas-citys-noah-cameron-is-having-a-stellar-rookie-season/",
          "publishedOn": "2025-08-15T16:00:02.000Z",
          "wordCount": null,
          "title": "Kansas City’s Noah Cameron Is Having a Stellar Rookie Season",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://blogs.fangraphs.com/?p=470170",
          "author": "Michael Rosen",
          "description": "The Royals' recent acquisition features an impressive arsenal.",
          "link": "https://blogs.fangraphs.com/in-at-least-one-respect-ryan-bergert-looks-like-an-ace/",
          "publishedOn": "2025-08-11T13:00:12.000Z",
          "wordCount": null,
          "title": "In at Least One Respect, Ryan Bergert Looks Like an Ace",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://blogs.fangraphs.com/?p=470172",
          "author": "David Laurila",
          "description": "Plus Hunter Brown and Noah Cameron on gophers, Jeff Montgomery on shaking Mike Macfarlane, Nic Wilson on Kyle Karros, facts and stats galore, and more.",
          "link": "https://blogs.fangraphs.com/sunday-notes-jack-dreyer-is-a-dodger-with-a-sneaky-heater-and-a-bad-slider/",
          "publishedOn": "2025-08-10T11:32:20.000Z",
          "wordCount": null,
          "title": "Sunday Notes: Jack Dreyer Is a Dodger With a Sneaky Heater and a “Bad Slider”",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://blogs.fangraphs.com/?p=470014",
          "author": "David Laurila",
          "description": "Casual games of catch they're not.",
          "link": "https://blogs.fangraphs.com/players-view-pitchers-weigh-in-on-their-catch-play-partners-some-are-nasty/",
          "publishedOn": "2025-08-07T15:25:13.000Z",
          "wordCount": null,
          "title": "Player’s View: Pitchers Weigh in on Their Catch Play Partners (Some Are Nasty)",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=198384",
          "author": "Puja Patel",
          "description": "Have you noticed how I've been yammering on about the month of August? If it's not abundantly clear, I think August is a top-three month for inducing existential malaise. Sure, I will wish for August in February—but by May, I'm already dreading its arrival. There are two seasons with opening months that are very obviously better than their closing ones (fall, winter), and two where the closing month wins easily (spring, summer). But the calendar-designated beginning and ends of the official seasons very rarely exactly squares with the spiritual seasons. If we're being real, spiritual winter runs from the top of December through early April; spring lasts from then through mid-May (or early June, if you're lucky); spiritual summer starts sometime in June and ends, without exception, after the first week of September. Everything else is fall—even as the climate crisis is doing its best to convince us otherwise. (The ideal temperature range, by the way, is 65 to 72 degrees. A natural occurrence so fleeting in Brooklyn, that I will travel to find it.) \nSometimes people say, \"Oh, your favorite or least favorite month probably also has something to do with your birthday month.\" Not in my case! And just to be clear: loosely equating months with astrological signs and assuming that I feel the same way about those signs—ranked—would be foolish. (That's for another day, perhaps.) The correct ranking of months, from best to worst, is as follows:\nMay\nSeptember\nOctober\nJune\nDecember\nApril\nMarch\nJuly\nNovember\nAugust\nJanuary\nBeing hit by a car\nFebruary",
          "link": "https://defector.com/months-ranked",
          "publishedOn": "2025-08-15T17:00:00.000Z",
          "wordCount": 7798,
          "title": "Months, Ranked",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-1467672323.jpg"
        },
        {
          "id": "https://defector.com/?p=197863",
          "author": "Brandy Jensen",
          "description": "If there’s one thing I’ve historically been very good at, it’s playing it cool around those for whom I have developed a romantic interest. Ask any of my friends and they’ll confirm that I am skilled at behaving normally about this kind of thing. I cultivate an air of mystery about my intentions, sending a very restrained number of texts, after a period of calm contemplation, all keeping to a reasonable length. A hint here, a gesture of openness there, but never too much. You want to signal your interest while strictly maintaining your dignity. Again, this is a skill I wield with ease. \nThis is a delicate dance, which of course requires the correct soundtrack. Sharing a playlist is an opportunity to demonstrate both your good taste and ever so subtly hint that perhaps, if the object of your affection can piece together the clues, deeper feelings could be revealed. So here is my tried and true playlist for when you want someone else to wonder if maybe, just maybe, you are looking for something more.",
          "link": "https://defector.com/a-playlist-for-being-chill-about-your-crush",
          "publishedOn": "2025-08-15T16:30:00.000Z",
          "wordCount": 7739,
          "title": "A Playlist For Being Chill About Your Crush",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-498638165.jpg"
        },
        {
          "id": "https://defector.com/?p=198278",
          "author": "Puja Patel",
          "description": "Consider this a sister piece to the list of \"The Worst Songs That We Love So Much\" that ran yesterday, with a slightly different conceit. I asked some of my music and culture writer friends to confess their soft spots for songs that reek of corniness and cheese—the ones that might make them cringe a little, but still feel like a knife to the heart. I was looking for love songs that could easily soundtrack a teenage rom-com or land on an algorithmic playlist where Ed Sheeran and Coldplay were held up as the pinnacle of romance. Maybe the melody is syrupy sweet, or the writing overwrought—I'd take melodramatic ballads, saccharine pop, or anything soaked in '80s and '90s nostalgia. It didn’t matter to me if they provoked tears because of pure sentimentality rather than visceral, sonic, or lyrical power; some songs are devastating simply because they remind you what it felt like to be the one that got left behind. \nAs I wrote earlier this week: August is the month of bittersweet reflection, caught in the tension between the low-key end of summer and the anxiety about what comes next. (It’s the emotional equivalent of the twilight of a relationship—when you know something is wrong, or the end is near—but want to savor what’s left just a little bit longer.) Some of these songs capture that feeling exactly. Please enjoy, and tell me yours too.\nPhil Collins - \"Against All Odds (Take a Look at Me Now)\"",
          "link": "https://defector.com/the-cringiest-love-songs-that-make-us-cry",
          "publishedOn": "2025-08-15T14:55:00.000Z",
          "wordCount": 19617,
          "title": "The Cringiest Love Songs That Make Us Cry",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-515497026.jpg"
        },
        {
          "id": "https://defector.com/?p=198360",
          "author": "Drew Magary",
          "description": "Some people are fans of the Tampa Bay Buccaneers. But many, many more people are NOT fans of the Tampa Bay Buccaneers. This 2025 Defector NFL team preview is for those in the latter group. Read all the previews so far here.\nYour team: DOINK!",
          "link": "https://defector.com/why-your-team-sucks-2025-tampa-bay-buccaneers",
          "publishedOn": "2025-08-15T13:57:27.000Z",
          "wordCount": 12904,
          "title": "Why Your Team Sucks 2025: Tampa Bay Buccaneers",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-2194142785.jpg"
        },
        {
          "id": "https://defector.com/?p=198276",
          "author": "Amy Phillips",
          "description": "The moment I had long dreaded finally arrived: the day I’d have to dismantle my childhood. I suppose I should consider myself lucky. It took 43 years to get here, to this spring day in 2025, standing in my nearly empty former bedroom in my mother’s house in Philadelphia, wearing a Mitski T-shirt, ratty yoga pants, and the glasses I only have on when I’m beyond exhausted. And lucky, too, that after the end of a 19-year run at a music writing job that shaped my identity and devoured my time, I was finally able to help my mom move out of the big old house that had become much too much for her.\nBut I didn’t feel very lucky—not with the encroaching phalanx of contractors, movers, and junk removal guys, and a seven-year-old daughter back in Brooklyn growing increasingly anxious for me to return home to her. I had only two days to pack everything up, including the painstaking task of taking everything off of my bedroom's walls. At work, I had been a master of efficiency and organization, coordinating a team of writers and wrangling the many moving parts of editorial projects into manageable timelines. But standing there in my room, I was at a loss.",
          "link": "https://defector.com/living-through-this-again",
          "publishedOn": "2025-08-15T13:06:57.000Z",
          "wordCount": 15544,
          "title": "Living Through This, Again",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/4-1.png"
        },
        {
          "id": "https://defector.com/?p=198251",
          "author": "Bobby Finger",
          "description": "A few minutes into her Aug. 13 appearance on New Heights with Jason & Travis Kelce, Taylor Swift said, “This is my first podcast.” I thought she was making a little joke—surely she’d talked to Marc Maron, Bowen Yang, or those two exasperated, newly popular ladies who look like Karens, but actually want all Karens brutally annihilated. But there was no laughter. Not from her, Travis (her boyfriend of two-ish years), or Jason (her boyfriend of two-ish years’ older brother). This was in fact her first appearance on a podcast. And over its 104-minute runtime, I was begrudgingly in its grim, peculiar thrall, watching both a version of Swift I was prepared to see—the ruthless, narrative-driven capitalist—and one that repeatedly surprised me: a funny, frequently dull late-thirties girlie who woul…",
          "link": "https://defector.com/two-showgirls-in-love-travis-kelce-and-taylor-swift-have-a-chat",
          "publishedOn": "2025-08-14T18:24:41.000Z",
          "wordCount": 12852,
          "title": "Two Showgirls In Love: Travis Kelce And Taylor Swift Have A Chat",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/taylor-travis-new-heights.jpg"
        },
        {
          "id": "https://defector.com/?p=197949",
          "author": "Puja Patel",
          "description": "I've always struggled with the idea of a \"guilty pleasure.\" Truly innocent pleasure shouldn't come with a side of shame. Most guilty pleasures are purposely private, indulged alone or among the friends who are safe enough to confide in. There are adults who skip social obligations to play video games in their underwear all day. People devote weeks of their lives to hilariously deranged dating shows—The Ultimatum, Love Is Blind, Married at First Sight, and Love Island—but engage in cultural discourse only when it's around something more acceptably \"meaningful,\" like books or politics. There are those who obsess over their frenemies' social media, but love to declare at parties, \"I don't really use Instagram anymore.\"\nA guilty pleasure is something you genuinely enjoy but might die before admitting to, simply because it doesn't align with the image of \"good taste\" you've imagined—or spent time curating—for yourself. The guilt isn't moral—it's not wrong to enjoy the thing—but it's socially contextual. It's not that you shouldn't enjoy it; it's that someone you've deemed cooler, wiser, or more informed might judge you for doing so.",
          "link": "https://defector.com/the-worst-songs-we-love-so-much",
          "publishedOn": "2025-08-14T16:55:06.000Z",
          "wordCount": 24381,
          "title": "The Worst Songs We Love So Much",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-515988382.jpg"
        },
        {
          "id": "https://defector.com/?p=198141",
          "author": "Drew Magary",
          "description": "Some people are fans of the Seattle Seahawks. But many, many more people are NOT fans of the Seattle Seahawks. This 2025 Defector NFL team preview is for those in the latter group. Read all the previews so far here.\nYour team: Seattle Seahawks.",
          "link": "https://defector.com/why-your-team-sucks-2025-seattle-seahawks",
          "publishedOn": "2025-08-14T14:42:30.000Z",
          "wordCount": 14016,
          "title": "Why Your Team Sucks 2025: Seattle Seahawks",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-2228244550.jpg"
        },
        {
          "id": "https://defector.com/?p=198119",
          "author": "Marian Bull",
          "description": "On a breezy spring night in 2023, the Georgia Room at the Freehand Hotel was humid with sweat. Queers of various genders wore cowboy hats and bedazzled denim, camouflage and American flag bikinis. The lights were low and clubby. A New York Times reporter milled around with a notepad. This was Stud Country, a queer line dancing night that began in Los Angeles but had begun migrating, every month or two, to New York. The hosts, Sean Monaghan and Bailey Salisbury, began the night by teaching a line dance to “Texas Time” by Keith Urban, an Australian man singing about his need to be in the Lone Star State, at least energetically: “New York girls, they can be so pretty / But I get cold living in the city.” This campy geographical incongruity felt fitting for an event hosted in a chain boutique hotel in Manhattan. \nWhen a friend floated the ticket link in the group chat, it sounded right up my alley: I’m an insufferable Brooklyn bisexual who took 12 years of ballet and spent every Sunday of my childhood performing onstage. I went to a Southern state school for college, so country radio imprinted itself on me before my brain was fully formed. Eight counts in, I was hooked. Gay line dancing is nothing new, but it’s a thrilling community to dive into. It was exciting to have a queer space that’s gender-diverse and not particularly boozy. Plus, country music isn’t so far from drag: All those big trucks, cold beers, boat parties, and jilted lovers wear the patina of cliché with a wink.",
          "link": "https://defector.com/stud-country-queer-line-dancing-and-the-joys-of-being-in-sync",
          "publishedOn": "2025-08-14T13:01:11.000Z",
          "wordCount": 10792,
          "title": "Stud Country, Queer Line Dancing,  And The Joys Of Being In Sync",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-1409046496-e1755175825793.jpg"
        },
        {
          "id": "https://defector.com/?p=198163",
          "author": "Puja Patel",
          "description": "Once upon a time, in a different life, I was tasked with running a blog vertical devoted entirely to help men, who read a sports site, become slightly better at life. Not exceptional. Not great. Not even very good. Just—adequate. We gave advice on anything and everything—cooking, grooming, relationships. We weighed in on matters surrounding identity, etiquette, culture, and taste. People who love to give advice usually don’t find it very difficult to deliver. The real trick, however, was stretching it into the “ideal” 500-750 words—enough to satisfy search engine algorithms, and to justify giving the advice in the first place.\nMost of the time it was worthwhile—often nuanced and sometimes even emotionally taxing. We tackled the real, complicated stuff: grief, dating, sex, parenting, workplace politics, even the art of perfecting a family recipe. Other times, it was completely absurd—a way for people who love to talk to keep talking, whether about their mustaches or favorite tomatoes or whatever else.\nNow that blog is dead, and the search engines have been rendered useless by AI. So, in tribute, I asked some friends from back then—friends of Defector, too—to share a little unwarranted advice of their own. Nothing overwrought, I told them. No long tirades. Just give me a tip. \n***",
          "link": "https://defector.com/just-a-tip",
          "publishedOn": "2025-08-13T18:15:46.000Z",
          "wordCount": 12663,
          "title": "Just A Tip",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-517256700.jpg"
        },
        {
          "id": "https://defector.com/?p=197836",
          "author": "Israel Daramola",
          "description": "When I listen to new music, one of the biggest influences I hear—both in the sound and the choices of samples—is video games. Specifically, the games and sounds I remember hearing constantly while I was growing up. There's Pi’erre Bourne’s skittering, glitchy \"power up\"-style instrumentals and sound effects, and Pinkpantheress’ unmistakable Sonic Adventure 2 vibe. Playboi Carti's outer-space pocket, flickering rhymes, and ad-libs make him feel like a walking arcade game soundtrack. Listen closely and you'll notice that gamer culture is all over the best music being made today.\nSometimes, that influence is direct and obvious—full of digital cartoon effects and bright electro-pop that sounds straight out of Dance Dance Revolution. Other times, it's more subtle, capturing the emotional residue of growing up playing these games. The nostalgia is channeled through ethereal textures—sounds that evoke Sega Dreamcast, the old PlayStation loading screen, or blur into something that feels like a half-remembered dream. Alex G and Mk.gee have a gift for this kind of sonic memory—their songs can feel like a lost afternoon on the N64 as you wait for your crush to get on AOL Instant Messenger.",
          "link": "https://defector.com/a-playlist-of-pop-that-sounds-like-my-gamer-youth",
          "publishedOn": "2025-08-13T17:05:00.000Z",
          "wordCount": 6713,
          "title": "A Playlist Of Pop That Sounds Like My Gamer Youth",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-50588245.jpg"
        },
        {
          "id": "https://defector.com/?p=198184",
          "author": "Tommy Craggs",
          "description": "At some point in the thick of the pandemic, I became briefly obsessed with a silly-seeming online controversy over what is known as the double-beat theory. The argument concerns classical music, which normally would’ve been enough for me to move along, prestissimo, but those were not normal times. By the third or fourth video I watched, I was fully invested in an argument I barely understood about a kind of music I rarely consumed. \nThe stakes couldn’t have been lower. The double-beat discourse, such as it was, unfolded in the nested replies of comments sections, one side sneering at the “single-beaters,” the other invoking flat-earthers, each lamenting the other’s tendency toward ad hominem attacks, and on and on and on. Polemics were delivered via YouTube—monologue after self-shot monologue that seemed to borrow its mise en scène and cast from an old VHS dating service, the men drifting in and out of focus on their farty ergonomic chairs, all the accents of the Western Europe professoriat on hand, each finding its own exciting path through words like “ludicrous\" and “contemptible.”",
          "link": "https://defector.com/are-we-playing-it-all-wrong",
          "publishedOn": "2025-08-13T16:17:38.000Z",
          "wordCount": 11309,
          "title": "Are We Playing It All Wrong?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-600080407.jpg"
        },
        {
          "id": "https://defector.com/?p=198148",
          "author": "Dave McKenna",
          "description": "Saturday marks 48 years since Elvis Presley was found dead inside a Graceland bathroom. And so, for the 48th time, his devoutest followers are gathering in Memphis for a week of concerts and various other events commemorating the King—who'd be 90 years old were he still alive. Cleary there’s still some juice to squeeze out of the King’s carcass: tickets for Monday’s tour of Elvis’s big house—hosted by one of his last girlfriends, Linda Thompson—sold out at $7,000 per set of four.\nI’ve been among the memorializers. Of the many rock and roll pilgrimages I’ve taken through the years, none combined irreverent and reverent quite like my 1990 trip to what was then commonly called “Death Week” before Elvis Presley Enterprises rebranded the tribute with the far less metal moniker, \"Elvis Week.\"",
          "link": "https://defector.com/remembering-my-elvis-death-week-pilgrimage-35-years-later",
          "publishedOn": "2025-08-13T15:30:00.000Z",
          "wordCount": 10225,
          "title": "Remembering My Elvis Death Week Pilgrimage, 35 Years Later",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-1403724152.jpg"
        },
        {
          "id": "https://defector.com/?p=198202",
          "author": "Ray Ratto",
          "description": "Some people are fans of the Cincinnati Bengals. But many, many more people are NOT fans of the Cincinnati Bengals. This 2025 Defector NFL team preview is for those in the latter group. Read all the previews so far here.\nYour team: The Cincinnati Bengals, Where Money Is Always The Object.",
          "link": "https://defector.com/why-your-team-sucks-2025-cincinnati-bengals",
          "publishedOn": "2025-08-13T14:46:34.000Z",
          "wordCount": 18216,
          "title": "Why Your Team Sucks 2025: Cincinnati Bengals",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-2187609609.jpg"
        },
        {
          "id": "https://defector.com/?p=197999",
          "author": "Jaime Brooks",
          "description": "In 2018, Mitski released her fifth album, Be the Cowboy. She had been putting out music that was as critically acclaimed as anything in the American indie world, and promoting it in the only way that still seemed to work: by going on tour. But with Be the Cowboy, the buzz reached a fever pitch. Tours sold out mid-size venues across the country, and her career reached a new peak, prompting reflection about where it might go next. Was there still room to grow, or would the next album cycle mean diminishing returns? Was she destined for back-to-back tours for the rest of her life?\nThe record’s standout was “Nobody,” a succinct, disco-inflected tune that was primed to be a crossover hit—catchy and danceable but still possessing what the kids are calling \"aura,\" like \"Lovefool\" by The Cardigans did back in the '90s. This was late in the 2010s, and Mitski was far from the first artist on an independent label to take a swing at making a crossover single with mass appeal. Sadly, radio did not take notice. A 2019 New York Times interview with the program director for ALT 92.3, described as \"New York City's only contemporary rock station,\" helped to explain Mitski's predicament. Alternative stations that, theoretically, might have been playing \"Nobody\" were chasing an audience that skewed male, and program directors were so worried about alienating that audience that they weren't even playing major label stars like Billie Eilish amid the typical runs of songs by Bastille or Walk the Moon. What hope did an independent artist like Mitski have?",
          "link": "https://defector.com/what-caused-the-current-country-boom",
          "publishedOn": "2025-08-13T13:41:47.000Z",
          "wordCount": 12714,
          "title": "What Caused The Current Country Boom?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/mitski-morgan-wallen-shaboozey-everybody-in-the-club-get-tips_ee85df.jpg"
        },
        {
          "id": "https://defector.com/?p=197943",
          "author": "Kathryn Xu",
          "description": "Blackpink is the biggest global group in K-pop. With BTS on hiatus and NewJeans in the midst of a prolonged contract dispute, they don't have much competition, so long as they stay active themselves. Yet their current world tour carries a title that suggests an endpoint: Deadline. Two years after renewing their contracts as a group, they have released a new single, \"Jump,\" in their signature style but with a heavier beat, and embarked on what may be their final arena-sized project together. The tour, which runs from July through January, includes 31 stadium shows over 16 cities, with even four stops in Europe, often neglected by K-pop acts. One month in, and they have had no issues selling out stadiums, sometimes doing so twice, and have even catered to local sports fans, launching merchandise collaborations with Mitchell & Ness and Paris Saint-German.\nIt is commonly understood that individual success jeopardizes the longevity of a group. Justin Timberlake became the breakaway star of NSYNC; it's possible younger fans of Beyoncé don't know more than one Destiny's Child song; One Direction—the biggest boy band in the world—made a multi-hyphenate pop idol out of Harry Styles. In K-pop, individual success is just one threat to a band's sustainability. Few groups survive past the industry's standard (and dreaded) seven-year initial contract term, and those who do often see new releases, referred to in K-pop as \"comebacks\" more as fan service endeavors than a meaningful return. Members may be lost to mandatory military service or, historically, Chinese members leaving, and scheduling is catered around solo ventures that are more popular or simply less grueling for the individuals.",
          "link": "https://defector.com/has-the-worlds-biggest-k-pop-group-already-come-and-gone",
          "publishedOn": "2025-08-12T18:36:49.000Z",
          "wordCount": 12201,
          "title": "Has The World’s Biggest K-Pop Group Already Come And Gone?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/blackpinkDEADLINE.jpg"
        },
        {
          "id": "https://defector.com/?p=198122",
          "author": "Sarah York",
          "description": "Some people are fans of the Arizona Cardinals. But many, many more people are NOT fans of the Arizona Cardinals. This 2025 Defector NFL team preview is for those in the latter group. Read all the previews so far here.\nYou team: The Arizona Cardinals",
          "link": "https://defector.com/why-your-team-sucks-2025-arizona-cardinals",
          "publishedOn": "2025-08-12T16:50:37.000Z",
          "wordCount": 16332,
          "title": "Why Your Team Sucks 2025: Arizona Cardinals",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-2193105816_f47fad.jpg"
        },
        {
          "id": "https://defector.com/?p=198125",
          "author": "Tom Scocca",
          "description": "One of the things that a visit to the Apartheid Museum in Johannesburg gets across very effectively is that a policy of monstrous repression was built on details—the details of paperwork and procedures and regulations, a parody of rational administration built around deranged and evil goals. Early on, a wall carries a list of the laws that made up the apartheid system: 148 different measures spanning 22 years, a constant process of repression and escalation. \nA little further on, there's a series of personal passbooks on display, turned to various pages. The particular one that brought me up short was opened to the spaces where the passbook holder was required to get their employer's signature every month. There was the same notation, over and over—routine daily existence made contingent and subject to endless re-approval.",
          "link": "https://defector.com/tyranny-is-managed-into-existence",
          "publishedOn": "2025-08-12T16:24:04.000Z",
          "wordCount": 10379,
          "title": "Tyranny Is Managed Into Existence",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-1242474324.jpg"
        },
        {
          "id": "https://defector.com/?p=197686",
          "author": "Kelsey McKinney",
          "description": "For most of my 20s, I did not believe that I had clinical depression. No, what I had was clinical depression's cuter, more manageable cousin: seasonal affective disorder. I bought one of those lamps that is too bright for the afternoon darkness but alleges to make your brain think you are standing in warm, direct sunlight. I took vitamin D pills. I whined about how it was too dark and too cold and blamed my brain's rebellion against me on both.\nIt was easier to confine the bad feelings to a season. I had just moved from Texas to Washington, D.C., a place with real (if mild) winter. Everyone else was struggling, too! It's much more manageable to accept that you have a seasonal setback than it is to worry about a looming lifelong struggle.",
          "link": "https://defector.com/a-playlist-to-escape-the-summertime-blues",
          "publishedOn": "2025-08-12T16:02:39.000Z",
          "wordCount": 6883,
          "title": "A Playlist To Escape The Summertime Blues",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/Grace-eNews-99-1024x576-1.png"
        },
        {
          "id": "https://defector.com/?p=197884",
          "author": "Clover Hope",
          "description": "There’s a scene in the new Superman movie that illustrates the precarious nature of music compatibility and how touchy it can get. Lois Lane (you know her, played by Rachel Brosnahan) and Clark Kent (David Corenswet), a.k.a. Superman, have a heated argument about their differences: She’s a reporter; he’s a bionic being from another planet. It all unfolded through the lens of rock, and the scene became viral for a reason.\nIn the middle of their conflict, Lois mocks Clark’s taste, calling herself just a “punk-rock kid from Bakerline.” He insists he’s punk rock too, citing the fictional pop-punk band Mighty Crabjoys and the real nu-metal band P.O.D. She shuts him down: “Those are pop radio bands. They’re not punk rock. The Mighty Crabjoys suck.” Clark replies, mildly wounded: “Well, a lot of people love ’em.” I couldn’t help but wonder … is this just banter, or foreshadowing for this mismatched couple’s inevitable breakup? (You’ll have to watch the movie. It’s great.)",
          "link": "https://defector.com/the-trials-of-finding-love-as-a-music-snob",
          "publishedOn": "2025-08-12T15:00:00.000Z",
          "wordCount": 10410,
          "title": "The Trials Of Finding Love As A Music Snob",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/Screenshot-2025-08-10-at-4.18.27-PM.png"
        },
        {
          "id": "https://defector.com/?p=196709",
          "author": "Sabrina Imbler",
          "description": "It is easy enough to read about the climate crisis through the dozens of devastating stories that run each week, warning us of the people who will be displaced or otherwise harmed by the planet's rapidly rising temperatures. It is also easy to feel the climate crisis, through escalating summer heatwaves and the choking smog of wildfire smoke, and to see it in photos of emaciated polar bears and other species at risk of going extinct. But can we hear the climate crisis?\nThe most obvious answer to this question, I think, is less about what we hear than what we no longer hear. In North America, 389 species of birds face an increased risk of extinction from rising temperatures. Around the world, 40 percent of all insect species have declined dramatically and may go extinct in the next few decades. Amphibians are the most threatened vertebrates, and two percent of the world's amphibians are already being pushed past their physiological limits of heat. Fewer birds mean more muted mornings, fewer insects mean quieter choruses of crickets and cicadas, and fewer amphibians muffle the evening bellows of mating frogs.",
          "link": "https://defector.com/how-climate-change-is-transforming-the-soundtrack-of-the-natural-world",
          "publishedOn": "2025-08-12T13:00:00.000Z",
          "wordCount": 14544,
          "title": "How Climate Change Is Transforming The Soundtrack Of The Natural World",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-2206478411.jpg"
        },
        {
          "id": "https://defector.com/?p=197810",
          "author": "Lauren Theisen",
          "description": "I finally get Midnights. I don’t just mean, “Oh, I thought this album was whatever when I first heard it, and now I really love it,” though I do mean that a little bit. I mean I get it get it. Like, I get how Taylor Swift concert tickets are as pricey as diamond rings. I get why people freak out about her every single move. I understand the compulsion to puzzle through complicated interpretations of each public missive. I get it because my relationship to this specific kind of average-white-girl pop music has fundamentally changed—not just with Taylor, but with Sabrina Carpenter, Gracie Abrams, Tate McRae, and the other women who appear on algorithmic playlists with titles like “Summer Hits” and “Mood Booster.” My embrace of this music helps to explain how I’m living through what is simultaneously the happiest and the scariest time of my life to date. I’m still figuring out what to do about it.\nEarlier this year, I met a man and fell in love for the first time in my life. As I saw friends—primarily cishet friends—share that most human of feelings, I felt anxious about if it would ever happen for me, as if I was too cold or closed-off or broken to deserve someone who would hold my hand on the train home, or whatever. I think all trans women are subliminally told that there has to be something wrong with anyone who’s into them. Even though I’d spent the last several years carving out valuable friendships and a fulfilling day-to-day life, I don’t think I’d ever had a sexual encounter with a guy where I came away feeling like he even respected me. My experiences had made me really question—for the first time since I was about 14—if I even liked men at all.",
          "link": "https://defector.com/taylor-swift-turned-me-straight",
          "publishedOn": "2025-08-11T16:01:19.000Z",
          "wordCount": 12712,
          "title": "Taylor Swift Turned Me Straight",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-21848628651.jpg"
        },
        {
          "id": "https://defector.com/?p=197975",
          "author": "Drew Magary",
          "description": "Some people are fans of the Atlanta Falcons. But many, many more people are NOT fans of the Atlanta Falcons. This 2025 Defector NFL team preview is for those in the latter group. Read all the previews so far here.\nYour team: Atl2nt8 Fal3ons.",
          "link": "https://defector.com/why-your-team-sucks-2025-atlanta-falcons",
          "publishedOn": "2025-08-11T15:35:21.000Z",
          "wordCount": 15297,
          "title": "Why Your Team Sucks 2025: Atlanta Falcons",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-2191310438.jpg"
        },
        {
          "id": "https://defector.com/?p=197996",
          "author": "Jordan Sargent",
          "description": "If it feels like white rappers are sprouting up all around us, it's with good reason. Though they never really went away—Kreayshawn is somehow still in the news—the last year alone has brought to prominence artists such as ian, who stylizes his name in all lowercase and puts a suburban face to Atlanta trap music; 2hollis, a model-esque figure whose dance rap is appropriately runway-ready; Nettspend, a snot-nosed teenager hellbent on reminding the world that rappers have long since been the new rockstars; Jorjiana, a bashful Midwesterner who was once introduced on the controversial rap podcast No Jumper as \"the most viral white girl in America\"; and 1900Rugrat, a spitfire Florida native who, on his breakthrough single, unforgettably compares himself to a school shooter. But it's not the bre…",
          "link": "https://defector.com/there-has-never-been-a-better-time-to-be-a-white-rapper",
          "publishedOn": "2025-08-11T15:00:00.000Z",
          "wordCount": 10913,
          "title": "There Has Never Been A Better Time To Be A White Rapper",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/ian-joriana-2hollis_35974a.jpg"
        },
        {
          "id": "https://defector.com/?p=198080",
          "author": "Maitreyi Anantharaman",
          "description": "Time to channel your inner cruciverbalist. This week's puzzle was constructed by Dan Zarin and edited by Hoang-Kim Vu. Dan is a crossword constructor and freelance writer based in Portland, Maine. Over the years he has been a musician, a hitchhiker, a barista, an advertising copywriter and a food critic, so making puzzles seemed like the next logical step.\n Defector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE.",
          "link": "https://defector.com/the-crossword-aug-11-lose-control",
          "publishedOn": "2025-08-11T14:30:27.000Z",
          "wordCount": 5901,
          "title": "The Crossword, Aug. 11: Lose Control",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-2228903482.jpg"
        },
        {
          "id": "https://defector.com/?p=198041",
          "author": "Puja Patel",
          "description": "That’s right. It’s Puja Week and I’m Puja—everyone has to do what I say, or else. Don’t worry, this isn’t my first rodeo. A decade ago, I was a culture editor at the Gawker Media version of Deadspin and worked with many of the writers and editors who make up Defector today. Back then, my remit was “anything but sports,” which meant navigating what I liked to call “a wide variety of balls” in pursuit of more entertaining and earnest fare. My time with those people—and with my colleagues across our sister sites—was one of the most ridiculously fun and journalistically bold stretches of my career. It shaped me as an editor and reporter, and it’s where I met some of my closest friends and favorite bloggers. It feels good to be here with some of them again. \nIf I sound nostalgic, it’s because I’m writing this in August. While “Puja Week” is meant to be synonymous with “Music Week”—I left Deadspin to run Spin, and more recently helmed Pitchfork—it’s equally a tribute to the hangover of the year, that liminal period where the last drops of summer freedom are wrung out in anxious, existential anticipation of the coming seasonal chill. August is a month of spiritual and climatic dissonance. Over the next few days, you’ll see writing to match—reflective, feelings-forward, sentimental, brooding, occasionally needling at past, present, and future. Expect essays (and playlists) about life’s transitional periods—exploring love, identity, family, and emotional regulation—lists that wrestle with liking and hating something at once, and surveys of the shifting pockets of the music industry and their current cultural cachet.",
          "link": "https://defector.com/huddle-up-take-a-knee-its-puja-week",
          "publishedOn": "2025-08-11T13:09:43.000Z",
          "wordCount": 6964,
          "title": "Huddle Up, Take A Knee: It’s Puja Week",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-50433384.jpg"
        },
        {
          "id": "https://defector.com/?p=197854",
          "author": "Billy Haisley",
          "description": "Like many who have loved and left New York City, I dearly miss the transportation setup there. The walkability, the trains, the buses—there's not another town in the U.S. where you can do so much (and get so far) easily and without needing a car of your own. Though my 16-year-old self would have scarcely believed it, those years on the subway convinced me of the superiority of life without a car. Even though I look back fondly at my days as a straphanger, my return to the driver's world has reminded me of an undeniable truth: Riding around in the car while blaring music you love is the absolute shit.\nFew pleasures in life can match the joy I feel when I plop into the driver's seat, queue up an album, pull out of the driveway, and embark on a medium-length drive while shouting lyrics and mangling melodies. The bliss of bobbing my head and contorting my face, throwing around my hands and popping my shoulders, lets me attain that uninhibited state otherwise reserved for when I'm  certain nobody is watching... or when I'm too inebriated to care. I don't think it's a coincidence that I’ve been listening to way more music since leaving NYC. There, podcasts seemed like a more fitting soundtrack to my daily commute, due to the sonic inferiority of my cheap earbud headphones and my self-conscious refusal to come off like an especially terrible Showtime act if I grooved to my music there the same way I do in private. I can't say that my rekindled passion for listening to new music in the car is an even trade for walking or riding the subway instead of driving. But it does come pretty damn close.",
          "link": "https://defector.com/a-playlist-of-ear-splitting-brazilian-funk-ideal-for-a-long-drive",
          "publishedOn": "2025-08-10T18:00:00.000Z",
          "wordCount": null,
          "title": "A Playlist Of Ear-Splitting Brazilian Funk Ideal For A Long Drive",
          "imageUrl": null
        },
        {
          "id": "https://defector.com/?p=198019",
          "author": "Owen Lewis",
          "description": "Elena Rybakina must have figured she had the match won. She’d just battered 18-year-old Victoria Mboko in a 25-shot rally late in their Montreal semifinal, sending her sprinting from corner to corner until Mboko’s desperate lob drifted long. Mboko hunched over in exhaustion afterwards, her racket pressed hard into the ground as a crutch. Losing a miserable point like this, reminiscent of the godforsaken PACER test, typically comes with a hangover. The fatigued player often pulls the cord early in the rally in a desperate bid to get their breath back and misses by a mile, or produces a meatball drop shot. The score here was tied—4-all in the do-or-die third-set tiebreak—but Rybakina had all the momentum and a seemingly significant fitness advantage. \nSo I thought. At 4-all, Mboko clobbered four forehands, but coherently rather than desperately. The last one tagged the sideline for a winner. Mboko grabbed the next two points as well to win the match, leaving my tennis logic in tatters. Rybakina’s epic rally just a minute earlier had somehow worked against her, proving the last point she would win rather than the boon I’d expected. That wasn’t Mboko’s only miracle act of the match: She’d saved a match point half an hour earlier. This proved too much for my Tennis Channel stream, which promptly buckled under the tension and crashed. Mboko broke serve to prolong the match twice, outlasting both Rybakina and TC’s notorious technical difficulties.",
          "link": "https://defector.com/victoria-mboko-is-here-to-break-brains",
          "publishedOn": "2025-08-10T15:24:12.000Z",
          "wordCount": 9436,
          "title": "Victoria Mboko Is Here To Break Brains",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-2228241665.jpg"
        },
        {
          "id": "https://defector.com/?p=198002",
          "author": "Brandy Jensen",
          "description": "Every misogynist joke poses a question to its female audience: Can you laugh along? Will you be chill or are you going to make a big deal out of this? Are you going to be a bitch about it? Arriving in the form of a dildo, the joke that is also the question becomes a double entendre: Can you take it?\nThe first time someone threw a sex toy onto the court, during a July 29 game between the Golden State Valkyries and the Atlanta Dream, many players were inclined to say Yes, we can laugh about this. Sydney Colson of the Indiana Fever joked about it on Twitter, as did Angel Reese. And why not? As a bizarre one-off, it’s easy enough to laugh. Dildos, especially the ones that aim for anatomical fidelity, are funny objects when they appear somewhere you don’t expect to see one.",
          "link": "https://defector.com/why-a-bunch-of-real-dicks-keep-throwing-fake-ones",
          "publishedOn": "2025-08-10T14:17:58.000Z",
          "wordCount": 7627,
          "title": "Why A Bunch Of Real Dicks Keep Throwing Fake Ones",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-2229150144_3a9e15.jpg"
        },
        {
          "id": "https://defector.com/?p=198005",
          "author": "Brandy Jensen",
          "description": "It’s pretty common these days for a television show to hold its viewers in contempt. Most “big-hearted comedies” treat you like a child, most crime shows assume you are very stupid, most dramas take for granted that you are easily manipulated. It’s not unusual to feel like whoever wrote the show you’re watching hates you.\nThe Sex and the City sequel And Just Like That…, which HBO execs announced would be ending this Thursday after just three seasons, is different. It’s the rare show brave enough to hate the viewer a little bit, and its own characters so much more.",
          "link": "https://defector.com/and-just-like-that-its-over",
          "publishedOn": "2025-08-10T13:04:49.000Z",
          "wordCount": 6730,
          "title": "And Just Like That… It’s Over",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/sarah-jessica-parker_5.jpg"
        },
        {
          "id": "https://defector.com/?p=197969",
          "author": "Tom Ley",
          "description": "Hello! We’re about to close up shop for the week, but before we park up our vans and lock up our warehouse, I must relay some precious information to you. Next week, the Defector staff will be convening for our annual Business and Innovation Summit, which means we will once again be leaving you in […]",
          "link": "https://defector.com/programming-notes-7",
          "publishedOn": "2025-08-08T19:22:58.000Z",
          "wordCount": 5104,
          "title": "Programming Notes",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2021/09/GettyImages-51105461.jpg"
        },
        {
          "id": "https://defector.com/?p=197967",
          "author": "Defector Staff",
          "description": "Hello! It's Friday afternoon and we are ready to chat with our pals. Hit us with your best questions below.",
          "link": "https://defector.com/well-look-at-that-its-time-to-chat-with-the-defector-staff-again",
          "publishedOn": "2025-08-08T18:00:00.000Z",
          "wordCount": 4860,
          "title": "Well Look At That, It’s Time To Chat With The Defector Staff Again",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2020/09/GettyImages-3240507.jpg"
        },
        {
          "id": "https://defector.com/?p=197923",
          "author": "Defector Staff",
          "description": "Defector started publishing blogs on September 10, 2020. We are somehow mere weeks away from our fifth anniversary. To celebrate, Defector is throwing a birthday party at Union Pool in Williamsburg on Wednesday Sept. 10, 2025. We’ll have the run of the place, with musical performances in the back room by Avery Friedman and Speedy […]",
          "link": "https://defector.com/youre-invited-to-defectors-fifth-birthday-party-and-also-some-baseball-games",
          "publishedOn": "2025-08-08T16:21:56.000Z",
          "wordCount": 5658,
          "title": "You’re Invited To Defector’s Fifth Birthday Party And Also Some Baseball Games",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/bdayparty-draft-2.png"
        },
        {
          "id": "https://defector.com/?p=197852",
          "author": "Ray Ratto",
          "description": "Some people are fans of the Indianapolis. But many, many more people are NOT fans of the Indianapolis Colts. This 2025 Defector NFL team preview is for those in the latter group. Read all the previews so far here.\nYour team: Indianapolis Colts, like it says in the intro.",
          "link": "https://defector.com/why-your-team-sucks-2025-indianapolis-colts",
          "publishedOn": "2025-08-08T16:00:05.000Z",
          "wordCount": 18519,
          "title": "Why Your Team Sucks 2025: Indianapolis Colts",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-2181392361.jpg"
        },
        {
          "id": "https://defector.com/?p=197855",
          "author": "Kelsey McKinney",
          "description": "Welcome to Ask The Book Doctor, a recurring series about books and reading them.\nThe beautiful shiny phone is killing us. We all know it, but there it is. We want it. It is made to keep us captivated. We are moths to its flame. Often, when I am around people I love, and one of us is looking at our phone, the other will say \"What's happening on your phone?\" This is embarrassing. It is so rare that anything is happening on the phone. About 99 percent of the time, the other person says \"nothing,\" and puts their phone down. I see this in people in every generation. No one is immune.",
          "link": "https://defector.com/how-to-put-down-your-phone-and-read-a-book",
          "publishedOn": "2025-08-08T15:44:14.000Z",
          "wordCount": 8987,
          "title": "How To Put Down Your Phone And Read A Book",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/bookdoctor4.jpg"
        },
        {
          "id": "https://defector.com/?p=197857",
          "author": "Dave Covucci",
          "description": "This piece was originally published on FOIAball, a new publication covering college football programs using this country’s robust Freedom of Information Act (FOIA) laws. If you like this story, consider becoming a FOIAball subscriber and receive a 33 percent early bird discount.",
          "link": "https://defector.com/how-college-mascots-conceal-their-identity-and-their-ass",
          "publishedOn": "2025-08-08T14:14:09.000Z",
          "wordCount": 10227,
          "title": "How College Mascots Conceal Their Identity And Their Ass",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/exposed-sparty.png"
        },
        {
          "id": "https://defector.com/?p=197902",
          "author": "Tom Ley",
          "description": "People keep throwing dildos onto the court at WNBA games, which is an incredibly wack trend even before you hear who is taking credit for it: Crypto bros.\nOn Wednesday, a powerful loser and crypto enthusiast who calls himself Lt. Daldo Raine—you may have just instinctively reached for a blunt object—spoke to ESPN's Katie Barnes and claimed that he and his fellow crypto shitheads have been orchestrating recent dildo tosses at WNBA games for the sake of pumping their meme coin. \"We wanted to really make memes funny again,\" he told Barnes. Mission not accomplished, my friend.",
          "link": "https://defector.com/lamest-members-of-society-claim-responsibility-for-wnba-dildo-throwing-epidemic",
          "publishedOn": "2025-08-08T13:01:38.000Z",
          "wordCount": 7285,
          "title": "Lamest Members Of Society Claim Responsibility For WNBA Dildo-Throwing Epidemic",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-2228090492.jpg"
        },
        {
          "id": "https://defector.com/?p=197734",
          "author": "David Roth",
          "description": "There are only so many ways to describe a podcast, as regular readers of these little blogs already know. Because they are cut in two by our ad break, it is easy enough to mentally divide them; because they all begin with Drew's signature skronking vocal overture, they all have a shape. But what does it mean, really, to say that something like half of a podcast is given over to soda-related discourse, and that the other component parts are about going to a Marlins game, the demi-crisis in WNBA officiating, and also a frank discussion about the frustration of duffing the preparation of a familiar recipe? You can put all that together and reach 100 percent of a podcast and 63 minutes, but also those things do not, on their face, fit together at all. I realize that. And yet:",
          "link": "https://defector.com/a-very-fine-cheerwine-with-emma-baccellieri",
          "publishedOn": "2025-08-07T20:17:37.000Z",
          "wordCount": 7413,
          "title": "A Very Fine Cheerwine, With Emma Baccellieri",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-1795052470.jpg"
        },
        {
          "id": "https://defector.com/?p=197779",
          "author": "Kathryn Xu",
          "description": "Josh Naylor is slow. Not slow in the way that catchers are considered slow by default, or how some tall lanky guys seemingly can't get their legs moving, or even slow in the way that Kyle Schwarber is. Josh Naylor is third-percentile sprint speed slow. Josh Naylor is the 16th-slowest guy in baseball, and the third-slowest first baseman—he'll beat Triston Casas and Rowdy Tellez in a footrace, but if you put him against a fast shortstop like Trea Turner, he's never winning.\nBut if you're only counting stolen bases, it's a different story. Turner currently has 25 stolen bases this year, on pace for a very respectable 35-steal season. He has been caught stealing six times, for a roughly 80 percent success rate, which satisfies the heuristic—though it is only a heuristic—of the 70 percent breakeven point. Not shabby at all! Bobby Witt Jr. has 30 stolen bases on the season and has been caught stealing seven times, for a roughly 81 percent success rate. Again, that's about what you'd expect. Meanwhile, Naylor has 21 stolen bases on the season and has been caught stealing only twice, for an absurd 91 percent success rate. Those are Oneil Cruz numbers, with the caveat that Cruz has attempted to steal 15 more times than Naylor.",
          "link": "https://defector.com/josh-naylor-is-so-slow-that-nobody-can-catch-him",
          "publishedOn": "2025-08-07T19:07:52.000Z",
          "wordCount": 8205,
          "title": "Josh Naylor Is So Slow That Nobody Can Catch Him",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/joshNaylorSteals.jpg"
        },
        {
          "id": "https://defector.com/?p=197815",
          "author": "Mike Tanier",
          "description": "Some people are fans of the Dolphins. But many, many more people are NOT fans of the Dolphins. This 2024 Defector NFL team preview is for those in the latter group. Read all the previews so far here.\nYour team: Miami Dolphins",
          "link": "https://defector.com/why-your-team-sucks-2025-miami-dolphins",
          "publishedOn": "2025-08-07T18:45:17.000Z",
          "wordCount": 17663,
          "title": "Why Your Team Sucks 2025: Miami Dolphins",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-2188042731.jpg"
        },
        {
          "id": "https://defector.com/?p=197742",
          "author": "Luis Paez-Pumar",
          "description": "Tom Brady may be incredibly famous, obscenely successful, and (formerly?) outrageously handsome, but he has never been cool. This is a plain fact, one that Patriots fans like myself overlooked during his tenure there and one that Patriots haters loved to mock him for. Since his retirement, Brady has lost the magnetic appeal of his abilities with the ball in his hands, which has made stark his absent coolness. His commentary stint has been mediocre at best and awful at worst, and his unwavering but erroneous belief in his own charm is fully insufferable without the touchdowns and wins to mask it. In place of any kind of recognizably human personality, there is nothing but coach speak and corporate speak and brand consciousness, which makes it close to impossible for him to forge any kind of connection with an audience when he's not wearing pads. That hasn't stopped him from trying, which brings us to soccer.\nBuilt in Birmingham: Brady & The Blues is the latest attempt to humanize and propagandize Brady, and in a perverse way it succeeds at painting what feels like a true portrait of the former quarterback-turned-commentator-and-owner. This is not to say that the show succeeds in making Brady a compelling figure, or even a sympathetic one. Instead, the show—which is terrible for a variety of reasons, almost all Brady-related—proves what has been obvious for years: post-football Tom Brady is nothing but a platitude-spouting Robotron incapable of self-awareness.",
          "link": "https://defector.com/built-in-birmingham-cant-save-tom-brady-from-himself",
          "publishedOn": "2025-08-07T18:25:56.000Z",
          "wordCount": 10074,
          "title": "‘Built In Birmingham’ Can’t Save Tom Brady From Himself",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-2172464374.jpg"
        },
        {
          "id": "https://defector.com/?p=197684",
          "author": "E.Y. Zhao",
          "description": "LAS VEGAS — From July 3-13, World Table Tennis staged a Grand Smash tournament in Las Vegas for the first time. Like the Grand Slams of tennis, the Grand Smashes sit atop WTT’s tournament hierarchy, and with $1.55 million in prizes and main draws of 64 top players, the Smash was the largest international table tennis event to take place in the United States.\nVegas is no stranger to big table tennis tournaments. The city often plays host to the U.S. Open, which is run by USA Table Tennis and features a handful of pros competing side by side with hundreds of amateurs. American players who have been to previous U.S. Opens arrived at the Grand Smash already familiar with the little hells that a tournament in Vegas can produce: blast-furnace heat and slot machine-choked hotels on the way to a convention center floor, undergirded by concrete so slick that players pour out drinking water to wet their soles between points.",
          "link": "https://defector.com/sweating-through-the-existential-angst-of-a-las-vegas-table-tennis-tournament",
          "publishedOn": "2025-08-07T15:58:40.000Z",
          "wordCount": 18898,
          "title": "Sweating Through The Existential Angst Of A Las Vegas Table Tennis Tournament",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-2224848372.jpg"
        },
        {
          "id": "https://defector.com/?p=197741",
          "author": "Lauren Theisen",
          "description": "How do you respond to a guy who's proven that he can crush your 103.9-mph fastball deep into left field for a four-bagger? Well, you don't throw him your 103.9-mph fastball; you dissolve him with your slider. That's how Mason Miller was able to begin his ninth-inning save on Wednesday night.\nThe Padres' big deadline add from not-Oakland was in the news for the wrong reason after Tuesday's game, when Diamondbacks DH Lourdes Gurriel Jr. tied the score in the eighth by making Miller's flameball the fastest pitch ever homered on (probably ever, but at least since they started keeping track of those things in 2008). San Diego recovered to win in extra innings, but it was hard to forget the fact that Miller's searing heat had been made to look so vincible.",
          "link": "https://defector.com/better-not-guess-wrong-against-mason-miller",
          "publishedOn": "2025-08-07T15:31:02.000Z",
          "wordCount": 7576,
          "title": "Better Not Guess Wrong Against Mason Miller",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/GettyImages-2228871313-min.jpg"
        },
        {
          "id": "https://defector.com/?p=197626",
          "author": "Sabrina Imbler",
          "description": "Anyone who ever met Wavy Dave and lived to tell the tale—which is, in point of fact, everyone who has ever met Wavy Dave—would tell you about his claw. It was big, that's for certain, but this was not unusual for male fiddler crabs, which wield one enormous front claw, much larger than its counterpart. This is what gets the the female fiddlers going: a large claw that can wave back and forth quickly; the kind of claw that sends a message. These major claws can comprise more than 30 percent of a male's total body mass, which is a big burden on such a little crab. But if a female likes the size and motion of a male's claw, she may enter his burrow and let him fertilize her eggs.\nBut Wavy Dave's large claw, according to those who've seen it, kept growing larger. On the first day he scuttled into town, his claw was nearly two inches from base to tip. But the next time he came 'round these parts, his claw was even bigger. If you'd had gotten close enough to measure it, you'd find it had grown to a whopping 2.7 inches, making it the largest major claw on record for the species Afruca tangeri. You might think twice before crossing Wavy Dave.",
          "link": "https://defector.com/the-brief-adventures-of-wavy-dave",
          "publishedOn": "2025-08-07T14:02:39.000Z",
          "wordCount": 8101,
          "title": "The Brief Adventures Of Wavy Dave",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/wavydave.jpeg"
        },
        {
          "id": "https://defector.com/?p=197541",
          "author": "David Roth",
          "description": "It is perhaps unfair to the rest of humanity to slot Alan Dershowitz in as a specific type of guy. He fits into a number of variously rancid cohorts: Inner Circle Jeffrey Epstein Associates; Celebrity Attorneys (Derogatory); People With \"Harvard\" As Their Personality; People With \"Actually I Have Voted Democratic\" As Their Personality; Podcaster. But the category into which he fits the most cleanly is more abstruse, and has less to do with anything Dershowitz has done or the (many) scary monsters and super-creeps that he has represented, than the way that Dershowitz himself is, and the uniquely grating hazard he represents.\nSo while it is true that Alan Dershowitz is quite literally someone who got into a huffy argument with a pierogi vendor at a farmer's market on Martha's Vineyard, was escorted from the premises by police, and subsequently threatened a lawsuit, it is also and more significantly true that Alan Dershowitz is exactly the sort of person who would do all those things, to the point where my first reaction upon hearing this news was trying to remember whether this was the first time he'd done it. And while I can now confirm that this was Dershowitz's first pierogi-specific Martha's Vineyard contretemps—as I was writing this, there was a second—there have been enough other things like it that it was a reasonable enough thing to be confused about. Give or take going on TV whenever anyone asks and writing books with titles like The Price Of Principle: Why Integrity Is Worth The Consequences, Guilt By Association: The Challenge Of Proving Innocence In The Age Of #MeToo, and Palestinianism: The Newest Attack On Peace And Human Rights And Democracy, this is just how Dershowitz spends his time—getting into weird public disputes and treating himself to outlandish takings of umbrage re: his seemingly very unhappy experience on Martha's Vineyard, where he has vacationed for 50 years, and then threatening lawsuits and recording emergency episodes of his delightfully named podcast, The Dershow, about it.",
          "link": "https://defector.com/are-you-aware-of-the-alan-dershowitz-marthas-vineyard-pierogi-situation",
          "publishedOn": "2025-08-07T13:02:30.000Z",
          "wordCount": 10142,
          "title": "Are You Aware Of The Alan Dershowitz Martha’s Vineyard Pierogi Situation?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/08/DershowScreenshot.png"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=863942",
          "author": "Darragh McDonald",
          "description": "The Royals are going to be reinstating Michael Lorenzen from the 15-day injured list on Saturday, which will bump left-hander Bailey Falter to the bullpen. Manager Matt Quatraro relayed the news to Anne Rogers of MLB.com. It’s an unfortunate development for Falter, who has been having a good season overall. He logged 113 1/3 innings…",
          "link": "https://www.mlbtraderumors.com/2025/08/royals-move-bailey-falter-to-bullpen.html",
          "publishedOn": "2025-08-13T18:00:48.000Z",
          "wordCount": 2282,
          "title": "Royals Move Bailey Falter To Bullpen",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/08/Bailey_Falter_Royals-1024x682.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=863869",
          "author": "Leo Morgenstern",
          "description": "The Royals have agreed to a minor league contract with Nick Robertson, reports Ari Alexander of KPRC 2. The right-hander had spent most of the season in the Astros organization, but he was released today, according to the transaction log on his MLB.com player page. Robertson, who recently turned 27, appeared in the majors for…",
          "link": "https://www.mlbtraderumors.com/2025/08/royals-to-sign-nick-robertson-to-minor-league-deal.html",
          "publishedOn": "2025-08-13T04:18:11.000Z",
          "wordCount": 2343,
          "title": "Royals To Sign Nick Robertson To Minor League Deal",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/08/USATSI_26621723_168416865_lowres-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=863697",
          "author": "Darragh McDonald",
          "description": "The Royals announced today that right-hander Hunter Harvey has been placed on the 15-day injured list due to a right adductor strain. Fellow righty Luinder Avila has been recalled in the corresponding move and will be making his major league debut as soon as he gets into a game. Harvey’s IL stint is another frustrating…",
          "link": "https://www.mlbtraderumors.com/2025/08/royals-place-hunter-harvey-on-injured-list.html",
          "publishedOn": "2025-08-11T22:34:15.000Z",
          "wordCount": 2507,
          "title": "Royals Place Hunter Harvey On Injured List",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/Hunter_Harvey_Royals-1024x701.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=863317",
          "author": "Darragh McDonald",
          "description": "The Royals announced, via their official player development account, that they have signed infielder/outfielder Bobby Dalbec to a minor league contract. He opted out of a minor league deal with the Brewers last week. He will presumably join Triple-A Omaha in the coming days. The book on Dalbec is well known around baseball at this…",
          "link": "https://www.mlbtraderumors.com/2025/08/royals-sign-bobby-dalbec-to-minor-league-deal.html",
          "publishedOn": "2025-08-08T17:42:41.000Z",
          "wordCount": 2300,
          "title": "Royals Sign Bobby Dalbec To Minor League Deal",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/USATSI_25990138-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=863287",
          "author": "Nick Deeds",
          "description": "The trade deadline has come and gone. While trade season was slow to get started this year, when all was said and done, there were several dozen trades made in a flurry of movement over the final few days before the deadline arrived. The full impact of these trades won’t be known for years to…",
          "link": "https://www.mlbtraderumors.com/2025/08/poll-who-had-the-best-deadline-in-the-al-central.html",
          "publishedOn": "2025-08-08T17:09:53.000Z",
          "wordCount": 4390,
          "title": "Poll: Who Had The Best Deadline In The AL Central?",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/08/USATSI_26764675-1024x683.jpg"
        }
      ]
    },
    {
      "title": "Flaming Hydra",
      "feedUrl": "https://flaminghydra.com/rss/",
      "siteUrl": "https://flaminghydra.com/",
      "articles": [
        {
          "id": "689f825dd206c80001cafdad",
          "author": "The Editors",
          "description": "Taking the pill of chill",
          "link": "https://flaminghydra.com/issue-383/",
          "publishedOn": "2025-08-15T23:34:45.000Z",
          "wordCount": 325,
          "title": "Ahhh.",
          "imageUrl": "https://flaminghydra.com/content/images/2025/08/IMG_6577.JPEG"
        },
        {
          "id": "689e5643d206c80001cae89f",
          "author": "The Editors",
          "description": "Brian Hioe on the dangers of inexperience",
          "link": "https://flaminghydra.com/issue-382/",
          "publishedOn": "2025-08-14T23:49:51.000Z",
          "wordCount": 525,
          "title": "Youth movement",
          "imageUrl": "https://flaminghydra.com/content/images/2025/08/china-national-day-LR-7557_-49049938866--1.jpg"
        },
        {
          "id": "689e2c8ed206c80001cae7ec",
          "author": "Brian Hioe",
          "description": "Last month, news broke of the arrest of four members of a Hong Kong political party, the Hong Kong Democratic Independence Union. The youngest arrested was 15 years old. This type of arrest is increasingly commonplace in Hong Kong, but something jumped out at me about this one. Reports claimed",
          "link": "https://flaminghydra.com/the-reckless-hopes-of-hong-kong-teens/",
          "publishedOn": "2025-08-14T23:47:54.000Z",
          "wordCount": 580,
          "title": "The Reckless Hopes of Hong Kong Teens",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/08/china-national-day-LR-7557_-49049938866-.jpg"
        },
        {
          "id": "689e6844d206c80001cae97f",
          "author": "The Editors",
          "description": "by The Editors\n\nThe time has come to render judgement, players of HYDRANYM, on the topic of\nPARTY\nHYDRANYM is the Creative Writing word game especially for Flaming Hydra subscribers (RULES appear below). \nJoin in by subscribing! It’s weirdly fun AND, as a subscriber, you will be helping",
          "link": "https://flaminghydra.com/hydranym-no-12-vote/",
          "publishedOn": "2025-08-14T23:01:08.000Z",
          "wordCount": 574,
          "title": "HYDRANYM No. 12: Vote!",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/HYDRANYM-6.jpg"
        },
        {
          "id": "689d0c5ed206c80001cad49b",
          "author": "The Editors",
          "description": "A dreamy new story by Sam Thielman",
          "link": "https://flaminghydra.com/issue-381/",
          "publishedOn": "2025-08-14T01:11:52.000Z",
          "wordCount": 712,
          "title": "Divine purpose",
          "imageUrl": "https://flaminghydra.com/content/images/2025/08/saguaro-1001609359.sas-1.png"
        },
        {
          "id": "689cf89ad206c80001cad458",
          "author": "Sam Thielman",
          "description": "In Leupp, which is close by, a pretty woman and a tall man with dark hair are walking out of a children’s film. She tells him she moved to New Mexico from the Florida panhandle after she’d had her juvenile record expunged and ended up working",
          "link": "https://flaminghydra.com/out-of-space/",
          "publishedOn": "2025-08-14T01:06:57.000Z",
          "wordCount": 777,
          "title": "Out of Space",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/08/saguaro-1001609359.sas.png"
        },
        {
          "id": "689b9535d206c80001cabf5b",
          "author": "Yemisi Aribisala",
          "description": "Power has been conceived throughout Nigeria’s history partly in spiritual terms and the spiritual domain is one in which power is actively contested. \n—Stephen Ellis\nSince Scottish Presbyterians and Portuguese Catholics came to the place later to be called Nigeria, and insisted on the wholehearted and unquestioning",
          "link": "https://flaminghydra.com/elder-james-must-die/",
          "publishedOn": "2025-08-13T08:58:28.000Z",
          "wordCount": 738,
          "title": "Elder James Must Die!",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/08/elder_james-1--1.jpg"
        },
        {
          "id": "689b8fd9d206c80001cabf44",
          "author": "The Editors",
          "description": "Where politics and the occult collide, by Yemisi Aribisala",
          "link": "https://flaminghydra.com/issue-380/",
          "publishedOn": "2025-08-13T01:02:45.000Z",
          "wordCount": 684,
          "title": "Hidden powers",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/08/elderjames-1.jpg"
        },
        {
          "id": "689a640c70a83e000179fe11",
          "author": "The Editors",
          "description": "by The Editors\n\nSubscribe to Flaming Hydra to play HYDRANYM! A devilishly fun and absurd word game with Creative Writing features.\nThis game will close on Thursday midnight PST.\n\n[countdown to 2025-08-14 12:00am PDT]\nArs longa, vita brevis\n\nTHE RULES\nCreate an ENTERTAINING and APT acronym from the letters",
          "link": "https://flaminghydra.com/hydranym-no-12/",
          "publishedOn": "2025-08-13T00:45:56.000Z",
          "wordCount": 496,
          "title": "HYDRANYM No. 12",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/08/HYDRANYM.jpg"
        },
        {
          "id": "689a663770a83e000179fe2c",
          "author": "The Editors",
          "description": "Josephine Riesman and Rhi Olivaw on a spectacular year for Xenomorphs",
          "link": "https://flaminghydra.com/issue-379/",
          "publishedOn": "2025-08-12T01:44:30.000Z",
          "wordCount": 766,
          "title": "Inside the aliens",
          "imageUrl": "https://flaminghydra.com/content/images/2025/08/AVA-3-1.png"
        },
        {
          "id": "689a43a870a83e000179fd6f",
          "author": "Josephine Riesman",
          "description": "A conversation with Rhi Olivaw",
          "link": "https://flaminghydra.com/talking-aliens-vs-avengers/",
          "publishedOn": "2025-08-12T01:42:14.000Z",
          "wordCount": 738,
          "title": "Talking 'Aliens vs. Avengers'",
          "imageUrl": "https://flaminghydra.com/content/images/2025/08/AVA-3.png"
        },
        {
          "id": "68964efc70a83e000179e25b",
          "author": "The Editors",
          "description": "Here as promised are the TOP ELEVEN films that are fun, with the number of votes received by each, as chosen by nearly 150 readers of Flaming Hydra in our recent poll from a list of 333 such films compiled by our contributors. \nAfter a trying week, we hope some",
          "link": "https://flaminghydra.com/poll-results-your-top-11-movies-that-are-fun/",
          "publishedOn": "2025-08-08T23:22:43.000Z",
          "wordCount": 591,
          "title": "POLL results: Your Top 11 Movies That are Fun",
          "imageUrl": "https://flaminghydra.com/content/images/2025/08/popcorn-fun-movies.png"
        },
        {
          "id": "68963e5a70a83e000179e21b",
          "author": "The Editors",
          "description": "John Saward on robots, slaves, and robot slavers",
          "link": "https://flaminghydra.com/issue-378/",
          "publishedOn": "2025-08-08T23:15:32.000Z",
          "wordCount": 619,
          "title": "Perfect employees / Happy pictures",
          "imageUrl": "https://flaminghydra.com/content/images/2025/08/outdated-businessmen-edit-1.png"
        },
        {
          "id": "6896509470a83e000179e268",
          "author": "John Saward",
          "description": "There are a great many things that might send you howling into insanity. Israel’s ongoing carnival of perverted and psychotic violence, either gleefully facilitated or strategically ignored by your government. Your college, hosting and financing avant-garde sting operations where state trooper burnouts chase student protestors into coffeeshops. The",
          "link": "https://flaminghydra.com/the-naked-game/",
          "publishedOn": "2025-08-08T23:14:22.000Z",
          "wordCount": 643,
          "title": "The Naked Game",
          "imageUrl": "https://flaminghydra.com/content/images/2025/08/outdated-businessmen-edit.png"
        },
        {
          "id": "68966d4270a83e000179e2f3",
          "author": "The Editors",
          "description": "by The Editors\n\nApologies for our tardiness, players of HYDRANYM! The 21 best entries from Game No. 11 are ready for your perusal, on the theme of\nISSUE\nHYDRANYM is the Creative Writing word game especially for Flaming Hydra subscribers (RULES appear below). Join in by subscribing! It’s",
          "link": "https://flaminghydra.com/hydranym-no-11-vote/",
          "publishedOn": "2025-08-08T23:13:57.000Z",
          "wordCount": 589,
          "title": "HYDRANYM No. 11: Vote!",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/HYDRANYM-6.jpg"
        },
        {
          "id": "6894fcd770a83e000179cb5d",
          "author": "The Editors",
          "description": "Felipe De La Hoz on risk assessment, and piano lessons with Misha Angrist",
          "link": "https://flaminghydra.com/issue-377/",
          "publishedOn": "2025-08-07T22:41:25.000Z",
          "wordCount": 745,
          "title": "Poultry politics / Soul music",
          "imageUrl": "https://flaminghydra.com/content/images/2025/08/chicken-dem-rep-sky-layer-edit-Screenshot-2025-08-07-at-4.21.37---PM.png"
        },
        {
          "id": "6894df9870a83e000179ca9e",
          "author": "Misha Angrist",
          "description": "Last fall, in a dark club a couple of hours before showtime, I accosted my future piano teacher—an affable, clean-living hippie who spent five years making sublime music as part of my favorite local (and perhaps favorite ever) band, who were celebrating their 20th anniversary that night. I",
          "link": "https://flaminghydra.com/key-change/",
          "publishedOn": "2025-08-07T22:41:10.000Z",
          "wordCount": 674,
          "title": "Key Change",
          "imageUrl": "https://flaminghydra.com/content/images/2025/08/piano-monk-screenshot.png"
        },
        {
          "id": "6894f22d70a83e000179caf2",
          "author": "Felipe De La Hoz",
          "description": "The unambiguous clarity of U.S. District Judge James Boasberg’s mid-March order for the Trump administration to turn back El Salvador-bound deportation flights—planes filled with people removed under an absurd Alien Enemies Act proclamation—only made Trump’s noncompliance that much more nakedly obvious.",
          "link": "https://flaminghydra.com/play-chicken-and-win/",
          "publishedOn": "2025-08-07T22:40:51.000Z",
          "wordCount": 724,
          "title": "Play Chicken and Win",
          "imageUrl": "https://flaminghydra.com/content/images/2025/08/chicken-dem-rep-sky-layer-edit-Screenshot-2025-08-07-at-4.21.37---PM-1.png"
        }
      ]
    },
    {
      "title": "Today in Tabs",
      "feedUrl": "https://rss.beehiiv.com/feeds/ZRiesnGI0u.xml",
      "siteUrl": "https://www.todayintabs.com/",
      "articles": [
        {
          "id": "https://www.todayintabs.com/p/the-seven-gallons-of-milk-in-the-pocket-challenge-d7a7",
          "author": "Rusty Foster",
          "description": "Holy moly, me oh my.",
          "link": "https://www.todayintabs.com/p/the-seven-gallons-of-milk-in-the-pocket-challenge-d7a7",
          "publishedOn": "2025-08-07T18:33:02.000Z",
          "wordCount": 10625,
          "title": "The Seven Gallons of Milk in the Pocket Challenge",
          "enclosure": {
            "url": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/8d29e807-3721-4767-987d-a7fa6d43ad8e/Screenshot_2025-08-07_at_2.04.22_PM.png",
            "length": "1893269",
            "type": "image/png"
          },
          "imageUrl": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/8d29e807-3721-4767-987d-a7fa6d43ad8e/Screenshot_2025-08-07_at_2.04.22_PM.png"
        }
      ]
    },
    {
      "title": "Bad Faith Times",
      "feedUrl": "https://bad-faith-times.ghost.io/rss/",
      "siteUrl": "https://badfaithtimes.com/",
      "articles": [
        {
          "id": "689df857498e240001611a36",
          "author": "Denny Carter",
          "description": "The goon squad has come to town. Beep beep.",
          "link": "https://badfaithtimes.com/stop-trying-to-make-sense-of-trumps-occupation-of-d-c/",
          "publishedOn": "2025-08-14T16:22:32.000Z",
          "wordCount": 1774,
          "title": "Stop Trying To Make Sense Of Trump's Occupation Of D.C.",
          "imageUrl": "https://badfaithtimes.com/content/images/size/w1200/2025/08/Screenshot-2025-08-14-at-12.20.57---PM.png"
        },
        {
          "id": "689a069283c87b000189354d",
          "author": "Denny Carter",
          "description": "Theirs isn't exactly a flattering depiction of the ultra-wealthy.",
          "link": "https://badfaithtimes.com/my-kids-playact-billionaires-and-i-dont-mind/",
          "publishedOn": "2025-08-12T11:53:39.000Z",
          "wordCount": 2569,
          "title": "My Kids Playact Billionaires And I Don't Mind",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/08/Screenshot-2025-08-11-at-11.21.47---AM.png"
        },
        {
          "id": "6896407483c87b0001892eaf",
          "author": "Denny Carter",
          "description": "The American right's conquering of CBS is the product of generations of bad-faith complaining",
          "link": "https://badfaithtimes.com/the-media-bias-wars-are-over/",
          "publishedOn": "2025-08-08T19:16:27.000Z",
          "wordCount": 1584,
          "title": "The Media Bias Wars Are Over",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/08/Screenshot-2025-08-08-at-3.12.08---PM.png"
        },
        {
          "id": "6893ebda83c87b000189276d",
          "author": "Denny Carter",
          "description": "There's only so much gerrymandering a party can do before they fuck it up for themselves",
          "link": "https://badfaithtimes.com/the-dummymander-a-manifestation-of-bad-faith-politics/",
          "publishedOn": "2025-08-07T12:36:48.000Z",
          "wordCount": 1748,
          "title": "The Dummymander: A Manifestation of Bad Faith Politics",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/08/Screenshot-2025-08-07-at-8.35.02---AM.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}