{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": [
        {
          "id": "https://blogs.fangraphs.com/?p=459710",
          "author": "Kiri Oler",
          "description": "Teams frequently watch inspirational sports movies in spring training as a bonding exercise. But what if they selected a film that fits their current vibe?",
          "link": "https://blogs.fangraphs.com/the-names-bonding-team-bonding-american-league/",
          "publishedOn": "2025-03-26T21:30:05.000Z",
          "wordCount": null,
          "title": "The Name’s Bonding, Team Bonding: American League",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://blogs.fangraphs.com/?p=459567",
          "author": "Jay Jaffe",
          "description": "Two righty-swinging outfielders suitable for plugging roster gaps land with AL Central contenders.",
          "link": "https://blogs.fangraphs.com/in-canha-and-margot-a-pair-of-brewers-nris-find-new-homes-elsewhere/",
          "publishedOn": "2025-03-25T15:00:13.000Z",
          "wordCount": null,
          "title": "In Canha and Margot, a Pair of Brewers NRIs Find New Homes Elsewhere",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=185816",
          "author": "Israel Daramola",
          "description": "Val Kilmer died on Tuesday, April 1. He had been diagnosed with throat cancer years ago, and early reports are that he died after a bout with pneumonia. Too beautiful to be a character actor and too much of a weirdo to be the Hollywood leading man his beauty seemed destined for, Kilmer was nonetheless one of the greats. He saw himself as an artist, in all the messy and pretentious ways that term implies. But no matter what, you couldn't look away from him. He's been in a lot of great movies, and some bad ones too. In his honor, here are five movies I think best exemplify what made him such an exceptional star.\nTombstone (1993) Dir. George Cosmatos - \"Doc Holliday\"",
          "link": "https://defector.com/remembering-val-kilmer-in-five-movies",
          "publishedOn": "2025-04-02T19:33:22.000Z",
          "wordCount": 8173,
          "title": "Remembering Val Kilmer In Five Movies",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-1149915854.jpg"
        },
        {
          "id": "https://defector.com/?p=185757",
          "author": "Alex Sujong Laughlin",
          "description": "We did it. We completed 12 weeks of morning pages, artist dates, media deprivation, and affirmations. We have walked The Artist's Way! Are we artists now? That is yet to be determined. For our very last check-in, we're reflecting on what these last three months brought us, from the carpal tunnel to the breakthroughs, to see if it was all worth it. \nWhat did you enjoy and loathe most about doing The Artist's Way?",
          "link": "https://defector.com/the-artists-way-week-12-is-julia-cameron-wrong",
          "publishedOn": "2025-04-02T19:01:22.000Z",
          "wordCount": 16186,
          "title": "‘The Artist’s Way’ Week 12: Is Julia Cameron Wrong?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/Copy-of-my-food-e1743619540959.png"
        },
        {
          "id": "https://defector.com/?p=185827",
          "author": "Kathryn Xu",
          "description": "The assumption, looking at the corpse of the Atlanta Braves in September, was that it could not possibly happen again. Bad luck doesn't come around that often, and certainly never strikes twice. Projected standings may be able to hold firm, but early April is the season for baseball mortals to conduct their favorite activity: small sample-size thinking. Fifteen homers in three games means that the New York Yankees' torpedo bats need to be torpedoed into the moon; Mike Trout is starting to stink; 15 strikeouts in 19 at-bats is, well, admittedly pretty awful, there's no getting around that. And, now, looking at a .000 win percentage over six games, simple math says that the Braves may not win another game this season.\nIt isn't just the record. On Monday, MLB suspended Jurickson Profar for 80 games, after he tested positive for human chorionic gonadotropin. Sealing the suspension, Profar didn't even file the customary appeal out of obligation. As pitchers' sudden resurgences could once be explained by \"He got into the special jam,\" a PED suspension provides a neat and tidy explanation as to how Profar had such an out-of-character season as a hitter last year, though it may lessen the charm of the story. It also explains the relatively slow offseason Profar had as a free agent, before the Braves handed him a three-year, $42 million contract in January—the only multi-year contract they handed out over the offseason. (According to David O'Brien at The Athletic, the Braves ascribed his performance to mechanical adjustments \"made with his lower body in his batting stance, after working out with Fernando Tatis Jr. and his dad the previous winter.\")",
          "link": "https://defector.com/the-braves-may-never-win-a-game",
          "publishedOn": "2025-04-02T18:11:02.000Z",
          "wordCount": 7699,
          "title": "The Braves May Never Win A Game",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/kelenicBravesDodgers.jpg"
        },
        {
          "id": "https://defector.com/?p=185840",
          "author": "Ray Ratto",
          "description": "On its face there was nothing unusually spectacular about Stephen Curry's 52-point game last night at Memphis. He had 56 in Orlando 33 days ago, after all, and put up 60 a year ago in Atlanta. For all the references to his 54-point resumé-maker in New York twelve years ago, Curry’s best games have seemed to come south of the Mason-Dixon and east of the Mississippi. His last triple double—he went for a mere 52, 10 and 8 in Tuesday’s win over the Grizzlies—happened three years ago in Miami, just three days after his penultimate triple double in Charlotte.\nAnd the spectacle of Curry's latest attention-grabbing triumph lasted only a couple of hours; Nikola Jokic had 61, 10, and 10 later in the evening in Denver's Russ-tainted double-overtime loss to Minnesota, a performance  outlandish enough to steer some of the shine away from yet another Curry fiftyburger. Some 40 players have scored half a hundred in a game 96 times in the last five years; Curry himself has done it nine times during that period. That’s more than any other player, so by these preposterous standards, Curry was...well, quite good but not necessarily OMG-able. It is a strange thing on the merits to be on the receiving end of merely a polite “that’s nice” after scoring 52 points on 31 shots, including going 12-for-20 from three, but Steph Curry does not get discussed on the merits. He gets discussed in relation to himself, which while meritorious enough still is a ridiculous yardstick. By those standards, this had all the feeling of, \"Oh, he did that, did he? Cool.\"",
          "link": "https://defector.com/steph-curry-went-off-again",
          "publishedOn": "2025-04-02T17:14:19.000Z",
          "wordCount": 6959,
          "title": "Steph Curry Went Off, Again",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2208035120.jpg"
        },
        {
          "id": "https://defector.com/?p=185810",
          "author": "Albert Burneko",
          "description": "Some things, no one can tell you. No one can tell you that you are in love; you simply know it. No one can tell you your calling in life; you have to find it. No one can tell you that you were not chased through San Francisco by a pistol-shooting madman on Saturday night. It's just one of those things a man knows for himself.\nDeep Prasad, CEO of a Texas-based artificial intelligence company named GenMat, had this experience over the weekend. Not just that of fleeing a murderer's gunfire through the witching-hour streets of San Francisco ...",
          "link": "https://defector.com/tech-ceo-do-not-say-to-me-that-i-was-not-just-assassinated-by-the-jackal",
          "publishedOn": "2025-04-02T16:47:18.000Z",
          "wordCount": 7594,
          "title": "Tech CEO: Do Not Say To Me That I Was Not Just Assassinated By The Jackal",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2197483278.jpg"
        },
        {
          "id": "https://defector.com/?p=185809",
          "author": "Lauren Theisen",
          "description": "The way I see it, these are the top five moments in St. Louis Blues history:\n1. Bobby Orr dives as his iconic goal sweeps the Blues out of the 1970 Stanley Cup Final, which St. Louis was only in because the NHL put all of the expansion teams in one half of the bracket.",
          "link": "https://defector.com/what-the-heck-got-into-the-blues",
          "publishedOn": "2025-04-02T15:14:00.000Z",
          "wordCount": 6413,
          "title": "What The Heck Got Into The Blues?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2207525788.jpg"
        },
        {
          "id": "https://defector.com/?p=185806",
          "author": "Tom Ley",
          "description": "It is a shame Russell Westbrook must be the first player mentioned in a blog about a 140-139 Minnesota victory over Denver that went to double-overtime and was perhaps the single most entertaining game of the season. That is what must happen, however, when such a game ends with one guy delivering the worst 17-second sequence of individual basketball anyone can imagine.\nSo let's just start at the end: With 17.7 seconds left in the second overtime, the Timberwolves were preparing to inbound the ball while trailing 139-138. Anthony Edwards got the ball in the corner, and after being double-teamed made a hesitant pass that found nobody. Westbrook jumped on the loose ball and initiated a 2-on-1 fast break going the other way. He passed the ball to Christian Braun, who passed it back to Westbrook, who then completely duffed a wide-open layup. The Timberwolves grabbed the rebound with 10 seconds left, and after a wild scramble the ball found Nickeil Alexander-Walker in the corner. Alexander-Walker's shot banged off the side of the rim as the buzzer sounded, but not before Westbrook, flying back into the play to contest the shot, fouled him. The refs put 0.1 seconds on the clock, Alexander-Walker went to the line for three shots, sank two, and the game was over.",
          "link": "https://defector.com/noooo-russell-westbrook-dont-do-that-nooooo-dont-do-that-either",
          "publishedOn": "2025-04-02T14:42:17.000Z",
          "wordCount": 6691,
          "title": "Noooo, Russell Westbrook, Don’t Do That! Nooooo, Don’t Do That Either!",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2207530848.jpg"
        },
        {
          "id": "https://defector.com/?p=185411",
          "author": "John Loeppky",
          "description": "Anything with the label of diversity, equity, or inclusion is under attack. Few arenas so closely tie DEI initiatives and athletics than parasports, for people with disabilities. From military-focused projects like the Invictus Games, to collegiate programs across the U.S., to the major funding disparities among international teams, the pursuits and careers of disabled athletes are just as much sociology and history lessons as they are athletics.\nIn the current, deeply destructive political moment, how are things going? I spoke to leaders at collegiate parasport programs and got the sense that they are in a holding pattern, hoping—perhaps vainly—that their sports will be insulated, while also being aware that their athletes stand to be affected off the court as well.",
          "link": "https://defector.com/university-parasports-brace-for-trumps-anti-dei-crusade",
          "publishedOn": "2025-04-02T12:58:10.000Z",
          "wordCount": 8420,
          "title": "University Parasports Brace For Trump’s Anti-DEI Crusade",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2146993231.jpg"
        },
        {
          "id": "https://defector.com/?p=185761",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about life before eyeglasses, cup storage, maximally dumbed down sports reporting, and more.\nYour letters:",
          "link": "https://defector.com/banning-the-tush-push-is-a-chickenshit-idea",
          "publishedOn": "2025-04-01T19:26:04.000Z",
          "wordCount": 16581,
          "title": "Banning The Tush Push Is A Chickenshit Idea",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-1740225815.jpg"
        },
        {
          "id": "https://defector.com/?p=185751",
          "author": "Soraya Roberts",
          "description": "In the modest new British detective series Ludwig, comedian David Mitchell—who you will likely know as uptight office drone Mark Corrigan from Jesse Armstrong’s very pre-Succession cult hit Peep Show—plays the shut-in twin of what appears to have been a much livelier detective who goes missing. John Taylor, whose literal job it is to make puzzles (for which he uses the titular pen name), gets a call from his sister-in-law (a delightful Anna Maxwell Martin), whom he has known since they were kids, who therefore also knows she has to send a cab hundreds of miles to pick him up and bring him to the university town of Cambridge where she lives, because otherwise he will not leave the house (she vows to match the exact meal she knows he’s having to make it up to him). \nShe enlists John to pose as his brother, James, in order to infiltrate his detective agency and solve the mystery of how he went missing, but in the meantime, John keeps getting waylaid. Turns out his puzzle skills make him incredibly adept at solving crimes—of which there are a surprising number in such a small town—through swift deductive reasoning (and a lot of confusing number crunching), if not at entirely convincing his coworkers this new socially inept personality in fact belongs to the twin he is claiming to be. At one point in the second episode, James’s son has to be reassured by his mother that John is up to the job. “Your uncle is the most brilliant person I’ve ever known, there’s nothing he can’t do,” she says. A beat. “Actually that’s a lie, there’s a lot of things he can’t do, but he CAN do this.”",
          "link": "https://defector.com/ludwig-gets-cozy-with-david-mitchells-limits",
          "publishedOn": "2025-04-01T18:41:30.000Z",
          "wordCount": 8241,
          "title": "‘Ludwig’ Gets Cozy With David Mitchell’s Limits",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/Ludwig-3-Final.jpg"
        },
        {
          "id": "https://defector.com/?p=185721",
          "author": "Dan McQuade",
          "description": "My Uncle Dave was at the game with his friend Donald. The Phillies were losing. Dave and Donald were walking around a lower-level concourse in the Veterans Stadium outfield. Bullpens at the Vet were behind the outfield wall in left and right. Fans were pretty high up, but they could lean over from the walkway above and get an overhead view of warmup tosses. Or do other things.\nDave and Donald were at a game in the early 2000s when they began doing one of the most popular of those other things, which was bugging Phillies pitchers. Donald wanted a ball or two for his kids, D.J. and Jack. I have attended dozens of baseball games with my uncle; I am sure the pair was annoying the heck out of Phillies relievers after a while. Right from the start, probably.",
          "link": "https://defector.com/philly-fan-hecklers-thwarted-by-doors",
          "publishedOn": "2025-04-01T17:49:19.000Z",
          "wordCount": 8386,
          "title": "Philly Fan Hecklers Thwarted By Doors",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/phillies-outfield-bullpen-doors.jpg"
        },
        {
          "id": "https://defector.com/?p=185356",
          "author": "Patrick Redford",
          "description": "Touchstone Climbing is a behemoth of a gym network, spanning 16 gyms across California. Two of those opened within the past year with another currently under construction, as Touchstone seeks to consolidate its position as the premier place to climb indoors in the most populous state in the country, and surf various cultural and economic waves: the post-Free Solo climbing boom, the trend of younger people buying gym memberships at higher rates, and the increasing number of remote workers in search of some sort of third space.\nIt's a smart bet, though quite a capital-intensive one, and all that levering-up is not without its pressure points. As Touchstone grows, so does the cost of a membership, which people have been happy to pay so far because the experience is worth it. But if multiple simultaneous construction projects and an expanded suite of offerings can be scaled up quickly, that speed only exacerbates the tension around the attribute that truly distinguishes Touchstone: the high-quality route-setting.",
          "link": "https://defector.com/theres-no-climbing-without-route-setters-and-theyre-on-strike",
          "publishedOn": "2025-04-01T15:57:18.000Z",
          "wordCount": 8463,
          "title": "There’s No Climbing Without Route Setters, And They’re On Strike",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/routesetter-union.jpeg"
        },
        {
          "id": "https://defector.com/?p=185730",
          "author": "Owen Lewis",
          "description": "Aryna Sabalenka did something unusual in her Miami Open semifinal with Jasmine Paolini: She visibly acknowledged an error while a point was still live. Between points, anything goes in tennis. Players eviscerate their rackets, scream at umpires, spew abuse at their support team, or send tennis balls caroming around stadiums. But live rallies themselves are treated like a sacred space, free of even an eye-roll as long as a chance to win the point remains. \nIt happened when Sabalenka, the best player in the world, was leading the first set 4-1 and nearing another break point. She had Paolini scampering with a forehand missile but put a little too much air under a drop shot, which Paolini spun into a lob over Sabalenka’s head. On replay, as Sabalenka sprinted to retrieve it and saw the ball land in, she was already grimacing at surrendering control of the point.",
          "link": "https://defector.com/aryna-sabalenka-is-thrillingly-imperfect",
          "publishedOn": "2025-04-01T15:07:00.000Z",
          "wordCount": 9624,
          "title": "Aryna Sabalenka Is Thrillingly Imperfect",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2206984190.jpg"
        },
        {
          "id": "https://defector.com/?p=185192",
          "author": "Drew Magary",
          "description": "A look at the awful playtime trinkets you’re forced to keep in your house until you can finally buy your kid a phone.\nThe Toy",
          "link": "https://defector.com/why-your-childrens-toy-sucks-playhut",
          "publishedOn": "2025-04-01T14:36:38.000Z",
          "wordCount": 7244,
          "title": "Why Your Children’s Toy Sucks: Playhut",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/Screenshot-2025-04-01-at-10.26.31 AM.png"
        },
        {
          "id": "https://defector.com/?p=185708",
          "author": "Maitreyi Anantharaman",
          "description": "For three early minutes of Monday night’s Texas-TCU Elite Eight game, Texas led 2-1, and that might as well have been the final score. Certainly it was the game’s realest, most honest scoreline. Bothered by a tight, physical Texas defense, TCU could only reliably score at the free-throw line. The Horned Frogs would finish their 58-47 loss with just 12 made field goals on 45 attempts. A one-point difference felt both tiny and substantial. If Texas was playing twice as well on offense, that still wasn’t saying much. Against one of the better outside shooting teams in the country, the Longhorns were as loath to take threes as they have been all season, taking only three shots (and making two) from behind the arc. Things stayed close and nervy late into the third quarter—a 2-1 game, through and through.\nTexas will appear in the Final Four for the first time since 2003. They’re set to play South Carolina, a staple of the Final Four by contrast and a conference rival the Longhorns have come to know well in the SEC regular season. The deep, shapeshifting Gamecocks present a slightly different challenge than TCU did. “If you cut that piece off, the rest of it dies,” Texas head coach Vic Schaefer said, referring to Hailey Van Lith, the glue of the Horned Frogs offense. To cut that piece off, Texas defended in layers: pressing up the floor and hard hedging the TCU pick-and-roll so that getting the ball even remotely close to the basket just seemed like a real chore. “Even if we didn't get a turnover, we really made ‘em work hard to get it in. Then when they got it in, they had to try to figure out how to run some offense. I think we had ‘em pushed out on the floor quite well,” Schaefer said. Hailey Van Lith turned the ball over seven times and finished with just two assists. TCU’s 6-foot-7, seventh-year center Sedona Prince fouled out with six minutes to play in the fourth quarter, leaving the game with more fouls than points—and, a mark of how few paint touches Texas allowed her, more fouls than field goal attempts, too.",
          "link": "https://defector.com/texas-cut-tcu-to-pieces",
          "publishedOn": "2025-04-01T13:30:43.000Z",
          "wordCount": 6877,
          "title": "Texas Cut TCU To Pieces",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2207878742.jpg"
        },
        {
          "id": "https://defector.com/?p=185592",
          "author": "Maitreyi Anantharaman",
          "description": "Asked if she ever imagined she’d reach her fourth Final Four in four years, Sania Feagin didn’t bother with pretense. “Yes, I did,” the South Carolina senior forward said. “I did because all they do is win here.” In Feagin's four years as a Gamecock, the team has taken many shapes, winning with different players at the helm. Through it all, they’ve played with the easy, understated confidence of a favorite. More often than not, a favorite is what they’ve been. \nThe Gamecocks head to Tampa later this week to play the winner of Monday night’s No. 1 Texas-No. 2 TCU meeting, for a trip to the national championship game. To get to this familiar place, they’ve had to spend some time in unfamiliar places. They’ve trailed with a couple minutes to play; they’ve traded big fourth-quarter buckets; they’ve made game-saving stops and clutched up late at the free-throw line. Last season's title-winning South Carolina team came in waves, slowly but surely overwhelming opponents until the game was out of reach. Suspense expired at halftime. But with close wins over Duke in the Elite Eight on Sunday and Maryland in the Sweet 16 before that, the Gamecocks have shown they can also thrive on the ropes.",
          "link": "https://defector.com/dawn-staley-gamecocks-are-escape-artists",
          "publishedOn": "2025-03-31T20:24:10.000Z",
          "wordCount": 6916,
          "title": "Dawn Staley’s Gamecocks Are Escape Artists",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2207680655.jpg"
        },
        {
          "id": "https://defector.com/?p=185531",
          "author": "David Roth",
          "description": "When Willson Contreras showed up for his first spring training as a full-time first baseman, he knew the learning curve would be steep. A year after he'd made over his catching mechanics entirely, a massive effort that earned some vinegary grousing from his co-workers and led to him getting his forearm broken on a catcher's interference, Contreras arrived at camp ready to start all over again. He was notably bulked up, and spent hours throughout the first weeks of camp having Cardinals infield coach Stubby Clapp fire grounders at him out of a machine called The Red Rocket; Contreras's brother William, a star catcher on the Brewers, \"told me when I told him I was switching positions...that I couldn’t be mean anymore and that I had to start saying ‘Hi’ to people.\"\nMost of what Contreras was looking forward to about the move, though, came down to the fact that his new job would be less all-consuming than his previous one, which required him to go over scouting reports and work with his team's pitchers. “I have plenty of time to do everything now,” Contreras told MLB.com's John Denton in February. \"One of the biggest keys to being a good hitter is having time to reflect on an at-bat or watch video to make adjustments. Now I can talk about hitting, and it feels relaxing to have time to talk to other hitters and ask them questions.\"",
          "link": "https://defector.com/willson-contreras-on-eating-grip-tape-it-was-disgusting-it-was-a-bad-taste",
          "publishedOn": "2025-03-31T20:11:47.000Z",
          "wordCount": 6838,
          "title": "Willson Contreras On Eating Grip Tape: “It Was Disgusting. It Was A Bad Taste.”",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/Screenshot-2025-03-31-at-4.02.50 PM.png"
        },
        {
          "id": "https://defector.com/?p=185566",
          "author": "Lauren Theisen",
          "description": "In the bottom of the fifth of Sunday's Braves-Padres contest, Atlanta pitcher José Suarez and his catcher Chadwick Tromp combined for a sneaky strikeout of San Diego shortstop Xander Bogaerts. After falling to a 3-1 count on a very low changeup, Suarez earned a called strike with a fastball that just barely caught the bottom of the zone. As his follow-up, he threw nearly the exact same pitch, just a tad lower. Bogaerts, again, didn't swing, and fans crediting the virtual strike zone on TV would've seen that he made the correct choice to take the walk. But Tromp's frame job, and Suarez's ability to hit his spot, fooled the umpire into calling for a strikeout that ESPN's machines informed us should never have happened.",
          "link": "https://defector.com/life-isnt-fair-why-should-the-strike-zone-be",
          "publishedOn": "2025-03-31T18:21:40.000Z",
          "wordCount": 6407,
          "title": "Life Isn’t Fair. Why Should The Strike Zone Be?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2173721064.jpg"
        },
        {
          "id": "https://defector.com/?p=185539",
          "author": "Kathryn Xu",
          "description": "If the Yankees hadn't hit a record-matching 15 home runs in three games to start their season, the discourse around their torpedo-shaped bats would look very different. As it stands, the bats have spurred accusations of cheating and stories that contain the dreaded figure of a former MIT physicist, who is nicknamed Lenny and is \"the man.\" (Aaron \"Lenny\" Leanhardt, credited as one of the original evangelists of the bat, left the Yankees in the offseason and is now a coach with the Miami Marlins.)\nTo get it out of the way, the bats are entirely legal. If MLB's confirmation of such wasn't enough, official rule 3.02 states that a bat \"shall be a smooth, round stick not more than 2.61 inches in diameter at the thickest part and not more than 42 inches in length\" and \"shall be one piece of solid wood.\" What is different about the torpedo bat is not necessarily its barrel diameter, but how the wood on the barrel is distributed: Rather than the even taper that most bats have on the barrel, the torpedo bat moves weight from the top of the bat, where hitters do not want to make contact, to the sweet spot of the bat, which players gesture to as the best place to hit a baseball.",
          "link": "https://defector.com/what-is-the-deal-with-the-yankees-weird-bats",
          "publishedOn": "2025-03-31T18:02:48.000Z",
          "wordCount": 7479,
          "title": "What Is The Deal With The Yankees’ Weird Bats?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/torpedo-bat.jpeg"
        },
        {
          "id": "https://defector.com/?p=185553",
          "author": "Chris Thompson",
          "description": "Rafael Devers is having a time. In Sunday's loss to the Texas Rangers, Devers struck out twice and walked once in five plate appearances. First, the good news: The free pass raised his on-base percentage on the season. The bad news: His on-base percentage on the season is .111. The worse news: Through four games, Devers has not yet collected a hit. The heart-breakingly awful news: Devers has struck out in two-thirds of his 18 plate appearances on the season, making him the first major-league hitter in history to strike out 12 times in his team's first four games.\nIt's as bad as it sounds. Prior to this putrid, horrendous start, only five players since 1901 had even struck out 11 times through their teams' first four games, per the Boston Globe. Rob Bradford of WEEI culled some genuinely appalling metrics from Baseball Savant Monday morning, highlighting the depth of Devers's struggles. The veteran has whiffed on a gut-churning 67.4 percent of his swings so far. No, he is not being particularly selective: Already, through four games, Devers has swung and missed at 31 pitches, 13 more than the next closest player in all of baseball, and that player (Teoscar Hernandez) has played an entire additional series. An unbearable 75 percent of the times that Devers has swung at a fastball, he has failed to make contact. I'm looking at Devers's Statcast page right now and openly weeping: Pitchers have thrown him 48 pitches in the strike zone, and he has swung at 36 of these pitches, and those swings have resulted in three (3) batted balls. Someone needs to drape an arm over this man's shoulder and just let him sob for a while. Be a friend!",
          "link": "https://defector.com/spare-a-thought-for-baseballs-poor-flailing-bozos",
          "publishedOn": "2025-03-31T17:25:59.000Z",
          "wordCount": 7467,
          "title": "Spare A Thought For Baseball’s Poor Flailing Bozos",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2207201000.jpg"
        },
        {
          "id": "https://defector.com/?p=185541",
          "author": "Dan McQuade",
          "description": "Michigan State was going to lose, but 6-foot-5 Coen Carr was still hustling. He rushed through the lane, passing three Auburn players to fight for a rebound. Auburn’s Miles Kelly slapped the ball out of his hands, and the two ended up on the ground fighting for it. Eventually, Kelly and MSU’s Jase Richardson had dual possession. The referees signaled for a jump ball.\nBecause this was college basketball, that did not lead to an actual jump ball. Auburn got the ball because the possession arrow was in their favor, something the Tigers had because they won the opening tip. The possession arrow wasn’t needed in the first half, and so Michigan State inbounded the ball to begin the second. Auburn then had the possession arrow in its favor for the entire second half. Nearly 20 minutes later, that meant they got the ball after that late tie-up.",
          "link": "https://defector.com/eliminate-the-possession-arrow",
          "publishedOn": "2025-03-31T17:13:42.000Z",
          "wordCount": 7635,
          "title": "Eliminate The Possession Arrow",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/jump-ball-2001-coaches-vs-cancer.jpg"
        },
        {
          "id": "https://defector.com/?p=185545",
          "author": "Luis Paez-Pumar",
          "description": "There's not much to be excited about when it comes to the 2025 Miami Marlins. I wrote about this in the Defector season preview, but these Fish stink. Sure, they have Sandy Alcantara back, and there are some prospects worth keeping an eye on, but a dour season appears to be on the books, along with yet another last-place finish in the brutal NL East. And yet, at the end of the first weekend of baseball's new season, it is the Marlins, mighty and effervescent, sitting at the top of the division standings. They're 3-1, an extremely temporary juggernaut of clutch hitting and historic walk-off wins.\n\nhttps://www.youtube.com/watch?v=2YQK-UDIuYM",
          "link": "https://defector.com/the-marlins-walk-it-off-again-and-again-and-again",
          "publishedOn": "2025-03-31T16:22:29.000Z",
          "wordCount": 7423,
          "title": "The Marlins Walk It Off, Again And Again And Again",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2207252133.jpg"
        },
        {
          "id": "https://defector.com/?p=185442",
          "author": "Vivian Blaxell",
          "description": "In Vivian Blaxell’s Worthy Of The Event, out Tuesday, a trans essayist with a checkered past takes on the big questions of human existence. The book includes philosophical investigations of the nature of transcendence and beauty, historical disquisitions on violence and domination, and searching appraisals of the events of her own life. This excerpt considers an episode from the early days of Blaxell's own transition in 1970s Australia.",
          "link": "https://defector.com/get-the-fuck-off-this-corner-its-mine",
          "publishedOn": "2025-03-31T16:05:00.000Z",
          "wordCount": 8793,
          "title": "“Get The Fuck Off This Corner. It’s Mine.”",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GET-THE-FUCK-OFF-THIS-CORNER.jpg"
        },
        {
          "id": "https://defector.com/?p=185516",
          "author": "Maitreyi Anantharaman",
          "description": "It's time to wrap up the month with a challenging themeless. Keep an eye out for tricky clues and fun wordplay. This week's puzzle was constructed by Rachel Fabi and edited by Hoang-Kim Vu. Rachel (she/her) is a crossword constructor and a professor of bioethics. She is the founder and co-editor of the crossword puzzle fundraiser \"These Puzzles Fund Abortion,\" which raises money for five abortion funds across the country, so if you like crossword puzzles with a progressive bent and helping people afford necessary healthcare, you can donate here through the end of May to receive the puzzle pack!\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE. Note that we're pausing open submissions until April 18.",
          "link": "https://defector.com/the-crossword-march-31-rules-lawyer-themeless",
          "publishedOn": "2025-03-31T14:59:49.000Z",
          "wordCount": 5251,
          "title": "The Crossword, March 31: Rules Lawyer (Themeless)",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2199670592.jpg"
        },
        {
          "id": "https://defector.com/?p=185408",
          "author": "Veronica de Souza",
          "description": "You’ve seen those picture-perfect spaces on Instagram and in design magazines—beautiful but often too styled to feel real. Don’t get me wrong, I love seeing a rich person’s house, but it can be hard to feel like they have any bearing on your own life. How can a multi-million dollar renovation inspire you to make changes in your space? How can you make your apartment beautiful while still having money left over to pay the rent?\nThat’s where I come in! I’m a design enthusiast … but also a (mostly) normal person with a normal budget. Consider this column a source for approachable interior advice. Whether you’re looking for a specific piece of furniture, struggling with a room layout that feels “off,” or just need a fresh perspective, I’m here to help. I already have a shopping addiction, so let me put it to good use—for you!",
          "link": "https://defector.com/introducing-make-it-nice",
          "publishedOn": "2025-03-31T14:52:26.000Z",
          "wordCount": 6617,
          "title": "Introducing: Make It Nice",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/make-it-nice-2.jpg"
        },
        {
          "id": "https://defector.com/?p=185513",
          "author": "Dan McQuade",
          "description": "Cooper Flagg got the ball at his own free-throw line with 4.6 seconds left. He looked up at the clock and sped down the court. Arizona was out of sorts in transition defense, and Flagg stopped behind the three-point line with a ton of space around him. He beat the buzzer easily. He’d hit a three on the previous possession, too. “We talk about inflection points,” said Kon Knueppel, who had 20 points in Duke’s 100-93 win over Arizona in the Sweet 16 last Thursday, “and the end of the half is a really big inflection point. So it was tie ballgame, and hit two threes gives us a bunch of momentum coming into the second half.” Flagg finished with 30 points, 6 rebounds, and 7 assists.\nFlagg didn’t do as much in the Elite 8 win over Alabama on Saturday, but he also didn’t have to. Alabama-Duke had the look of a classic beforehand, and then the Blue Devils jumped out to a 15-5 lead five minutes in and were never really challenged in a 85-65 win. They put it away with a 13-0 stretch over five minutes late in the game. Flagg opened that run with an impressive one-hander after backing down AP All-American Mark Sears. He beat Sears again a few minutes later with a layup he basically shot sideways.",
          "link": "https://defector.com/oh-no-they-made-a-likable-duke-basketball-team",
          "publishedOn": "2025-03-31T14:14:37.000Z",
          "wordCount": 10454,
          "title": "Oh, No! They Made A Likable Duke Basketball Team",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/duke-celebration-final-four-2025.jpg"
        },
        {
          "id": "https://defector.com/?p=185507",
          "author": "Ray Ratto",
          "description": "Becoming A Contender is difficult business, filled with missteps, false starts, cul-de-sacs and distractions, and it is never more difficult than when a team that has been on power suck for most of the last decade and a half suddenly finds itself in other people's late-season business.\nHence, the Detroit Pistons in this, the beginning of their latest renaissance, having to relearn everything here at the hinder end of the regular season. Since their last trip to the Eastern Conference Final in 2008, they have had the worst record in the NBA, their worst record in team history, the longest losing streak in league history, lost their last 12 playoff games, and in general been easy to dismiss—hence their persistent dismissal.",
          "link": "https://defector.com/the-season-is-too-long-and-everybody-is-cranky",
          "publishedOn": "2025-03-31T03:29:46.000Z",
          "wordCount": 6922,
          "title": "The Season Is Too Long, And Everybody Is Cranky",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2207705604-e1743391127520.jpeg"
        },
        {
          "id": "https://defector.com/?p=185500",
          "author": "Ray Ratto",
          "description": "UCLA chose an odd way to muscle itself into its first women's Final Four—by seeing its muscle get into early foul trouble and having her sit out the entire second quarter. This would surely be LSU's moment as the very live and historically imposing three-seed in a tournament full of chalk.\nInstead, the Bruins somehow managed to be better without center Lauren Betts than they were with her, as counterintuitive as that seems, building themselves a workable lead that they could then safely defend through the second half, when Betts returned to re-establish her place in the game's highlight reel. In all, it was a structurally odd way for the Bruins to finally break through the bracket ceiling, but the final score of 72-65 was an accurate portrayal of the difference between the two teams.",
          "link": "https://defector.com/ucla-finally-finds-its-place",
          "publishedOn": "2025-03-30T23:54:40.000Z",
          "wordCount": 6666,
          "title": "UCLA Finally Finds Its Place",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2207700202-e1743377901598.jpg"
        },
        {
          "id": "https://defector.com/?p=185469",
          "author": "Diana Moskovitz",
          "description": "Perhaps it was not a coincidence that on Friday night Alysa Liu wore gold. That's when the 19-year-old took to the ice in Boston for this year's figure skating world championships and made it all look so easy, like she never left figure skating (which she did), as if her victory had been assured all season (it was not). Skating to Donna Summer's \"MacArthur Park,\" Liu didn't just land her jumps, she seemed to float. Her entire performance exuded ease and joy, without a stumble or slip to be found. When Liu neared the end of her routine with a gorgeous layback slide across the ice, the crowd roared. You know it's a powerful performance when former Olympians Tara Lipinski and Johnny Weir stop talking and just let the skating speak for itself. At one point, broadcaster Terry Gannon asked Lipinski if she believed what she was seeing. The Olympic gold medalist replied, \"I am not!\"\nEven Liu herself was surprised, telling her coaches as she walked off the ice into a giant group hug, \"What the hell?!?\"",
          "link": "https://defector.com/alysa-lius-world-title-is-more-than-just-a-comeback",
          "publishedOn": "2025-03-30T21:13:55.000Z",
          "wordCount": 7050,
          "title": "Alysa Liu’s World Title Is More Than Just A Comeback",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2207425649-e1743350776524.jpg"
        },
        {
          "id": "https://defector.com/?p=185479",
          "author": "Ray Ratto",
          "description": "The AFC South has always been kind of a meh-stival—four under-noticed teams (just one media market inside the top 25) all doing relatively dull things (having the worst cumulative record since the division became an actual thing) and only very occasionally getting our attention for anything other than draft position. Thus it is with admiration as well as curiosity that we gaze upon the escalating uniform war between the Houston Texans and Tennessee Titans over the use of what the rest of us would just call light blue.\nOr as the Titans call it, Titans blue. Or as the Texans call it, H-Town blue. Or as the rest of us call it, \"The Nothing Else To Do Battle Royal.\"",
          "link": "https://defector.com/you-cant-say-baby-blue-without-baby",
          "publishedOn": "2025-03-30T19:33:22.000Z",
          "wordCount": 7344,
          "title": "You Can’t Say Baby Blue Without ‘Baby’",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-1863295367-e1743360980117.jpg"
        },
        {
          "id": "https://defector.com/?p=185459",
          "author": "Ray Ratto",
          "description": "Jake Bauers looked history right in the eye and spat dead on its cornea. But that's what great non-pitcher pitchers do. And when they do it on a late-model recreation of the biggest stage of all, it is all the more, well, more.\nBauers, the Milwaukee Brewers' backup first baseman, was looking Saturday morning at a relatively relaxing afternoon in Yankee Stadium. He wasn't in the starting lineup and, if things went well, he wouldn't be needed. Instead, it went galactically not. The Yankees started the game with three consecutive first-pitch homers off Nestor Cortes, a major league record for instantaneous pitcher abuse, and even then it seemed fair to assume that Bauers wouldn't be needed for defensive or pinch-hitting reasons in a close game. But by the third inning, when 3-0 became 13-3, Bauers' availability became inevitability. As the Brewers' designated lost-cause pitcher, he has the responsibility of saving relievers' arms when a game is declared beyond redemption, and the Yankees had delivered the necessary conditions in near-record time.",
          "link": "https://defector.com/aaron-judge-destroys-pitchers-so-dont-be-a-pitcher-and-youll-be-fine",
          "publishedOn": "2025-03-30T15:53:38.000Z",
          "wordCount": 7477,
          "title": "Aaron Judge Destroys Pitchers, So Don’t Be A Pitcher And You’ll Be Fine",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2207244782-e1743349091392.jpg"
        },
        {
          "id": "https://defector.com/?p=183724",
          "author": "David Roth",
          "description": "The summer after I got married, one of my bosses bit me on the arm. I had a lot of jobs that summer, and a lot of bosses; at the time, I was recreating the sort of interchangeable, poorly paid jobs I'd had throughout my twenties in exhausting freelanced aggregate. The boss that bit me was the co-owner of a real estate agency that paid me more or less minimum wage to jam search keywords into apartment rental listings, write bios for their agents and copy for their website, and oversee whatever other writing or editorial work needed doing. There was a lot of that; unpaid college interns and international employees churned through the office nonstop, and their combined labor and movement kept the agency's burgeoning online presence stocked with fresh spam. Agents came and went as agents do, as did various ostensible eminences—I remember one, after being told by my boss that I had written for The Wall Street Journal, excitedly launching into a speech about \"a disease called PC-itis\" like a child actor at an audition—and prayer group buddies and transient subletters and an intense Georgian named George, whom I liked and sometimes brought me strange Georgian desserts. It sucked.\nWhen my boss bit me, I had just questioned his wish to include an easily disprovable lie in his bio, which I was writing on his computer, at his desk. I was shocked by the bite, but less surprised by the look on his face afterwards—he was flushed and eager, like a child that has just discovered how to be naughty, his eyes shining and a little wet. As with the cohort that generally does that sort of thing, which is weird little kids acting out in daycare settings, there was a question implied in that look—what would be the consequence for doing a thing that you are absolutely not supposed to do? In retrospect, I wonder if he was waiting to see if I'd hit him.",
          "link": "https://defector.com/kingdom-of-the-biters",
          "publishedOn": "2025-03-28T20:31:56.000Z",
          "wordCount": 12017,
          "title": "Kingdom Of The Biters",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2204569411.jpg"
        },
        {
          "id": "https://defector.com/?p=185438",
          "author": "Nicholas Russell",
          "description": "I was overly aware of my response the night I saw Moby-Dick at the Met. I don’t know the first thing about opera and, more worryingly, I’ve become known to friends as a person who won’t stop talking about the novel. Some of those people came with me that Saturday night, but no one really knew what to expect. \nMoby-Dick, originally adapted for opera in 2010 by composer Jake Heggie, is an American creation that was neither deemed consequential or groundbreaking upon its publication. Demonstrating the lives of many artists before and since, Herman Melville died in relative obscurity and with limited financial resources. The Moby-Dick opera premiered at the Dallas Opera nearly 200 years after the novel’s publication and has since toured around the country, from L.A. to D.C. The libretto is in English and its references, like the novel, pertain to the seafaring culture of northeastern America.",
          "link": "https://defector.com/moby-dick-is-still-too-big-for-the-opera",
          "publishedOn": "2025-03-28T18:24:03.000Z",
          "wordCount": 9436,
          "title": "‘Moby-Dick’ Is Still Too Big For The Opera",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-104502371.jpg"
        },
        {
          "id": "https://defector.com/?p=185420",
          "author": "Patrick Redford",
          "description": "Less than a month before the NBA playoffs begin, the Memphis Grizzlies announced today that they have fired head coach Taylor Jenkins. This is fairly shocking news, for the timing and also because Jenkins was seen as rather entrenched in Memphis. He'd been there since the 2019–20 season, making him the fifth-longest tenured coach in the NBA. Jenkins was weeks away from coaching his fourth playoffs with the Grizzlies.\n\"I'm genuinely appreciative of Taylor's contributions to this team and this city over the past six seasons,\" general manager Zach Kleiman said in a statement. \"This was a difficult decision given the consistent and tangible development of our players and overall success under Taylor's leadership. I wish Taylor the very best going forward.\" Kleiman and Jenkins were hired during the same offseason, so this is not a case of a GM dumping a coach inherited from a previous regime, but there were signs of unrest last summer. Kleiman oversaw a dramatic revamping of Jenkins's staff, cleaning out the entire bench save for Patrick St. Andrews and Anthony Carter, each of whom had been hired just the previous offseason. In came six new coaches, including, most importantly, Finnish coach Tuomas Iisalo.",
          "link": "https://defector.com/out-of-nowhere-memphis-grizzlies-fire-coach-taylor-jenkins",
          "publishedOn": "2025-03-28T17:41:33.000Z",
          "wordCount": 6371,
          "title": "Out Of Nowhere, Memphis Grizzlies Fire Coach Taylor Jenkins",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2206243797.jpg"
        },
        {
          "id": "https://defector.com/?p=185424",
          "author": "Carly Stern",
          "description": "On a Friday morning in December, I found myself sitting on a bench outside a federal courtroom in Brooklyn. I was attending the sentencing of Carlos Watson, my former employer at Ozy Media from 2018 to 2020, because a curiosity had gnawed at me: Would he express remorse? What would he have to say for himself? \nWatson had been found guilty of conspiracy to commit wire fraud, conspiracy to commit securities fraud, and aggravated identity theft by a federal jury in July. Now was time for his sentencing. I had experienced how disorienting it was to work for someone who routinely bent reality to match his will and beliefs. I was curious how it might feel watching Watson finally be forced to adhere to a judge’s reality and a jury’s findings—and potentially confront the consequences.",
          "link": "https://defector.com/looking-for-closure-at-carlos-watsons-sentencing-hearing",
          "publishedOn": "2025-03-28T17:04:41.000Z",
          "wordCount": 9819,
          "title": "Looking For Closure At Carlos Watson’s Sentencing Hearing",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2190298954.jpg"
        },
        {
          "id": "https://defector.com/?p=185078",
          "author": "Luis Paez-Pumar",
          "description": "Welcome to The Backlog, a series in which we will take a look back at 12 games from 2020 that, in one way or another, had a lasting impact on the video game industry. \nIn the first two installments of The Backlog, I looked at games that released in January of 2020. Part of this is because February was a bit of a dead month, and part of it is because I wanted to set the stage. The world was mostly normal that month, though there were already warning signs about the coronavirus. A botched remake of a classic game and a sequel to a long-running franchise ... those were the games that could make waves in a slow period for games. Now, though, we come to March of 2020, where things went off the rails very quickly.",
          "link": "https://defector.com/animal-crossing-new-horizons-arrived-at-just-the-right-time",
          "publishedOn": "2025-03-28T16:08:19.000Z",
          "wordCount": 10750,
          "title": "‘Animal Crossing: New Horizons’ Arrived At Just The Right Time",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/sc836s.png"
        },
        {
          "id": "https://defector.com/?p=185382",
          "author": "Chris Thompson",
          "description": "The Chicago Bulls—I know! Listen, I know. It is March 28. Baseball has returned. Redbuds and daffodils are blossoming. Goldfinches are going yellow. There are better things to talk about, and even if there weren't, there would be more serious things to talk about than this goofy-ass basketball team, which has been mired in miserable grinding sub-mediocrity for, Christ, a decade! Nevertheless, here we are. As I was saying: The Chicago Bulls—and really we are never going to get to the end of this if you can't dispense with the whole groaning eye-roll thing, so please—are on one. It cannot be denied. These chaotic rebuilding bozos are currently shredding just about everything in their path. They've now won four in a row, and nine of their last 11. These are not horseshit wins: Over this run they have beaten seven teams that are currently in playoff position. Thursday night they beat the Lakers for the second time in five days; in between they exhausted and befuddled and totally worked over the Denver Nuggets.\nThat first win over the Lakers was an eye-popping beatdown, a 31-point destruction in Los Angeles against a would-be title contender very much motivated to reverse a recent swoon. The Bulls were out of their minds: Josh Giddey had 17 assists and eight steals; rookie Matas Buzelis put up a career-best 31 points; Coby White scored 36 on just 17 shot attempts. The Lakers were made to look dumpy and slow, and came to Chicago Thursday hoping for a better showing. Instead they spent most of the early stages of the game once again being made to look like old tired uncles, falling behind early and trailing the floppy-haired Bulls by as many as 13 points, and only scrapping back to within a possession in the final minutes before halftime. The game turned in the second half, and the Lakers built up a 19-point lead early in the fourth quarter. This was a win in-hand for a fairly desperate veteran team.",
          "link": "https://defector.com/how-about-these-absurd-chicago-bulls",
          "publishedOn": "2025-03-28T15:05:33.000Z",
          "wordCount": 8713,
          "title": "How About These Absurd Chicago Bulls?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2206597753.jpg"
        },
        {
          "id": "https://defector.com/?p=185309",
          "author": "Israel Daramola",
          "description": "Whatever you want to call the current age of television, it is far from golden and far from the prestige era of the late aughts. Instead we have entered into some sort of silver age, where television has all the qualitative earmarks of the prestige era—fancy, though digitally glossy, cinematography, showy directing, big stars, elaborate stage production—but with the kind of story churn and writing that more resembles the kind of television I grew up on.\nI'd compare present-day TV to the cable dramas of the late 2000s. Shows like the 911 series, Defector favorite Reacher, The Pitt, or the Taylor Sheridan and Tyler Perry television universes hearken back to familiar TV tropes of the 2000s, but with bigger names and often more elaborate filmmaking. I find this mostly refreshing. At the peak of the prestige era, it felt like television had forgotten something fundamental about its medium that separates it from movies—you spend more time with these characters and therefore they become members of your family, and you want to care about their stories and not just try and solve some overarching mystery the entire time. For every True Detective or Twin Peaks: The Return, there were a lot more Westworlds and Black Mirrors, shows that tend to fall apart when you're no longer invested in solving their puzzles. TV should still be a little boilerplate, and should be more about characters than the story.",
          "link": "https://defector.com/seth-rogens-the-studio-is-the-latest-example-of-tvs-silver-age",
          "publishedOn": "2025-03-28T14:53:43.000Z",
          "wordCount": 7172,
          "title": "Seth Rogen’s ‘The Studio’ Is The Latest Example Of TV’s Silver Age",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/download-3.jpeg"
        },
        {
          "id": "https://defector.com/?p=185368",
          "author": "Drew Magary",
          "description": "[Eats a weed gummy]\n[30 minutes later]",
          "link": "https://defector.com/hear-me-out-the-vikings-are-using-aaron-rodgers",
          "publishedOn": "2025-03-28T14:13:54.000Z",
          "wordCount": 7177,
          "title": "Hear Me Out: The Vikings Are USING Aaron Rodgers",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-1238572426.jpg"
        },
        {
          "id": "https://defector.com/?p=185363",
          "author": "Dave McKenna",
          "description": "In a game from the gods, Texas Tech played its way into a not-so-sweet 16-point second-half deficit against Arkansas, then played its way out. And then some. The gutsy and fun Red Raiders used a late bank shot from Darrion Williams and some great last-second defense to beat John Calipari’s Razorbacks, 85-83, in the first overtime game of this year’s NCAA Tournament. Tech now advances to Saturday’s West Region final. \nTech, the No. 3 seed in the region, fell behind early by way of an offense built around missed layups and missed three-pointers. Lots of Red Raiders had off nights. Star guard Chance McMillian, who hasn’t played since suffering what he said was an oblique strain in the early rounds of the Big 12 tournament, didn’t even dress for the Arkansas game. Senior guard Elijah Hawkins played all 45 minutes for Tech, but went 0-9 from the field in regulation, including 0-6 from three. Kerwin Walton, who had eight threes while putting up a team- and career-high 27 points a week ago in Tech’s tournament-opening win over North Carolina-Wilmington, was benched early against Arkansas and finished with zero points.",
          "link": "https://defector.com/texas-tech-made-it-feel-like-destiny",
          "publishedOn": "2025-03-28T13:10:09.000Z",
          "wordCount": 8504,
          "title": "Texas Tech Made It Feel Like Destiny",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2207284819.jpg"
        },
        {
          "id": "https://defector.com/?p=185317",
          "author": "Billy Haisley",
          "description": "You can never be all that surprised when a team reverts to type. Yes, Real Madrid was fresh on the heels of the best week in its short history, having sealed two huge, potentially fate-altering wins. Nevertheless, this is still Real Madrid—talented but bumbling, ineptly managed, devoid of ambition, and disappointing as a rule. If the shock Clásico victory over the weekend, and the preceding 2-0 home win in the first leg of the Champions League quarterfinal tie against Arsenal, made for Real's Cinderella moment, then the opening whistle of Wednesday's followup match in London marked the arrival of midnight. Alessia Russo and her teammates were ready with the sledgehammers.\n\nhttps://www.youtube.com/watch?v=P9xuGOEiAPE",
          "link": "https://defector.com/alessia-russo-smashed-the-real-madrid-pumpkin",
          "publishedOn": "2025-03-27T20:33:05.000Z",
          "wordCount": 8023,
          "title": "Alessia Russo Smashed The Real Madrid Pumpkin",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2207070950.jpg"
        },
        {
          "id": "https://defector.com/?p=185215",
          "author": "David Roth",
          "description": "If you know only one thing about Drew Magary, it is that he went on the Food Network show Chopped and won. If you know just two things, that additional knowledge probably involves one of his many acclaimed books or his long and successful writing career. But if you know a third thing about Drew it is that Bob Mould is his favorite musician. It's a good choice, and in my opinion one that tells you something about a person. Mould is a one-of-one, a trailblazer and a punk rock legend who has continued to make ambitious, socially conscious, and extremely loud music over the course of five decades in a business with a short memory and narrow margins. I like his music a lot, too, but the person I just described is someone that I would, just given my own deep-seated sense of suburban uncoolness, be inclined to admire from afar. Drew, who is different, has not just set out to Meet His Hero but to have him on the podcast. And so, for a second time, we welcomed back one of the coolest and most admirable Americans of his era onto the podcast where we otherwise say \"pee pee\" and \"poo poo\" back and forth to each other.",
          "link": "https://defector.com/catching-the-rain-with-bob-mould",
          "publishedOn": "2025-03-27T19:56:47.000Z",
          "wordCount": 7122,
          "title": "Catching The Rain, With Bob Mould",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-1174941674.jpg"
        },
        {
          "id": "https://defector.com/?p=185343",
          "author": "Defector Staff",
          "description": "The damn bats are about to start cracking any second, closely followed by the gloves popping. Now is the time to settle in and ask the Defector staff whatever baseball-related questions you have. Let's get to it.",
          "link": "https://defector.com/take-me-out-to-the-staff-chat",
          "publishedOn": "2025-03-27T18:59:14.000Z",
          "wordCount": 4470,
          "title": "Take Me Out To The Staff Chat",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-640479327.jpg"
        },
        {
          "id": "https://defector.com/?p=185305",
          "author": "Patrick Redford",
          "description": "LeBron James went on ESPN Sunburn Lord Pat McAfee's show on Wednesday; while there, he said some mostly anodyne stuff about Michael Jordan and talked a little about his sons Bronny and Bryce. The parts of the interview that achieved escape velocity, though, were comments James made about two other ESPN personalities: Stephen A. Smith and Brian Windhorst.\nSmith and James have been feuding for a couple months now, with Smith identifying that the concerned uncle angle is the most likely to provoke a reaction and being proven broadly correct, as James confronted him on the court after beating the Knicks on Mar. 6. \"If it’s one person that couldn’t wait until the video had dropped so you could address it, it's your ass. Like, seriously,\" James said, to McAfee, of his courtside confrontation. He allowed that criticism was fine up to a point, \"But when you take it and you get personal with it, it’s my job to not only protect my damn household but protect the players.\"",
          "link": "https://defector.com/espn-lebron-james-on-espn-to-espn-espn",
          "publishedOn": "2025-03-27T18:14:42.000Z",
          "wordCount": 7659,
          "title": "ESPN: LeBron James, On ESPN, To ESPN: “ESPN.”",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/Screenshot-2025-03-27-at-9.32.53 AM-e1743099660276.jpg"
        },
        {
          "id": "https://defector.com/?p=185289",
          "author": "Lauren Theisen",
          "description": "It's not always easy to determine if and when a team has quit on their coach. Observers of the Philadelphia Flyers have no such uncertainty. After allowing six unanswered goals in Toronto on Tuesday, Philly's 7-2 defeat was their 11th in the past 12, and only a couple of those losses featured anything positive to build on. This is rock bottom.\n\nhttps://youtu.be/kKMnmRjnZos?si=sWvoxuYpbUi5rMtW&t=322",
          "link": "https://defector.com/john-tortorella-wore-out-his-welcome",
          "publishedOn": "2025-03-27T17:33:15.000Z",
          "wordCount": 6503,
          "title": "John Tortorella Wore Out His Welcome",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2122798694.jpg"
        },
        {
          "id": "https://defector.com/?p=185175",
          "author": "Sabrina Imbler",
          "description": "When Veronica Correa started college at the University of North Carolina at Chapel Hill, she knew she wanted to pursue some kind of science, but traditional paths—such as medicine or research—didn't feel right to her. She sampled different classes, at one point signing up for a class about water management and human rights to fulfill a philosophy requirement. This class helped Correa realize she wanted to enter the environmental field, which combined many disciplines.\nCorrea's interest in science was both personal and familial. Her parents are originally from Venezuela, where her grandmother worked as a biologist studying tropical disease and teaching at a university. \"I always thought it was really admirable what she was doing, especially starting her career in the '60s and '70s in a time in culture when there weren't a lot of women pursuing her particular field,\" Correa said.",
          "link": "https://defector.com/an-interview-with-a-fired-epa-public-affairs-specialist",
          "publishedOn": "2025-03-27T15:29:07.000Z",
          "wordCount": 13973,
          "title": "An Interview With A Fired EPA Public Affairs Specialist",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/IMG_2272-e1743086575190.jpg"
        },
        {
          "id": "https://defector.com/?p=185288",
          "author": "Tom Ley",
          "description": "On Tuesday night, a Tufts University graduate student named Rumeysa Ozturk was detained by agents from the Department Of Homeland Security while walking down the sidewalk outside an off-campus apartment building. Ozturk, a Turkish citizen, is attending Tufts on a student visa.\nOzturk, who according to records from Immigration and Customs Enforcement is now being held in a detention facility in Louisiana, is now threatened with deportation despite not having been charged with any crime. When asked to explain why Ozturk was arrested and renditioned to another state, the DHS circulated the following statement:",
          "link": "https://defector.com/it-is-what-it-looks-like",
          "publishedOn": "2025-03-27T15:00:14.000Z",
          "wordCount": 6606,
          "title": "It Is What It Looks Like",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/Screenshot-2025-03-27-at-10.35.23 AM.png"
        },
        {
          "id": "https://defector.com/?p=185209",
          "author": "Chris Thompson",
          "description": "When I baseball in the morning, love\nAnd the baseball hurts my eyes. \nAnd something baseball baseball, love\nBears baseball on my mind\nThen I look at baseball\nAnd the baseball’s alright with me.\nJust one look at baseball\nAnd I know it’s gonna be",
          "link": "https://defector.com/important-blog-tktk",
          "publishedOn": "2025-03-27T14:06:00.000Z",
          "wordCount": 5623,
          "title": "Baseball!",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/Bill-Withers-Dodgers-5-4-6-5.jpg"
        },
        {
          "id": "https://defector.com/?p=185174",
          "author": "Ray Ratto",
          "description": "Well look at that! It's time for baseball. I'm looking at my watch right now and it says \"baseball.\"\nThat means that you, the baseball-enjoyer, are in desperate need of facts and information about baseball. Specifically, you hunger to learn everything there is to know about the teams and players who will be competing for glory in the 2025 MLB season. Hunger no more, my friend. You are about to be fed.",
          "link": "https://defector.com/mlb-season-preview-2025",
          "publishedOn": "2025-03-27T13:45:49.000Z",
          "wordCount": 51415,
          "title": "An MLB Preview Containing All The Information One Could Possibly Hope To Ascertain About The 2025 Season",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-1156521355.jpg"
        },
        {
          "id": "https://defector.com/?p=185238",
          "author": "Tom Scocca",
          "description": "Welcome to Margin of Error, a politics column from Tom Scocca, editor of the Indignity newsletter, examining the apocalyptic politics, coverage, and consequences of Campaign 2024.\nWhere was the harm in the Houthi PC small group scandal? This was, within a certain set of limits, the dispute as the story accelerated into its third day: Yes, a set of high Trump administration officials had, apparently by accident, looped Jeffrey Goldberg, the editor of The Atlantic, into a Signal chat that discussed the planning and carrying out of the United States's Mar. 15 attack on Yemen—but did the security breach really matter?",
          "link": "https://defector.com/the-human-factor",
          "publishedOn": "2025-03-27T13:01:29.000Z",
          "wordCount": 8662,
          "title": "The Human Factor",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/houthis.jpeg"
        },
        {
          "id": "https://defector.com/?p=185181",
          "author": "Ray Ratto",
          "description": "It is Opening Day tomorrow, which means the peak of Fantasy Draft Season is today. We mention this not because we want to know anything about your experience of any of that, or about your fantasy team, or about you, to be clear. \nWe mention it only because we had our annual draft Tuesday, and because our reckless mention of the fact that this is the league’s 54th season led to us being hectored into writing about it by several members of Defector's Baseball Bastardy Brigade (and they know who they are). And that is probably all the detail you need, because Rule The First of fantasy drafts remains in force, and that rule stipulates that you must keep your fantasy team to yourself. Your designated typist has been assured (and when we say \"assured,\" we mean \"threatened\") that there is an exemption for fantasy leagues that predate the first appearance of a high-five on television.",
          "link": "https://defector.com/zero-lessons-from-54-years-of-my-fantasy-baseball-league",
          "publishedOn": "2025-03-26T18:34:59.000Z",
          "wordCount": 8085,
          "title": "Zero Lessons From 54 Years Of My Fantasy Baseball League",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-1346821316.jpg"
        },
        {
          "id": "https://defector.com/?p=185178",
          "author": "Ray Ratto",
          "description": "Starting a new team in an organized sports league is hard, and that's after you round up the money to bribe all the other rich people that you’ll need to join the group. There is also the vital matter of the team nickname, which is how and why we have arrived at the Boston Lega . . . Leg . . . Llllll . . . nope. Can't do it. Don't even want to try. It's not worth taking seriously on any level, with all due respect to the people who delivered it. Those people did their best, twice, which is the troubling part. You only get one chance to get a nickname right, and you can't get it back no matter how many do-overs you ask the audience to allow in search of that one chance.\nThe new NWSL franchise in Boston has unveiled their official do-over after the hilarious yet horrific BOS Nation debacle, and credit where it’s due: they started well enough with their choice of Sharpie Highlighter Green as a team color. Green is an underused and therefore fine idea; the color has been an out-of-fashion athletic choice since organized sport began, on both sides of the gender, geographical, and even oceanic barriers, and even now green is used in barely 10 percent of the college and pro teams in the major sports. The praise sadly must end there.",
          "link": "https://defector.com/from-the-group-that-brought-you-bos-nation-its-an-even-worse-team-name",
          "publishedOn": "2025-03-26T17:09:42.000Z",
          "wordCount": 7714,
          "title": "From The Group That Brought You BOS Nation, It’s An Even Worse Team Name",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/BostonLegacyScreengrab.png"
        },
        {
          "id": "https://defector.com/?p=185151",
          "author": "Drew Magary",
          "description": "I’m gonna tell you a dirty little secret about the Pittsburgh Steelers: they don’t care about winning another Super Bowl. They have a coach who can win nine games a year with just weeds and garbage, a name brand pass rusher whose jersey will keep selling long after he’s retired, and a full stadium every home game. That’s Steelers-y enough for the Rooney family. They don’t need anything more than that to be content. And that’s good, because they just lost their other starting quarterback from 2024.\nWhile the New York Giants are putting the finishing touches on their three-headed Herb-erus of a QB room, the Steelers have opted to go in the opposite direction by doing nothing at all. The only QBs they currently have rostered are a pair of nobodies in Mason Rudolph and Skylar Thompson, and their highest pick in the upcoming draft is 21st. If this were any other organization—even the Titans!—there would be a giant red siren flashing over team headquarters, and the franchise’s scouting department would be urgently canvassing the nation to measure the hand side of every would-be quarterback out there. This is the NFL. You need a quarterback to live. I believe Itchy explicitly told Scratchy this once.",
          "link": "https://defector.com/the-steelers-are-trapped-in-a-hell-of-their-own-neglect",
          "publishedOn": "2025-03-26T15:00:11.000Z",
          "wordCount": 7647,
          "title": "The Steelers Are Trapped In A Hell Of Their Own Neglect",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2192443493.jpg"
        },
        {
          "id": "https://defector.com/?p=185106",
          "author": "Kelsey McKinney",
          "description": "In 2018, I went to Pompeii. I did not particularly want to go to Pompeii, but we were on vacation in Italy, and my partner wanted to go, and so I obliged. We could eat in Naples, I reasoned. Then even if I did not have fun in the hot sun amongst the rocks and ruins of an ancient town, I would still be happy. But I was wrong; I enjoyed it. How do you not fawn over a perfectly preserved mosaic floor laid carefully in the entryway to a opulent home almost two thousand years ago? How can you not need to catch your breath at a still-standing arch that has been excavated from thousands of tons of debris that buried it after a volcano exploded?\nThe only thing I did not like about Pompeii—besides the heat—was that I was denied full access. There was a whole-ass vineyard behind some very high walls that I was not allowed to touch, and worse, whole sections of the city were still roped off because archeologists were still painstakingly uncovering them. I respect science, and understand that they need excavations to abide by certain rules to make sure that everything stays as unbroken as possible. But also I went to the wrong entrance of Pompeii and wandered around without a map, and saw the sections I was not allowed to enter and it pained me. I wanted to go back there! I felt the pull of curiosity. And now I know why: There was a glass brain.",
          "link": "https://defector.com/i-should-have-been-the-one-to-discover-the-glass-brain",
          "publishedOn": "2025-03-26T14:28:22.000Z",
          "wordCount": 7039,
          "title": "I Should Have Been The One To Discover The Glass Brain",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/image_720.png"
        },
        {
          "id": "https://defector.com/?p=184983",
          "author": "Billy Haisley",
          "description": "Soccer in Spain is defined by the rivalry between Real Madrid and Barcelona. It's what stirs Spanish hearts (one study found that some 57 percent of Spaniards support either Real or Barça), captivates the world's imagination (El Clásico is hands down the biggest rivalry match on the planet), and therefore drives the attention, passion, and economics that are the lifeblood of the sport. What Spanish soccer is, it is in large part directly due to Real and Barça.\nAs should be evident by now, the men's and women's sides of the sport are two inextricably linked aspects of the same entity. Much of the history of women's soccer can be told by measuring the gap between the two at any given point in time, success always found in the places where the chasm wasn't quite as wide as elsewhere. The future of the sport is in shrinking that margin further still.",
          "link": "https://defector.com/real-madrid-is-finally-becoming-real-madrid",
          "publishedOn": "2025-03-26T13:46:43.000Z",
          "wordCount": 11366,
          "title": "Real Madrid Is Finally Becoming Real Madrid",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2205992822.jpg"
        },
        {
          "id": "https://defector.com/?p=184989",
          "author": "Alex Sujong Laughlin",
          "description": "William Kim’s TikTok videos should not be popular. They are long, sparsely edited, and lack music or text that might hold viewers’ attention. Most of his videos start with a defiant and absurd statement: “This is my food. My food is me.” His first video, posted on January 30, 2025, has almost six million views. \nI first saw one in early February, not long after the TikTok ban was temporarily reversed in the U.S. My feed tends to be full of fashion theory and celebrity gossip, so the minimal editing of Kim’s video felt distinct and interesting.",
          "link": "https://defector.com/my-food-guy-human-kibble",
          "publishedOn": "2025-03-26T13:15:14.000Z",
          "wordCount": 8562,
          "title": "I Found This Guy’s Recipe For Human Kibble Surprisingly Enjoyable",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/my-food.png"
        },
        {
          "id": "https://defector.com/?p=185027",
          "author": "Patrick Redford",
          "description": "The race reports following each of the past 29 editions of the men's Milan–San Remo, the first monument classic of the cycling season, are more or less identical, save for the proper nouns. The peloton races down from Milan onto the coast of the Ligurian Sea for like six hours and, after being softened up by all that racing through foreboding spring conditions and one ascent of the Cipressa around 20 kilometers from the line, the race is decided by the ascent and descent of the Poggio, a sinuous and otherwise unremarkable climb made totally decisive by all that softening up. Oddly, the race's structural predictability (matched only by La Fleche Wallone) lends itself to an unpredictability of outcome. You never knew who will win, but you know how they will win.\nThat is, until this past weekend's men's race, which not only ended with Mathieu van der Poel repeating his 2023 triumph, but saw a wholly different kind of finish. It was the best Milan–San Remo I've seen in my time watching pro cycling, a testament to the greatness of both van der Poel and Tadej Pogacar, and the possibility of their rivalry.",
          "link": "https://defector.com/mathieu-van-der-poel-and-tadej-pogacar-tear-up-the-script",
          "publishedOn": "2025-03-25T19:27:31.000Z",
          "wordCount": 7993,
          "title": "Mathieu van der Poel And Tadej Pogacar Tear Up The Script",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2206382899.jpg"
        },
        {
          "id": "https://defector.com/?p=185080",
          "author": "Alex Sujong Laughlin",
          "description": "Look, we are nearly finished with this 12-week-long odyssey into unlocking our inner artist and we're all just ready to be done. Surely next week we'll have more eloquent things to say about this three-month journey into the heart of our creative souls. Or, perhaps, we will be so broken and filled with dread that even the promise of being among the proud few to actually complete the The Artist's Way will not fill us with joy. For now we're trying to get through the last few days of morning pages. \nWill this next week mark the beginning of our new lives as enlightened artists? Will one (or many) of us burn the book when we're done? Will the next time you see us be on a Broadway stage? Only time will tell.",
          "link": "https://defector.com/the-artists-way-week-11-we-are-dying-to-be-done",
          "publishedOn": "2025-03-25T18:17:13.000Z",
          "wordCount": 11641,
          "title": "‘The Artist’s Way’ Week 11: We Are Dying To Be Done",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-517423298-e1742926406914.jpg"
        },
        {
          "id": "https://defector.com/?p=185055",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about lazy rivers, track lengths, the importance of music videos in 2025, and more.\nYour letters:",
          "link": "https://defector.com/the-only-spaghetti-eating-lesson-youll-ever-need",
          "publishedOn": "2025-03-25T17:45:05.000Z",
          "wordCount": 16769,
          "title": "The Only Spaghetti Eating Lesson You’ll Ever Need",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-174307156.jpg"
        },
        {
          "id": "https://defector.com/?p=185060",
          "author": "Lauren Theisen",
          "description": "The funny thing about getting invested in the race for the wild card is that, by definition, none of the teams involved are very good. Montreal is improbably clinging to the last playoff spot in the East right now mostly because they're not losing in regulation. The Islanders, with their minus-16 goal differential (better than Montreal's!), are right behind them for similar reasons. The Rangers have lost seven of their last 10. The Blue Jackets just ended a six-game skid by squeaking one out against the Isles. And finally, before we reach the completely unsalvageable wreckage, we have the Detroit Red Wings, currently experiencing the comedown after the coaching-change hot streak that rocketed them back into relevancy around New Year's.\nThe Wings, last among the not-good teams, are really not good. They tricked people into thinking they might be when they ripped off a couple of seven-game win streaks in close proximity, but this is a squad that still hasn't found a goalie solution, has struggled to make smart veteran acquisitions, and is stuck waiting on talent development to usher in a turnaround. Since the end of the international break, they've plummeted down the standings, and entering Monday's first-ever franchise trip to Utah they'd won just four of their last 14. Facing the Hockey Clubs—another group that badly needs to scrounge up some points to sneak into the playoffs—the Wings, honestly, turned in another poor performance. But despite barely getting the puck on net, a couple of silly/frustrating goals delivered them the worst-looking 5-1 victory I've ever seen.",
          "link": "https://defector.com/very-stupid-goals-help-slow-red-wings-spiral",
          "publishedOn": "2025-03-25T16:47:00.000Z",
          "wordCount": 6553,
          "title": "Very Stupid Goals Help Slow Red Wings’ Spiral",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2206273825.jpg"
        },
        {
          "id": "https://defector.com/?p=185061",
          "author": "Nicholas Russell",
          "description": "Over the course of nearly a decade, Gisele Pelicot of Mazan, France, was drugged and raped by her husband and as many as 83 other men he invited to do so. Presented with the option to prosecute the case privately, Gisele instead insisted on a public trial. Sophie Smith writes in an essay for The London Review of Books: “Her hope – and in this she is not alone – is that by publicising the behaviour such a society produces, the trial will be a step towards changing it.” The accomplices of Gisele’s husband, Dominique, variously admitted their guilt or rejected the use of “rape” outright. Several men repeated the line, “I am not a rapist,” with added justifications that Gisele must have known what was happening, that it was all a game, that she actually wanted the encounter to happen. “Liar, slut, loudmouth, killjoy: as is often true of rape trials, the best defense is one able to transform the victim into a contemptible Medusa, to make of the accuser the accused,” writes Jamie Hood, author of the new memoir Trauma Plot, in a recent Bookforum review of Virginie Despentes’s novel Dear Dickhead that begins with Pelicot’s trial. \nIn Trauma Plot, Hood delineates her experience surviving three rapes through a prismatic formal lens. Each chapter of the memoir switches from a first, second, or third-person perspective, charting Hood’s time in grad school in Boston and her subsequent relocation to Brooklyn, while also weaving in threads from her childhood. But time, in Hood’s hands, is anything but linear. Hood destabilizes what might be deemed the tidy story of rape and gendered violence, the narrative that claims narrative is even a suitable form with which to contain trauma. “Everywhere I went, rape followed. Rape was the little phrase repeated through the score of my life.”",
          "link": "https://defector.com/rape-is-political-jamie-hood-on-trauma-narratives-writing-the-self-and-ethical-obligation",
          "publishedOn": "2025-03-25T16:20:51.000Z",
          "wordCount": 16456,
          "title": "“Rape Is Political”: Jamie Hood On Trauma Narratives, Writing The Self, And Ethical Obligation",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/trauma-plot-cover.jpg"
        },
        {
          "id": "https://defector.com/?p=184953",
          "author": "Tom Ley",
          "description": "Thanks to some serendipitous scheduling, Manchester City and Chelsea are three-quarters of the way through a four-game series that started on March 15 with the League Cup final. It will end this Thursday, with the second leg of a Champions League quarterfinal tie. So far, this is a series that's shown us the best of what the WSL has to offer.\nIt takes high-quality players and high stakes to turn a quirk of the schedule into a season-defining series, and this one has loads of both. For Chelsea, the WSL's undisputed hegemon, these games presented an opportunity not only to continue their pursuit of a multi-trophy season, but to put Manchester City back in its place. Chelsea has failed to win the WSL title just once in the last eight seasons, but were pushed to the brink by City last season, which ended with Chelsea claiming their fifth consecutive title, but only on goal difference. For City, these four games brought with them the opportunity to salvage what is a season gone awry. City currently sits fourth in the WSL table, having regressed so far from last season's heights that they are 15 points behind Chelsea at the top of the table and seven points out of the Champions League places. And yet, 12 straight days spent as Chelsea's biggest obstacle to completing the treble left plenty to play for.",
          "link": "https://defector.com/chelsea-and-manchester-city-are-delivering-the-goods",
          "publishedOn": "2025-03-25T15:20:49.000Z",
          "wordCount": 7280,
          "title": "Chelsea And Manchester City Are Delivering The Goods",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2206071504.jpg"
        },
        {
          "id": "https://defector.com/?p=185047",
          "author": "Chris Thompson",
          "description": "The Los Angeles Lakers dropped a game to the Magic Monday night, 118–106, in Orlando. There are worse things. The Magic are experiencing a rare patch of reasonable health, and in an otherwise nearly lost regular season they've managed to hold their heads above water at their home arena. Losing stinks—Nuke LaLoosh would say it's, like, worse than winning—but for the Lakers this is just a loss. Rub some dirt on it, I say.\nFar more troubling was the home loss Saturday night to the Chicago Bulls. This was supposed to be a get-well game, with LeBron James returning to action following a seven-game absence to tend to a groin injury. The Bulls aren't exactly food, having now won 10 of 15 to pull into the East's ninth seed, but that's a second- or third-rate basketball operation over there, on the precipice of another gruesome rebuild, and the Lakers think of themselves as contenders. With James returning, and in the final game of the last significant homestand of the season, and with designs on righting a recently wayward ship, you would expect the Lakers to make a statement against so measly a foe. Instead, the visitors summarily karate-chopped the Lakers' buttcheeks to hamburger, in a drubbing so severe that Bronny James was given almost seven minutes of supervised sandbox time (naturally he missed all four of his shot attempts). The guys who shredded the Lakers are just guys: Coby White put up 36 points on 17 shots; Josh Giddey came two steals shy of a goddamn quadruple-double, and posted 17 assists to just two turnovers. Matas Buzelis (in fairness, he might someday become more than a guy) went for a career-high 31 points.",
          "link": "https://defector.com/the-lakers-are-puking-and-shitting-at-an-inopportune-moment",
          "publishedOn": "2025-03-25T14:51:09.000Z",
          "wordCount": 7399,
          "title": "The Lakers Are Puking And Shitting At An Inopportune Moment",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2206733973.jpg"
        },
        {
          "id": "https://defector.com/?p=185030",
          "author": "Dave McKenna",
          "description": "George Foreman could take a punch. \nForeman, who died Friday at his home in Houston, was better known for other things. Like, most obviously, throwing a punch. He’s remembered as one of the hellaciousest hitters the sweet science ever saw, and his ring record (76-5 with 68 knockouts) and lots of YouTube highlights bolster that. The uninitiated can and should watch him seemingly lift Joe Frazier off the ground with a shot in 1973, or send former great white hope Gerry Cooney into retirement for good some 17 years later, or transport Michael Moorer to LaLa Land in late 1994. And outside the squared circle, Foreman famously shilled no-frills grills, and named all five of his sons George.",
          "link": "https://defector.com/george-foreman-got-as-good-as-he-gave",
          "publishedOn": "2025-03-25T14:18:57.000Z",
          "wordCount": 7562,
          "title": "George Foreman Got As Good As He Gave",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-517332206.jpg"
        },
        {
          "id": "https://defector.com/?p=185036",
          "author": "Maitreyi Anantharaman",
          "description": "JuJu Watkins will miss the rest of the NCAA tournament with an injury she sustained in USC’s second-round game against Mississippi State, the team announced late Monday night. ESPN’s Shams Charania reported that the sophomore guard tore her ACL in her right knee. \nWatkins was carried off the floor by trainers just five minutes into Monday night’s game. To fans of Watkins, the sequence before the injury might have looked familiar. Her transition burst, and her rarer ability to change pace—to decelerate—make her one of the best players in college basketball. On a fast break in the first quarter, she seemed ready to bring both skills to bear against two defenders. But as the Bulldogs players caught up to her on the other end of the court, and as she tried to stop and swerve around them, Watkins fell and screamed in pain.",
          "link": "https://defector.com/juju-watkins-season-ends-with-a-torn-acl",
          "publishedOn": "2025-03-25T13:59:06.000Z",
          "wordCount": 6607,
          "title": "JuJu Watkins’s Season Ends With A Torn ACL",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2206275664.jpg"
        },
        {
          "id": "https://defector.com/?p=184594",
          "author": "Sabrina Imbler",
          "description": "Chinook salmon start their lives high upstream in the rivers of western North America. The young fish linger in the safety of freshwater until they are big enough to head out into the open ocean, where they can live for up to five years. At sea, the salmon shine blue-green and glint silver. When the fish head back upriver, however, they flush into warmer hues: olive browns, reds, and purples. The jaws of the males lengthen and hook. The salmon almost always return to the exact stream in which they were born, following the Earth's magnetic field like a compass. There, the salmon meet, mate, and prepare to die.\nAt this stage of the salmon's life, they become \"gruesome zombie fish,\" said Sara Hugentobler, a fish biologist who worked for the U.S. Fish and Wildlife Service in the hatchery evaluation program in Red Bluff, Calif. \"They're losing scales. They're losing tissue. You can see exposed bone.\" But this orgy of death leaves behind a bounty of carcasses—a buffet for bears and other scavengers. And whatever flesh, bone, and scales remain sink to the riverbed and become fertilizer for more life. \"They're a really important ecological part of the environment,\" Hugentobler said.",
          "link": "https://defector.com/an-interview-with-a-fired-usfws-fish-biologist",
          "publishedOn": "2025-03-25T13:00:22.000Z",
          "wordCount": 14364,
          "title": "An Interview With A Fired USFWS Fish Biologist",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/17424189559621-e1742849286871.jpg"
        },
        {
          "id": "https://defector.com/?p=184931",
          "author": "Maitreyi Anantharaman",
          "description": "The first decision Mark Johnson made was a no-brainer. Late in Sunday’s Frozen Four women’s championship game, the Wisconsin Badgers team he has coached for more than two decades was beginning to tilt the ice. But they still trailed 3-2 to their biggest challenger of late, the Ohio State Buckeyes, who they were playing in the title game for the third straight year.",
          "link": "https://defector.com/kirsten-simms-put-her-hand-up-and-led-wisconsin-to-a-title",
          "publishedOn": "2025-03-24T20:29:01.000Z",
          "wordCount": 7283,
          "title": "Kirsten Simms Put Her Hand Up And Led Wisconsin To A Title",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2206104481.jpg"
        },
        {
          "id": "https://defector.com/?p=184948",
          "author": "Ray Ratto",
          "description": "The clinically overbearing college basketball coach used to be one of the sport’s overarching memes and central characters, but no longer. They’re still out there, but they’ve become minor players thanks to the revolution that followed players winning the right to get paid and transfer from program to program—only a nonagenarian or certified delusional still refers to them as \"schools\" in this context—until they get the fit or payday they want. In this new order, the general managers and athletic directors who make sure those payments come on time have taken over the top of the perception food chain; for every Tom Izzo, Rick Barnes, or Matt Painter, there is an army of younger, more mobile, and less martinet-ish new guys who lead with the smooth for the new generation of employees—less coaches than managers.\nFortunately, though, there is still Dan Hurley to corner the tantrum market.",
          "link": "https://defector.com/dan-hurley-is-the-last-angry-man",
          "publishedOn": "2025-03-24T18:39:28.000Z",
          "wordCount": 8072,
          "title": "Dan Hurley Is The Last Angry Man",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2205662072.jpg"
        },
        {
          "id": "https://defector.com/?p=178499",
          "author": "Dan McQuade",
          "description": "My son was on a mission. Simon has been walking since December, and he’s getting more confident each day. He’d spotted something, and was scooting down the aisle as fast as he could towards it. He wanted to play in the clothing racks.\nThey were empty. The store was full of people, but all that remained was plus-size women’s clothing priced at 3-for-$5. Even most of the mannequins had been purchased; rental trucks idled outside as buyers loaded them up with fixtures from the store. Philadelphia’s flagship Macy’s was closing; signs declared it the “final few hours.” I was there with my son, my wife, and my parents. Some guy was riding his bike through the store, which is about when we figured it was OK to let Simon run around. After spending some time entranced by a jewelry case, he found the clothing racks.",
          "link": "https://defector.com/one-last-trip-to-philadelphias-department-store-of-dreams",
          "publishedOn": "2025-03-24T18:06:38.000Z",
          "wordCount": 11796,
          "title": "One Last Trip To Philadelphia’s Department Store Of Dreams",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/wanamakers-final-concert.jpg"
        },
        {
          "id": "https://defector.com/?p=184551",
          "author": "Drew Magary",
          "description": "Back in the late 2010s, my wife and I took our kids to Los Angeles for spring break. Being the good little tourist family that we were, we used the occasion to visit Universal Studios Hollywood, which included a Wizarding World of Harry Potter sub-park at its far end. This was back when my kids found Harry Potter interesting, and right as Potter author J.K. Rowling was committing herself to becoming a culture warrior of the most tiresome sort. We enjoyed all of the magical offerings that Potterworld had on display. The virtual roller coaster (Universal has a lot of them). The actual roller coaster (underwhelming). Ollivanders Wand Shop (endless line for what was ultimately just a gift shop). It was a good time, but hardly a memorable one. What was memorable, however, was the butterbeer.\nIf you know your Potter lore, and I do to a casual extent, you know that butterbeer was served at the pub in the town of Hogsmeade. I loved beer, and I loved butter, so the second that I saw the word “butterbeer” in the books, I wanted one. I could taste it just by staring at that word for seconds at a time: thick, foamy, sweet like butterscotch. When I’d finished the entire Potter saga, the desire hadn’t abated a whit. I said to myself, “Fuck me, I’d love to drink a butterbeer.”",
          "link": "https://defector.com/butterbeer-flavoring-has-broken-contain",
          "publishedOn": "2025-03-24T16:45:08.000Z",
          "wordCount": 6733,
          "title": "Butterbeer Flavoring Has Broken Contain",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-1236838732.jpg"
        },
        {
          "id": "https://defector.com/?p=184924",
          "author": "Barry Petchesky",
          "description": "Max Muncy will make the opening day roster. So far, so normal. Max Muncy plays for the Sacramento A's. [Monocle pops out of my eye and into my champagne; it is unclear why I was wearing that or drinking that.]\nYes, there's a new Max Muncy in town. This one is a middle infielder, is 22 years old, and was a first-round pick in 2021. He's listed as the organization's No. 7 prospect mostly thanks to his stellar defense, and he's got a little bit of pop in his bat. Max Muncy is not to be confused with Max Muncy, the 34-year-old Dodgers corner infielder. Two totally different guys! Even though both were drafted by the Athletics, and both have August 25 birthdays.",
          "link": "https://defector.com/a-second-max-muncy-has-hit-mlb",
          "publishedOn": "2025-03-24T15:43:39.000Z",
          "wordCount": 6178,
          "title": "A Second Max Muncy Has Hit MLB",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2115791931.jpg"
        },
        {
          "id": "https://defector.com/?p=184927",
          "author": "Tom Ley",
          "description": "No baseball reporter delivers the goods as consistently as USA Today's Bob Nightengale, by which I mean nobody else in his field possesses even one percent of his ability to make dispassionately tweeting news and information related to Major League Baseball a constant struggle. Bob attempting to break free agency news? A riot. Bob confidently sharing photos that look like they were taken from inside of a vaseline jar? Always kills. Bob just inventing and then getting really hung up on the idea of the $10 Million Club? I laughed all day.\nOn Sunday, Bob struck again. While everyone was just trying to relax and watch some college basketball, Bob attempted to share a heartfelt message about the death of sports columnist Bryce Miller. Instead, he briefly sent the entire city of Philadelphia into a panic:",
          "link": "https://defector.com/bob-thats-the-wrong-bryce",
          "publishedOn": "2025-03-24T15:26:43.000Z",
          "wordCount": 5295,
          "title": "Bob, That’s The Wrong Bryce!",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2203168853.jpg"
        },
        {
          "id": "https://defector.com/?p=184915",
          "author": "Maitreyi Anantharaman",
          "description": "A very pleasant good solve to you, wherever you may be. This week's puzzle was constructed by Will Nediger and edited by Hoang-Kim Vu. Will is a crossword constructor from London, Ontario who uses the nom de plume Bewilderingly (an anagram of \"by Will Nediger\").\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE. Note that we're pausing open submissions until April 18.",
          "link": "https://defector.com/the-crossword-march-24-skipping-town",
          "publishedOn": "2025-03-24T15:00:00.000Z",
          "wordCount": 4831,
          "title": "The Crossword, March 24: Skipping Town",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-591594646.jpg"
        },
        {
          "id": "https://defector.com/?p=184900",
          "author": "Tom Ley",
          "description": "A one-possession NCAA tournament game with seconds on the clock can induce as much dread as anticipation. For as often as situations like these produce iconic buzzer-beaters, they just as often fall victim to college basketball's inherent jankiness—subpar coaches drawing up doomed sets and skittish players momentarily forgetting which direction their basket is. It's a blessing to get one great shot out of a scenario like this; on Sunday night, Colorado State and Maryland gave us two.\nThe teams that successfully navigate these moments tend to be the ones that have a good idea of who they are and what they want to do. After Maryland's Julian Reese hit two free throws to give his team a 70-68 lead with 22 seconds left, CSU head coach Niko Medved didn't like what he saw as his team raced up the floor and struggled to get into an offensive set. He called a timeout with 12 seconds left, and while the Rams huddled up, there was no doubt who would be getting the ball on the next possession.",
          "link": "https://defector.com/one-good-shot-deserves-a-great-one",
          "publishedOn": "2025-03-24T13:03:30.000Z",
          "wordCount": 7306,
          "title": "One Good Shot Deserves A Great One",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-2206584945.jpg"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=847094",
          "author": "Nick Deeds",
          "description": "Opening Day has finally arrived, and teams all around the league are gearing up for another pennant chase in hopes of being crowned this year’s World Series champion. Of course, there’s still another seven months to go before someone raises the Commissioner’s Trophy. Until the playoffs begin, teams will be focused on a smaller goal:…",
          "link": "https://www.mlbtraderumors.com/2025/04/poll-who-will-win-the-al-central-3.html",
          "publishedOn": "2025-04-02T20:10:03.000Z",
          "wordCount": 4907,
          "title": "Poll: Who Will Win The AL Central?",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/04/USATSI_24475213-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=846822",
          "author": "Steve Adams",
          "description": "The Royals announced Monday that they’ve selected the contract of infielder/outfielder Tyler Tolbert from Triple-A Omaha. They had an open 40-man spot already and only needed to clear an active roster spot, which they did by placing outfielder Dairon Blanco on the 10-day IL due to right Achilles tendinopathy. More to come.",
          "link": "https://www.mlbtraderumors.com/2025/03/royals-select-tyler-tolbert.html",
          "publishedOn": "2025-03-31T16:10:14.000Z",
          "wordCount": 3345,
          "title": "Royals Select Tyler Tolbert",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/03/tyler-tolbert-royals-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=846122",
          "author": "Darragh McDonald",
          "description": "The latest episode of the MLB Trade Rumors Podcast is now live on Spotify, Apple Podcasts, and wherever you get your podcasts! Make sure you subscribe as well! You can also use the player at this link to listen, if you don’t use Spotify or Apple for podcasts. This week, host Darragh McDonald is joined by Steve Adams and…",
          "link": "https://www.mlbtraderumors.com/2025/03/mlbtr-podcast-what-we-learned-from-the-offseason.html",
          "publishedOn": "2025-03-26T14:22:58.000Z",
          "wordCount": 3817,
          "title": "MLBTR Podcast: What We Learned From The Offseason",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/03/Juan_Soto_Mets_Marcus_Stroman_Yankees-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=845959",
          "author": "Steve Adams",
          "description": "The Royals announced a wide slate of cuts this morning. Infielder Harold Castro, righty Taylor Clarke, catcher Brian O’Keefe and infielder Tyler Tolbert were all reassigned to minor league camp. All were non-roster invitees. Meanwhile, infielder Nick Loftin and outfielders Drew Waters and Joey Wiemer were optioned to Triple-A Omaha. That leaves just 26 players…",
          "link": "https://www.mlbtraderumors.com/2025/03/cavan-biggio-royals-opening-day-roster.html",
          "publishedOn": "2025-03-25T16:42:26.000Z",
          "wordCount": 3928,
          "title": "Cavan Biggio Expected To Make Royals’ Roster",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/03/cavan-biggio-royals-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=845447",
          "author": "Anthony Franco",
          "description": "March 24: Canha was officially added to the 40-man today, as announced by the Royals. No corresponding move was necessary because they had several vacancies, with their 40-man count now at 38. March 21: The Brewers are trading first baseman/outfielder Mark Canha to the Royals, report Jon Heyman and Joel Sherman of The New York…",
          "link": "https://www.mlbtraderumors.com/2025/03/royals-to-acquire-mark-canha-from-brewers.html",
          "publishedOn": "2025-03-24T19:55:51.000Z",
          "wordCount": 6356,
          "title": "Royals Acquire Mark Canha From Brewers",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/02/mark-canha-1024x690.jpg"
        }
      ]
    },
    {
      "title": "Flaming Hydra",
      "feedUrl": "https://flaminghydra.com/rss/",
      "siteUrl": "https://flaminghydra.com/",
      "articles": [
        {
          "id": "67ec2999dbbca9000163ef64",
          "author": "The Editors",
          "description": "Nathan Munn, reporting from Canada",
          "link": "https://flaminghydra.com/issue-289/",
          "publishedOn": "2025-04-01T23:14:48.000Z",
          "wordCount": 2360,
          "title": "On guard",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/bear-2-000612-0004-000370-2.jpg"
        },
        {
          "id": "67ec3391dbbca9000163f017",
          "author": "Nathan Munn",
          "description": "A dispatch from Canada",
          "link": "https://flaminghydra.com/at-the-edge-of-empire/",
          "publishedOn": "2025-04-01T23:13:48.000Z",
          "wordCount": 2314,
          "title": "At the Edge of Empire",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/bear-2-000612-0004-000370.jpg"
        },
        {
          "id": "67eade3a7248c5000160b9f8",
          "author": "The Editors",
          "description": "That's just the way Rax King talks; Colin McGowan trips out on the sofa",
          "link": "https://flaminghydra.com/issue-288/",
          "publishedOn": "2025-03-31T21:55:16.000Z",
          "wordCount": 779,
          "title": "Crowded vowels / Lonesome heroes",
          "imageUrl": "https://flaminghydra.com/content/images/2025/03/hunger-games-catching-fire-justice-16x9-1.jpg"
        },
        {
          "id": "67eada2c7248c5000160b9cc",
          "author": "Rax King",
          "description": "Like the D.C. native herself, the D.C. accent is rarely even named, much less considered and discussed. Linguists have a hard time nailing it down because the city’s population is so transient, changing over with every new congressional and presidential term. A minority of the adults",
          "link": "https://flaminghydra.com/the-d-c-accent/",
          "publishedOn": "2025-03-31T21:54:48.000Z",
          "wordCount": 791,
          "title": "The D.C. Accent",
          "imageUrl": "https://flaminghydra.com/content/images/2025/03/hunger-games-catching-fire-justice-16x9.jpg"
        },
        {
          "id": "67eadb037248c5000160b9e2",
          "author": "Colin McGowan",
          "description": "Lieutenant Columbo pulls up to the home of this week’s murderer in a shitty car, emerging in a raincoat that suggests he knows something we don’t about the coming weather. We’re in sunny Los Angeles, aren’t we? But this is part of",
          "link": "https://flaminghydra.com/troub/",
          "publishedOn": "2025-03-31T21:54:23.000Z",
          "wordCount": 797,
          "title": "Troubles in the Dark",
          "imageUrl": "https://flaminghydra.com/content/images/2025/03/Peter_Falk_-_1973-hero.jpg"
        },
        {
          "id": "67e715057248c5000160a12d",
          "author": "The Editors",
          "description": "The complex and the obvious in Arwa Mahdawi’s investigation",
          "link": "https://flaminghydra.com/issue-287/",
          "publishedOn": "2025-03-28T23:07:56.000Z",
          "wordCount": 843,
          "title": "Outlived by reputation",
          "imageUrl": "https://flaminghydra.com/content/images/2025/03/colage.jpg"
        },
        {
          "id": "67e6ee3d7248c50001609fd7",
          "author": "Arwa Mahdawi",
          "description": "In July 1996, 36-year-old Susan Walsh supposedly left her house in New Jersey and never came back. She is presumed dead but a body has never been found. This is Part Three of a series on my five-year investigation into her unsolved disappearance. \nTo begin at the beginning, here are",
          "link": "https://flaminghydra.com/how-to-solve-a-murder-part-three/",
          "publishedOn": "2025-03-28T22:59:52.000Z",
          "wordCount": 903,
          "title": "How to Solve a Murder: Part Three",
          "imageUrl": "https://flaminghydra.com/content/images/2025/03/Part-Three.jpg"
        },
        {
          "id": "67e595847248c500016084c3",
          "author": "The Editors",
          "description": "Today: Trevor Alixopulos, comics artist and author of The Hot Breath of War; and Jack Pendarvis, an American screenwriter, author, and voice actor.\n\nIssue No. 286\nSpring 2025\nTrevor Alixopulos\nAce Goes to Hollywood: Episode 2\nJack Pendarvis\n\nSpring 2025\nby Trevor Alixopulos",
          "link": "https://flaminghydra.com/issue-286/",
          "publishedOn": "2025-03-27T21:41:32.000Z",
          "wordCount": 499,
          "title": "Pulped pages / Peak Pauly",
          "imageUrl": "https://flaminghydra.com/content/images/2025/03/spring20205thumb.jpg"
        },
        {
          "id": "67e5a6617248c50001608558",
          "author": "Trevor Alixopulos",
          "description": "a collective of 60 writers, on fire and hard to kill",
          "link": "https://flaminghydra.com/spring-2025/",
          "publishedOn": "2025-03-27T21:39:32.000Z",
          "wordCount": 422,
          "title": "Spring 2025",
          "imageUrl": "https://flaminghydra.com/content/images/2025/03/spring20205thumb-1.png"
        },
        {
          "id": "67e56a697248c5000160841a",
          "author": "Jack Pendarvis",
          "description": "Ace Goes to Hollywood is a continuing transcript of a ride from Oxford, Mississippi, to Memphis, Tennessee, during which Jack Pendarvis interviewed Ace Atkins about his work on the Pauly Shore film Jury Duty.\n\nA Slacker, Surfer, Gen X Hippie Type\nJACK: And let’s tell the people…",
          "link": "https://flaminghydra.com/ace-goes-to-hollywood-episode-2/",
          "publishedOn": "2025-03-27T21:29:16.000Z",
          "wordCount": 598,
          "title": "Ace Goes to Hollywood: Episode 2",
          "imageUrl": "https://flaminghydra.com/content/images/2025/03/encino-bw-16w.jpg"
        },
        {
          "id": "67e46da67248c50001606cf0",
          "author": "The Editors",
          "description": "Anna Merlan, agog in the Happiest Place on Earth",
          "link": "https://flaminghydra.com/issue-285/",
          "publishedOn": "2025-03-26T22:49:33.000Z",
          "wordCount": 927,
          "title": "Too much joy",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/03/Disneyland-TodSeelie-whale-2.jpg"
        },
        {
          "id": "67e42df17248c50001606b72",
          "author": "Anna Merlan",
          "description": "“You see?” my mom said, pointing out the window of our hotel room in Anaheim, California, where laborers in the field next door were picking strawberries. I was maybe eight years old or so, and she was never one to miss an opportunity. “That’s what",
          "link": "https://flaminghydra.com/garden-of-earthly-delights/",
          "publishedOn": "2025-03-26T22:47:18.000Z",
          "wordCount": 980,
          "title": "Garden of Earthly Delights",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/03/Disneyland-TodSeelie-whale-1.jpg"
        },
        {
          "id": "67e31cdeae6d960001f0389c",
          "author": "The Editors",
          "description": "Miles Klee with a rare gospel, and Amy Chu on bodily imperatives",
          "link": "https://flaminghydra.com/issue-284/",
          "publishedOn": "2025-03-26T00:57:07.000Z",
          "wordCount": 462,
          "title": "Space craft / Bottom line",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/03/33722036624_9a7b44d055_k.jpg"
        },
        {
          "id": "67e30f9aae6d960001f03842",
          "author": "Amy Chu",
          "description": "a collective of 60 writers, on fire and hard to kill",
          "link": "https://flaminghydra.com/a-reminder-to-our-nation-everybody-poops/",
          "publishedOn": "2025-03-26T00:55:31.000Z",
          "wordCount": 305,
          "title": "A Reminder to Our Nation: Everybody Poops",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/03/amythumb.jpg"
        },
        {
          "id": "67e31b14ae6d960001f0388d",
          "author": "Miles Klee",
          "description": "a collective of 60 writers, on fire and hard to kill",
          "link": "https://flaminghydra.com/the-god-of-parking-demands-receipts-2/",
          "publishedOn": "2025-03-26T00:53:30.000Z",
          "wordCount": 309,
          "title": "The God of Parking Demands Receipts",
          "imageUrl": "https://flaminghydra.com/content/images/2025/03/parking-flickr.jpg"
        },
        {
          "id": "67e1d6202cc2220001e19393",
          "author": "The Editors",
          "description": "Yemisi Aribisala on the places you can’t leave",
          "link": "https://flaminghydra.com/issue-283/",
          "publishedOn": "2025-03-24T23:12:39.000Z",
          "wordCount": 769,
          "title": "Hope in exile",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/03/IMG_4612-2.jpg"
        },
        {
          "id": "67e1c56e2cc2220001e19264",
          "author": "Yemisi Aribisala",
          "description": "by Yemisi Aribisala\n\nIllustration by the author\nOla Soyinka was a better pro-democracy activist than he was a businessman. I went to work for him at the British Journal of Cardiology at 3 Tyers Gate, London, in 1995; he hired me because I was his brother’s girlfriend, that",
          "link": "https://flaminghydra.com/from-nigeria-to-bermondsey/",
          "publishedOn": "2025-03-24T23:11:49.000Z",
          "wordCount": 831,
          "title": "From Nigeria to Bermondsey",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/03/IMG_4612.jpg"
        }
      ]
    },
    {
      "title": "Today in Tabs",
      "feedUrl": "https://rss.beehiiv.com/feeds/ZRiesnGI0u.xml",
      "siteUrl": "https://www.todayintabs.com/",
      "articles": []
    },
    {
      "title": "Bad Faith Times",
      "feedUrl": "https://bad-faith-times.ghost.io/rss/",
      "siteUrl": "https://bad-faith-times.ghost.io/",
      "articles": [
        {
          "id": "67ebe54e9df7290001a3ee81",
          "author": "Denny Carter",
          "description": "Elon Musk and DOGE are deleting American history that runs afoul of a fascist worldview. Their success is hardly a foregone conclusion.",
          "link": "https://bad-faith-times.ghost.io/doge-is-editing-american-history-it-might-not-work/",
          "publishedOn": "2025-04-01T15:01:34.000Z",
          "wordCount": 2771,
          "title": "DOGE Is Editing American History. It Might Not Work.",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/size/w1200/2025/04/Screenshot-2025-04-01-at-10.57.58-AM.png"
        },
        {
          "id": "67e9868149390f0001501eef",
          "author": "Denny Carter",
          "description": "Musk again ran to Fox News to whine about a politician saying mean things about him",
          "link": "https://bad-faith-times.ghost.io/i-am-begging-elon-musk-to-cry-more-2/",
          "publishedOn": "2025-03-31T11:07:42.000Z",
          "wordCount": 936,
          "title": "I Am Begging Elon Musk To Cry More",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/size/w1200/2025/03/Screenshot-2025-03-31-at-7.07.13-AM.png"
        },
        {
          "id": "67e583c549390f000150139f",
          "author": "Denny Carter",
          "description": "\"Whatever it is we thought the First Amendment was supposed to be doing ... that's not working.\"",
          "link": "https://bad-faith-times.ghost.io/bft-video-a-thought-terminating-cliche/",
          "publishedOn": "2025-03-27T17:21:21.000Z",
          "wordCount": 632,
          "title": "BFT Video: 'A Thought-Terminating Cliche'",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/size/w1200/2025/03/Screenshot-2025-03-27-at-1.20.33-PM.png"
        },
        {
          "id": "67e41ef049390f0001500df3",
          "author": "Denny Carter",
          "description": "Democrats flipped a Pennsylvania state senate seat with one weird trick: Hammer DOGE.",
          "link": "https://bad-faith-times.ghost.io/the-political-gift-of-doge-2/",
          "publishedOn": "2025-03-26T16:24:50.000Z",
          "wordCount": 1754,
          "title": "The Political Gift Of DOGE",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/03/Screenshot-2025-03-26-at-12.21.57-PM.png"
        },
        {
          "id": "67e1ab57b3068f0001ef3260",
          "author": "Denny Carter",
          "description": "In today's BFT video I talked about Monday's blog post on the latest voting data showing young men turning in droves against American democracy. \nI may have also lost my mind while talking about Trump's recent cabinet meeting, one highlighted by never-before-seen levels of",
          "link": "https://bad-faith-times.ghost.io/bft-video-cabinet-member-groveling-egg-prices-and-shoutout-to-gen-z-women/",
          "publishedOn": "2025-03-25T11:29:37.000Z",
          "wordCount": 613,
          "title": "BFT Video: Cabinet Member Groveling, Egg Prices, And Shoutout To Gen-Z Women",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/03/Screenshot-2025-03-25-at-7.35.44-AM.png"
        },
        {
          "id": "67e1688db3068f0001ef2ca5",
          "author": "Denny Carter",
          "description": "Recent analysis of 2024 voting data shows just how far down the fascist rabbit hole young guys have gone",
          "link": "https://bad-faith-times.ghost.io/zoomer-dudes-embrace-of-authoritarianism-is-worse-than-you-think-2/",
          "publishedOn": "2025-03-24T14:55:55.000Z",
          "wordCount": 2131,
          "title": "Zoomer Dudes' Embrace of Authoritarianism Is Worse Than You Think",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/03/Screenshot-2025-03-24-at-10.44.32-AM.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}