{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": [
        {
          "id": "https://blogs.fangraphs.com/?p=450554",
          "author": "David Laurila",
          "description": "Plus Will Pennyfeather, Roki Sasaki, a Classic Baseball Era Committee ballot poll, facts and stats galore, and more.",
          "link": "https://blogs.fangraphs.com/sunday-notes-dispatches-from-the-gm-meetings-in-san-antonio/",
          "publishedOn": "2024-11-10T13:01:23.000Z",
          "wordCount": null,
          "title": "Sunday Notes: Dispatches From the GM Meetings in San Antonio",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://blogs.fangraphs.com/?p=450466",
          "author": "David Laurila",
          "description": "Five executives weigh in on the innings their teams got from starting pitchers in 2024, and what it might mean going forward.",
          "link": "https://blogs.fangraphs.com/general-managers-address-the-highs-and-lows-of-starter-innings/",
          "publishedOn": "2024-11-08T16:45:18.000Z",
          "wordCount": null,
          "title": "General Managers Address the Highs and Lows of Starter Innings",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Pitch",
      "feedUrl": "https://www.thepitchkc.com/feed/",
      "siteUrl": "https://www.thepitchkc.com/",
      "articles": [
        {
          "id": "https://www.thepitchkc.com/?p=861284",
          "author": "Mike Dahlor",
          "description": "Pursuit Spirits Double-Oaked Bourbon Whiskey // Photo by Mike Dahlor Pursuit Spirits’ latest whiskey is special, but to fully appreciate the depth of this offering, I’m going to guide you on a trip through time. Time to fire up the Flux Capacitor. This trip is focused on what, in the whiskey world, is known as a “Dusty.” A dusty whiskey...",
          "link": "https://www.thepitchkc.com/inside-the-bottle-pursuit-spirits-siphons-inspiration-from-chardonnay-and-a-beloved-dusty/",
          "publishedOn": "2024-11-12T17:00:45.000Z",
          "wordCount": 2277,
          "title": "Inside the Bottle: Pursuit Spirits siphons inspiration from chardonnay and a beloved “dusty”",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/11/y/l/pxl-20241110-151532030portrait-1024x771.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=859887",
          "author": "Pitch Staff",
          "description": "Chioma Anyanwu, Alyssa Byers, Chloe Castro-Santos, and Amari Lewis in KCRep’s 2024 production of LITTLE SHOP OF HORRORS. // Photo by Don Ipock Earlier this month, we published The Pitch’s annual Best of Kansas City issue. You can take a peek at the results of the readers’ poll here. The issue also included a list, compiled and written by our...",
          "link": "https://www.thepitchkc.com/best-of-kc-2024-outrageous-talent-makes-for-a-bodacious-bloodbath-in-kcreps-little-shop-of-horrors/",
          "publishedOn": "2024-11-12T17:00:21.000Z",
          "wordCount": 1969,
          "title": "Best of KC 2024: Outrageous talent makes for a bodacious bloodbath in KCRep’s Little Shop of Horrors",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/05/z/c/screenshot-2024-05-03-at-111926pm-1024x672.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=859878",
          "author": "Pitch Staff",
          "description": "Photo Courtesy of The Rabbit hOle Earlier this month, we published The Pitch’s annual Best of Kansas City issue. You can take a peek at the results of the readers’ poll here. The issue also included a list, compiled and written by our editorial staff, of some local people, places, and things that we thought clearly won 2024. We’ll be...",
          "link": "https://www.thepitchkc.com/best-of-kc-2024-the-rabbit-hole-digs-deeper-into-their-own-private-narnia/",
          "publishedOn": "2024-11-12T14:00:45.000Z",
          "wordCount": 1782,
          "title": "Best of KC 2024: The Rabbit hOle digs deeper into their own private Narnia",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/11/k/f/rabbit-hole-best-of-photo-courtesy-of-rabbit-hole.jpeg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=860529",
          "author": "Brock Wilbur",
          "description": "Courtesy Shout! Studios There are few genres we’re more on board for than the tiny cat-and-mouse thriller—especially those that feel like a stage play captured on film… those intimate games with twists, turns, and a chance for a small set of actors to just go hard in the paint. Last month’s Hitchcockian thriller The Wasp turned a muder-for-hire thriller into...",
          "link": "https://www.thepitchkc.com/daisy-ridleys-mean-little-neo-noir-magpie-forgets-to-give-its-characters-any-character/",
          "publishedOn": "2024-11-11T22:00:11.000Z",
          "wordCount": 1984,
          "title": "Daisy Ridley’s mean little neo-noir Magpie forgets to give its characters any character",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/11/v/m/screenshot-2024-11-09-at-34927pm.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=860755",
          "author": "Tarik Sykes",
          "description": "KC Current versus North Carolina Courage on Saturday, Nov. 9, 2024. // Photo by Tarik Sykes KC Current took on North Carolina Courage in their first match of the 2024 NWSL Playoffs on Saturday, Nov. 9. Coming into the playoffs as the four-seed, the Current were matched up against five-seed North Carolina. Temwa Chawinga—the team’s savior—quickly did what she knows...",
          "link": "https://www.thepitchkc.com/photos-current-swipe-first-match-of-2024-nwsl-playoffs-against-north-carolina-courage/",
          "publishedOn": "2024-11-11T22:00:09.000Z",
          "wordCount": 1647,
          "title": "Photos: Current swipe first match of 2024 NWSL Playoffs against North Carolina Courage",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/11/t/q/tms8809-scaled.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=859853",
          "author": "Nick Spacek",
          "description": "Welcome to Analog Adventures, where we run down the latest stacks of wax to hit our mailbox. Reissues, new releases, and more are all on the turntable as we spin these records. Ray Charles Modern Sounds in Country and Western Music Modern Sounds in Country and Western Music Volume Two Country and Western Meets Rhythm and Blues Crying Time Best...",
          "link": "https://www.thepitchkc.com/analog-adventures-ray-charles-the-creature-comforts-the-fleshtones-and-more-new-vinyl-releases-for-october-2024/",
          "publishedOn": "2024-11-11T19:00:12.000Z",
          "wordCount": 4211,
          "title": "Analog Adventures: Ray Charles, The Creature Comforts, The Fleshtones, and more new vinyl releases for October 2024",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/11/a/q/screenshot-2024-11-07-at-82504pm.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=860752",
          "author": "Tarik Sykes",
          "description": "Kansas Jayhawks versus Iowa State Cyclones on Saturday, Nov. 9, 2024. // Photo by Tarik Sykes College football was on display again this past weekend at Arrowhead Stadium at GEHA Field, as the Kansas Jayhawks took on the #17 ranked Iowa State Cyclones on Saturday, Nov. 9. Saturday was an action-packed, high-scoring display of talent between the two Big 12...",
          "link": "https://www.thepitchkc.com/photos-jayhawks-take-down-17-cyclones-in-high-scoring-affair/",
          "publishedOn": "2024-11-11T17:16:58.000Z",
          "wordCount": 1607,
          "title": "Photos: Jayhawks take down #17 Cyclones in high-scoring affair",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/11/x/e/tms4285-scaled.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=859868",
          "author": "Pitch Staff",
          "description": "Photo by Matthew Lloyd Earlier this month, we published The Pitch’s annual Best of Kansas City issue. You can take a peek at the results of the readers’ poll here. The issue also included a list, compiled and written by our editorial staff, of some local people, places, and things that we thought clearly won 2024. We’ll be publishing these...",
          "link": "https://www.thepitchkc.com/best-of-kc-2024-blood-on-the-big-screen-as-wichita-shot-western-pistol-whips-the-genre/",
          "publishedOn": "2024-11-11T17:00:23.000Z",
          "wordCount": 1804,
          "title": "Best of KC 2024: Blood on the big screen as Wichita-shot Western pistol-whips the genre",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/11/z/y/they-call-her-death-best-of-photo-by-matthew-lloyd-1024x656.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=859858",
          "author": "Pitch Staff",
          "description": "Photo by Tarik Sykes Earlier this month, we published The Pitch’s annual Best of Kansas City issue. You can take a peek at the results of the readers’ poll here. The issue also included a list, compiled and written by our editorial staff, of some local people, places, and things that we thought clearly won 2024. We’ll be publishing these...",
          "link": "https://www.thepitchkc.com/best-of-kc-2024-kc-currents-cultural-currency-as-classy-competitors-earns-their-crowns/",
          "publishedOn": "2024-11-11T14:00:45.000Z",
          "wordCount": 2014,
          "title": "Best of KC 2024: KC Current’s cultural currency as classy competitors earns their crowns",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/11/j/y/kc-current-best-of-photo-by-tarik-sykes-scaled.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=860551",
          "author": "Isabella Galvan",
          "description": "Creed. // photo by Isabella Galvan Creed with 3 Doors Down and Mammoth WVH T-Mobile Center Wednesday, November 6 On Wednesday, it was a soaring evening of big ol’ rock ‘n’ roll vibes when Creed brought their Are You Ready? tour to T-Mobile Center with fellow brothers in big guitars 3 Doors Down and Mammoth WVH. Our photographer Isabella Galvan...",
          "link": "https://www.thepitchkc.com/photos-creed-took-us-higher-at-t-mobile-center/",
          "publishedOn": "2024-11-11T13:24:09.000Z",
          "wordCount": 1573,
          "title": "Photos: Creed took us higher at T-Mobile Center",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/11/a/x/pic-22-scaled-e1731207899515.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=860555",
          "author": "Allison Scavo",
          "description": "Lost Dog Street Band. // photo by Allison Scavo Lost Dog Street Band with Nolan Taylor Liberty Hall Friday, November 8 One of the original traveling street bands, these Lost Dogs have built a loyal following over the years who scream, cry, and laugh with them. Lost Dog Street Band is a dark country-folk band whose music cuts right to...",
          "link": "https://www.thepitchkc.com/photos-lost-dog-street-band-brought-raw-authenticity-to-liberty-hall/",
          "publishedOn": "2024-11-11T13:01:23.000Z",
          "wordCount": 1723,
          "title": "Photos: Lost Dog Street Band brought raw authenticity to Liberty Hall",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/11/h/g/screenshot-2024-11-10-at-111519pm.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=860445",
          "author": "Brock Wilbur",
          "description": "Thundergong! presser with Jason and Billy. // Photo by Brock Wilbur For the 8th year in a row, the THUNGDERGONG! evening of celebrity-heavy comedy and music will spotlight KC tomorrow night at the Uptown Theatre. The Steps of Faith Foundation, whose mission is to raise money to supply limbs to amputees, probably shouldn’t need to exist. In a better America,...",
          "link": "https://www.thepitchkc.com/david-st-hubbins-blesses-2024-thundergong-benefit-for-steps-of-faith-foundation/",
          "publishedOn": "2024-11-09T00:25:56.000Z",
          "wordCount": 2090,
          "title": "David St. Hubbins blesses 2024 Thundergong! benefit for Steps of Faith foundation",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/11/i/h/screenshot-2024-11-08-at-74046pm.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=860456",
          "author": "Sarah Sipple",
          "description": "Oil on Linen // Photo by Anna Petrow Mulvihill Café Sebastienne at Kemper Museum of Contemporary Art has closed. After a time of reworking the menu and decor–both are equal elements of the experience–the dining space has reopened as Oil on Linen.  Named as a reference cleverly blending an art medium with imagery of a well-set dining table, Oil on...",
          "link": "https://www.thepitchkc.com/reimagined-museum-restaurant-oil-on-linen-blends-visual-and-edible-art/",
          "publishedOn": "2024-11-08T20:30:24.000Z",
          "wordCount": 2530,
          "title": "Reimagined museum restaurant, Oil on Linen, paints a new experience with bold flavor and color",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/11/f/t/photo-oct-31-2024-10-55-54-am-scaled.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=858572",
          "author": "Brock Wilbur",
          "description": "Welcome, dearest readers, to the annual BEST OF issue of The Pitch. We are so thrilled to have you joining us again this year—our 44th!—celebrating the highlights and heroes that define who we are as a city. This special mega-issue is a huge undertaking, starting with groundwork for the process which we begin formulating in February. For an entire vertical...",
          "link": "https://www.thepitchkc.com/letter-from-the-editor-and-i-do-my-little-turn-on-the-catwalk/",
          "publishedOn": "2024-11-08T17:00:51.000Z",
          "wordCount": 2233,
          "title": "Letter from the Editor: And I do my little turn on the catwalk",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/09/f/i/brock-pitch-bitch.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=858553",
          "author": "Michael Mackie",
          "description": "Photo by Sandy Morris/HBO For a low-key comedy actress, Bridget Everett sure does a lot of crying in the third season of HBO’s award-winning series Somebody, Somewhere. The show—set in Manhattan, Kansas—has seen Everett’s alter-ish ego character, Sam, tackle plenty of personal highs and lows over the past two seasons. Now, in its final season, Sam’s emotional arcs quietly peak… crater… and...",
          "link": "https://www.thepitchkc.com/season-three-of-somebody-somewhere-embraces-laughter-tears-and-all-things-manhattan-kansas/",
          "publishedOn": "2024-11-08T14:00:40.000Z",
          "wordCount": 2972,
          "title": "Season three of Somebody, Somewhere embraces laughter, tears, and all things Manhattan, Kansas",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/10/o/n/somebody-somewhere-photo-by-sandy-morris-hbo.jpg"
        }
      ]
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=173031",
          "author": "Barry Petchesky",
          "description": "The first thing I thought when I saw the big pigeon was I wish I didn't know the big pigeon was here. Oh, I was plenty charmed. It's a hyperrealistic, 16-foot aluminum pigeon—like pizza, the basic idea is good enough that I'm not really sure there's any version of the execution that wouldn't have satisfied me. But I had come specifically to see the pigeon, and achieved that goal, and wished I had been surprised by it instead. Turned a corner and been gobsmacked by the pigeon, or been riding up 10th Avenue and seen the pigeon in the distance, getting ever-closer and -larger. What the hell? would have been my ideal reaction to seeing the big pigeon for the first time. Why is there a pigeon here?\nWell, why not? It's Manhattan. There are pigeons everywhere. Anywhere from half a million to nine million, depending on who you ask. Iván Argote, a Colombian artist living in Paris, has added one more with his sculpture which perches atop the High Line, an unused rail trestle turned linear park, and stares somewhat menacingly down on passing traffic. The sculpture is called Dinosaur (on display through spring 2026), and it does look more than a little saurian at this scale—the claws look like they could properly gut you, perhaps as revenge for all those times you didn't offer his smaller cousins any crumbs. Close-up foot here, with, helpfully, a pigeon for scale.",
          "link": "https://defector.com/the-big-pigeon-isnt-scary-enough",
          "publishedOn": "2024-11-12T17:48:44.000Z",
          "wordCount": 7992,
          "title": "The Big Pigeon Isn’t Scary Enough",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2182236959.jpg"
        },
        {
          "id": "https://defector.com/?p=173006",
          "author": "Tom Ley",
          "description": "Before Monday night's game between the Miami Dolphins and Los Angeles Rams, ESPN reporter Jeff Darlington and Dolphins quarterback Tua Tagovailoa teamed up to produce one of the year's strangest pieces of NFL-related media.\nTagovailoa is exactly the sort of young, talented, charismatic quarterback that the league and its broadcasters crave in order to sell fans on a Monday night game between two mediocre teams, so it makes sense that he would be the centerpiece of ESPN's pregame coverage. Tagovailoa's marketability is complicated, however, by the fact that he recently completed yet another stint on the IR after being concussed in Week 2. Tagovailoa's career, from college to the pros, has been riddled with brain injuries, at such an alarming rate that many pundits were urging him to retire following the hit he took in September. Tagovailoa didn't retire, though, and now he's trying to salvage the Dolphins' season. It's a story worth telling, surely, but how exactly does a network sell the story to fans?",
          "link": "https://defector.com/you-cant-sell-tua-tagovailoas-story",
          "publishedOn": "2024-11-12T16:19:07.000Z",
          "wordCount": 6458,
          "title": "You Can’t Sell Tua Tagovailoa’s Story",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2184287768.jpg"
        },
        {
          "id": "https://defector.com/?p=172921",
          "author": "Chris Thompson",
          "description": "Every morning, I make for myself a protein shake. It is my impression that this is good behavior, healthy and so forth. I do not consider it my business to engage in any even half-serious interrogation of this impression. The body requires protein, probably, and though I do enjoy gnawing on animal parts, it's a lot simpler to fire down a daily hit of protein out of a shaker bottle (or three) than it is to make sure I have handfuls of meat available in the fridge at all times. Every morning, I open the pantry and hunt around for the tub of protein powder. Very often on these hunts, I encounter other, different tubs, tubs and bags of things that look like protein powder but possibly are not, or tubs or bags of things that definitely are not protein powder, but look and smell like they are meant to be dissolved in water and then consumed, for health. Health being good, I find it wise simply to throw a scoop or two of these things into the shaker bottle, to make the resulting sludge maximally healthful.\nHere are some things that are going into my current \"protein\" shake, in order of application.",
          "link": "https://defector.com/i-cant-stop-drinking-this-fucked-up-protein-shake",
          "publishedOn": "2024-11-12T15:29:55.000Z",
          "wordCount": 9911,
          "title": "I Can’t Stop Drinking This Fucked-Up Protein Shake",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/Protein-Shake.jpg"
        },
        {
          "id": "https://defector.com/?p=173001",
          "author": "Soraya Roberts",
          "description": "Bridget Everett is 52. She was 48 when HBO took on her show, Somebody Somewhere, now in its third and final season. The show, in which she plays the lead character, Sam, loosely depicts Everett’s own life, or at least the one she would have lived if she had stayed in Kansas instead of moving to New York, where she eventually became a downtown alt-cabaret star. If you consider her start getting her equity card around the age of 26, that’s a good two decades to get to the position she is in now, where her show is a Peabody Award winner and she no longer has to wait tables as a fallback. Depending on your perspective, that’s incredibly cool or incredibly nuts.\n“Dreams don’t have deadlines.” The first time I saw Everett say that was in 2017, during an interview for the indie film Patti Cake$, in which she plays the alcoholic mother of a bartender (Danielle Macdonald) who aspires to become a rap star. “There’s a quote from LL Cool J,” Everett tells the young interviewer, laughing, “it’s DDHD—Dreams don’t have deadlines—and I live by that and I think everybody should live by it because it doesn’t matter if you’re 15, you’re 23, or you’re collecting retirement checks, just keep going for what makes you feel happy and follow and live your dream.”",
          "link": "https://defector.com/somebody-somewhere-is-a-dream-without-a-deadline",
          "publishedOn": "2024-11-12T14:03:04.000Z",
          "wordCount": 7726,
          "title": "‘Somebody Somewhere’ Is A Dream Without A Deadline",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/jeff-hiller-bridget-everett.jpg"
        },
        {
          "id": "https://defector.com/?p=172913",
          "author": "Patrick Redford",
          "description": "On Monday morning, English soccer's referee association (PGMOL) announced that it had suspended Premier League ref David Coote after an odd video of him leaked online. In the video, Coote, who appears to be absolutely smacked off of some kind of intoxicating substance, chats some generationally compromising shit. Despite his earlier assertion that someone put a ton of effort into producing a bizarre fake video of a relatively obscure referee talking generationally compromising shit, Coote's since admitted it was indeed him.\n\nhttps://www.youtube.com/watch?v=WQtnWER3TEU",
          "link": "https://defector.com/this-really-is-david-coote-shitting-on-klopp",
          "publishedOn": "2024-11-11T21:27:11.000Z",
          "wordCount": 7376,
          "title": "Premier League Ref Admits Video Of Him Talking Wild Shit About Liverpool Not Actually A Deepfake",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-1630038849.jpg"
        },
        {
          "id": "https://defector.com/?p=172920",
          "author": "Dave McKenna",
          "description": "Jaron \"Boots\" Ennis put himself in a KO-or-lose situation. So even while keeping his belt in what was a romp on the scorecards in Saturday’s IBF welterweight title fight against Karen Chukhadzhian in front of a hometown Philadelphia crowd, in the big picture Ennis hardly came away a winner. \nOver the summer, Ennis and his team booked what looked like a paid workout when he signed to face the Ukrainian, whom he’d already beaten by decision in January 2023 on the undercard of a Tank Davis fight. Boots had the title, the perfect record (32-0 with 29 knockouts), and a one-two combo of out-of-the-ring charm and on-the-job ferocity that put him in any conversation about boxing’s Next Big Thing. The 27-year old Philly native was maybe just one highlight-reel KO away from breathing the rare air that Tank breathes popularity-wise, hitting pay-per-view headliner status and getting what all boxers suddenly covet: An invite to Saudi Arabia. This was the fight that was supposed to get Ennis all that.",
          "link": "https://defector.com/boots-ennis-learns-that-being-boring-can-be-worse-than-losing",
          "publishedOn": "2024-11-11T19:46:46.000Z",
          "wordCount": 7011,
          "title": "Boots Ennis Learns That Being Boring Can Be Worse Than Losing",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2183026258.jpg"
        },
        {
          "id": "https://defector.com/?p=172861",
          "author": "Luis Paez-Pumar",
          "description": "Manchester City loves to give rivals hope right before snatching it away. The four-peating Premier League champions started each of those consecutive title-winning campaigns with whimpers, relatively speaking, dropping at least eight points in Premier League play in each of them by about mid-November. Each of those stretches of (relatively) subpar play gave hope to everyone who supports a fellow title contender or simply (and justifiably) hates City's whole deal. But, as the saying goes, it's the hope that kills you, and City eventually crushed those hopes in each of those four seasons.\nRight on time, the present day Citizens have entered the late-fall point of the schedule mired in a funk. Right now City sits in second place on the league table, having dropped 10 points in its first 11 matches. After a strong start to the campaign, the Mancs have hit the skids hard recently, currently stuck in a four-match losing streak across all competitions. The latest blow came in a come-from-ahead 2-1 loss to Brighton on Saturday.",
          "link": "https://defector.com/manchester-city-is-stuck-in-the-mud",
          "publishedOn": "2024-11-11T19:15:21.000Z",
          "wordCount": 8706,
          "title": "Manchester City Is Stuck In The Mud",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2183186849.jpg"
        },
        {
          "id": "https://defector.com/?p=172844",
          "author": "Chris Thompson",
          "description": "Early in the second quarter of Sunday's game between the excellent but joyless Boston Celtics and the talented but butt Milwaukee Bucks, Giannis Antetokounmpo kerpowed Jaylen Brown with a high elbow. Giannis had the ball on the block, drove to the defense's middle, and then attempted to pivot over his left shoulder, throwing out a cartoonishly long and pointy chicken wing to clear some shooting space; Brown, the primary defender, took the blow to the shoulder and head, and went down with a shout. The referees signaled an offensive foul and awarded the ball to the Celtics. Giannis offered Brown a conciliatory handshake and then cruelly yoinked it away, executing the rude \"too slow\" hair-smoothing maneuver and leaving Brown grasping at air.\n\nhttps://www.youtube.com/watch?v=d6crt19V_mU",
          "link": "https://defector.com/nba-friendship-wobbled-by-ill-timed-fake-handshake",
          "publishedOn": "2024-11-11T16:29:54.000Z",
          "wordCount": 7369,
          "title": "NBA Friendship Wobbled By Ill-Timed Fake Handshake",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/Screenshot-2024-11-11-at-8.45.15 AM.png"
        },
        {
          "id": "https://defector.com/?p=172864",
          "author": "Maitreyi Anantharaman",
          "description": "Here’s a picture perfect Monday crossword for you. This week's puzzle was constructed by Will Nediger and edited by Hoang-Kim Vu. Will is a crossword constructor from London, Ontario who uses the nom de plume Bewilderingly (an anagram of \"by Will Nediger\").\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE.",
          "link": "https://defector.com/the-crossword-nov-11-paintball",
          "publishedOn": "2024-11-11T16:00:00.000Z",
          "wordCount": 4606,
          "title": "The Crossword, Nov. 11: Paintball",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2149316138.jpg"
        },
        {
          "id": "https://defector.com/?p=172880",
          "author": "Ray Ratto",
          "description": "Our NBA Injury Of The Day is brought to you by the G League. Eventually, All You'll Have Left Is Us.\nToday's IOTD is Chet Holmgren's fractured pelvis, which given that he just played in his 100th career NBA game Friday night almost sounds like he is using his grandfather's bones to carry his skin. He contested an Andrew Wiggins shot less than six minutes into Sunday's early season marquee stealer between Golden State and Oklahoma City and fell hard to the floor, limped off, and won't even be evaluated again before mid-January at the earliest. Now that we're all more seasoned in the way of evaluating injury evaluations, that means he won't be back until early February.",
          "link": "https://defector.com/the-nba-is-turning-into-one-big-hospital-ward",
          "publishedOn": "2024-11-11T15:55:13.000Z",
          "wordCount": 6677,
          "title": "The NBA Is Turning Into One Big Hospital Ward",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2183052399.jpg"
        },
        {
          "id": "https://defector.com/?p=172837",
          "author": "Barry Petchesky",
          "description": "A big, dense ball of gas that has fascinated mankind since the dawn of time, Jerry Jones is constantly innovating in the field of sabotaging his own team. Not content with letting paying customers watch Cowboys players poop, Jones has perfected a unique method of neutralizing players: blinding them with the awesome power of the Sun itself. Supervillain shit.\nA wide-open CeeDee Lamb tried and failed to catch a second-quarter touchdown pass in Sunday's 34-6 loss to the Eagles, and it's not really his fault, since he had no idea there was a pass at all. The Sun, low in the standard-time skies and blasting through the huge glass windows at the opposite end of Cowboys Stadium, made sure of that.",
          "link": "https://defector.com/jerry-jones-does-not-have-sufficient-respect-for-the-sun",
          "publishedOn": "2024-11-11T15:07:09.000Z",
          "wordCount": 7227,
          "title": "Jerry Jones Does Not Have Sufficient Respect For The Sun",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-1345896510-copy.jpg"
        },
        {
          "id": "https://defector.com/?p=172832",
          "author": "Lauren Theisen",
          "description": "If an accurate quarterback is a comfortable quarterback, then the Texans' pass rush made Jared Goff play like he was wearing cleats filled with Christmas tree needles for most of Sunday's night contest against the Lions. A one-loss signal-caller who entered Houston on a record pace for completion percentage, who hadn't thrown a ball to the wrong-colored jerseys since Week 3, looked without warning like a Lions QB from the old days, completing a season-low 50 percent of his 30 passes while tossing an increasingly confounding five interceptions as his boys trailed by as much as 23-7 in the second half. Still, all was forgiven in the end, as some Texan mistakes, a refocused offense, and a couple of clutch kicks all combined to deliver Detroit an inspiring comeback—26-23, with a walk-off field goal for the win. \nMost of what you need to know about Detroit's offense is this: In their one loss this season, Week 2 vs. Tampa Bay, Goff threw the ball 55 times. In all other games leading into their primetime clash against Houston, he'd maxed out at 28. The two prongs that allow this offense to plug into a power source are running backs David Montgomery and Jahmyr Gibbs, and their punishing runs behind a fearsome offensive line are what open up opportunities for Goff to find his receivers on play-action pass plays. But the Texans' pressure in the early going both suffocated the run and forced Goff into uncharacteristic errors. On the game's opening drive, an energetic deflection by Jalen Pitre created a Jimmie Ward interception, and with the Lions down 13-7 in the second, Denico Autry got his hand on Goff while he threw and sparked a tip frenzy that eventually led to another Texans field goal. Detroit proceeded to go three-and-out on each of the next two drives, as Houston's aggression disrupted Goff's rhythm and refused to give him clear looks at his targets.",
          "link": "https://defector.com/jared-goff-threw-five-interceptions-and-none-of-them-mattered",
          "publishedOn": "2024-11-11T14:00:44.000Z",
          "wordCount": 6668,
          "title": "Jared Goff Threw Five Interceptions And None Of Them Mattered",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2184097028.jpg"
        },
        {
          "id": "https://defector.com/?p=172810",
          "author": "Rachelle Hampton",
          "description": "FLATBUSH, BROOKLYN – It was 74 degrees on Election Day; I wore bike shorts on the two block walk to my polling site. The iced coffee in my hand proved unwieldy as I scanned my ballot, the poll worker’s hands fluttering nervously nearby. By the time I completed my civic duty, I still had most of my coffee left, along with a mostly free afternoon. When I messaged my editor to get a vibe check for the day, she told me “For election coverage, I think nobody has a sense of what to write right now but then it will get either pretty easy or pretty hard.” It was as true then as it is now. \nBut I had that strangely beautiful afternoon ahead of me. It was the kind of day that tricks everyone into believing they like summer in New York, except it was early November. My face and legs began to prick with heat as I settled onto a park bench and lit a joint. A pickup basketball game unfolded before me. A group of teens gossiped at a table nearby, shedding their black puffer jackets as the sun's warmth intensified. I remembered a wish I’d made earlier that year, that this fall would be the most beautiful I’d ever witnessed. I wondered if it was a curse. In a group chat with my best friends, one of them, a culture editor at the New Yorker, said, “I hate to say this and I want to be wrong but I kind of think he’s going to win.” My legs began to burn; I pulled a book out of my bag, my jacket over my knees.",
          "link": "https://defector.com/it-was-too-warm-this-week",
          "publishedOn": "2024-11-10T20:24:57.000Z",
          "wordCount": 7917,
          "title": "It Was Too Warm This Week",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2183907100.jpg"
        },
        {
          "id": "https://defector.com/?p=172813",
          "author": "David Roth",
          "description": "Everyone in the stadium at Texas Tech's loss to Colorado on Saturday would have understood why Tech head coach Joey McGuire took it upon himself to seize a microphone and begin yelling at the home fans near the beginning of the fourth quarter. They would have seen what people watching at home did not, which was those fans throwing a bunch of garbage from the seats and onto the field while officials reviewed a Colorado sack that involved both a facemask penalty that was not called and a targeting infraction that first was, and then was overturned. While Dean Blandino explained to the TV audience what was happening, his traditional more-in-sorrow-than-in-anger tone was overtaken by something that sounded more like a Muppet that had been stuffed into a dryer against its will. That was McGuire, and he wanted everyone to knock it off.\n\nhttps://www.youtube.com/watch?v=mTAMqZDCh1Y",
          "link": "https://defector.com/college-football-is-in-a-golden-age-of-throwing-garbage",
          "publishedOn": "2024-11-10T19:53:36.000Z",
          "wordCount": 6823,
          "title": "College Football Is In A Golden Age Of Throwing Garbage",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2178709817.jpg"
        },
        {
          "id": "https://defector.com/?p=172704",
          "author": "David Roth",
          "description": "In the absence of any actual recourse or meaningful agency where the material terms of your existence are concerned, you are permitted to create a reality of your own. You can't fully live there because there's nowhere to cook or sleep, but you can decorate it however you like. This space is not and cannot really ever be home, and also it is not even really safe—there are always sketchy guys letting themselves in and going through your stuff, grabbing at your wallet, constantly issuing what are very clearly threats in the form of insulting advice. There is a screen you can watch, but it mostly just shows commercials in a little box surrounded by tickers and betting lines and blaring chyrons lousy with incomprehensible AI babble, things that are shaped like words but are not. When the news …",
          "link": "https://defector.com/beyond-belief",
          "publishedOn": "2024-11-10T18:33:04.000Z",
          "wordCount": 9323,
          "title": "Beyond Belief",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2183189807.jpg"
        },
        {
          "id": "https://defector.com/?p=172805",
          "author": "David Roth",
          "description": "It is early enough in the college basketball season that nothing really feels consequential yet. Most of the programs that will matter in March are still tuning up teams that won't, to the point where the scoreboard has kind of a pleasant abstraction to it. For every early match-up between North Carolina and Kansas—it really happened, on Friday night; Kansas won, it was a fun game—there are two that mostly serve to remind you what a vast and varied country this is. Kentucky and Bucknell? Arizona and Old Dominion? Auburn, but also Vermont? Provided you don't look at the scores in those games, which were decided by a combined margin of 137 points in favor of the programs you'd expect, it's kind of nice to think about. But it's conceptual, in the ways that basketball games played before Thanksgiving tend to be.\nSo much of the season hasn't happened yet that the broader stakes are not yet set, but it seems safe to say that Auburn's convincing 74-69 road win over Houston on Saturday night will matter. Houston, which came into the game ranked fourth in the country, is very good; Auburn, which was ranked 11th, won by getting second-half buckets with striking efficiency against one of the best defensive teams in the country. What was abstract and unrepresentative about Auburn's season-opening thrashing of Vermont—and they won that game 94-43, so that's basically everything—looked sharper and more significant on Saturday. The performance vaulted the Tigers to the top spot on the KenPom rankings, just ahead of Houston; the inherently unstable admixture of transfer portal ronin and multi-star recruits, which could always become anything, looked like a (very good) basketball team.",
          "link": "https://defector.com/auburn-beat-each-other-up-before-they-beat-houston",
          "publishedOn": "2024-11-10T17:26:59.000Z",
          "wordCount": 6285,
          "title": "Auburn Beat Each Other Up Before They Beat Houston",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2183941514.jpg"
        },
        {
          "id": "https://defector.com/?p=172778",
          "author": "Billy Haisley",
          "description": "Stripped of context, visiting soccer fans getting drunk and causing havoc ahead of a big continental match in Europe would be so routine as to be almost unworthy of mention. But the hooligans in this instance were supporters of the Israeli soccer club Maccabi Tel Aviv, and the residents of Amsterdam weren't keen to their disruptive behavior, which meant that outlets like the New York Times and politicians like Joe Biden trained their focus on what happened and characterized it with their warped clarity.\nAfter a few hours and several substantial edits, the Times' article about Thursday's events has something approaching a comprehensive picture of what went down—though to get it, you still have to patch together a timeline from the facts scattered throughout the article. It all started on Wednesday, the day before the match, when a sizable number of Maccabi fans arrived into Amsterdam to watch their team take on Ajax in the Europa League. Coinciding with the Maccabi fans' arrival, pro-Palestinian activists assembled in Dam Square in protest of Israel's ethnic cleansing of Palestinians in Gaza.",
          "link": "https://defector.com/the-media-cant-figure-out-why-some-racist-israeli-soccer-hooligans-were-beaten-up",
          "publishedOn": "2024-11-08T23:35:36.000Z",
          "wordCount": 7654,
          "title": "The Media Can’t Figure Out Why Some Racist Israeli Soccer Hooligans Were Beaten Up",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2182889859.jpg"
        },
        {
          "id": "https://defector.com/?p=172621",
          "author": "Sabrina Imbler",
          "description": "It's a beautiful Friday in autumn and I am here to share some drama with all of you: the story of two big, beautiful female elephants whose long-simmering resentments boiled over into an all-out brawl over one of the most coveted gadgets (by pachyderm standards). Our story takes place at the Berlin Zoo, and names have not been anonymized to bring you the cold, hard truth of what can happen when two divas have a trunk-off.\nWithout any further ado, let me introduce you to the Asian elephants at the heart of this story.",
          "link": "https://defector.com/the-shower-beef-between-elephant-mary-and-elephant-anchali-explained",
          "publishedOn": "2024-11-08T18:52:27.000Z",
          "wordCount": 8501,
          "title": "The Shower Beef Between Elephant Mary And Elephant Anchali, Explained",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/Screenshot-2024-11-07-at-1.32.49 PM.png"
        },
        {
          "id": "https://defector.com/?p=172717",
          "author": "Dan McQuade",
          "description": "Going online used to be an event. My early online experience was probably similar to many of our old millennial readers like me: I went into the house’s Computer Room, booted up the PC, waited the agonizingly long time it took for it to load, then opened up a program that allowed me to connect, via a phone line, to The Internet. It was a process; there was a distinctive grating sound involved. It was much different than carrying around the whirr of the world in my pocket at all times. It is not a particularly memorable experience when I unlock my phone or open up my laptop. Going online as a kid was something I had to plan for; I even had limited hours of access! I think it was 10 a month when I started. I can’t even imagine spending such little time online.\nI don’t know if that’s good or bad. (It’s bad. It’s obviously bad.) I got online pretty early—I think it would’ve been 1994. We had AOL, which was basically online for babies. But I was 11, and so more or less a baby in computer years. I was so early on AOL that I was part of what became known as Eternal September: I was one of the early AOL users to begin looking at and posting in USENET newsgroups, messing up all the carefully cultivated norms that had been established over the years. I am pretty sure I had email alerts when I got a reply. All of which is to say that I have heard a voice from the computer tell me “you’ve got mail” more than I have heard basically any other sound in my life.",
          "link": "https://defector.com/youve-got-mail-reminds-me-of-a-specific-time-and-place",
          "publishedOn": "2024-11-08T18:31:51.000Z",
          "wordCount": 6825,
          "title": "“You’ve Got Mail” Reminds Me Of A Specific Time And Place",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/aol-people-magic-johnson-david-hasselhoff.jpg"
        },
        {
          "id": "https://defector.com/?p=172716",
          "author": "Israel Daramola",
          "description": "At some point early in the third quarter of Thursday night's great game between the Cincinnati Bengals and Baltimore Ravens, I began to believe that it just wasn't the Ravens' night. The game resembled many other Baltimore losses from the last couple years: bad defensive play, a lethargic offense, a bunch of unforced penalties. On top of that, star safety Kyle Hamilton went out with an ankle sprain and Lamar Jackson was stretching his apparently ailing throwing hand on the sidelines. It was 21-7 in the Bengals' favor at the time, and it seemed like things were only going to get worse.\nBut good teams make their own luck, and a fumble by the Bengals in Ravens territory set up a touchdown drive with yet another \"Lamar Jackson does something amazing against Cincinnati\" play, and also kick-started an onslaught in which the Ravens scored on every drive for the rest of the game. If not for some busted coverages from their highly bustable defense, the Ravens might have pulled away with the game the same way the Bengals threatened to at the beginning. But this is the AFC North, where things get wonky and close no matter what.",
          "link": "https://defector.com/going-for-two-is-always-the-correct-call",
          "publishedOn": "2024-11-08T17:52:22.000Z",
          "wordCount": 6236,
          "title": "Going For Two Is Always The Correct Call",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2183607890.jpg"
        },
        {
          "id": "https://defector.com/?p=172727",
          "author": "Chris Thompson",
          "description": "The early stages of each new NBA season are a time for widespread optimism and excitement. Many young players around the league will further establish themselves among the sport's elite: Paolo Banchero, Anthony Edwards, Victor Wembanyama, etc. Several more—your Chet Holmgrens, your Brandon Millers, your Evan Mobleys—will make the leap into stardom, or even superstardom, delighting their fans and promising years or even decades of excellence to come. Unfortunately, many other young NBA players are poop from the anus of fate. \nHere is that group:",
          "link": "https://defector.com/here-are-some-young-nba-players-who-are-butt-2",
          "publishedOn": "2024-11-08T17:28:08.000Z",
          "wordCount": 4820,
          "title": "Here Are Some Young NBA Players Who Are Butt",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2180381812.jpg"
        },
        {
          "id": "https://defector.com/?p=172719",
          "author": "Ray Ratto",
          "description": "We have a pretty good idea that neither the Baltimore Ravens nor Cincinnati Bengals are going to the Super Bowl, if only because they're both far too fun to survive the difficult December/January gauntlet of bad-weather games and injuries that help make football the cruel and brutal slog it is. We definitely know they won't be playing each other in the Super Bowl because someone foolishly shoved them into the same conference 54 years ago. That’s a particularly egregious example of long-term vision impairment, but it also is what it is.\nBut also this is where Roger Goodell, the ginger banker who minds the money for the 31 descendants of Scrooge McDuck who run the NFL, could deliver a bold new idea that, if he sells it right, will land well with everyone in our fractured and shattered land. Namely, he could see to it that the Ravens and Bengals somehow are planted in the Super Bowl anyway, either by public fiat or quiet connivance. Given that we as a nation will clearly buy anything we're told and nod in stupefaction, even a middling Svengali like Goodell could carry this off.",
          "link": "https://defector.com/america-needs-more-ravens-bengals-football",
          "publishedOn": "2024-11-08T16:22:23.000Z",
          "wordCount": 7267,
          "title": "America Needs More Ravens/Bengals Football",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2182856465.jpg"
        },
        {
          "id": "https://defector.com/?p=172631",
          "author": "Tom Ley",
          "description": "An electoral defeat like the one just suffered by Kamala Harris and the Democratic Party is guaranteed to keep the Recrimination Engine redlined throughout the weeks and months to come. Right now, it's impossible to turn on the news, read a mainstream liberal publication, or scroll through social media without immediately being confronted with someone's diagnosis of where it all went wrong for the Democrats, followed by a strident declaration about what needs to happen next.\nThe worst versions of this ritual are undertaken for the sake of self-preservation. Pundits and politicians are scrambling to define the terms of the defeat in whatever fashion will most easily allow them to hang onto their influence. This is why Bernie Sanders, who just spent the last four years enthusiastically stumping for Joe Biden and his administration, is suddenly reaming out the Democratic Party for having abandoned the working class. It's why a pundit like Matt Yglesias, a liberal in name only who just watched the Harris campaign completely eat shit while running on the kind of centrist policies he has long championed, has to quickly invent a new reality in which Harris lost because she somehow wasn't centrist enough.",
          "link": "https://defector.com/the-cowards-are-already-making-plans",
          "publishedOn": "2024-11-08T14:48:33.000Z",
          "wordCount": 7248,
          "title": "The Cowards Are Already Making Plans",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2167050215.jpg"
        },
        {
          "id": "https://defector.com/?p=172599",
          "author": "Lauren Theisen",
          "description": "More than Freddie Freeman or Francisco Lindor or those Yankee jamokes who tried to rip off Mookie Betts's hand, I will remember the 2024 MLB postseason for the commercials. Specifically, it was impossible to sit through any game across the entire month of October without being forced to watch multiple Donald Trump campaign ads that fear- and hate-mongered about trans people. Here's an example, if you somehow missed them:\n\nhttps://www.youtube.com/watch?v=3xzybGKwIGk",
          "link": "https://defector.com/end-mlb-pride-nights",
          "publishedOn": "2024-11-08T14:05:08.000Z",
          "wordCount": 7265,
          "title": "End MLB Pride Nights",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2158358826.jpg"
        }
      ]
    },
    {
      "title": "Joe's Weather Blog | In-depth Kansas City forecasts | FOX4KC",
      "feedUrl": "http://fox4kc.com/category/weather/weather-blog/feed/",
      "siteUrl": "https://fox4kc.com",
      "articles": [
        {
          "id": "https://fox4kc.com/?p=3726047",
          "author": "Joe Lauria",
          "description": "Got to say, watching the model data for next week is a walk on the wild side right now, and fascinating as well. This happens when the models are trying to figure something out, something that may be highly unusual, and as a result, they sort of freak out. Most models have some fascinating solutions, [...]",
          "link": "https://fox4kc.com/weather/weather-blog/joes-blog-weather-weirdness-alert-tue-11-12/",
          "publishedOn": "2024-11-12T15:25:58.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Weather weirdness alert (TUE-11/12)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11122.png?w=641",
            "type": "image/png",
            "length": "857417"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11122.png?w=641"
        },
        {
          "id": "https://fox4kc.com/?p=3725031",
          "author": "Joe Lauria",
          "description": "Our mild November will continue for the next week or so in the region as we're running 5.5° above average so far this month and with more days in the next 7 in the 60s for highs...it won't be all that bad around these parts. As a matter of fact since meteorological fall began on [...]",
          "link": "https://fox4kc.com/email-alerts/joes-weather-blog-email-alerts/joes-blog-could-winter-weather-arrive-in-10-days-mon-11-11/",
          "publishedOn": "2024-11-11T15:09:36.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Could winter weather arrive in 10 days? (MON-11/11)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/1117_665479.png?w=900",
            "type": "image/png",
            "length": "1770324"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/1117_665479.png?w=900"
        },
        {
          "id": "https://fox4kc.com/?p=3723046",
          "author": "Joe Lauria",
          "description": "Well clouds are going to be the thing for today, and while the chances of any meaningful rains will wait till early Saturday it appears, the skies won't be nearly as blue in the afternoon as they have been recently. The system coming our way is a big snowmaker across the Plains of CO into [...]",
          "link": "https://fox4kc.com/email-alerts/joes-weather-blog-email-alerts/joes-blog-fast-rains-and-mild-days-fri-11-8/",
          "publishedOn": "2024-11-08T15:43:35.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Fast rains and mild days (FRI-11/8)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/1189.png?w=859",
            "type": "image/png",
            "length": "894453"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/1189.png?w=859"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=830531",
          "author": "Anthony Franco",
          "description": "The Baseball Writers Association of America announced the finalists for the 2024 awards this evening. Bobby Witt Jr. was among the finalists for American League MVP, indicating he finished in the top three in the balloting. As Matt Eddy of Baseball America points out (on X), that’ll earn the Royals an extra pick after the first…",
          "link": "https://www.mlbtraderumors.com/2024/11/royals-receive-ppi-pick-for-witts-top-three-mvp-finish.html",
          "publishedOn": "2024-11-12T05:20:05.000Z",
          "wordCount": 4089,
          "title": "Royals Receive PPI Pick For Witt’s Top-Three MVP Finish",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/11/USATSI_24432710-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=830315",
          "author": "Mark Polishuk",
          "description": "With Michael Wacha retained on a three-year deal worth at least $51MM, “we don’t expect to be in the market for a starter moving forward.  We’re going to focus on some other things,” Royals general manager J.J. Picollo told MLB.com’s Maria Guardado and other reporters during the GM Meetings.  Picollo cited the projected top five…",
          "link": "https://www.mlbtraderumors.com/2024/11/al-central-notes-royals-pitching-rodriguez-manning.html",
          "publishedOn": "2024-11-09T23:17:18.000Z",
          "wordCount": 4055,
          "title": "AL Central Notes: Royals Pitching, Rodriguez, Manning",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/11/MattManning-2024-1024x682.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=830220",
          "author": "Steve Adams",
          "description": "The Royals were the surprise spender of the 2023-24 offseason, putting down a combined $110.5MM on eight free agents: Seth Lugo, Michael Wacha, Hunter Renfroe, Chris Stratton, Will Smith, Adam Frazier, Garrett Hampson and Austin Nola. Several of the moves didn't pan out, but the ones that did paid of in spades. Lugo and Wacha…",
          "link": "https://www.mlbtraderumors.com/2024/11/why-the-royals-should-be-primed-for-another-big-offseason.html",
          "publishedOn": "2024-11-08T22:35:58.000Z",
          "wordCount": 3598,
          "title": "Why The Royals Should Be Primed For Another Big Offseason",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/06/jj-picollo-royals-general-manager-1024x683.jpg"
        }
      ]
    },
    {
      "title": "local food",
      "feedUrl": "https://www.kcur.org/tags/local-food.rss",
      "siteUrl": "https://www.kcur.org/tags/local-food",
      "articles": [
        {
          "id": "https://www.kcur.org/arts-life/2024-11-09/kansas-city-southern-food-restaurants-soul-cooking",
          "author": "Shannon Carpenter",
          "description": "Smack in the middle of the country, Kansas City is a melting pot of different cultures and cuisines — especially soul food. At this restaurants, there's plenty to enjoy with the big flavor, and portions, of Southern comfort cooking.",
          "link": "https://www.kcur.org/arts-life/2024-11-09/kansas-city-southern-food-restaurants-soul-cooking",
          "publishedOn": "2024-11-09T10:00:00.000Z",
          "wordCount": 3478,
          "title": "Here are Kansas City's best restaurants for Southern comfort cooking and soul food",
          "imageUrl": "https://npr.brightspotcdn.com/dims4/default/16078f6/2147483647/strip/true/crop/3936x2066+0+75/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F47%2F9d%2F318e27874934994736240c1686a2%2Fandy-fluet-hkltcznnp9u-unsplash.jpg"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}