{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": []
    },
    {
      "title": "LinuxLinks",
      "feedUrl": "https://www.linuxlinks.com/feed/",
      "siteUrl": "https://www.linuxlinks.com/",
      "articles": [
        {
          "id": "https://www.linuxlinks.com/?p=140092",
          "author": "Steve Emms",
          "description": "vim-tree integrates good old tree into Vim and Nvim for all common operating systems. \nThe post vim-tree – use tree for quick navigation appeared first on LinuxLinks.",
          "link": "https://www.linuxlinks.com/vim-tree-quick-navigation/",
          "publishedOn": "2024-12-27T13:05:21.000Z",
          "wordCount": 4438,
          "title": "vim-tree – use tree for quick navigation",
          "imageUrl": "https://www.linuxlinks.com/wp-content/uploads/2023/04/monitor-watch.png"
        },
        {
          "id": "https://www.linuxlinks.com/?p=97150",
          "author": "Steve Emms",
          "description": "Here are our favorite TypeScript-based web content management systems. They are all free and open source software.\nThe post 12 Best Free and Open Source TypeScript-Based Web Content Management Systems appeared first on LinuxLinks.",
          "link": "https://www.linuxlinks.com/best-free-open-source-typescript-based-web-content-management-systems/",
          "publishedOn": "2024-12-27T06:11:29.000Z",
          "wordCount": 4299,
          "title": "12 Best Free and Open Source TypeScript-Based Web Content Management Systems",
          "imageUrl": "https://www.linuxlinks.com/wp-content/uploads/2020/10/web-content-management-systems.jpg"
        },
        {
          "id": "https://www.linuxlinks.com/?p=140063",
          "author": "Steve Emms",
          "description": "logseq is a privacy-first, open-source knowledge management and note-taking software designed to enhance productivity\nThe post Logseq – privacy-first platform for knowledge management and collaboration appeared first on LinuxLinks.",
          "link": "https://www.linuxlinks.com/logseq-privacy-first-platform-knowledge-management-collaboration/",
          "publishedOn": "2024-12-26T07:01:14.000Z",
          "wordCount": 4533,
          "title": "Logseq – privacy-first platform for knowledge management and collaboration",
          "imageUrl": "https://www.linuxlinks.com/wp-content/uploads/2020/03/business-woman-writing-notepad-with-pen-office.jpg"
        },
        {
          "id": "https://www.linuxlinks.com/?p=139997",
          "author": "Steve Emms",
          "description": "Merry Christmas and a Happy New Year from everyone at LinuxLinks.\nThe post Season’s Greetings from LinuxLinks appeared first on LinuxLinks.",
          "link": "https://www.linuxlinks.com/seasons-greetings-linux/",
          "publishedOn": "2024-12-25T08:41:43.000Z",
          "wordCount": 3954,
          "title": "Season’s Greetings from LinuxLinks",
          "imageUrl": "https://www.linuxlinks.com/wp-content/uploads/2022/12/christmas-new-year-holiday-background.jpg"
        },
        {
          "id": "https://www.linuxlinks.com/?p=139976",
          "author": "Luke Baker",
          "description": "Parabolic is a Qt and GTK-based utility which is a frontend for yt-dlp, a feature-rich audio/video downloader.\nThe post Parabolic – tool to download web video and audio appeared first on LinuxLinks.",
          "link": "https://www.linuxlinks.com/parabolic-tool-download-web-video-audio/",
          "publishedOn": "2024-12-24T14:47:01.000Z",
          "wordCount": 4228,
          "title": "Parabolic – tool to download web video and audio",
          "imageUrl": "https://www.linuxlinks.com/wp-content/uploads/2020/08/Annie-Download.png"
        },
        {
          "id": "https://www.linuxlinks.com/?p=140012",
          "author": "Steve Emms",
          "description": "Please complete the form if you'd like us to add an open source program to our compilations.\nThe post Help Our Site: Suggest an Open Source Program appeared first on LinuxLinks.",
          "link": "https://www.linuxlinks.com/suggest-open-source-program/",
          "publishedOn": "2024-12-24T13:51:50.000Z",
          "wordCount": 3123,
          "title": "Help Our Site: Suggest an Open Source Program",
          "imageUrl": "https://www.linuxlinks.com/wp-content/uploads/2023/11/linux-wordcloud3.png"
        },
        {
          "id": "https://www.linuxlinks.com/?p=139971",
          "author": "Steve Emms",
          "description": "Microsoft Calendar is a personal calendar application which offers synchronization with various calendar services. We recommend the best free and open source alternatives.\nThe post Best Free and Open Source Alternatives to Microsoft Calendar appeared first on LinuxLinks.",
          "link": "https://www.linuxlinks.com/best-free-open-source-alternatives-microsoft-calendar/",
          "publishedOn": "2024-12-23T13:31:02.000Z",
          "wordCount": 5033,
          "title": "Best Free and Open Source Alternatives to Microsoft Calendar",
          "imageUrl": "https://www.linuxlinks.com/wp-content/uploads/2021/08/Open-Source-Alternatives-Microsoft.jpg"
        },
        {
          "id": "https://www.linuxlinks.com/?p=139967",
          "author": "Steve Emms",
          "description": "Hop is a terminal based file explorer designed to be fast, simple and user friendly. Hop runs on any operating system.\nThe post Hop – terminal based file explorer appeared first on LinuxLinks.",
          "link": "https://www.linuxlinks.com/hop-terminal-based-file-explorer/",
          "publishedOn": "2024-12-23T11:48:47.000Z",
          "wordCount": 4349,
          "title": "Hop – terminal based file explorer",
          "imageUrl": "https://www.linuxlinks.com/wp-content/uploads/2023/04/monitor-watch.png"
        },
        {
          "id": "https://www.linuxlinks.com/?p=139962",
          "author": "Steve Emms",
          "description": "Pages CMS is a content management system for GitHub. It is well suited for static site generators (e.g. Jekyll, Next.js, VuePress, Hugo).\nThe post Pages CMS – content management system for static site generators appeared first on LinuxLinks.",
          "link": "https://www.linuxlinks.com/pages-cms-content-management-system/",
          "publishedOn": "2024-12-23T07:39:06.000Z",
          "wordCount": 4414,
          "title": "Pages CMS – content management system for static site generators",
          "imageUrl": "https://www.linuxlinks.com/wp-content/uploads/2020/10/web-content-management-systems.jpg"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "http://xkcd.com/rss.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/3029/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/3029/",
          "publishedOn": "2024-12-25T05:00:00.000Z",
          "wordCount": 206,
          "title": "Sun Avoidance",
          "imageUrl": "https://imgs.xkcd.com/comics/sun_avoidance_2x.png"
        },
        {
          "id": "https://xkcd.com/3028/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/3028/",
          "publishedOn": "2024-12-23T05:00:00.000Z",
          "wordCount": 206,
          "title": "D Roll",
          "imageUrl": "https://imgs.xkcd.com/comics/dnd_roll_2x.png"
        }
      ]
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=176452",
          "author": "Alex Sujong Laughlin",
          "description": "Though neither of us were alive during Jimmy Carter’s presidency, when the weather gets cold, my partner and I love to recite to each other in cartoonish voices, “Do what I do: wear a sweater!” I’m not actually sure if Carter ever said these exact words (I’m not finding it in the transcript of his 1977 sweater speech), but they are a potent reminder: In the cold months, your clothes are meant to keep you warm. \nLast year, a piece by Amanda Mull set off weeks of discourse about why sweaters are such poor quality these days. For most of my life, I wore garbage sweaters that barely kept me warm. I’m sure you know this experience, too. The affordable, accessible options are generally so terrible that it’s possible that the majority of sweaters many of us have worn in our lives have been acrylic or some other synthetic material. It's likely many people don’t know how nice and warm it feels to wear a sweater made from materials that aren't garbage.",
          "link": "https://defector.com/how-to-buy-a-sweater-that-doesnt-suck",
          "publishedOn": "2024-12-27T14:05:41.000Z",
          "wordCount": 10891,
          "title": "How To Buy A Sweater That Doesn’t Suck",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-1417178020.jpg"
        },
        {
          "id": "https://defector.com/?p=177161",
          "author": "David Roth",
          "description": "You know how it is when you're starting a new job. There are new rules and systems to figure out, a new overall cadence and a bunch of new people, and some number of other, stranger, newer things specific to that workplace that you can't really know about going in. When I was hired at the old site back in 2017, I had been through a couple of previous staff writing jobs and a great many recurrent freelance jobs and more get-me-over bullshit office gigs than I care to remember, and while I believed that would prepare me somewhat for the new job—and it did, sort of—I knew there would be stuff that I did not know how to do. \nThat was years ago, now, and I remember worrying at the time that I was too old for it. I don't know that I have ever felt it more acutely than I did during my first appearance on the old podcast, where I joined Drew and Tim Marchman for a spirited round of The Price Is Right: Williams-Sonoma Edition. All those jobs I'd had and lost, the content management systems and corporate cultures I'd sort of figured out, the various flavors of shitty media ownership I'd endured—none of that was any help to me when I was tasked with guessing the price of a champagne saber from that year's catalog. I don't remember how wrong I was with my guess, but I do remember that I have seldom been more wrong about anything.",
          "link": "https://defector.com/the-fellowship-of-the-champagne-saber",
          "publishedOn": "2024-12-26T19:52:22.000Z",
          "wordCount": 6696,
          "title": "The Fellowship Of The Champagne Saber",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-161088387.jpg"
        },
        {
          "id": "https://defector.com/?p=177235",
          "author": "Patrick Redford",
          "description": "Basketball fans and league officials who were wringing their hands about the NFL encroaching on Christmas woke up on Wednesday to quite the treat. Knicks-Spurs was an incredible opener to an altogether great showcase day of hoops, largely because Victor Wembanyama played one of his best games as an NBA player. In his second game in Madison Square Garden (his first was only his eighth game as a Spur), Wemby went for 42 points, 18 rebounds, six made three-pointers, and four assists. He also had four blocks, though there's no point in emphasizing those, as he's averaging four per game anyway and he had a 10-block game and a seven-block half in his two previous games.\nMy favorite thing about a Wembanyama highlight is picking out where he is when there's a cut in the video, as it's usually much further out or in a more compromising position than anyone ever is in a clip where they will soon be highlighted. There he is, two players away out near the perimeter as OG Anunoby winds up for a doomed layup attempt, only for him to scythe over and erase it; there he is, lurking near the logo as Tre Jones pulls a three, only to zip in and dunk back the rebound.",
          "link": "https://defector.com/victor-wembanyama-crafted-a-fittingly-weird-christmas-masterpiece",
          "publishedOn": "2024-12-26T19:21:51.000Z",
          "wordCount": 6610,
          "title": "Victor Wembanyama Crafted A Fittingly Weird Christmas Masterpiece",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2191400656.jpg"
        },
        {
          "id": "https://defector.com/?p=177042",
          "author": "Defector Staff",
          "description": "This is what the Defector staff enjoyed reading in 2024.",
          "link": "https://defector.com/the-best-things-we-read-in-2024",
          "publishedOn": "2024-12-26T18:57:10.000Z",
          "wordCount": 21448,
          "title": "The Best Things We Read In 2024",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-3270309.jpg"
        },
        {
          "id": "https://defector.com/?p=177219",
          "author": "Ray Ratto",
          "description": "Draymond Green…we'll wait a moment while you readjust your underwear…is the last living pre-modern basketball player, a time-traveler from the era when \"everyone is just collateral damage to the greater goal\" was the predominant philosophy who has arrived in our moment to do the absolute most. Which is why his little tribute to the 1970s, and to a handful of defunct WWE finishing moves, hit the Christmas basketball crowd so intensely. In executing and selling his inspired and illegal double-takedown of two Los Angeles Lakers, Green managed to commit four callable fouls on the same play. It was remarkable, but also just part of a full evening's work on a full day of quality basketball. And he still managed to fit in his normal output—no discernible offense, 10 rebounds, and a technical foul for complaining to referees—in that purely Greenian way of his.\nThe “four callable fouls” thing is particularly instructive where Green’s eye to the past is concerned. You can almost see Dalton Knecht and Rui Hachimura sensing that something is about to go very amiss for both of them. They both can see that Green is between them, but their main attention is on the rebound they seek. You can definitely see Scott Foster, the referee you love to hate mostly because he's probably the only referee whose name you know, already putting his whistle in his mouth; he's seen this general dynamic since Green became a pro and has the requisite Pavlovian response. None of this really snuck up on anyone, and yet it arrived as a surprise all the same.",
          "link": "https://defector.com/draymond-green-is-still-innovating",
          "publishedOn": "2024-12-26T18:12:17.000Z",
          "wordCount": 7017,
          "title": "Draymond Green Is Still Innovating",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2191427276.jpg"
        },
        {
          "id": "https://defector.com/?p=177197",
          "author": "Chris Thompson",
          "description": "The Philadelphia 76ers began the season in the toilet, but appear now to have slithered out of the bowl. They have the best record in the NBA since Thanksgiving, in a tie with three teams whose bonafides are for the most part pretty well established. All it took was a run of schedule heavy on the league's bozos—the 76ers have played (and beaten) the Charlotte Hornets three times in 18 days—and a little bit of musculoskeletal good fortune, and today the 76ers find themselves just a game out of the Eastern Conference play-in. The cruddiness of the East makes this not too much of an accomplishment, but the 76ers still hope to make something of this season, and a grip on the back of a breathtakingly sad playoff pack at least gives them reason to keep struggling upward.\nWednesday's 118-114 road win over the festively clad Boston Celtics was a good one. This was just the sixth time all season that Philadelphia has had all of Joel Embiid, Paul George, and Tyrese Maxey in the lineup at the same time, and the 76ers are now a respectable 4–2 with their core intact. This is not yet the world-destroying Big Three anyone might've imagined, in part because George and Embiid are still working their way into rhythm and shape, but in 107 minutes of shared court-time the trio has eked out a narrow positive net rating, by holding opposing teams to a suffocated 99.6 points per 100 possessions. Eventually one or more of these very good basketball players will remember how to shoot, and then Philadelphia's important lineups will also thrive, or at least stink a lot less, on the offensive end. For now it's enough to tread water with hellacious defense.",
          "link": "https://defector.com/the-76ers-are-showing-signs-of-life-amid-brushes-with-death",
          "publishedOn": "2024-12-26T17:29:21.000Z",
          "wordCount": 7213,
          "title": "The 76ers Are Showing Signs Of Life Amid Brushes With Death",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2191417032.jpg"
        },
        {
          "id": "https://defector.com/?p=177198",
          "author": "Barry Petchesky",
          "description": "Netflix viewer statistics are notorious lies. Not just in the Nielsen \"we're doing a lot of extrapolating\" sense, nor even generous but plausible exaggerations. The data is wholly private, the methods proprietary, and the numbers they do choose to leak are immediately laughed down as mathematically absurd. All streamers play fast and loose with this stuff, but Netflix is particularly egregious. They have their ways: When you watch five minutes of a movie and turn it off because it's ass, Netflix multiplies that five minutes by whatever it needs to achieve the total runtime, then by the 16 people who no doubt live in your household, and that's how we end up with things like Red Notice being the most-watched movie on Earth, ever.\nThe NFL likes to brag about its ratings. This is understandable, because live sports are the only thing that gets decent broadcast ratings anymore, and the NFL is a juggernaut even in that rare air. So when NFL games made their Netflix debut on Christmas Day with a pair of boring blowouts, you knew the bragging would reach new heights. And because there's no third party actually tracking or verifying the numbers, they could just make up some shit. That is presumably what they did, when NFL Media shared some impressive metrics not long after Chiefs-Steelers ended, but they flew a little too close to the sun.",
          "link": "https://defector.com/netflix-nfl-viewership-claims-threaten-several-international-incidents",
          "publishedOn": "2024-12-26T16:40:31.000Z",
          "wordCount": 6198,
          "title": "Netflix NFL Viewership Claims Threaten Several International Incidents",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187871483.jpg"
        },
        {
          "id": "https://defector.com/?p=177177",
          "author": "Victoria Zeller",
          "description": "Drew Magary’s Thursday Afternoon NFL Dick Joke Jamboroo runs every Thursday at Defector during the NFL season. This week's guest host is Victoria Zeller. Her debut novel, One of the Boys, is set to be released on May 13, 2025 by Levine Querido\nAbout a year ago now, I decided I wanted to bake bread.\nI certainly did not grow up a baker, or even a cook at all: my skills in the kitchen stayed at the young bachelor-standard Kraft Mac/frozen pizza capacity into my early 20s. While my younger sisters were pressed into service at a young age, churning out cookies and brownies and birthday cakes with my mother, I was never called to duty. I was a boy, my sisters were girls. I could try to turn this into a moment of Injustice, yet another example of Young Victoria having a girlhood she didn’t know she wanted preemptively withheld from her; in reality, I was extremely fucking lazy. If I had been invited to participate, I would’ve said “no” and retreated to my room to play Madden.",
          "link": "https://defector.com/go-for-it",
          "publishedOn": "2024-12-26T15:56:07.000Z",
          "wordCount": 18184,
          "title": "Go For It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2190607781.jpg"
        },
        {
          "id": "https://defector.com/?p=176916",
          "author": "Defector Staff",
          "description": "This is what the Defector staff enjoyed listening to this year.",
          "link": "https://defector.com/the-best-things-we-heard-in-2024",
          "publishedOn": "2024-12-26T13:58:23.000Z",
          "wordCount": 24701,
          "title": "The Best Things We Heard In 2024",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-514895790-1.jpg"
        },
        {
          "id": "https://defector.com/?p=177081",
          "author": "John Saward",
          "description": "This article was originally published on Flaming Hydra on Dec. 4. If you like it, we encourage you to visit their site and subscribe.\nFor so long I avoided It’s a Wonderful Life—it was too bruising, its redemptions too meager for the guy I was in my 20s, with all those grand plans of his own. I always found myself wishing for more for poor George Bailey, I guess is what I’m saying. Trampled by bad luck, by his own virtue and his begrudging loyalties, stalled out at every moment of departure and always left to clean up someone else’s mess. And worst of all, tormented by the horrible Mister Potter, who creaks through Bedford Falls threatening foreclosures and buyouts in that blubbery old whine of his. I saw Potter as a special kind of real-world doom—a man so powerful you cannot fight against him, only beg him for mercy, as George’s father had done before him and as his children almost certainly will after. The Potters won’t live forever, but there is always another one on their way, with the cops and the bank examiner all working for them too. They weren’t going anywhere.",
          "link": "https://defector.com/how-can-a-life-be-wonderful",
          "publishedOn": "2024-12-25T14:39:05.000Z",
          "wordCount": 8736,
          "title": "How Can A Life Be Wonderful?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-527186178.jpg"
        },
        {
          "id": "https://defector.com/?p=175016",
          "author": "Barry Petchesky",
          "description": "Do you realize that this is the 12th year we've run this series? Time really flies when you don't have something lodged up your butt. But for those of you who do, read on to see if you made this year's list of the weirdest stuff that entered America's orifices. If not, there's always next year.\nAll reports are taken from the U.S. Consumer Product Safety Commission's database of emergency room visits, all descriptions are verbatim, and all the entries below involved some very poor decisions.",
          "link": "https://defector.com/what-did-we-get-stuck-in-our-rectums-last-year-5",
          "publishedOn": "2024-12-25T14:00:00.000Z",
          "wordCount": 5861,
          "title": "What Did We Get Stuck In Our Rectums Last Year?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2020/12/1_ca_F5XXjQaVWtkJvGSUYvw.jpg"
        },
        {
          "id": "https://defector.com/?p=177048",
          "author": "Kelsey McKinney",
          "description": "It’s easy to hate Blake Lively. She's beautiful. She's tall. Her hair is so lush. Her skin is so smooth. She's married to a damn Marvel actor, and they have beautiful children. Her best friend is Taylor Swift. In a world of demure, close-lipped smirks, Lively has a megawatt full-teeth smile. She was born in Los Angeles and raised by a talent scout and an actor. She was a cheerleader in high school. Relative to a celebrity like Jennifer Lawrence, Lively does not seem particularly approachable or down-to-earth; she seems much more like a goddess sent to give you body dysmorphia. She's the popular girl, and always has been. But those are all reasons based in envy.\nThen, of course, there are the real reasons to hate her. Lively has been in the spotlight since Sisterhood of the Traveling Pants premiered in 2005, almost two decades ago. That's a lifetime in Hollywood, and plenty of time to make mistakes that everyone can see. And Lively's actual mistakes have been bad ones. In 2012, she married Ryan Reynolds on a plantation in South Carolina, a decision she apologized for eight years later in 2020. This was, somehow, not a one-off; in 2014, Lively launched a (very short-lived) online lifestyle magazine called Preserve, which included a spread titled “Allure of Antebellum.” As Kara Brown wrote for Jezebel at the time, “Anyone who romanticizes our nation's Antebellum period as some sort of marker of style and taste is definitely white and probably an asshole.”",
          "link": "https://defector.com/blake-lively-justin-baldoni-mess-narratives",
          "publishedOn": "2024-12-24T15:05:27.000Z",
          "wordCount": 13561,
          "title": "The Narrative Is All That Matters",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2165930059.jpg"
        },
        {
          "id": "https://defector.com/?p=177152",
          "author": "Tom Ley",
          "description": "Happy holidays, everyone! Feel free to hang out here and exchange glad tidings with your fellow commenters while the site enters a bit of a slumber for the next few days. \nDon't worry, there will still be some blogs under the tree.",
          "link": "https://defector.com/be-merry-in-the-christmas-open-thread",
          "publishedOn": "2024-12-24T14:32:50.000Z",
          "wordCount": 4663,
          "title": "Be Merry In The Christmas Open Thread",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2191089109.jpg"
        },
        {
          "id": "https://defector.com/?p=176461",
          "author": "Sabrina Imbler",
          "description": "This is the time of year when the best, biggest, and most ambitious movies come out. Not Oscar season, but rather that stretch when the halls of streaming services are decked with the brightly lit, thinly disguised advertisements that are the year's new Christmas movies. There are more than 100 new Christmas films to watch this holiday season, and whether that number horrifies or excites you depends upon how much of a freak you are for the festive. Sabrina is proud to say they are a real Christmas freak, and this year they asked some of their colleagues to watch some of the most, uh, available new holiday movies. The final movie in our lineup is The Merry Gentlemen, Netflix's answer to the longstanding question: How will Chad Michael Murray withstand the ravages of time?\nSabrina: Well, well, well. It’s come to this: the finale of Defector Watches A Christmas Movie. Thank you both for experiencing this movie with me, and thank you Justin for shepherding this series. Let’s get right to it: This movie operates on the premise that a big-city girl must help save her parent’s local small-town nightclub. Did your hometowns have a local nightclub? Did you ever go there, and would you consider it worth saving?",
          "link": "https://defector.com/defector-watches-a-christmas-movie-the-merry-gentlemen",
          "publishedOn": "2024-12-24T14:24:31.000Z",
          "wordCount": 16377,
          "title": "Defector Watches A Christmas Movie: ‘The Merry Gentlemen’",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/Screenshot-2024-12-19-at-10.27.29 AM.png"
        },
        {
          "id": "https://defector.com/?p=177133",
          "author": "Tom Scocca",
          "description": "On Wednesday of last week, the richest person in the world seized control of the government of the United States. It's going to be helpful, over the next four years, to note down the events that happen, when they happen, before the next events come along.",
          "link": "https://defector.com/elon-musk-takes-what-he-can-get",
          "publishedOn": "2024-12-23T20:17:53.000Z",
          "wordCount": 8897,
          "title": "Elon Musk Takes What He Can Get",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/trump-musk-vance.jpeg"
        },
        {
          "id": "https://defector.com/?p=177064",
          "author": "Maitreyi Anantharaman",
          "description": "Rachelle Hampton: Can I just say I’m so honored to be taking part in my very first DRAB? This was one of the series I was most jealous of before I joined Defector because it seemed so fun. That maybe makes it even funnier that the very first book I suggested (and the one we ended up choosing) is the biggest bummer DRAB has ever seen.\nI first came across Young Men And Fire in a McNally Jackson earlier this year; I remember my attention being caught by the promise of an in-depth look at the Smokejumpers, who I’d been sort of lowkey obsessed with since reading Nora Roberts’ Chasing Fire. I’d never heard of the Mann Gulch fire or Norman Maclean really, though I realized after we picked this book that he also wrote A River Runs Through It, which I’ve seen the movie adaptation of. All to say, I was pretty stoked when y’all agreed to read it. What piqued y’alls interest?",
          "link": "https://defector.com/racing-with-mortality-in-norman-macleans-young-men-and-fire",
          "publishedOn": "2024-12-23T19:31:11.000Z",
          "wordCount": 14652,
          "title": "Racing With Mortality In Norman Maclean’s ‘Young Men And Fire’",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-615229024.jpg"
        },
        {
          "id": "https://defector.com/?p=176589",
          "author": "Defector Staff",
          "description": "This is what the Defector staff saw and enjoyed this year.",
          "link": "https://defector.com/the-best-things-we-saw-in-2024",
          "publishedOn": "2024-12-23T17:37:45.000Z",
          "wordCount": 22511,
          "title": "The Best Things We Saw In 2024",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/year-in-review-talking-pictures-best-things-we-saw.jpg"
        },
        {
          "id": "https://defector.com/?p=177051",
          "author": "Luis Paez-Pumar",
          "description": "Let's start with a flaw. Liverpool's defense is still the best in the Premier League, having allowed 13 goals in 15 matches entering Sunday's trip to North London for a match against often-feisty but currently-shambolic Tottenham Hotspur. Virgil van Dijk is back to world-beating form, and his various partners in the center—often Ibrahima Konaté, though not for the past two months, thanks to a knee injury—have been competent enough to lead the league in goals against. However, there have been some cracks showing, and Liverpool's two previous league matches saw that dominant defense give up five combined goals to Newcastle and Fulham.\nBoth of those matches ended in draws, only the third and fourth blemishes in Liverpool's league season so far, and though it is unfair to put the entirety of the blame on the defense, it certainly didn't help. And so, if one were to look at just how many goals Liverpool gave up on Sunday against Tottenham, it would read like another bad day at the office for van Dijk and co. Thankfully, soccer is played in both directions, and Tottenham's three goals on its home ground only felt like feeble attempts at holding off the siege that was Liverpool's high-line-abusing attack, which scored six goals but probably could have scored 10.",
          "link": "https://defector.com/liverpool-has-the-premier-league-in-a-stranglehold",
          "publishedOn": "2024-12-23T16:39:20.000Z",
          "wordCount": 8359,
          "title": "Liverpool Has The Premier League In A Stranglehold",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2191108672.jpg"
        },
        {
          "id": "https://defector.com/?p=177052",
          "author": "Maitreyi Anantharaman",
          "description": "Get your head in the game—it's time to solve the Monday crossword. This week’s puzzle was constructed by Jesse Cohn and Hoang-Kim Vu. Jesse, an oncology consultant, lives in Austin, Texas with his family and his derpy dog, and has been dunked on by two NBA players. Kim works in global public health in Washington, D.C., and is a member of the crossword editing team at Defector and AVCX. His puzzles have appeared in numerous outlets, including the New York Times, Los Angeles Times, and USA Today. \nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE.",
          "link": "https://defector.com/the-crossword-dec-23-parting-ways",
          "publishedOn": "2024-12-23T16:00:00.000Z",
          "wordCount": 4911,
          "title": "The Crossword, Dec. 23: Parting Ways",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-176547418.jpg"
        },
        {
          "id": "https://defector.com/?p=177045",
          "author": "Owen Lewis",
          "description": "Tyson Fury once broke an opponent’s spirit with a story. He was set to fight Wladimir Klitschko, who’d been in possession of at least one major heavyweight belt for a full decade, looking near invincible throughout his run. Few expected Fury to do much before getting knocked out. Then, in a sit-down face-off, Fury recounted a tale of a long-ago training camp in which he outlasted Klitschko in a sauna, making it out to be a battle of wills. Just before Fury revealed that Klitschko departed the hot box first, Wlad gulped like somebody was holding him at gunpoint. Fury was equally effective in the ring, so bamboozling Klitschko with feints and twitches that the longtime champion seemingly forgot to throw punches. Fury won, then rubbed a tub of salt into the wound by serenading his wife with a harrowing version of Aerosmith’s “I Don’t Want To Miss a Thing.” Klitschko stood feet away, perhaps daydreaming of new career paths and better singers.\nFury figured never to meet an opponent he couldn’t out-talk. He approached the brash knockout artist Deontay Wilder with a furious torrent of psychological warfare, then knocked him out twice in their trilogy. He surely has said the word “dosser” more than any other boxer, or Earth resident. He could be at turns nasty, earnest, bigoted, kind, or silent, but he inevitably snuck into his foes’ heads and mangled their brains before he even started punching them.",
          "link": "https://defector.com/oleksandr-usyk-got-inside-tyson-furys-head",
          "publishedOn": "2024-12-23T15:25:20.000Z",
          "wordCount": 8900,
          "title": "Someone Got Inside Tyson Fury’s Head For A Change",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2190328811.jpg"
        },
        {
          "id": "https://defector.com/?p=176562",
          "author": "Defector Staff",
          "description": "These are the sports moments from 2024 that the Defector staff enjoyed.",
          "link": "https://defector.com/favorite-sports-moments-of-2024",
          "publishedOn": "2024-12-23T13:56:53.000Z",
          "wordCount": 25205,
          "title": "Defector’s Favorite Sports Moments Of 2024",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/year-in-review-interleague-game-best-sports-moment.jpg"
        }
      ]
    },
    {
      "title": "Joe's Weather Blog | In-depth Kansas City forecasts | FOX4KC",
      "feedUrl": "http://fox4kc.com/category/weather/weather-blog/feed/",
      "siteUrl": "https://fox4kc.com",
      "articles": [
        {
          "id": "https://fox4kc.com/?p=3769598",
          "author": "Joe Lauria",
          "description": "It's another murky and damp start to the day after Christmas in Kansas City. Periods of mist, drizzle, showers and a general fog are hanging around the region, and it's not going to change a lot over the next 36 hours or so until a system moves through tomorrow night. The good news is the [...]",
          "link": "https://fox4kc.com/weather/weather-blog/joes-blog-stuck-in-the-muck-thu-12-26/",
          "publishedOn": "2024-12-26T15:50:28.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Stuck in the muck (THU-12/26)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/12266.png?w=900",
            "type": "image/png",
            "length": "1108167"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/12266.png?w=900"
        },
        {
          "id": "https://fox4kc.com/?p=3769598",
          "author": "Joe Lauria",
          "description": "It's another murky and damp start to the day after Christmas in KC. Periods of mist, drizzle, showers and a general fog are hanging around the region and it's not going to change a lot over the next 36 hours or so until a system moves through tomorrow night. The good news is the weekend [...]",
          "link": "https://fox4kc.com/email-alerts/joes-weather-blog-email-alerts/joes-blog-stuck-in-the-muck-thu-12-26/",
          "publishedOn": "2024-12-26T15:50:28.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Stuck in the muck (THU-12/26)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/12266.png?w=900",
            "type": "image/png",
            "length": "1108167"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/12266.png?w=900"
        },
        {
          "id": "https://fox4kc.com/?p=3768510",
          "author": "Joe Lauria",
          "description": "Temperatures this month are trending a bit above average right now, and with the forecast for most of the rest of the month pretty mild, that will continue to grow to some degree over the next week or so. What has been interesting to me though is that we're losing out on our previous December [...]",
          "link": "https://fox4kc.com/weather/weather-blog/joes-blog-where-have-the-december-snows-gone-tue-12-24/",
          "publishedOn": "2024-12-24T15:25:00.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Where have the December snows gone? (TUE-12/24)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/Capture_da1a6d.png?w=900",
            "type": "image/png",
            "length": "2159380"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/Capture_da1a6d.png?w=900"
        },
        {
          "id": "https://fox4kc.com/?p=3768510",
          "author": "Joe Lauria",
          "description": "Temperatures this month are trending a bit above average right now...and with the forecast for most of the rest of the month pretty mild, that will continue to grow to some degree over the next week or so. What has been interesting to me though is that we're losing out on our previous December snows [...]",
          "link": "https://fox4kc.com/email-alerts/joes-weather-blog-email-alerts/joes-blog-where-have-the-december-snows-gone-tue-12-24/",
          "publishedOn": "2024-12-24T15:25:00.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Where have the December snows gone? (TUE-12/24)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/Capture_da1a6d.png?w=900",
            "type": "image/png",
            "length": "2159380"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/Capture_da1a6d.png?w=900"
        },
        {
          "id": "https://fox4kc.com/?p=3767671",
          "author": "Joe Lauria",
          "description": "The mild weather will continue for the rest of the year. There are signs of changes coming through to start 2025 and stronger signs of much colder air coming down from Canada and elsewhere to be a big player in returning to not only cold but occasional snow chances as well.",
          "link": "https://fox4kc.com/weather/weather-blog/joes-blog-mild-week-with-bigger-changes-ahead-mon-12-23/",
          "publishedOn": "2024-12-23T15:20:02.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Mild week with bigger changes ahead (MON-12/23)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/12237.png?w=900",
            "type": "image/png",
            "length": "1907445"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/12237.png?w=900"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": []
    },
    {
      "title": "local food",
      "feedUrl": "https://www.kcur.org/tags/local-food.rss",
      "siteUrl": "https://www.kcur.org/tags/local-food",
      "articles": [
        {
          "id": "https://www.kcur.org/podcast/up-to-date/2024-12-26/burek-cake-bosnian-bakery-kansas-city-northland",
          "author": "Claudia Brancart",
          "description": "Fatima Hodzic opened Burek and Cake just over two years ago. Since then, the tiny Bosnian bakery in the Northland has become a destination to gather over cakes, coffee, and bureks, a traditional Bosnian snack made with pastry dough and savory fillings.",
          "link": "https://www.kcur.org/podcast/up-to-date/2024-12-26/burek-cake-bosnian-bakery-kansas-city-northland",
          "publishedOn": "2024-12-26T10:01:00.000Z",
          "wordCount": 2266,
          "title": "Burek and Cake, a Bosnian bakery in Kansas City's Northland, makes each customer feel special",
          "imageUrl": "https://npr.brightspotcdn.com/dims4/default/75ba99f/2147483647/strip/true/crop/1600x840+0+114/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F49%2F50%2F9091f56a4dd6836fd6c6ad756645%2Fpics-1-of-1.jpg"
        }
      ]
    },
    {
      "title": "Flow State",
      "feedUrl": "https://www.flowstate.fm/feed",
      "siteUrl": "https://www.flowstate.fm",
      "articles": [
        {
          "id": "https://www.flowstate.fm/p/off-until-mon-16",
          "author": "Flow State",
          "description": "Flow State will be off for holiday break until Monday, 1/6/25.",
          "link": "https://www.flowstate.fm/p/off-until-mon-16",
          "publishedOn": "2024-12-25T05:07:08.000Z",
          "wordCount": null,
          "title": "Off until Mon, 1/6",
          "itunes": {},
          "enclosure": {
            "url": "https://substackcdn.com/image/fetch/w_256,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F06c6a312-26fb-4ce1-b27e-229a91b2b1e4_888x888.png",
            "length": "0",
            "type": "image/jpeg"
          },
          "imageUrl": "https://substackcdn.com/image/fetch/w_256,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F06c6a312-26fb-4ce1-b27e-229a91b2b1e4_888x888.png"
        },
        {
          "id": "https://www.flowstate.fm/p/flow-state-best-of-2024",
          "author": "Flow State",
          "description": "Here’s our list of our 50 favorite albums released in 2024.",
          "link": "https://www.flowstate.fm/p/flow-state-best-of-2024",
          "publishedOn": "2024-12-24T08:02:01.000Z",
          "wordCount": null,
          "title": "Flow State Best of 2024",
          "itunes": {},
          "enclosure": {
            "url": "https://api.substack.com/feed/podcast/152936885/d62d1eec6c73ba7f2843f67f045ae0c4.mp3",
            "length": "0",
            "type": "audio/mpeg"
          },
          "imageUrl": null
        },
        {
          "id": "https://www.flowstate.fm/p/guest-recs-from-illuminati-hotties",
          "author": "Sarah Tudzin",
          "description": "Today we have a guest recommendation from Sarah Tudzin, the American producer and frontwoman of illuminati hotties and author of IH In Motion. Her new album, POWER, is available now.",
          "link": "https://www.flowstate.fm/p/guest-recs-from-illuminati-hotties",
          "publishedOn": "2024-12-23T08:02:17.000Z",
          "wordCount": null,
          "title": "Guest rec from Illuminati Hotties",
          "itunes": {},
          "enclosure": {
            "url": "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe072ef63-13bd-4dec-99bf-467e5aa20769_2128x1106.png",
            "length": "0",
            "type": "image/jpeg"
          },
          "imageUrl": "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe072ef63-13bd-4dec-99bf-467e5aa20769_2128x1106.png"
        }
      ]
    },
    {
      "title": "Food & Drink Archives | The Pitch",
      "feedUrl": "https://www.thepitchkc.com/category/food-drink/feed/",
      "siteUrl": "https://www.thepitchkc.com/category/food-drink/",
      "articles": [
        {
          "id": "https://www.thepitchkc.com/?p=866040",
          "author": "Tiffany Watts",
          "description": "Made In Kc Cafe Taproom // Photo By Tiffany Watts Made In KC Cafe & Taproom In the heart of Downtown Kansas City, Made in KC Café & Taproom offers a little bit of everything—coffee, local craft drinks, and a welcoming space to gather. It’s a spot that brings together coffee lovers, craft beverage enthusiasts, and anyone looking for a...",
          "link": "https://www.thepitchkc.com/dish-drink-kc-made-in-kc-cafe-taproom-and-als-bar-grill/",
          "publishedOn": "2024-12-25T14:00:00.000Z",
          "wordCount": 2148,
          "title": "Dish & Drink KC: Lunch meetings at Made In KC Cafe and Al’s Bar & Grill",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/k/u/made-in-kc-cafe-taproom-photo-by-tiffany-watts-2.jpg"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}