{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": []
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=194777",
          "author": "Luis Paez-Pumar",
          "description": "Through two games at Euro 2025, Germany hasn't been the most impressive of top sides. The results flatter to deceive. After beating Poland 2-0 in the opener, Germany came back from a 1-0 deficit to beat Denmark 2-1, thereby qualifying for the knockout rounds. That's a tidy resume, even if neither Poland (27th FIFA rank) or Denmark (12th) are truly elite opposition, and there shouldn't be much to quibble from six points out of six, especially after Germany went out in the group stage of the 2023 World Cup. However, the specifics of how Germany is playing and its glaring weaknesses in defense might yet come back to bite the side as the competition gets tougher.\nStill, though, the way Germany came back to beat Denmark deserves some recognition, even if it wasn't free of controversy. In a way, a tough and sloppy match might have been what Germany needed to prove, to itself mostly, that it was no longer carrying an emotional albatross from the last World Cup, a process that began in earnest with an encouraging bronze medal at last summer's Olympics. The first-half one-two-three punch combination the Germans suffered might have sank them if the weight of disappointment still hung around their necks, but on Tuesday, it didn't.",
          "link": "https://defector.com/germany-has-been-good-enough-for-now",
          "publishedOn": "2025-07-09T18:32:42.000Z",
          "wordCount": 9226,
          "title": "Germany Has Been Good Enough, For Now",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2224226928.jpg"
        },
        {
          "id": "https://defector.com/?p=194806",
          "author": "Albert Burneko",
          "description": "When last we checked in on Grok, Twitter's supremely grating and corny embedded chatbot, it had spent an otherwise ordinary weekday in May attempting to impress upon Twitter users the seriousness of the supposed \"white genocide\" not actually happening in Elon Musk's homeland of South Africa, routing even unrelated queries into discussions of \"Kill the Boer\" chants and supposedly racially motivated attacks against white Afrikaner farmers. Hours into this spree, xAI, the Musk-controlled company responsible for Grok's creation and development, issued a statement attributing the chatbot's abrupt lapse into racist conspiracy theory to unspecified \"unauthorized modification\" of Grok's system prompt, before the company hastily moved on from the whole disaster. The question of exactly which (racist, white genocide–obsessed, white Afrikaner) xAI employee, or unaccountable founder, might have been responsible never received any official answer.\nGiven how chatbots work, none of this was very mysterious. Neither were Tuesday's events, in which Grok lapsed into sneering, unalloyed Nazism for several hours.",
          "link": "https://defector.com/elon-musks-idiot-chatbot-turns-into-an-explicit-nazi",
          "publishedOn": "2025-07-09T18:13:32.000Z",
          "wordCount": 10765,
          "title": "Elon Musk’s Idiot Chatbot Turns Into An Explicit Nazi",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/muskgrok.jpeg"
        },
        {
          "id": "https://defector.com/?p=194811",
          "author": "Tom Ley",
          "description": "Mariners catcher Cal Raleigh might just be the best player in baseball this year. There's no need for equivocation when it comes to his nickname, though. \"Big Dumper\" is the finest sobriquet in the league, and no arguments to the contrary will be heard.\nHaving an opposing player named Big Dumper come to town is also easy fodder for local broadcasters, who get to regale viewers with the nickname's backstory—it's what you think it is: he has a huge ass—alongside their astonishment at Raleigh's MVP-caliber numbers. But leave it to Michael Kay, one of the weirdest and most curmudgeonly announcers in baseball, to sneer at the majesty of Raleigh's backside.",
          "link": "https://defector.com/michael-kay-constitutionally-incapable-of-enjoying-an-extended-gaze-at-cal-raleighs-huge-ass",
          "publishedOn": "2025-07-09T16:21:16.000Z",
          "wordCount": 6108,
          "title": "Michael Kay Constitutionally Incapable Of Enjoying An Extended Gaze At Cal Raleigh’s Huge Ass",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/big_dumber.png"
        },
        {
          "id": "https://defector.com/?p=194774",
          "author": "Kathryn Xu",
          "description": "After long-lived rumors of a power struggle among Red Bull leadership, and allegations of misconduct by a female Red Bull employee, and the suspension of said Red Bull employee for being \"dishonest,\" and meticulous displays of wifely affection in the paddock, and Max Verstappen throwing his weight behind team advisor Helmut Marko, and the departure of chief technical officer Adrian Newey, and a car increasingly deteriorating in performance, and a billion second drivers, and the scheduling of that misconduct case to go before an employment tribunal in the United Kingdom in early 2026, and rumors of Verstappen leaving the team for Mercedes ... after all that, CEO Christian Horner is out at Red Bull Racing.\nThe news dropped Wednesday with very little preamble. In its announcement, Red Bull leadership provided no explanation for the choice to fire Horner—or rather, to borrow their phrasing, release Horner from his position with immediate effect. The team simply thanked him for his \"exceptional work over the last 20 years,\" a tidy reminder that Horner had been CEO and team principal since its inception in 2005. Since then, the team has won eight Drivers' Championships and six Constructors' Championships. Depending on how much one values managerial talent, most will credit the vast majority of the success to Newey, Verstappen, and four-time Drivers' Champion Sebastian Vettel, with Horner and Marko only splitting the remainder.",
          "link": "https://defector.com/red-bull-belatedly-fires-team-principal-christian-horner",
          "publishedOn": "2025-07-09T15:56:59.000Z",
          "wordCount": 7313,
          "title": "Red Bull Belatedly Fires Team Principal Christian Horner",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/christianHornerGONE.jpg"
        },
        {
          "id": "https://defector.com/?p=194776",
          "author": "Kelsey McKinney",
          "description": "There is a difference between robbing and burgling. When you burgle, you waltz in somewhere you're not supposed to be—maybe you force your entry, maybe you don't, but it must be illegal for you to be there—with the intention of taking stuff. It is a property crime. Robbery, however, requires a direct victim. When you rob, you are taking an item or items from someone right there in front of you. The Padres love robbing.\nSan Diego is making a habit of this. Last week, center fielder Jackson Merrill leapt up in Philadelphia and yoinked a home run ball back into the field of play. Mine! He might have said. He got a taste for crime, and now he cannot stop. Worse (or better depending on your perspective), his crimes were so beautiful that his teammate Fernando Tatis Jr is copying them!",
          "link": "https://defector.com/the-robbin-padres-are-at-it-again",
          "publishedOn": "2025-07-09T15:28:50.000Z",
          "wordCount": 7031,
          "title": "The Robbin’ Padres Are At It Again",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2223590666-min-1-e1752073316364.jpg"
        },
        {
          "id": "https://defector.com/?p=194727",
          "author": "Asher Elbein",
          "description": "In June, Florida’s attorney general James Uthmeier extolled the benefits of the concentration camp they were rushing to build in the wetlands of the Big Cypress Nature Reserve, west of Miami and just north of the Everglades. The swamp location wasn’t incidental to the 5,000-bed facility, but a plus. \"It presents an efficient, low-cost opportunity to build a temporary detention facility because you don't need to invest that much in the perimeter,\" he crowed.  \"If people get out, there's not much waiting for them other than alligators and pythons.\" \nWhat happened next was, perhaps, predictable. The Department of Homeland Security formally named the camp “Alligator Alcatraz,” a sweaty piece of branding that the rest of the administration picked up with customary glee. DHS social media posted …",
          "link": "https://defector.com/why-do-fascists-dream-of-alligators",
          "publishedOn": "2025-07-09T14:39:33.000Z",
          "wordCount": 11450,
          "title": "Why Do Fascists Dream Of Alligators?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2204165815-1.jpg"
        },
        {
          "id": "https://defector.com/?p=194737",
          "author": "Dan McQuade",
          "description": "Last night on Love Island USA, a game show my wife watches while I'm in the room, the remaining male contestants played basketball. I do not know if this was part of the contest or just a pick-up game where the players happened to be wearing mic packs. However I do know, via osmosis, that one of the dudes on the show is a professional basketball player.\nAccording to an article on NBC.com titled \"Who Is Chris Seeley from Love Island USA? All About His Basketball Career & More,\" the 6-foot-8 forward played in college for Utah, Fresno State and Division II Cal State–Dominguez Hills (the Toros). Stats on kenpom.com show Seeley played 20 Division I games and made 14 of his 30 free throws. Per Eurobasket, he has played in Australia, France, Kosovo, North Macedonia and, this year, Indonesia.",
          "link": "https://defector.com/the-basketball-court-on-love-island-is-all-fucked-up",
          "publishedOn": "2025-07-09T13:40:03.000Z",
          "wordCount": 7526,
          "title": "The Basketball Court On ‘Love Island’ Is All Fucked Up",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/love-island-basketball-court-overhead.jpg"
        },
        {
          "id": "https://defector.com/?p=194707",
          "author": "Tom Ley",
          "description": "It's fitting that 15 years after LeBron James created the most memorable summer in NBA history, we finally have an offseason storyline that threatens to surpass The Decision in its ramifications. It's the question that is dominating every discussion, that every NBA insider is attempting to get answered as they furiously type away at their phones: Is Jonas Valanciunas going to Greece or what?\nValanciunas, a 33-year-old big man and 13-year NBA veteran, started the 2024–25 campaign with the Wizards and was traded to the Kings for a couple of second-round picks during the season. The Kings shipped him off to Denver in exchange for Dario Saric last week. This was the sort of offseason trade that mostly scans as idle shuffling: The Nuggets no longer wanted Saric because he sucks, and the Kings no longer wanted Valanciunas because they don't want to pay him the $10 million he will be owed next season. The Kings got some salary relief (Saric will only make $5 million next season, if he doesn't get bought out), and the Nuggets finally got a true center who can spell Nikola Jokic for 10–14 minutes every night. Everybody got what they wanted.",
          "link": "https://defector.com/the-nuggets-are-in-a-standoff-with-jonas-valanciunas-and-it-somehow-matters",
          "publishedOn": "2025-07-09T12:58:26.000Z",
          "wordCount": 8692,
          "title": "The Nuggets Are In A Standoff With Jonas Valanciunas And It Somehow Matters",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2203667914.jpg"
        },
        {
          "id": "https://defector.com/?p=194571",
          "author": "Samer Kalaf",
          "description": "On Thursday night, right before a long summer holiday weekend, the New York Times published a triple-bylined bombshell: 16 years ago, in an application form for a college that ultimately did not accept him, New York City Democratic nominee Zohran Mamdani checked the boxes for both \"Asian\" and \"African-American.\" Since the widespread negative reaction toward that article, the newspaper has scrambled to revise its original intent.\nThe scoop itself could not have been possible without a hack of Columbia University's computers, the purpose of this breach being to find any evidence that the school was still using affirmative action in admissions after the Supreme Court's reversal in 2023. Among the data was Mamdani's 2009 application. The Ugandan-born politician explained why he filled it out in that way to the Times:",
          "link": "https://defector.com/the-new-york-times-had-to-work-with-a-eugenicist-so-they-didnt-get-scooped-by-a-bigot",
          "publishedOn": "2025-07-08T19:59:13.000Z",
          "wordCount": 9062,
          "title": "The New York Times Had To Work With A Eugenicist So They Didn’t Get Scooped By A Bigot",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2021/12/GettyImages-94123770.jpg"
        },
        {
          "id": "https://defector.com/?p=194673",
          "author": "Patrick Redford",
          "description": "Tadej Pogacar's 100th win as a professional rider was a perfect synecdoche of the other 99, partially in how he won it and partially because of who finished second and third on the day. In an interview just after crossing the line, he characterized Tuesday's Stage 4 of the 2025 Tour de France as \"pure racing,\" a correct assessment and unintentional self-endorsement. The race is on, and the purest racer of his generation has struck first.\nStage 4 was a roiling affair, with five small categorized climbs and several more uncategorized hills in the finale. The terrain alone would have made it difficult for anyone to stay in contact with the peloton without riding hard, and the character of that peloton made the task extra onerous. Once poor woebegone Lenny Martinez was scooped up with around 20 kilometers left in the race, Alpecin, then Visma, then UAE each took turns drilling it at the front in order to shear as many hangers-on from the group as possible. It worked, and once UAE's Jhonatan Narvaez led the group onto the Ramp Saint-Hellaire at a furious pace, everyone in the peloton and the world knew what was coming. Who needs stagecraft when you have strength? Narvaez gave way to Joao Almeida, who cranked up the pace until the steepest part of the ramp, when Pogacar took off flying.",
          "link": "https://defector.com/tadej-pogacar-strikes-the-first-blow-with-some-pure-racing",
          "publishedOn": "2025-07-08T19:13:59.000Z",
          "wordCount": 8352,
          "title": "Tadej Pogacar Strikes The First Blow With Some “Pure Racing”",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2223525764.jpg"
        },
        {
          "id": "https://defector.com/?p=194659",
          "author": "Billy Haisley",
          "description": "The peerless superiority of the Spain women's national soccer team is primarily a matter of technique. There's no national team in the world that can put so many exquisite technical players on the field at the same time. When the Spaniards have the ball—and they always have the ball—the effect of even just watching them cut capers around the pitch with astonishing touches that zip the ball through unseen gaps is something like seeing 10 sleight-of-hand experts execute an elaborate card trick, where the answer to \"Do you know where the ball is now?\" is always \"I didn't see anything, but I bet it's in the back of the net.\"\nAlong with the team's technical resplendence, Spain also dominates games by dominating opponents' minds. The impact of all that technique and the already imposing legacies of the players who wield it manifests not only on the scoreboard but also in the psychological realm. La Roja wants to, even needs to, break the opposition's spirit, stringing together long possessions and unrelenting waves of fearsome attacks and rabid counter-pressures and goal after goal after goal until the other team is tired, distressed, and demoralized, at which point they more or less concede defeat. It's at that very point of surrender that Spain is at its ruthless best. And nobody has more to do with bringing teams to that breaking point than Alexia Putellas.",
          "link": "https://defector.com/spain-is-untouchable-when-alexia-is-feeling-it",
          "publishedOn": "2025-07-08T18:51:26.000Z",
          "wordCount": 9648,
          "title": "Spain Is Untouchable When Alexia Is Feeling It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2223371696.jpg"
        },
        {
          "id": "https://defector.com/?p=194649",
          "author": "Chris Thompson",
          "description": "In addition to being deeply bad, the Washington Nationals are also profoundly unserious. These traits tend to go together, but sometimes do not. A rebuilding team can be a serious one, so long as its actions follow a path of logic, and so long as that logic is bound to the general priority of becoming better, and so long as the path is reasonably direct. Sunday the Nationals gave a start to Shinnosuke Ogasawara, a 27-year-old rookie pitcher who'd thrown just nine total innings, all in the minors, since April 13. Ogasawara was needed because Trevor Williams, owner of a 6.21 earned run average and arguably the worst starting pitcher in all of baseball, has a kerploded elbow, and is on the injured list. Ogasawara got lit up by the Boston Red Sox—seven hits, four runs, and 55 pitches in exchan…",
          "link": "https://defector.com/the-nationals-should-quit-pretending",
          "publishedOn": "2025-07-08T18:22:24.000Z",
          "wordCount": 10540,
          "title": "The Nationals Should Quit Pretending",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2223749244.jpg"
        },
        {
          "id": "https://defector.com/?p=194672",
          "author": "Giri Nathan",
          "description": "Aryna Sabalenka eked out an ugly win in her Wimbledon quarterfinal Tuesday, 4-6, 6-2, 6-4. The top player on the WTA was taken to her limit by an unlikely figure: Laura Siegemund, the 37-year-old veteran known for a confounding style of play that proceeds at a lumbering pace. You might recall Siegemund from a memorable match at the 2023 U.S. Open, where Coco Gauff was openly pleading with the umpire to call time violations on her foe.\nOn paper, it's difficult to grasp why the WTA's most fearsome and in-form player would struggle with an opponent who was ranked outside the top 100 at the outset of Wimbledon. Sabalenka should be rolling right through players of Siegemund's stature, and she typically does. But Siegemund, still an excellent athlete in the twilight of her career, managed to infuriate Sabalenka by tracking down every single ball and dragging the rallies into the mud. She rattled the No. 1 seed with her arrhythmic mix of chips, slices, and drop shots. Junk, in other words.",
          "link": "https://defector.com/aryna-sabalenka-could-round-out-game-hiring-some-elderly-training-partners",
          "publishedOn": "2025-07-08T17:36:35.000Z",
          "wordCount": 7304,
          "title": "Aryna Sabalenka Could Round Out Her Game By Hiring Some Elderly Training Partners",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2224124779.jpg"
        },
        {
          "id": "https://defector.com/?p=194640",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about fear of flying, robot body parts, fancy parties, and more.\nBefore we get into today’s proceedings, I am officially opening up submissions for the 2025 edition of Why Your Team Sucks. Most of you already know the drill, but new contributors are not only welcome into the fold here, but actively desired. So here’s what you need to do:",
          "link": "https://defector.com/i-listen-to-music-wrong",
          "publishedOn": "2025-07-08T17:15:39.000Z",
          "wordCount": 18184,
          "title": "I Listen To Music Wrong",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1241214365.jpg"
        },
        {
          "id": "https://defector.com/?p=194647",
          "author": "John Saward",
          "description": "This article was originally published on Flaming Hydra on July 2. If you like it, we encourage you to visit their site and subscribe.\nSix-foot-five, 245 pounds, a slugger from the age of behemoths and big-swingers, the real-deal furniture movers and bouncer-shaped designated hitters, the plodding old oafs running out of breath on stand-up doubles. But Dave Parker could move, was the thing; he could hit it all over, he could be pesky and patient and he could demolish you too, and all of this together was the great bounty that he gave to baseball. When he died last month he was 74 years old.",
          "link": "https://defector.com/dave-parkers-great-bounty",
          "publishedOn": "2025-07-08T15:13:38.000Z",
          "wordCount": 11052,
          "title": "Dave Parker’s Great Bounty",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-91285425.jpg"
        },
        {
          "id": "https://defector.com/?p=194608",
          "author": "Giri Nathan",
          "description": "What an unforgettably accursed end for Grigor Dimitrov at Wimbledon. His injury on Monday will haunt me not because of its visible gore, but its timing. Few players in men's tennis find themselves holding a 2-0 set lead over the top-ranked player in the world, Jannik Sinner, at a major tournament. In fact, it's been 17 months since anyone held such an advantage on Sinner, and he came back to win that one, anyway. But the No. 19 seed Dimitrov was in that rarefied position, fully in control of this fourth-round match, until he wasn't.\nWhile serving at 1-2 in the third set, Dimitrov missed a low backhand volley and touched the right side of his chest. It looked innocuous enough. On the very next point he hit an ace to win the game, then sat down on the grass, clutching his chest, gasping, and repeating, \"My pec.\"",
          "link": "https://defector.com/on-the-brink-of-a-defining-victory-grigor-dimitrovs-body-failed-him",
          "publishedOn": "2025-07-08T14:24:00.000Z",
          "wordCount": 8290,
          "title": "On The Brink Of A Defining Victory, Grigor Dimitrov’s Body Failed Him",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/dimitrov.jpg"
        },
        {
          "id": "https://defector.com/?p=194580",
          "author": "Ray Ratto",
          "description": "The Fourth of July is always there to remind us that we aren't the country we fancy ourselves being, but this year's national try-not-to-blow-your-hand-off munitions festival was even grimmer given that the current season of Taskmaster's final episode aired on Friday as well. As we all know from our reading, Taskmaster is the absolute zenith of humanity's artistic development, and creator and co-host Alex Horne is proof that the key to television greatness is simply giving a smart and funny person full license to be funny and smart, which includes trusting them to find other people with similar skills. True, I promised I would never rave about this show again, but there has never been a better time for prevaricating frauds with minimal cultural scope, so here we are.\nThat said, Taskmaster is what comes of not being fixated on someone \"winning\" a thing but rather the process that makes the winning worth the walk. Most British game/panel shows use points only as props, where the American versions slap a dollar sign in front of whatever number they find and encourage contestants to take part in a war of all against all, overseen by some host who fails to make up for in name recognition what he lacks in charm. Taskmaster is exactly the kind of show our own \"creatives\" could not produce at gunpoint because they would be too busy trying to turn it into a vehicle for Stephen A. Smith.",
          "link": "https://defector.com/sure-we-gained-our-independence-but-we-lost-the-ability-to-make-anything-as-good-as-taskmaster",
          "publishedOn": "2025-07-08T14:08:46.000Z",
          "wordCount": 9916,
          "title": "Sure, We Gained Our Independence, But We Lost The Ability To Make Anything As Good As ‘Taskmaster’",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/taskmasterSeries19.jpg"
        },
        {
          "id": "https://defector.com/?p=194526",
          "author": "Kelsey McKinney",
          "description": "It's easy to forget that God's covenant is limited. God makes a solemn promise to Noah that He will never flood the whole Earth again ... however. \"Never again will I let floodwaters destroy all life,\" the Bible says He said. But He never promised that He wouldn't let the floodwaters destroy someone's life, or your life. He only promised they wouldn't destroy everyone's at once.\nThis weekend, a mammoth amount of rain fell on the Texas Hill Country. Some experts estimate as much as 15 or even 20 inches of rain fell in just a few hours. More than a literal foot of rain dumped from the sky, with very little warning. I remember storms like these, where it feels as if sheets of rain are pouring down, as if someone reached up with a Bowie knife and sliced open the swollen clouds. But where I grew up in Northern Texas, there is no beautiful winding river for all that water to funnel into like it did this weekend. All of that water, immense and terrifying, poured into the Guadalupe River and its tributaries. In my memory, the Guadalupe River is emerald-green. It carves through limestone hills, and is dotted with cedar and oak and pecan trees. It is dotted with mountain laurel. This weekend it was wrathful. It took all of that rain, and expanded, took the land as its own, broke down trees, swept away people and cars and pets and homes.",
          "link": "https://defector.com/the-floodwaters-are-rising",
          "publishedOn": "2025-07-08T13:01:56.000Z",
          "wordCount": 10014,
          "title": "The Floodwaters Are Rising",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2223865313.jpg"
        },
        {
          "id": "https://defector.com/?p=194310",
          "author": "Dan McQuade",
          "description": "Paige Lakovic heard the meow first. She'd headed over to Section 103 before the Toledo Mud Hens' game last Thursday. Staffers had been alerted: There was a cat in the seating area. Lakovic was out to find it, but the frightened kitty had already moved. But a little mew was all she needed to suss out his location.\n\"He was so small,\" she says. \"He really looked like a bunny … I was trying to get a look at him first before I just grabbed him. But I waited a little too long and he ran down the entire row. So I had to chase him down, and then I just kind of grabbed a scruff.\" Lakovic, the media production coordinator for the Mud Hens, brought him back to the press box and put him in a corrugated box.",
          "link": "https://defector.com/the-newest-toledo-mud-hen-is-a-purrfect-midseason-addition",
          "publishedOn": "2025-07-07T17:46:53.000Z",
          "wordCount": 7235,
          "title": "The Newest Toledo Mud Hen Is A Purrfect Midseason Addition",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/webley-baseball-card-2.jpg"
        },
        {
          "id": "https://defector.com/?p=194544",
          "author": "Alex Tey",
          "description": "BROOKLYN — The first year, they wrestled in a tub of lube. The second year, it was crushed tomatoes and cooked noodles. The third? Baked beans. But the first I saw of the Twinks vs. Dolls Olympics was that one Instagram story screenshot: a couple dozen people crowded into the backyard of the Brooklyn bar Singers surrounding a smaller circle of smoke-clouded contestants huffing back those darts as fast as they could. “Twinks vs dolls cigarette race,” the text read. That image’s Twitter virality catapulted the first annual Twinks vs. Dolls Olympics, a decidedly offline affair, into something much grander.",
          "link": "https://defector.com/the-anti-fascist-power-of-trans-women-wrestling-in-nacho-cheese",
          "publishedOn": "2025-07-07T16:51:00.000Z",
          "wordCount": 13860,
          "title": "The Anti-Fascist Power Of Trans Women Wrestling In Nacho Cheese",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/B2A6172-min-e1751907464467.jpg"
        },
        {
          "id": "https://defector.com/?p=192471",
          "author": "Becky Ferreira",
          "description": "Scientists aren't sure whether Earth will be fully swallowed by the Sun, or merely burned to a crisp. Which sounds better to you?",
          "link": "https://defector.com/are-you-team-fiery-sun-death-or-team-lifeless-husk",
          "publishedOn": "2025-07-07T16:20:24.000Z",
          "wordCount": 11224,
          "title": "Are You Team Fiery Sun Death Or Team Lifeless Husk?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-1205740895.jpg"
        },
        {
          "id": "https://defector.com/?p=194397",
          "author": "Samer Kalaf",
          "description": "With last week's sale of Kotaku, the project that was G/O Media is effectively dead. Its media portfolio is now something of a media one-pager: The only website it still owns is The Root, another publication that deserved better. The Nosferatus in Oxford blue shirts at Great Hill Partners, which owns G/O Media, have polished off the blood and will turn to some other victim.\nIn a lengthy statement released on Wednesday—titled \"G/O Media Epilogue\"— CEO Jim Spanfeller looked back on his work and concluded that he's actually done a decent job, all things considered. \"While the business in general was doing as well or better than the vast majority of its peers it was clear that the hockey stick type growth that was initially planned before Covid and several media recessions and the ongoing issues of the walled gardens (Google, Meta, etc.) was not coming in the near future,\" Spanfeller wrote.",
          "link": "https://defector.com/jim-spanfeller-somehow-worse-at-writing-than-running-a-media-company",
          "publishedOn": "2025-07-07T15:49:07.000Z",
          "wordCount": 8542,
          "title": "Jim Spanfeller Somehow Worse At Writing Than Running A Media Company",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/03/GettyImages-1241464180.jpg"
        },
        {
          "id": "https://defector.com/?p=194539",
          "author": "Ray Ratto",
          "description": "That C.J. Abrams fly ball to end yesterday's Red Sox–Nationals game must have pissed someone off, because the game itself didn't warrant the Nationals firing GM Mike Rizzo and manager Davey Martinez any more than any of the other 52 losses that came before it. It was just another thing that happened to the Nats in their fruitless chase to be either young and spunky or memorably awful when in fact they're just normally awful.\nWe say this not because Rizzo and Martinez were mighty men done wrong by a scapegoating owner. The five and a half seasons since their World Series championship have been metronomically bad, and this latest stretch in which they have lost 20 of 27 has not been particularly worse in terms of horrifying exhibitions. If there was a completely defensible time to have cleaned out the basement, it would have been three weeks ago when they needed 11 innings to avoid being swept in a four-game series at home by Colorado. Just on embarrassment alone, someone should have been whacked before the ensuing SoCal road trip.",
          "link": "https://defector.com/mark-lerner-stops-neglecting-the-nationals-long-enough-to-fire-everyone",
          "publishedOn": "2025-07-07T15:30:46.000Z",
          "wordCount": 7666,
          "title": "Mark Lerner Stops Neglecting The Nationals Long Enough To Fire Everyone",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1249371161.jpg"
        },
        {
          "id": "https://defector.com/?p=194527",
          "author": "Maitreyi Anantharaman",
          "description": "Our Monday crossword, at your service. This week's puzzle was constructed by Erica Hsiung Wojcik and edited by Hoang-Kim Vu. Erica is a psychology professor at Skidmore College.\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE. Note that our submissions are closed through July 31.",
          "link": "https://defector.com/the-crossword-july-7-tennis-anyone",
          "publishedOn": "2025-07-07T15:05:34.000Z",
          "wordCount": 6115,
          "title": "The Crossword, July 7: Tennis, Anyone?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2203893937.jpg"
        },
        {
          "id": "https://defector.com/?p=194519",
          "author": "Tom Scocca",
          "description": "Welcome to Margin of Error, a politics column from Tom Scocca, editor of the Indignity newsletter.\nOn the way to Independence Day weekend, the United States Department of Education announced that, \"thanks to the leadership of President Trump,\" the University of Pennsylvania had agreed to retroactively change the results of 100-, 200-, and 500-meter women's freestyle swimming races from the 2021–2022 season. Penn removed Lia Thomas, the trans swimmer who had set school records in those events, from the university's record books—and, according to the announcement, agreed to \"send a personalized letter of apology\" to each swimmer who had competed against Thomas.",
          "link": "https://defector.com/totally-petty",
          "publishedOn": "2025-07-07T13:24:44.000Z",
          "wordCount": 11304,
          "title": "Totally Petty",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/trump.jpeg"
        },
        {
          "id": "https://defector.com/?p=194484",
          "author": "Kathryn Xu",
          "description": "With Wimbledon, the Tour de France, and the 2025 British Grand Prix, the long Fourth of July weekend for Americans has unpatriotically delivered a frantic mishmash of sports and European time zones. Some athletes are referencing the crossover. After easily winning his third-round match in Wimbledon on Saturday, Jannik Sinner was eager to get off court to catch the last few laps of qualifying. He was already planning his Sunday: \"I will manage my practice sessions around the race,\" Sinner said.\nLike any good Italian, Sinner was rooting for Ferrari, specifically Charles Leclerc. (Leclerc was returning the favor.) In a later interview, a commentator noted that Leclerc would only be starting P6 on the grid after a mistake-laden qualifying delivered pole position to Max Verstappen. \"Yeah, but race is race,\" Sinner said, with great optimism. Then, as any long-suffering member of the tifosi would after these past few years, Sinner covered his face with his hands and lamented, \"Don't put me down.\"",
          "link": "https://defector.com/239th-times-the-charm-for-nico-hulkenberg",
          "publishedOn": "2025-07-07T13:00:19.000Z",
          "wordCount": 9128,
          "title": "239th Time’s The Charm For Nico Hülkenberg",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/nicoHulkenbergPodium.jpg"
        },
        {
          "id": "https://defector.com/?p=194476",
          "author": "Barry Petchesky",
          "description": "Bring in the big fella, manager Ozzie Guillen pantomimed on his way to the mound in Game 1 of the 2005 World Series, because the big fella was a phenomenon. It was a miracle he'd even made the show; his first team had cut him before reaching the majors because of problems with alcohol, with his weight, and with injuries caused by his mighty fastball. The White Sox had claimed him on waivers, and finally called him up on July 5, and here it was—the biggest moment in franchise history in nearly a century, and Guillen went to the rookie. He'd call for the big fella in each and every game of that Chicago sweep, and Jenks was on the mound as the Sox won their first title since 1917.\n\nhttps://www.youtube.com/watch?v=EpF-Pg8kN5k&ab_channel=MLB",
          "link": "https://defector.com/bobby-jenks-made-the-most-of-a-short-time",
          "publishedOn": "2025-07-06T16:51:01.000Z",
          "wordCount": 7145,
          "title": "Bobby Jenks Made The Most Of A Short Time",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-81450661.jpg"
        },
        {
          "id": "https://defector.com/?p=194465",
          "author": "Kathryn Xu",
          "description": "In theory, or, at least, from the perspective of someone who does not gamble on sports, I figured an MLB pitcher has limited options for manipulating individual player prop bets. For all that a pitcher can control a game with their stuff, so much of the mechanics of hits and strikeouts and home runs allowed are dependent on the batter. The statistic the pitcher seemingly has the most control over, walks, still requires some level of cooperation by the hitter—try as you might, you will only walk Javy Báez if he agrees to be walked.\nBut this thinking, I now see, revolved around my false perception of \"normal gambling maneuvers.\" Normal gambling maneuvers now contain a much broader and more granular variety of prop bets, down to ball/strike calls on individual pitches. That particular bet would be easy to manipulate—but also easier to flag.",
          "link": "https://defector.com/the-suspect-pitches-in-mlbs-gambling-investigation-of-luis-ortiz-look-not-great",
          "publishedOn": "2025-07-06T16:21:33.000Z",
          "wordCount": 7534,
          "title": "The Suspect Pitches In MLB’s Gambling Investigation Of Luis Ortiz Look Not Great",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/ortizGamba.jpg"
        },
        {
          "id": "https://defector.com/?p=194437",
          "author": "Barry Petchesky",
          "description": "\"It's been a terrible week,\" said Yankees manager Aaron Boone, a short time after announcing starting pitcher Clarke Schmidt needs Tommy John surgery and will be out until 2027, and an even shorter time after his 1.202 OPS right fielder was thwacked in the face by a ball thrown by his .703 OPS shortstop. When it rains, it pours: After losing 12-6 to the Mets on Saturday in a game about as sloppy as they come, the Yankees have now dropped six straight for the second time in under a month, and have seen their once-solid divisional lead sublime into vapor, leaving behind a fumbling team for which the only good news is that Aaron Judge only bled a little.\n\nhttps://twitter.com/MLBONFOX/status/1941618624936149392",
          "link": "https://defector.com/its-been-that-kind-of-a-week-for-aaron-judge-and-the-yankees",
          "publishedOn": "2025-07-06T13:43:28.000Z",
          "wordCount": 7402,
          "title": "It’s Been That Kind Of A Week For Aaron Judge And The Yankees",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2223091770.jpg"
        },
        {
          "id": "https://defector.com/?p=194345",
          "author": "Barry Petchesky",
          "description": "Solar systems mostly keep to themselves. What's ours is ours and what's not is not. Stars are simply too far from each other—four light years and change to our nearest neighbor—and too big and strong to allow things to escape their gravity well. But we know some things do make it out. And, seemingly very rarely, some things make it in. One's on its way now. Everyone get ready to meet 3I/ATLAS, a comet that was likely born around some distant star, hurtling toward our inner solar system at about 130,000 mph and getting faster. It'll be here this fall. Everyone try to look busy.\nMost of the things we know about that can leave our solar system, we have built ourselves. The Voyager probes have both crossed what we (somewhat arbitrarily) have deemed the border of interstellar space, and two Pioneer probes, even though we've lost touch with them, are on their way. New Horizons will get there too.",
          "link": "https://defector.com/a-comet-from-another-solar-system-is-on-its-way",
          "publishedOn": "2025-07-06T13:05:42.000Z",
          "wordCount": 9301,
          "title": "A Comet From Another Solar System Is On Its Way",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2180664173.jpg"
        },
        {
          "id": "https://defector.com/?p=194426",
          "author": "Defector Staff",
          "description": "We're off today. Consider this your place to blab about sports, food, antiquing, or anything else that floats your boat.",
          "link": "https://defector.com/your-fourth-of-july-open-thread",
          "publishedOn": "2025-07-04T13:33:27.000Z",
          "wordCount": 5506,
          "title": "Your Fourth Of July Open Thread",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2133560222.jpg"
        },
        {
          "id": "https://defector.com/?p=194239",
          "author": "Patrick Redford",
          "description": "Bonjour et bienvenue! The 2025 Tour de France begins Saturday in Lille. If you want to about read the rhythms of the sport, you're in luck, because we have a two-part series on that for you. If you want a preview of the three weeks of racing, you have come to the right place.\nA lovely rhythm to the Tour de France is that while the precise route is different every year, the rough shape holds. The Tour always gets more difficult as it goes, with the race beginning on flatter terrain before hitting the Alps and Pyrenees in some order in the second and third weeks to assort the winner. Over the past 15 years the Tour's organizers, the Amaury Sport Organisation (ASO), have set aside their haughty sense of superiority and made their race significantly better by borrowing from what works in other races. Gone are the interminable, 200-kilometer-plus days of pancake-flat racing and predictable mountain slogs, replaced with mixed, Ardennes-style hilly stages and shorter, punchier mountain days.",
          "link": "https://defector.com/your-guide-to-the-2025-tour-de-france",
          "publishedOn": "2025-07-04T13:18:31.000Z",
          "wordCount": 21823,
          "title": "Your Guide To The 2025 Tour de France",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2162389750.jpg"
        },
        {
          "id": "https://defector.com/?p=194338",
          "author": "Patrick Redford",
          "description": "In yesterday's story, How To Watch Cycling, I wrote offhand that the Tour de France was \"poker on two wheels.\" That poker game is an important element of tactics, but it's not the only one. With the Tour so close and so much more coverage to come, it seemed worth addressing the principles of team tactics a little more thoroughly. How do the teams fight each other? What are they fighting for? And why is that interesting?\nA team's primary weapon is riding hard enough to exact a toll on riders who want to stay in the peloton. Imagine a stage where the day's breakaway is not getting away from the peloton. Imagine that over the remainder of the stage there are, say, four medium to medium-hard climbs spread out over 100 kilometers. The team that has been managing the pace on a hilly day suddenly champs down on the bit and starts attacking. Their riders are taking turns setting a grueling pace, sustained by a willingness to accept burning some serious fuel. Whether that means a single rider pushing their limit or several riders taking turns expending serious efforts and then relieving each other, someone is going to expend more effort than the average rider could fully recover from by the next day.",
          "link": "https://defector.com/how-team-tactics-shape-the-tour-de-france-and-vice-versa",
          "publishedOn": "2025-07-03T15:51:02.000Z",
          "wordCount": 8730,
          "title": "How Team Tactics Shape The Tour de France, And Vice Versa",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2167151801.jpg"
        },
        {
          "id": "https://defector.com/?p=192961",
          "author": "Dan McQuade",
          "description": "The vote looked like a funeral. Residents showed up to the council meeting dressed in black, carrying prop tombstones. One carried drooping flowers. \"I feel that what the council has just done has sentenced us to a long, agonizing death,\" she said. \"We're disgusted,\" said another protester. Dire predictions had been made at earlier hearings. \"I'm embarrassed to say I live in Bensalem,\" one woman told the council. \"Do you know why? Because of what we've let it become.\"\nIt was 1997. The issue at hand in Bensalem Township, Penn., was the construction of an $11 million, 24-screen movie theater at the Neshaminy Mall. The township's planning commission had rejected the proposal. Residents of the nearby Belmont Hills neighborhood were concerned about increased crime and traffic. The arguments got a little esoteric. \"When Arnold Schwarzenegger finishes saving the world, some rowdy people will come out of the theater spinning their wheels, and crime will inevitably occur,\" said the town watch co-chair. A planning commission board member wondered why anyone would even go to a theater: \"Why should you get in your car and face all that traffic and all that aggravation just to see a movie?\"",
          "link": "https://defector.com/a-mall-i-loved-is-going-pitch-black",
          "publishedOn": "2025-07-03T15:28:11.000Z",
          "wordCount": 13081,
          "title": "A Mall I Loved Is Going Pitch Black",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/amc-neshaminy-empty.jpg"
        },
        {
          "id": "https://defector.com/?p=194071",
          "author": "Soraya Roberts",
          "description": "That Joan Didion line, \"We tell ourselves stories in order to live,\" is ubiquitous because like so much of her work, it gets at an essential truth. But the thing about that quote—the idea that we form narratives out of the things that happen to us—is that it suggests we do it in order to move forward in some way. \"In order to live\" implies that those stories make life easier, more understandable, maybe even conquerable. Didion is a master at also showing how those stories fail us, and yet there is still a kind of optimism embedded in her words. Didion may have been fragile, her life may have been difficult towards the end, but on the page, maybe in part because of her facility with landing on the mot juste, she always seemed like she could handle it—like she was fundamentally indestructible. \nSo what happens when you tell yourself stories for a less inspiring reason? When the narrative you form out of the things that happen to you is in fact designed to keep you stuck? Or, my therapist's preferred term: tangled up. \"We tell ourselves stories in order to die\" doesn't have quite the same lift. It's also not exactly accurate. But there are plenty of us who tell ourselves stories, incessantly, relentlessly, which make it harder to live. We take the things that happen to us, and only see the dark side, even when the people around us keep on trying to extend some light our way. \"You do it to yourself,\" my therapist told me recently, to which I did not respond (but wanted to): \"And that's what really hurts.\"",
          "link": "https://defector.com/hanif-kureishi-writes-himself-anew-in-shattered",
          "publishedOn": "2025-07-03T14:54:09.000Z",
          "wordCount": 10567,
          "title": "Hanif Kureishi Writes Himself Anew In ‘Shattered’",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2181811220.jpg"
        },
        {
          "id": "https://defector.com/?p=194063",
          "author": "David Roth",
          "description": "It is probably enough to note that this week's episode of The Distraction, which was recorded last week, is A Vacation Episode. Regular listeners have encountered these before, and even those readers that have never listened to the podcast but have some understanding of words can probably guess at what this means. If you want to parse it even more finely, this is a Double Vacation Episode, given that Drew was on vacation when we recorded it—was, quite literally, slathered in sunblock and headed to the beach when I reminded him that we were scheduled to talk—and that I am on vacation now as the episode finds you wherever you get your podcasts. If you want to go in fully prepared, you should bear that in mind. Think about what a Double Vacation Episode might be like. OK, here you go:",
          "link": "https://defector.com/like-a-bat-in-the-supermarket",
          "publishedOn": "2025-07-03T14:16:46.000Z",
          "wordCount": 7466,
          "title": "Like A Bat In The Supermarket",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2190446023.jpg"
        },
        {
          "id": "https://defector.com/?p=193930",
          "author": "Kathryn Xu",
          "description": "F1: The Movie is not a good sports movie, but it also doesn't try very hard to be. Instead, it is a superhero flick dressed in a sports movie livery. Like a superhero movie, F1: The Movie primarily rewards nerds—in this case, fans who know too much about Formula 1—with opportunities to tap into the dopamine vault of recognition. There is no shortage of figures to recognize: the voices, and later profiles, of commentators David Croft and Martin Brundle; a fatuous aside about how that Max Verstappen guy's really good, huh; a shot of Lewis Hamilton's bulldog Roscoe happily trundling down the paddock; the phrase \"shitbox\"; Guenther Steiner, enough said.\nEqually recognizable is the visual language, which successfully mimics an F1 television broadcast. Each race is introduced with the name printed in F1's proprietary font and a stylized diagram of the circuit stamped over an overhead helicopter shot. Much of the race footage is adapted from shots of the 2023 and 2024 F1 Championship, which means few new angles to work with, but plenty for fans to recall. There is the onboard shot, peeking above the bars of the halo. There is a shot of the drivers' helmets, seated on the grid before the start. Do the cars look like they're the fastest in the world? Not really, which proves a commitment to the aesthetics of the source material.",
          "link": "https://defector.com/f1-the-movie-is-great-if-your-favorite-part-of-racing-is-all-the-corporate-logos",
          "publishedOn": "2025-07-03T13:46:53.000Z",
          "wordCount": 10107,
          "title": "‘F1: The Movie’ Is Great If Your Favorite Part Of Racing Is All The Corporate Logos",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/formulaAssTheMovie.jpg"
        },
        {
          "id": "https://defector.com/?p=193985",
          "author": "Raphael Orlove",
          "description": "“Eight hours per day, we’re not allowed to do more,” FIA World Rally Championship safety delegate Nicolas Klinger jokes. “Eight hours in the morning, eight hours in the afternoon.” \nI’m sitting with Klinger in the WRC’s race control room at the Rally de Portugal, which took place in May. Klinger has been here since 6:00 a.m. and won’t leave until 9:00 p.m. or later. He’s doing important work, scanning video feeds of the 337-kilometer course for what he calls “mushrooms.” Before every stage, the WRC sends out a car to move spectators standing in unsafe locations. But some spectators wander back after the safety car is gone, or hide as it goes by, popping up like a mushroom after it passes.",
          "link": "https://defector.com/meet-the-crew-whose-job-is-to-keep-rally-fans-from-getting-themselves-killed",
          "publishedOn": "2025-07-03T12:59:52.000Z",
          "wordCount": 12880,
          "title": "Meet The Crew Whose Job Is To Keep Rally Fans From Getting Themselves Killed",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/IMG_0736b.jpg"
        },
        {
          "id": "https://defector.com/?p=194304",
          "author": "Ray Ratto",
          "description": "So after all that windmill-tilting, the New York Knicks are about to spear Mike Brown as their new head coach, and there will be some laughter because of all the time they wasted to get a guy they could have gotten 15 minutes after firing Tom Thibodeau.\nWhich matters exactly not at all in the long run. It's just us enjoying the shambolic Knicks for not receiving permission to bother all the coaches with all the reputations, just because they're the Knicks and should never not enjoy all the illusory benefits of habitual label shopping—especially if the shopping is done with an eye toward taking something someone else has.",
          "link": "https://defector.com/the-knicks-backed-their-way-into-a-good-coach",
          "publishedOn": "2025-07-02T19:25:43.000Z",
          "wordCount": 8159,
          "title": "The Knicks Backed Their Way Into A Good Coach",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2191118306.jpg"
        },
        {
          "id": "https://defector.com/?p=193905",
          "author": "Nicholas Russell",
          "description": "The history of mainstream filmmaking is prone to whiggish readings. The story is that Hollywood, an industry of entertainment and representation, has moved forward in a pleasing, gradually liberal-minded direction with every decade, enfranchising more audiences, capturing more imaginations, all for positive and idealistic reasons. \nMichael Koresky’s excellent new book Sick and Dirty: Hollywood’s Gay Golden Age and the Making of Modern Queerness troubles this idea. Training his eye on a period not generally known for its celebration of non-normative sexuality or gender expression, Koresky demonstrates how queerness occupied a complex, often contradictory position in the industry. He writes, “Future generations have come to accept on-screen images of the past as simply the way things were, but to believe people were naive rather than part of a heavily policed system is to misunderstand where popular art comes from.”",
          "link": "https://defector.com/two-steps-forward-three-steps-back-michael-koresky-on-hollywoods-queer-history",
          "publishedOn": "2025-07-02T17:27:43.000Z",
          "wordCount": 14820,
          "title": "Two Steps Forward, Three Steps Back: Michael Koresky On Hollywood’s Queer History",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/sick-and-dirty-book.jpg"
        },
        {
          "id": "https://defector.com/?p=194232",
          "author": "Defector Staff",
          "description": "Defector’s growth committee is hard at work preparing for all-company meetings in August, where we’ll set strategy for Year 6 and beyond. Our biennial reader survey is probably the most important single input to that process. You should take the survey! It’ll take you about five minutes, and you’ll gain entry into a drawing for […]",
          "link": "https://defector.com/take-defectors-2025-reader-survey",
          "publishedOn": "2025-07-02T17:00:00.000Z",
          "wordCount": 6195,
          "title": "Take Defector’s 2025 Reader Survey",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/defector-media-reader-survey-16-9.jpg"
        },
        {
          "id": "https://defector.com/?p=193566",
          "author": "Patrick Redford",
          "description": "The 112th edition of the Tour de France starts this weekend. La Grand Boucle is the biggest deal in cycling by a considerable margin, which means that a mass audience of non-enthusiasts will tune in for their first and only taste of road racing of the year, watch the beautiful scenery fly for five-plus hours, and shrug their shoulders, not quite having understood the appeal. \nIt seems simple. One rider crosses the line before the others. I'm somewhat sympathetic to the skeptic's position here, not because it is correct, but rather because the visual and technical language of cycling is remarkably distinct from every other major sport. Cycling is a nested suite of sophisticated maneuvers masquerading as a straightforward fitness contest. The Tour de France, more than any other race, typifies this.",
          "link": "https://defector.com/how-to-watch-cycling",
          "publishedOn": "2025-07-02T16:34:41.000Z",
          "wordCount": 11152,
          "title": "How To Watch Cycling",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-1134235755.jpg"
        },
        {
          "id": "https://defector.com/?p=194197",
          "author": "Giri Nathan",
          "description": "NBA free agent Malik Beasley is currently the subject of a federal investigation into gambling, prop bets, and wire fraud. As a result, the Detroit Pistons have reportedly withdrawn a three-year, $42 million contract to their top three-point shooter. Beasley could have really used the money, judging by the grim financial picture painted by The Detroit News in a report published Tuesday.\nCourt records accessed by the News show that Beasley has been sued by a variety of parties. In order of severity:",
          "link": "https://defector.com/malik-beasley-had-his-wages-garnished-by-his-former-dentist",
          "publishedOn": "2025-07-02T16:08:43.000Z",
          "wordCount": 6930,
          "title": "Malik Beasley Had His Wages Garnished By His Former Dentist",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2207705632.jpg"
        },
        {
          "id": "https://defector.com/?p=192757",
          "author": "Lucy Bloom",
          "description": "The purpose of a car's design is to take something that will essentially exist to consumers as an appliance and elevate it into something that they can project an identity onto, and therefore justify blowing 10-to-100 grand to acquire. The grand project of drawing the most fuckable windowed toaster has brought many evolutions, and just as evolution keeps making crabs, car designers keep going, \"Yo, what if they could climb on it?\" What follows is a history of their attempts to help us goofy car owners clamber up our vehicles, and the reasons we have had to.\nWhy Climb? Poop Is Gross!",
          "link": "https://defector.com/a-peoples-history-of-climbing-on-cars",
          "publishedOn": "2025-07-02T14:55:25.000Z",
          "wordCount": 18818,
          "title": "A People’s History Of Climbing On Cars",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-111975737-e1751046634503.jpg"
        },
        {
          "id": "https://defector.com/?p=194185",
          "author": "Ray Ratto",
          "description": "The last few weeks have been a string of hard times for Indiana-based basketball, even with victories strewn across the landscape. The Indiana Pacers reached the NBA Finals—good—but lost Tyrese Haliburton to a torn Achilles tendon in Game 7—very bad. The Indiana Fever are now the WNBA's leading draw because of Caitlin Clark—good—but Clark has been injured twice, first her quad muscle and more recently her groin—bad—in addition to finishing ninth at her position in player voting for the All-Star Game—confusing—and being the subject of Christine Brennan's upcoming unauthorized hagiography—ominous.\nBut those were circumstantial. Now we know something is karmically amiss, because a vengeful universe has just taken out Red Panda.",
          "link": "https://defector.com/get-well-soon-red-panda",
          "publishedOn": "2025-07-02T14:20:11.000Z",
          "wordCount": 7498,
          "title": "Get Well Soon, Red Panda",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2215450959.jpg"
        },
        {
          "id": "https://defector.com/?p=194146",
          "author": "Barry Petchesky",
          "description": "The Los Angeles Kings entered free agency with one mission: to build a team better than the Oilers, who've eliminated them in the first round in each of the last four postseasons. Enter new GM Ken Holland, who in his post–Red Wings career has a pathological fetish for signing veterans and depth guys and then expecting too much from them in a cursed chimera of a lineup. Seriously, this guy hasn't met a roster he couldn't make older. He's testing the limits of how much he can pay a third defensive pairing and still find employment. He hasn't changed his opinion of what makes a useful NHL player since the Bush administration. He acts as if the salary cap is just a phase, and the league will toss it out any day now. He recoils from the word \"rebuild\" like a rabies patient from water.\nSo it was with both glee and trepidation that the world watched the Kings head into free agency with a whopping $23.5 million in cap space, and mostly bare shelves to spend it on, after nearly all the top available guys found homes before the store opened. True to form, their Day 1 spending spree proved to be extremely funny.",
          "link": "https://defector.com/the-kings-did-their-free-agency-shopping-at-a-bin-store",
          "publishedOn": "2025-07-02T13:51:56.000Z",
          "wordCount": 7365,
          "title": "The Kings Did Their Free Agency Shopping At A Bin Store",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2214676495.jpg"
        },
        {
          "id": "https://defector.com/?p=193697",
          "author": "Dave McKenna",
          "description": "Only a few years ago, JD Vance was boasting about his immigrant roots. “To understand me, you must understand that I am a Scots-Irish hillbilly at heart,” Vance wrote in Hillbilly Elegy, the 2016 book that launched him into the public consciousness.\nGiven that he leveraged the success of that bestseller and the movie it spawned into a job just a heartbeat away from the top spot in the most anti-immigrant administration in American history, it's kind of delicious watching the foreigners he'd claimed as kin fail to admit he’s really one of them.",
          "link": "https://defector.com/is-jd-vance-irish-be-careful-who-you-ask",
          "publishedOn": "2025-07-02T13:02:33.000Z",
          "wordCount": 12376,
          "title": "Is JD Vance Irish? Be Careful Who You Ask",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2204716932.jpg"
        },
        {
          "id": "https://defector.com/?p=194082",
          "author": "Giri Nathan",
          "description": "Damian Lillard's tenure as a star almost certainly fell apart when his left Achilles tendon did in late April. Now his tenure as a Milwaukee Buck is over, too. The team announced Tuesday that it will waive Lillard and stretch the remaining $113 million on his contract over the next five years, thus concluding the oddly unsatisfying Giannis-Dame era.\nOn paper, it was a perfect fit; on the court, it never cohered. Lillard will receive all that money he's due without having to play another basketball game. Surely he wants to play more, however. He also turns 35 in two weeks, and will be 36 by the time he's ready to log serious minutes again, on a repaired tendon, as a 6-foot-2 guard already toeing the line of athletic viability.",
          "link": "https://defector.com/the-bucks-and-damian-lillard-end-their-brief-forgettable-relationship",
          "publishedOn": "2025-07-01T20:06:47.000Z",
          "wordCount": 7467,
          "title": "The Bucks And Damian Lillard End Their Brief, Forgettable Relationship",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2212314444.jpg"
        },
        {
          "id": "https://defector.com/?p=193977",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about farmers markets, vibrators, dogs in mild peril, and more.\nYour letters:",
          "link": "https://defector.com/all-i-want-is-to-live-in-a-world-where-people-talk-normal",
          "publishedOn": "2025-07-01T17:36:14.000Z",
          "wordCount": 17868,
          "title": "All I Want Is To Live In A World Where People Talk Normal",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2219195445.jpg"
        },
        {
          "id": "https://defector.com/?p=194030",
          "author": "Lauren Theisen",
          "description": "You might think that the coolest place to hit a baseball is over the fence. But Red Sox outfielder Wilyer Abreu is here to prove you wrong. In a Boston win where he also smashed a grand slam the traditional way, Abreu earned an inside-the-park dong with a trick shot off Fenway Park's centerfield wall.\nThe Sox attacked Reds rookie Chase Burns early, scoring seven in the first inning. By the time the bottom of the fifth came around, Cincinnati had plated four of their own to make the game a little more interesting. Abreu was the lead-off hitter, and he had a chance to tie his ex-teammate Rafael Devers for most dingers by a Red Sock this season. On 0-2, he got a juicy fastball up in the zone and turned on it, knocking the ball to that little angled nook in the deepest part of his 113-year-old ballfield. The Sock's sock was a few feet from a slow trot around the bases. Instead, he had to race the whole way, benefiting from a dramatic ricochet that sent the ball rolling along the warning track. Its path was so mischievous that the Reds couldn't even throw the ball back to the infield before Abreu slid head-first across the plate.",
          "link": "https://defector.com/wilyer-abreu-hit-it-to-the-most-fun-spot-in-fenway",
          "publishedOn": "2025-07-01T16:38:43.000Z",
          "wordCount": 6981,
          "title": "Wilyer Abreu Hit It To The Most Fun Spot In Fenway",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2222229588.jpg"
        },
        {
          "id": "https://defector.com/?p=194034",
          "author": "Ray Ratto",
          "description": "The kneejerk response to the Ohio legislature helping Cleveland Browns owner Jimmy Haslam to stop being the Cleveland part of that descriptor was a marvelous bit of cynicism-driven political powerlifting that, in its own way, is exactly what Ohio, the Browns, and particularly the Haslams deserve.\nWith three deft moves, the lawmakers cleared the track for the Haslams, Jimmy and Dee, to move the team out of Cleveland to the suburb of Brook Park, in contravention of the Modell Law, named after the bankrupted cur who moved the original Browns to Baltimore, by changing the wording of the law to undermine it entirely; they also claimed to find their $600 million share of the new stadium nut by seizing some treasure trove of unclaimed money; they then allowed the Haslams to continue to collect on their share of county's taxes against beer, hard liquor and cigarettes because, well, Deshaun Watsons don't come cheap.",
          "link": "https://defector.com/ohio-caves-to-the-haslams-tells-cleveland-to-eat-dirt",
          "publishedOn": "2025-07-01T16:16:35.000Z",
          "wordCount": 8000,
          "title": "Ohio Caves To The Haslams, Tells Cleveland To Eat Dirt",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2217996579.jpg"
        },
        {
          "id": "https://defector.com/?p=193865",
          "author": "Owen Lewis",
          "description": "In 2019, while in Peru as a camp counselor, Tyler Andrews set his first Fastest Known Time (FKT) on the 37.9-mile Salkantay Inca Trail, which leads to the summit of Machu Picchu. Andrews’s time beat the previous mark by more than two hours. He identified primarily as a distance runner back then—he’d earned a spot at the U.S. Olympic trials for the marathon in 2016, would do so again in 2020, and had a personal best of 2:15:52—but his performance on the Salkantay Inca Trail kickstarted a new athletic career as a full-fledged mountaineer ascending the tallest mountains in the world in pursuit of various speed records. In May, he aimed to set one on the loftiest setting of all: Mount Everest. \nAndrews exploded into elite-level running from inauspicious beginnings. He was a music and theater head in his younger years and didn’t crack 18 minutes in the 5K in high school. But he was fiercely hardworking, discovered he had an enormous VO2 max, and improved steadily all the way into the professional ranks. Like with his running career, once Andrews started making inroads into the mountaineering world and claiming FKTs, he didn’t stop. Since the Salkantay speed record, Andrews posted several new FKTs each year, setting new standards on Mount Fuji, Kilimanjaro, and the towering, 26,781-foot monster Manaslu, among many others.",
          "link": "https://defector.com/a-lot-can-go-wrong-while-attempting-a-speed-record-on-mount-everest",
          "publishedOn": "2025-07-01T15:45:10.000Z",
          "wordCount": 17369,
          "title": "A Lot Can Go Wrong While Attempting A Speed Record On Mount Everest",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/Ty-running-up-mountain.jpg"
        },
        {
          "id": "https://defector.com/?p=193969",
          "author": "Kelsey McKinney",
          "description": "A little less than 320 feet away, the ball leaves Matt Waldon's right hand. All night, it has been ornery. It has misbehaved. The ball is Waldron's enemy. It's supposed to knuckle, and instead it rebels, skittering out of his hand like it's possessed by some force other than the pitcher's arm. The strike zone? The ball doesn't care for that. Tonight, it wants the backstop. It needs it. It will do any thing to get to it.\nMatt Waldron is the only pitcher in Major League Baseball who even bothers trying to throw the bewitched knuckleball, and still it betrays him. By the time the bottom of the third inning arrives, the ball has run away again and again. It's scurrying past the catcher, walking a man, letting him take second base while it visited (who else?) the backstop again. And then just to prove its dominance, it walks a second man to prove the wild pitch never mattered anyway.",
          "link": "https://defector.com/it-feels-so-good-to-be-a-robber",
          "publishedOn": "2025-07-01T14:34:59.000Z",
          "wordCount": 7896,
          "title": "It Feels So Good To Be A Robber",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2222989821.jpg"
        },
        {
          "id": "https://defector.com/?p=193967",
          "author": "Barry Petchesky",
          "description": "It should be impossible—water-from-a-stone impossible, faster-than-light-travel impossible—to make a bad movie about scary dinosaurs. And yet, according to reviews for Jurassic World Rebirth, out this week, they have done just that for the fourth time in a row.\nSomething is amiss here. These are dinosaurs: the biggest, meanest fuckers to ever walk the Earth—the demons and dragons of nightmare and legend, surely the source of some deep mammalian atavistic fear in the basest parts of our brainstem. If filmmakers can't squeeze two hours of excitement out of being chased by these horrors of tooth and nail, filmmakers need to look at themselves in the mirror and ask, How am I failing the dinos? The answer is that they are not respecting them properly, and trying to invent, new, bigger, smarter, scarier versions of dinosaurs. This is pathetic. Stick to saurians!",
          "link": "https://defector.com/just-give-me-some-normal-damn-dinosaurs",
          "publishedOn": "2025-07-01T14:13:47.000Z",
          "wordCount": 7778,
          "title": "Just Give Me Some Normal Damn Dinosaurs",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2222010428.jpg"
        },
        {
          "id": "https://defector.com/?p=193957",
          "author": "Barry Petchesky",
          "description": "The morning after the Panthers raised the Stanley Cup, some idiot wrote that it would be \"nearly impossible\" for Florida to re-sign its two top pending free agents, forward Sam Bennett and defenseman Aaron Ekblad. That idiot didn't even include mention of Brad Marchand in the same sentence, because only a giant mega mondo idiot would even consider the possibility that they could bring back all three. Well. About that. You see. The thing is. \nThe thing is that the Panthers and GM Bill Zito have done basically everything right over the last three years, and been rewarded with back-to-back Cups, and a roster that adores each other and winning and Florida's lack of income tax, and a bunch of stars willing to take less than their open-market value to keep all that going. So, in a huge blow to the rest of the league's chances next year, and to the potential for drama as true free agency opens up today, the Panthers locked down all three guys to long-term extensions.",
          "link": "https://defector.com/the-panthers-are-bringing-back-all-their-guys",
          "publishedOn": "2025-07-01T13:05:14.000Z",
          "wordCount": 7964,
          "title": "The Panthers Are Bringing Back All Their Guys",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2211979139.jpg"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=858521",
          "author": "Steve Adams",
          "description": "The Royals announced Wednesday that they’ve signed left-hander Dallas Keuchel to a minor league contract. ESPN’s Jeff Passan notes that Keuchel held a workout for clubs last week, which the Royals attended. He’ll earn a prorated $2MM salary for any time spent on the major league roster. Keuchel, 37, has pitched in parts of 13…",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-sign-dallas-keuchel-to-minor-league-deal.html",
          "publishedOn": "2025-07-09T14:22:28.000Z",
          "wordCount": 3528,
          "title": "Royals Sign Dallas Keuchel To Minor League Deal",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/07/dallas-keuchel-brewers-1024x705.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=858434",
          "author": "Steve Adams",
          "description": "The Royals announced today that they have selected the contract of infielder/outfielder Cam Devanney. In a corresponding active roster move, outfielder Mark Canha has been placed on the 10-day injured list due to left elbow epicondylitis. To open a 40-man spot, left-hander Cole Ragans was transferred to the 60-day IL. Devanney was a 2019 Brewers…",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-select-cam-devanney-transfer-cole-ragans-to-60-day-il.html",
          "publishedOn": "2025-07-08T19:07:39.000Z",
          "wordCount": 2422,
          "title": "Royals Select Cam Devanney, Transfer Cole Ragans To 60-Day IL",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/Cam_Devanney_Royals-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=858229",
          "author": "Mark Polishuk",
          "description": "Prior to today’s game, the Guardians placed outfielder Lane Thomas on the 10-day injured list (retroactive to July 5), as Thomas is again dealing with plantar fasciitis in his right foot.  Infielder Will Wilson was called up from Triple-A to replace Thomas, who is headed to the IL for the third time this season.  The…",
          "link": "https://www.mlbtraderumors.com/2025/07/al-central-notes-thomas-ragans-lynch-cobb.html",
          "publishedOn": "2025-07-07T01:59:06.000Z",
          "wordCount": 3120,
          "title": "AL Central Notes: Thomas, Ragans, Lynch, Cobb",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/LaneThomas-2025-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=858022",
          "author": "Darragh McDonald",
          "description": "The Royals announced that they have selected the contract of catcher Luke Maile. Outfielder Drew Waters has been optioned to Triple-A Omaha in a corresponding active roster move. The 40-man roster had a vacancy, so no corresponding move was required there. As noted by Anne Rogers of MLB.com, the move is related to some calf…",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-select-luke-maile-2.html",
          "publishedOn": "2025-07-05T00:40:29.000Z",
          "wordCount": 2259,
          "title": "Royals Select Luke Maile",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/Luke_Maile_Royals-copy-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=857854",
          "author": "Steve Adams",
          "description": "The Royals announced Thursday that they’ve signed righty Michael Fulmer to a minor league contract. He’s been assigned to Triple-A Omaha. Fulmer, a client of BBI Sports Group, recently passed through waivers and elected free agency after being designated for assignment by the Cubs. Fulmer, 32, is a former American League Rookie of the Year…",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-sign-michael-fulmer-to-minor-league-deal.html",
          "publishedOn": "2025-07-03T21:10:43.000Z",
          "wordCount": 2551,
          "title": "Royals Sign Michael Fulmer To Minor League Deal",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/04/michael-fulmer-pitching-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=857780",
          "author": "Nick Deeds",
          "description": "The Royals’ 2025 season has not gone as they surely hoped it would after they surprised the baseball world with a playoff berth in 2024 and invested heavily into the team over the offseason. While they entered June over .500, a brutal 8-18 swoon last month left the team very abruptly buried in the AL…",
          "link": "https://www.mlbtraderumors.com/2025/07/poll-will-the-royals-trade-seth-lugo.html",
          "publishedOn": "2025-07-03T19:04:01.000Z",
          "wordCount": 3208,
          "title": "Poll: Will The Royals Trade Seth Lugo?",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/SethLugo-2025Royals-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=857789",
          "author": "Darragh McDonald",
          "description": "The Royals have been looking for outfield upgrades for years and Ken Rosenthal of The Athletic reports that they have interest in Bryan Reynolds of the Pirates, though Rosenthal adds that talks haven’t yet gained momentum and Kansas City is also interested in other hitters. Reynolds, 30, has been one of the faces of the…",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-interested-in-bryan-reynolds.html",
          "publishedOn": "2025-07-03T16:01:30.000Z",
          "wordCount": 3766,
          "title": "Royals Interested In Bryan Reynolds",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/04/BryanReynolds-2025-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=857629",
          "author": "Darragh McDonald",
          "description": "The latest episode of the MLB Trade Rumors Podcast is now live on Spotify, Apple Podcasts, and wherever you get your podcasts! Make sure you subscribe as well! You can also use the player at this link to listen, if you don’t use Spotify or Apple for podcasts. This week, host Darragh McDonald is joined by Tim Dierkes of…",
          "link": "https://www.mlbtraderumors.com/2025/07/mlbtr-podcast-depleted-mets-pitching-the-pirates-are-open-for-business-and-more.html",
          "publishedOn": "2025-07-02T14:51:32.000Z",
          "wordCount": 2611,
          "title": "MLBTR Podcast: Depleted Mets’ Pitching, The Pirates Are Open For Business, And More!",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/06/USATSI_26540627-1024x683.jpg"
        }
      ]
    },
    {
      "title": "Flaming Hydra",
      "feedUrl": "https://flaminghydra.com/rss/",
      "siteUrl": "https://flaminghydra.com/",
      "articles": [
        {
          "id": "686ec0b9bebdef0001f47fb5",
          "author": "The Editors",
          "description": "Misha Angrist talks fashion and neurology with Rick Bedlack; a valedictory sendoff for Linda Yaccarino by Joe MacLeod",
          "link": "https://flaminghydra.com/issue-357/",
          "publishedOn": "2025-07-09T23:40:19.000Z",
          "wordCount": 624,
          "title": "Listen to the suit / Talk to the hands",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/BedlackTurquoiseFashionably-crop-16x9-1.png"
        },
        {
          "id": "686eb3acbebdef0001f47f90",
          "author": "Misha Angrist",
          "description": "“There’s just a lot of despair in the world right now,” Rick Bedlack says. “There’s a lot of anger and negativity.” \nHe is 6’3” in cowboy boots, sporting large glasses, a full head of gray hair with a",
          "link": "https://flaminghydra.com/a-loud-suit-of-armor/",
          "publishedOn": "2025-07-09T23:40:08.000Z",
          "wordCount": 595,
          "title": "A Loud Suit of Armor",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/BedlackTurquoiseFashionably-crop-16x9.png"
        },
        {
          "id": "686ef257bebdef0001f48158",
          "author": "Joe MacLeod",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/remembering-linda-yaccarinos-career-at-x-dot-com-in-gestures/",
          "publishedOn": "2025-07-09T23:39:56.000Z",
          "wordCount": 364,
          "title": "Remembering Linda Yaccarino’s Career at X dot Com in Gestures",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/tiny-violin-hand.jpg"
        },
        {
          "id": "686d7244bebdef0001f46b05",
          "author": "The Editors",
          "description": "Miles Klee, naysayer; return to the road with Jack Pendarvis",
          "link": "https://flaminghydra.com/issue-356/",
          "publishedOn": "2025-07-09T00:39:50.000Z",
          "wordCount": 478,
          "title": "Not buying it / Suspending disbelief",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/No-sans-1.png"
        },
        {
          "id": "686d7728bebdef0001f46b27",
          "author": "Jack Pendarvis",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/ace-goes-to-hollywood-episode-8/",
          "publishedOn": "2025-07-09T00:39:04.000Z",
          "wordCount": 330,
          "title": "Ace Goes to Hollywood: Episode 8",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/manbun-16x9-edit.jpg"
        },
        {
          "id": "686698075fc5d20001174518",
          "author": "Miles Klee",
          "description": "Any headline that ends in a question mark can be answered by the word “No.”  \n                               —Betteridge's law of headlines\nQ. My neighbor’s dog often leaves solid waste on the tree lawn in front of his house. The piles are huge (the dog is",
          "link": "https://flaminghydra.com/betteridges-advice-column/",
          "publishedOn": "2025-07-09T00:38:38.000Z",
          "wordCount": 507,
          "title": "Betteridge's Advice Column",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/No-sans.png"
        },
        {
          "id": "686d7777bebdef0001f46b2c",
          "author": "The Editors",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/hydranym-no-7/",
          "publishedOn": "2025-07-08T20:07:27.000Z",
          "wordCount": 321,
          "title": "HYDRANYM No. 7",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/HYDRANYM-2.jpg"
        },
        {
          "id": "686c1e395fc5d20001175fe0",
          "author": "The Editors",
          "description": "Tod Seelie’s visit to the pretend war zone, and Zito Madu, missing the departed",
          "link": "https://flaminghydra.com/issue-355/",
          "publishedOn": "2025-07-07T23:30:55.000Z",
          "wordCount": 552,
          "title": "Built for violence / Left for dead",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/01-FtIrwin-webresedit-1-1.jpg"
        },
        {
          "id": "686c298e5fc5d20001176002",
          "author": "Tod Seelie",
          "description": "The town of Razish is located deep in the California desert, and is home to residents from various mostly Middle Eastern countries, plus the occasional bomb blast. The town is made of stacked shipping containers and plywood facades floating like a tiny beige garbage patch in an ocean of sand.",
          "link": "https://flaminghydra.com/razish/",
          "publishedOn": "2025-07-07T23:28:34.000Z",
          "wordCount": 553,
          "title": "Razish",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/01-FtIrwin-webresedit-1.jpg"
        },
        {
          "id": "6864735ecd718d000107c554",
          "author": "Zito Madu",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/safe-journey/",
          "publishedOn": "2025-07-07T23:27:32.000Z",
          "wordCount": 318,
          "title": "Safe journey",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/crop-warm-sun-16x9-000206-0053-000275.jpg"
        },
        {
          "id": "6866fed55fc5d2000117465a",
          "author": "The Editors",
          "description": "Zach Rabiroff in conversation with Billy Bragg about protest, comics, and cave walls",
          "link": "https://flaminghydra.com/issue-354/",
          "publishedOn": "2025-07-04T00:53:17.000Z",
          "wordCount": 361,
          "title": "Talking with the punk man about comic books",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/capt-america-16x9-1.png"
        },
        {
          "id": "6865a6acf4a63e00017f70cb",
          "author": "Zach Rabiroff",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/when-billy-bragg-met-alfred-e-neuman/",
          "publishedOn": "2025-07-04T00:42:45.000Z",
          "wordCount": 339,
          "title": "When Billy Bragg Met Alfred E. Neuman",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/capt-america-16x9.png"
        },
        {
          "id": "684ae0fee36b2c0001a46bc3",
          "author": "The Editors",
          "description": "Make your choice from among these 21 convivial entries on the theme: \nREUNION \nto choose the victor of Hydranym No. 6. \nHYDRANYM is the Creative Writing word game especially for Flaming Hydra subscribers. Please join in! It’s fun, and you will also receive our glorious email newsletter each",
          "link": "https://flaminghydra.com/hydranym-no-6-vote/",
          "publishedOn": "2025-07-04T00:19:49.000Z",
          "wordCount": 428,
          "title": "HYDRANYM No. 6: Vote!",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/HYDRANYM-1.jpg"
        },
        {
          "id": "68659638f4a63e00017f7073",
          "author": "The Editors",
          "description": "Remembering Dave Parker with John Saward; Felipe De La Hoz in a purple haze",
          "link": "https://flaminghydra.com/issue-353/",
          "publishedOn": "2025-07-03T01:40:44.000Z",
          "wordCount": 590,
          "title": "Big slugger / Warped colors",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/Parker_Pirates-16x9-crop-tight-1.jpg"
        },
        {
          "id": "68647519cd718d000107c5a2",
          "author": "John Saward",
          "description": "Six-foot-five, 245 pounds, a slugger from the age of behemoths and big-swingers, the real-deal furniture movers and bouncer-shaped designated hitters, the plodding old oafs running out of breath on stand-up doubles. But Dave Parker could move, was the thing; he could hit it all over, he could be pesky and",
          "link": "https://flaminghydra.com/dave-parker-trots-home/",
          "publishedOn": "2025-07-03T01:39:47.000Z",
          "wordCount": 608,
          "title": "Dave Parker Trots Home",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/Parker_Pirates-16x9-crop-tight.jpg"
        },
        {
          "id": "6862e8e6e9904f0001974c32",
          "author": "Felipe De La Hoz",
          "description": "I’m using my precious Hydra space this month to write about something that’s often been on my mind: LomoChrome Purple, an ISO 100-400 color-shift film emulsion produced by the cheeky analog photography company Lomography, which renders most scenes in sumptuous hues of blue and purple.\nNow,",
          "link": "https://flaminghydra.com/glow-in-the-dark/",
          "publishedOn": "2025-07-03T01:39:04.000Z",
          "wordCount": 755,
          "title": "Glow in the Dark",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/20250502-IMG_8760.jpg"
        },
        {
          "id": "686459cbcd718d000107c48e",
          "author": "The Editors",
          "description": "Yemisi Aribisala on a questionable insurance policy",
          "link": "https://flaminghydra.com/issue-352/",
          "publishedOn": "2025-07-02T01:03:52.000Z",
          "wordCount": 698,
          "title": "Global citizens",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/IMG_5696-1.jpg"
        },
        {
          "id": "68645012cd718d000107c3dc",
          "author": "Yemisi Aribisala",
          "description": "I visited a friend who was babysitting some relatives’ children, one Saturday afternoon 23 years ago. During the course of the visit, the children began to fight. One little boy had been called Nigerian, and as a consequence had become very offended. It emerged that they’d been",
          "link": "https://flaminghydra.com/born-in-the-usa/",
          "publishedOn": "2025-07-02T01:03:36.000Z",
          "wordCount": 764,
          "title": "Born in the USA",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/IMG_5696.jpg"
        },
        {
          "id": "68645ac4cd718d000107c49d",
          "author": "The Editors",
          "description": "Subscribe to Flaming Hydra to play HYDRANYM! It's bizarrely fun, plus you get to read the newsletters each weekday AND participate in the Comments Section.  YES.\nTHIS GAME ENDS MIDNIGHT PST WEDNESDAY, JULY 3\n\nTHE RULES\nCreate an ENTERTAINING and APT acronym from the letters provided. Use only",
          "link": "https://flaminghydra.com/hydranym-no-6/",
          "publishedOn": "2025-07-02T01:03:08.000Z",
          "wordCount": 493,
          "title": "HYDRANYM No. 6",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/HYDRANYM.jpg"
        },
        {
          "id": "686280b5e9904f0001974b1d",
          "author": "The Editors",
          "description": "Anna Merlan's golden hours, and Brian Hioe’s adventures as a feline baker",
          "link": "https://flaminghydra.com/issue-351/",
          "publishedOn": "2025-06-30T22:22:06.000Z",
          "wordCount": 350,
          "title": "Old gold / Kitten kitchen",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/divazus-fabric-store-Qe0txR7VKUU-unsplash.jpg"
        },
        {
          "id": "686059c2e9904f0001974870",
          "author": "Brian Hioe",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/pizza-cat/",
          "publishedOn": "2025-06-30T22:03:50.000Z",
          "wordCount": 326,
          "title": "Pizza Cat",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/pizzac.jpg"
        },
        {
          "id": "6862e97ce9904f0001974c40",
          "author": "Anna Merlan",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/mellow-yellow/",
          "publishedOn": "2025-06-30T22:03:12.000Z",
          "wordCount": 321,
          "title": "Mellow Yellow",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/divazus-fabric-store-Qe0txR7VKUU-unsplash-1.jpg"
        }
      ]
    },
    {
      "title": "Today in Tabs",
      "feedUrl": "https://rss.beehiiv.com/feeds/ZRiesnGI0u.xml",
      "siteUrl": "https://www.todayintabs.com/",
      "articles": [
        {
          "id": "https://www.todayintabs.com/p/what-would-you-do-617f",
          "author": "Rusty Foster",
          "description": "It happened here.",
          "link": "https://www.todayintabs.com/p/what-would-you-do-617f",
          "publishedOn": "2025-07-08T20:56:11.000Z",
          "wordCount": 19135,
          "title": "What Would You Do?",
          "enclosure": {
            "url": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/454a405a-4367-4a4c-988a-950cb78dedc4/IMG_1819.PNG",
            "length": "651477",
            "type": "image/png"
          },
          "imageUrl": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/454a405a-4367-4a4c-988a-950cb78dedc4/IMG_1819.PNG"
        }
      ]
    },
    {
      "title": "Bad Faith Times",
      "feedUrl": "https://bad-faith-times.ghost.io/rss/",
      "siteUrl": "https://badfaithtimes.com/",
      "articles": [
        {
          "id": "686c076acfaf6f00012f6cb8",
          "author": "Denny Carter",
          "description": "Bloodlust can never be a substitute for justice",
          "link": "https://badfaithtimes.com/in-the-absence-of-justice-we-have-dark-fantasies/",
          "publishedOn": "2025-07-07T18:29:07.000Z",
          "wordCount": 1858,
          "title": "In The Absence Of Justice, We Have Dark Fantasies",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/07/Screenshot-2025-07-07-at-2.24.27---PM-1-1.png"
        },
        {
          "id": "6866c80454e524000111a85e",
          "author": "Denny Carter",
          "description": "Folks who aren't down with fascism are going to have no choice but to leverage patriotism to beat back creeping authoritarianism",
          "link": "https://badfaithtimes.com/fireworks-in-the-age-of-fascism/",
          "publishedOn": "2025-07-03T19:46:10.000Z",
          "wordCount": 1306,
          "title": "Fireworks In The Age Of Fascism",
          "imageUrl": "https://badfaithtimes.com/content/images/size/w1200/2025/07/Screenshot-2025-07-03-at-3.43.29---PM.png"
        },
        {
          "id": "6863efde22d8620001268bb7",
          "author": "Denny Carter",
          "description": "The left has to accept that we have entered a post-materialist age, whether we like it or not",
          "link": "https://badfaithtimes.com/vibes-are-all-that-matter-now/",
          "publishedOn": "2025-07-02T12:04:45.000Z",
          "wordCount": 2309,
          "title": "Vibes Are All That Matter Now",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/07/Screenshot-2025-07-01-at-10.56.23---AM.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}