{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": []
    },
    {
      "title": "The Pitch",
      "feedUrl": "https://www.thepitchkc.com/feed/",
      "siteUrl": "https://www.thepitchkc.com/",
      "articles": [
        {
          "id": "https://www.thepitchkc.com/?p=861402",
          "author": "Pitch Staff",
          "description": "Art by Keegan Hudspeth   Bryan Busby KMBC 9 Meteorologist  The book, You are a badass, by Jen Sincero. It is a self-help book like no other, using very directed, frank wording. With a title like that, you can only imagine the language she uses to motivate you. I have given friends and my protégés this book as a holiday...",
          "link": "https://www.thepitchkc.com/the-pitchs-2024-holiday-self-gift-guide-for-spoiling-yourself/",
          "publishedOn": "2024-11-28T14:00:26.000Z",
          "wordCount": 8290,
          "title": "The Pitch’s 2024 Holiday Self-Gift Guide for spoiling yourself",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/l/x/giftguidesocial-head-1024x683.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=861989",
          "author": "Tiffany Watts",
          "description": "Q39 // Photo By Tiffany Watts If you’re on the hunt for the best chicken wings in Kansas City, you’re in luck. From smoky BBQ to bold international flavors, these local gems are redefining what it means to serve unforgettable wings. Here’s your ultimate guide to KC’s wing scene—grab your wet wipes and prepare for a flavor-packed journey. Mr. Wingz...",
          "link": "https://www.thepitchkc.com/kansas-city-wing-tour-six-must-try-spots-for-chicken-wing-lovers/",
          "publishedOn": "2024-11-27T22:00:22.000Z",
          "wordCount": 2451,
          "title": "Kansas City Wing Tour: Six must-try spots for chicken wing lovers",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/06/s/l/q39-photo-by-tiffany-watts-scaled.jpeg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=863493",
          "author": "Michael Mackie",
          "description": "Photo by Don Ipock Not unlike the arrival of Mariah Carey, the holidays aren’t the holidays without KCRep’s annual performance of the beloved holiday classic, Charles Dickens’s A Christmas Carol. Over the decades, the play—which runs through Dec. 28 at Spencer Theatre—has become an iconic KC tradition.  If you’ve been living under a rock, the show tells the tale of the...",
          "link": "https://www.thepitchkc.com/four-inane-questions-with-a-christmas-carols-nedra-dixon/",
          "publishedOn": "2024-11-27T20:00:23.000Z",
          "wordCount": 1913,
          "title": "Four Inane Questions with A Christmas Carol’s Nedra Dixon",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/11/m/m/screenshot-2024-11-26-090029.png"
        }
      ]
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=174830",
          "author": "Giri Nathan",
          "description": "The Washington Wizards started the season at a plucky 2-2. Perhaps that was pluckier than they intended. They proceeded to lose all 14 games they played in November, settling in the muck at a league-worst 2-16. This would be bleak new territory for most teams, but incredibly, this is not even the franchise's first winless month in the current calendar year. Last season's Wizards went 0-12 in February. That was part of a larger 16-game losing streak, tied for the worst in franchise history. Should the current Wizards lose three more games—and, given that the opponents are the Cavs, Mavs, and Nuggets, they might—they would claim that franchise record instead.\nAnother astonishing aspect is how uncompetitive the games themselves have been. The Wizards lost all 14 games in this streak by a margin of at least nine points, which had never been accomplished in NBA history. In 10 of those games, they were blown out by at least 15 points. The team is omni-directionally bad, with both the league's worst offensive rating and the worst defensive rating and, as such, the worst net rating, a gruesome -14.1.",
          "link": "https://defector.com/the-washington-wizards-won-nothing-in-november",
          "publishedOn": "2024-12-02T00:07:30.000Z",
          "wordCount": 6465,
          "title": "The Washington Wizards Won Nothing In November",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187063898-e1733096249201.jpg"
        },
        {
          "id": "https://defector.com/?p=174809",
          "author": "Diana Moskovitz",
          "description": "Jacksonville Jaguars quarterback Trevor Lawrence left Sunday's game on a medical cart after Houston Texans linebacker Azeez Al-Shaair hit the QB while he was sliding, appearing to lead with his forearm and helmet. The smack of the tackle could be heard on TV.\nLawrence lay motionless on the field in what looked like a fencing response. But it was hard to see all of Lawrence's body because, almost immediately, a fight broke out. After Al-Shaair made the tackle, Jaguars tight end Evan Engram rushed over and shoved him, and players from both teams escalated the clash. At one point, the broadcast showed a huge swath of players on one sideline as the fight wound down while, further away, a handful of personnel tended to Lawrence. ESPN's Michael DiRocco reported that \"an official knelt to protect Lawrence as the skirmish moved toward the Jaguars sideline.\"",
          "link": "https://defector.com/azeez-al-shaair-confronted-and-ejected-after-ugly-hit-that-gave-trevor-lawrence-concussion",
          "publishedOn": "2024-12-01T23:56:15.000Z",
          "wordCount": 5641,
          "title": "Azeez Al-Shaair Confronted And Ejected After Ugly Hit That Gave Trevor Lawrence Concussion",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187737594-e1733083534842.jpg"
        },
        {
          "id": "https://defector.com/?p=174790",
          "author": "Giri Nathan",
          "description": "For the second time in 2024, one of the best tennis players in the world has violated anti-doping rules. The International Tennis Integrity Agency announced Thursday that Iga Swiatek, currently the world No. 2, tested positive for the banned substance trimetazidine, a heart medication used in Europe and Asia to treat angina. It was detected in an out-of-competition test Swiatek provided just ahead of the Cincinnati Open in August, the ITIA said. Swiatek formally admitted to the anti-doping rules violation and accepted a one-month ban from the sport; her three weeks of provisional suspension earlier in the year count toward that ban and she is currently serving the remaining eight days during a meaningless stretch of the tennis calendar. She was also stripped of $158,944 in prize money and 390 ranking points for her semifinal run in Cincinnati.\nSwiatek previously had a provisional suspension as she sought to explain the source of the trimetazidine to the ITIA. While doing so, she missed tournaments in Seoul, Beijing, and Wuhan in September and October. Swiatek was able to have her suite of at least 14 supplements analyzed to identify a possible source of contamination. She concluded that the culprit was her melatonin, which Swiatek has long used, she said, because with \"all my traveling, jet lag and work-related stress mean that sometimes without it, I couldn’t fall asleep.\" She provided both an opened and unopened containers of the melatonin to the ITIA, which had them analyzed and found the contamination consistent with the trace amounts of trimetazidine detected in Swiatek's urine sample. Her provisional suspension was lifted and she was able to continue competing at the WTA's year-end finals, per the ITIA decision.",
          "link": "https://defector.com/iga-swiatek-suspended-after-testing-positive-for-banned-substance",
          "publishedOn": "2024-12-01T19:09:55.000Z",
          "wordCount": 7783,
          "title": "Iga Swiatek Suspended After Testing Positive For Banned Substance",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2166195136-e1733077571226.jpeg"
        },
        {
          "id": "https://defector.com/?p=174796",
          "author": "Diana Moskovitz",
          "description": "Michigan beat Ohio State on Saturday for the fourth season in a row. The win gave this year's senior class at Michigan a clean sweep over their longtime Buckeye rivals, and it was a stunning upset as OSU hosted the game and came into it ranked second in the country. Sure, college players are increasingly transferring between programs and extending their careers into their mid-twenties, but facts like that mean little next to the emotions of a longstanding rivalry that goes back more than a century. The most important fact of all is that Ohio State and Michigan hate each other. When the Wolverines won in Columbus, 13-10, and a player tried to plant a Michigan flag on the field, a brawl unsurprisingly followed.\nReporters were already on the field when the fight broke out, and Nicole Shearin of WBNS got video of what happened. The Michigan player, carrying a Michigan flag on a pole, walked up to an area of the field and motioned as if to plant the flag. He was slowed down, first by what looked like people in Ohio State clothing, followed by someone in Michigan clothing who put his arms around the player. The Michigan player wasn't able to plant the flag, but kept talking as Ohio State athletes filled up the area. Video from another angle by UMGoBlue showed that after the failed flag planting, an Ohio State player grabbed the cloth part of the Michigan flag and ripped it off its pole. In the videos, this is when the fight started. (A different video also showed former Wolverine turned broadcaster Jason Avant securing the loose Michigan flag, but it's hard to tell when that happened relative to everything else.)",
          "link": "https://defector.com/police-pepper-spray-players-during-michigan-ohio-state-postgame-fight",
          "publishedOn": "2024-12-01T18:49:40.000Z",
          "wordCount": 6542,
          "title": "Police Pepper Spray Players During Michigan-Ohio State Postgame Fight",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187064922-e1733062541146.jpeg"
        },
        {
          "id": "https://defector.com/?p=174490",
          "author": "Patrick Redford",
          "description": "The United States Women's National Team is currently in Europe to play a pair of friendlies that will thoroughly stretch the meaning of that designation.\nFirst up is a date with England at Wembley, both a homecoming for USWNT coach Emma Hayes and a fascinating opportunity to consider the dynamics of the transatlantic soccer exchange on both the Olympic champions and the European champions. Hayes, of course, made her name managing Chelsea for over a decade, though she got her start coaching in New York, a bit north of where Three Lionesses manager Sarina Wiegman played college soccer. USWNT vets have enjoyed short stints in England, and so many England players have tussled in the NWSL that The Athletic ran a long story with quotes from each payer about how physical and demanding the standard of play was stateside. The game is not exactly a referendum on whose development environment is better, though it does provide an occasion to think seriously about at the state of the best women's club league and the second-best as it closes the gap. It's also a serious test for both teams with close to their full rosters.",
          "link": "https://defector.com/enjoy-the-lily-yohannes-victory-lap",
          "publishedOn": "2024-11-29T21:23:07.000Z",
          "wordCount": 6769,
          "title": "Enjoy The Lily Yohannes Victory Lap",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2187000462.jpg"
        },
        {
          "id": "https://defector.com/?p=174670",
          "author": "Patrick Dubuque",
          "description": "Defector has partnered with Baseball Prospectus to bring you a taste of their work. They write good shit that we think you’ll like. If you do like it, we encourage you to check out their site and subscribe.\nThis story was originally published at Baseball Prospectus on November 22.",
          "link": "https://defector.com/the-last-pitcher",
          "publishedOn": "2024-11-29T17:24:11.000Z",
          "wordCount": 8728,
          "title": "The Last Pitcher",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-1387469914.jpg"
        },
        {
          "id": "https://defector.com/?p=174198",
          "author": "Felix Kent",
          "description": "I recently stayed at a blandly business-oriented hotel in San Jose in order to celebrate my birthday, drink a tall boy, and watch the Sharks lose. You know this type of hotel. There were white duvet covers, white sheets, beige walls, dark wood for the closet and bathroom doors. There was a nice light under a wall bench to help you find your way to the bathroom in the middle of the night. The soundproofing was good.\nThere was also, of course, a picture on the wall. There is always a picture on the wall in hotel rooms. It was a photograph and it showed a cement wall and floor belonging to what seemed to be a warehouse building.",
          "link": "https://defector.com/why-does-hotel-art-look-like-that",
          "publishedOn": "2024-11-29T14:00:40.000Z",
          "wordCount": 10070,
          "title": "Why Does Hotel Art Look Like That?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-1265276272.jpg"
        },
        {
          "id": "https://defector.com/?p=174669",
          "author": "David Roth",
          "description": "It is not important how late I stayed up watching Rutgers defeat Notre Dame on Tuesday night, in one of the many Thanksgiving-season college basketball tournaments happening right now. It is sufficient to say that it was late enough that I felt both tired and stupid the next morning, and arrived at my parents' house the next evening to help with Thanksgiving prep both a little droopy and decently primed for the cascading excesses of this season. Staying up to watch tournaments sponsored by the manufacturers of the orange-shaped chocolate thing my in-laws like, or the early rounds of the Bad Boy Mowers Battle 4 Atlantis, is a kind of gluttony in itself. It's less literal than the kind that generally defines Thanksgiving, but it comes from the same place—the instinct, when presented with an abundance of something/anything, to let yourself have a little treat, and then maybe another after that.",
          "link": "https://defector.com/staying-up-late-and-being-stupid",
          "publishedOn": "2024-11-28T17:21:21.000Z",
          "wordCount": 7074,
          "title": "Staying Up Late And Being Stupid",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2186464399-1.jpg"
        },
        {
          "id": "https://defector.com/?p=174547",
          "author": "Drew Magary",
          "description": "Drew Magary’s Thursday Afternoon NFL Dick Joke Jamboroo runs every Thursday at Defector during the NFL season. Got something you wanna contribute? Email the Roo. And buy Drew’s book, The Night The Lights Went Out, through here.\nIt’s Thanksgiving today, and I have only one message for you, the Holiday-American: please pass the salt. Do not hog the salt. Do not set the table without salt and pepper, as if the food you’ve cooked has already been flawlessly seasoned. And do NOT, under any circumstances, give me any guff when I ask for more salt on my food.",
          "link": "https://defector.com/pass-the-salt",
          "publishedOn": "2024-11-28T15:14:07.000Z",
          "wordCount": 14686,
          "title": "Pass The Salt",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-175040791.jpg"
        },
        {
          "id": "https://defector.com/?p=174698",
          "author": "Dan McQuade",
          "description": "Trent Green does not have a long acting career. His IMDb page is basically his football career. For example, it lists him as appearing in 11 episodes of NFL On Fox as “Self,” while quarterbacking Washington, St. Louis, and Kansas City. Now Green has a real credit to his name, though he’s still playing himself—Trent Green is in a Hallmark Christmas movie.\nEarlier this week, Alex, Kelsey, Sabrina and I discussed Christmas in the Spotlight. That was a Lifetime Christmas movie featuring not-so-thinly veiled versions of Taylor Swift and Travis Kelce. It was like any other football movie that existed in a world outside the NFL, in that the teams were fake—the Kelce character, Gonzo, played for the Bay Springs Bombers—and the extra-large end zones in the football scenes were proof that the film was made in Canada. But Trent Green’s movie debut features the real Kansas City Chiefs. Holiday Touchdown: A Chiefs Love Story, which premieres Saturday, is an actual honest-to-God NFL-licensed Hallmark Christmas movie. Score one for Hallmark in the annual contest for made-for-TV Christmas supremacy.",
          "link": "https://defector.com/they-put-trent-green-in-this-hallmark-christmas-movie",
          "publishedOn": "2024-11-27T18:43:54.000Z",
          "wordCount": 7651,
          "title": "They Put Trent Green In This Hallmark Christmas Movie",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/trent-green-holiday-touchdown.jpg"
        }
      ]
    },
    {
      "title": "Joe's Weather Blog | In-depth Kansas City forecasts | FOX4KC",
      "feedUrl": "http://fox4kc.com/category/weather/weather-blog/feed/",
      "siteUrl": "https://fox4kc.com",
      "articles": [
        {
          "id": "https://fox4kc.com/?p=3744369",
          "author": "Joe Lauria",
          "description": "It's not a wide band, but it's a mighty one. About 10-15 miles from north to south around that band there are little or no impact, and in the band, there are crashes and road closures. This is what I've been concerned about for two days and last night I hit this hard. I had [...]",
          "link": "https://fox4kc.com/weather/weather-blog/joes-blog-band-of-snow-creates-a-mess-in-kc-sat-11-30/",
          "publishedOn": "2024-11-30T15:50:00.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Band of snow creates a mess in KC (SAT-11/30)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11304.png?w=570",
            "type": "image/png",
            "length": "920469"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11304.png?w=570"
        },
        {
          "id": "https://fox4kc.com/?p=3744369",
          "author": "Joe Lauria",
          "description": "It's not a wide band, but it's a mighty one...roughly 10-15 miles from north to south...around that band there is little or no impacts and in the band there are crashes and road closures. This is what I've been concerned about for two days and last night I hit this hard. I had a bad [...]",
          "link": "https://fox4kc.com/email-alerts/joes-weather-blog-email-alerts/joes-blog-band-of-snow-creates-a-mess-in-kc-sat-11-30/",
          "publishedOn": "2024-11-30T15:50:00.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Band of snow creates a mess in KC (SAT-11/30)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11304.png?w=570",
            "type": "image/png",
            "length": "920469"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11304.png?w=570"
        },
        {
          "id": "https://fox4kc.com/?p=3743490",
          "author": "Joe Lauria",
          "description": "As we head toward the last day of November tomorrow, Mother Nature may give us a last day of November snow, and perhaps, it may be more than just a casual amount for parts of the area",
          "link": "https://fox4kc.com/weather/weather-blog/joes-blog-fast-moving-snows-saturday-fri-11-29/",
          "publishedOn": "2024-11-29T16:50:24.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Fast moving snows Saturday (FRI-11/29)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11298.png?w=900",
            "type": "image/png",
            "length": "1885239"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11298.png?w=900"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": []
    },
    {
      "title": "local food",
      "feedUrl": "https://www.kcur.org/tags/local-food.rss",
      "siteUrl": "https://www.kcur.org/tags/local-food",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}