{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": [
        {
          "id": "https://blogs.fangraphs.com/?p=464608",
          "author": "Dan Szymborski",
          "description": "Kansas City needs to call up Caglianone to prevent a terrible offense from dragging down its best pitching staff since the 1980s.",
          "link": "https://blogs.fangraphs.com/royals-be-nimble-royals-be-quick-royals-desperately-need-jacs-stick/",
          "publishedOn": "2025-05-30T18:00:01.000Z",
          "wordCount": null,
          "title": "Royals Be Nimble, Royals Be Quick, Royals Desperately Need Jac’s Stick",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://blogs.fangraphs.com/?p=464448",
          "author": "Leo Morgenstern",
          "description": "Kansas City could be on its way to one of the greatest seasons of stolen base prevention that any of us has ever seen.",
          "link": "https://blogs.fangraphs.com/no-one-is-running-on-the-royals/",
          "publishedOn": "2025-05-29T17:00:35.000Z",
          "wordCount": null,
          "title": "No One Is Running on the Royals",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://blogs.fangraphs.com/?p=464430",
          "author": "Eric Longenhagen and James Fegan",
          "description": "This is a below-average system with one big fish at the very top, several high-variance hitters with hit tool risk, and a fair number of pitchers with starter-quality command.",
          "link": "https://blogs.fangraphs.com/kansas-city-royals-top-35-prospects/",
          "publishedOn": "2025-05-29T13:00:06.000Z",
          "wordCount": null,
          "title": "Kansas City Royals Top 35 Prospects",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=191058",
          "author": "Diana Moskovitz",
          "description": "A woman sued Pelicans power forward Zion Williamson on Thursday, saying Williamson raped her multiple times. She also said in the complaint that he physically hurt her, stalked her, and threatened to kill her and her family. The woman filed as Jane Doe in Los Angeles County Superior Court and said the violence occurred while she and Williamson were dating for several years.\nThe lawsuit listed nine causes of action: assault, battery, sexual battery, intentional infliction of emotional distress, domestic violence, stalking, burglary, false imprisonment, and conversion. A lawyer for Williamson responded by issuing a statement saying the allegations were \"categorically false and reckless\" and calling the lawsuit \"an attempt to exploit a professional athlete driven by a financial motive rather than any legitimate grievance.\"",
          "link": "https://defector.com/zion-williamson-accused-of-rape-domestic-violence-in-lawsuit",
          "publishedOn": "2025-05-30T21:10:46.000Z",
          "wordCount": 7913,
          "title": "Zion Williamson Accused Of Rape, Domestic Violence In Lawsuit",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2198065030-e1748632204160.jpeg"
        },
        {
          "id": "https://defector.com/?p=191074",
          "author": "Drew Magary",
          "description": "I’m about to spoil the ending of Mission: Impossible—The Final Reckoning for you, but that’s fine. You don’t go to an M:I movie for things like “a coherent plot” or “fully realized characters.” You go for the stunts, for Tom Cruise breaking into a dead sprint, and for shit to blow up real good. Going by those metrics, The Final Reckoning delivers. I got my money’s worth, and then some.\nBut there was one extra draw to The Final Reckoning, which was that it was presumably the final movie Cruise would do for the franchise. After all, “The Final Reckoning” is right there in the title. Also, Cruise is 62 years old and surely hellbent on finally getting himself a Best Actor statuette before he goes to Scientology heaven. So it made perfect sense for him to bow out of this series while his limbs were still intact.",
          "link": "https://defector.com/if-tom-cruise-really-loved-movies-he-would-let-me-watch-him-die",
          "publishedOn": "2025-05-30T20:26:18.000Z",
          "wordCount": 7814,
          "title": "If Tom Cruise REALLY Loved Movies, He Would Let Me Watch Him Die",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2215904376.jpg"
        },
        {
          "id": "https://defector.com/?p=191061",
          "author": "Drew Magary",
          "description": "Talk about HIGH seas! Here’s a video of Patriots wideout Stefon Diggs pulling an offseason Odell Beckham to pARRRRGHty with some lovely ladies (and girlfriend Cardi B) on a luxury yacht:\n\nhttps://twitter.com/imabout2tweetu/status/1927326121688756522",
          "link": "https://defector.com/the-stefon-diggs-experience-reaches-its-inevitable-maritime-climax",
          "publishedOn": "2025-05-30T19:23:58.000Z",
          "wordCount": 7673,
          "title": "The Stefon Diggs Experience Reaches Its Inevitable Maritime Climax",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/Diggs_on_a_boat.png"
        },
        {
          "id": "https://defector.com/?p=190978",
          "author": "David Roth",
          "description": "In quiet moments, you can almost hear the faint sizzling sound of AI corroding humanity's capacity for inquiry and sustained, focused thought. The arguments against this—that the technology itself does not work very well, or at all; that the ability to reason things out on our own is actually both important for a healthy society and more or less the thing that makes us human—don't seem to be working, and have barely registered. People ask chatbots or AI-larded search engines for answers to questions that chatbots inherently cannot understand, receive a confidently phrased but often luridly wrong result, and move on grateful for the convenience and exactly zero percent wiser for having done so. It is not just that the responses might be incorrect, although they really might be; it's that asking the question at all seems only to make the answer recede further into abstraction. This is something that even the smartest people in the most specialized areas are experiencing, so you can only imagine how stupid the results might be when someone like me does something with it. \nHere is an example of this. An online friend noted yesterday that Google's search delivered some surprising and hard to explain results on the question of what Sam Presti's name is. This would not seem to be much of a question at all, and the AI overview's answer seemed self-evident. Sam Presti's name, it said, is Sam Presti.",
          "link": "https://defector.com/what-is-sam-prestis-name-the-answers-may-surprise-you",
          "publishedOn": "2025-05-30T19:10:28.000Z",
          "wordCount": 9753,
          "title": "What Is Sam Presti’s Name? The Answer(s) May Surprise You.",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-1976112305.jpg"
        },
        {
          "id": "https://defector.com/?p=191028",
          "author": "Albert Burneko",
          "description": "The topic, in Defector's internal chat, on Friday, was a ban, in the nation of France, on smoking in most outdoor spaces. How can the French—the French!—ban smoking? David Roth observed that \"this feels like one of those things that leads to a bunch of guys in day-glow vests overturning a police van\"; Kelsey McKinney said \"they're gonna light the streets on fire\"; Barry Petchesky quipped that it is \"time for le vape.\" \nThe discussion then drifted onto the topic of which world populations smoke the most cigarettes (the Balkans, apparently?). But suddenly, Slack warned: Dave McKenna is typing. This is the Slack equivalent of hearing the hiss of a burning fuse. Here, lightly edited to remove various lols and feeble attempts at returning to the subject of world smoking habits, is what ensued.",
          "link": "https://defector.com/dave-mckenna-insists-they-have-ham-trucks-in-france",
          "publishedOn": "2025-05-30T18:23:19.000Z",
          "wordCount": 12152,
          "title": "Dave McKenna Insists They Have Ham Trucks In France",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2169069514.jpg"
        },
        {
          "id": "https://defector.com/?p=191019",
          "author": "Ray Ratto",
          "description": "There was a time not that long ago when the West Sacramento Athletics were positioning themselves to replace The Hunny Club as the pride of Yolo County, which would have been a true festival of inner conflict for the region. By \"not that long ago,\" we mean May 5.\nSince then, the A’s have clarified their position. And by \"clarified their position,\" we mean \"challenged the Colorado Rockies for the title of worst baseball team on earth.\" The A’s are back in their customary spot as a readily visible example of an organization loathing everything it inadvertently represents, and The Hunny Club has solidified its hold on Yolo’s hearts, if only because of the acronym.",
          "link": "https://defector.com/the-athletics-have-hopped-back-into-the-dumpster",
          "publishedOn": "2025-05-30T15:44:12.000Z",
          "wordCount": 8382,
          "title": "The Athletics Have Hopped Back Into The Dumpster",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2217048614.jpg"
        },
        {
          "id": "https://defector.com/?p=190982",
          "author": "Dan McQuade",
          "description": "John Laurinaitis has pulled off a twist worthy of his time as on-screen GM of WWE Monday Night Raw. That is, it was very obviously coming well before it happened. WWE’s former head of talent relations has been dropped as a co-defendant in Janel Grant’s sex trafficking lawsuit accusing Vince McMahon of gross sexual acts. Representatives for Grant and Laurinaitis announced a settlement-cooperation deal earlier this week; a statement said Laurinaitis will provide “evidence” against McMahon.\n“His agreement to a confidential settlement is a pivotal next step toward holding McMahon and WWE accountable and bringing justice to Ms. Grant after years of sexual abuse and trafficking,” representatives for Grant and Laurinaitis said in the joint statement. “Mr. Laurinaitis looks forward to moving on with his life.”",
          "link": "https://defector.com/john-laurinaitis-says-he-will-testify-against-vince-mcmahon",
          "publishedOn": "2025-05-30T14:44:34.000Z",
          "wordCount": 6552,
          "title": "John Laurinaitis Says He Will Testify Against Vince McMahon",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/mcmahon-lauriniatis.jpg"
        },
        {
          "id": "https://defector.com/?p=190991",
          "author": "Post-Postdoc",
          "description": "My first favorite search engine was Lycos. Why? There’s no single explanation. I know it had a dog logo, which very possibly made a positive impression on my younger self. It had an exotic-sounding name, so that was a point in its favor. But I just felt like it fit my vibe. AOL? We didn't pay for that. Ask Jeeves? OK, boomer (is what I would have said if I was sassy and/or prescient). Alta Vista? Yahoo? (Apologies—Yahoo!?) I dunno; they weren't for me.\nIn some small way, there was some identity-making going on. But nothing that happened on a computer at that time felt very consequential to me. What were computers for, after all? I didn't really play video games, aside from a brief phase of getting pretty into Civilization (I or II or III? I have no idea). I remember a cousin showing me Myst and being impressed but confused; I remember playing Doom, probably with a sibling or a neighbor. But all of the stuff that happened on the computer seemed a little pointless, a little dull, a little like work. Observationally, people used it to stare at spreadsheets, and to write stuff. (Lame!) Games were on disks (actual floppies, nominal floppies, or CD-ROMs). Otherwise, it was just a boring work box.",
          "link": "https://defector.com/the-ai-floodwaters-are-rising-fast",
          "publishedOn": "2025-05-30T14:20:20.000Z",
          "wordCount": 12764,
          "title": "The AI Floodwaters Are Rising Fast",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-544980403.jpg"
        },
        {
          "id": "https://defector.com/?p=190936",
          "author": "Kelsey McKinney",
          "description": "Welcome to Ask The Book Doctor, a new recurring series about books and reading them.\nMy home is full of books. Because I am able to justify it as “supporting the local bookstore” and “keeping my own career afloat,” I am constantly buying books. I have four full bookshelves of fiction and three of non-fiction. There are two individual shelves of poetry, and a shelf just for the collected works of Shakespeare. There is a half a shelf of books in my office that I have not read yet, but might want to read one day. But sometimes, I pick through them all, and I do not want them. I want to read something, but what?",
          "link": "https://defector.com/got-a-reading-problem-ask-the-book-doctor",
          "publishedOn": "2025-05-30T13:49:54.000Z",
          "wordCount": 8469,
          "title": "Got A Reading Problem? Ask The Book Doctor!",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/ask-the-book-doctor-color.jpg"
        },
        {
          "id": "https://defector.com/?p=190983",
          "author": "Ray Ratto",
          "description": "Late in the New York Knickerbockers' conprehensive but semi-drab 111–94 beating of the Indiana Pacers, TNT analyst Stan Van Gundy took his inner grump for one final walk around the broadcast by saying something along the lines of, After Game 4, people were asking why Jalen Brunson couldn't be a little more like Tyrese Haliburton, and after Game 5 they'll be asking why Tyrese Haliburton couldn't be a little bit more like Jalen Brunson.\nIt was, yes, another lament about who the next face of the NBA's Eastern Conference would be, because the game itself carried so little entertainment. In fairness, the first four games had been excellent and Game 4 preposterously so, thus Game 5 would have to suffer by comparison. That the margin of fun between the two was this large, though, came as a bit of an annoyance to Van Gundy, and to be sure nearly anyone not sitting courtside at Madison Square Garden. Frankly, the biggest moment in Knicks–Pacers was when Peter DeBoer hooked goaltender Jake Oettinger after eight minutes in Dallas' 6-3 series-killing loss to Edmonton.",
          "link": "https://defector.com/they-cant-all-be-thrillers",
          "publishedOn": "2025-05-30T13:17:46.000Z",
          "wordCount": 7787,
          "title": "They Can’t All Be Thrillers",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2217390929.jpg"
        },
        {
          "id": "https://defector.com/?p=190893",
          "author": "David Roth",
          "description": "Drew and I agreed before Memorial Day weekend that it was time for a Just The Two Of Us episode of The Distraction, but it wasn't until much closer to recording it that we decided what kind of episode that would be. There is more than one kind of those, and while we were probably due for one of the loopy, pre-vacation, Oops! All Digressions episodes, there is a whole long summer ahead of us to fill with those, and still some really good playoff basketball happening. Between the fact of that dwindling season and Drew's latter-day return to NBA fandom, the decision was decently easy. It's a just-us episode, but this one is also About Sports.",
          "link": "https://defector.com/activating-the-dunk-machine",
          "publishedOn": "2025-05-29T20:33:58.000Z",
          "wordCount": 7648,
          "title": "Activating The Dunk Machine",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2216913680.jpg"
        },
        {
          "id": "https://defector.com/?p=190952",
          "author": "Patrick Redford",
          "description": "Late in the second set of his matchup with French doubles specialist Pierre-Hugues Herbert, 18-year-old Brazilian player João Fonseca scored a point to even the tenth game of the set at 30–all. \"Scored\" is the most active verb I can use there, as the exchange only ended when Herbert dumped an unthreatening rally ball into the net. Yet Fonseca erupted into a celebration, conducting the crowd into a froth, asking for more energy, more pressure. It was like stepping to the free-throw line and cupping a hand to one's ear for more noise.\nFonseca lost that game, though he won the set in a tiebreak, then took the third set, 6–4, to move on to the third round of the French Open. There is a lot to love about Fonseca, the ebullient princeling of men's tennis. To me, the most striking thing about the Fonseca experience, more than the actual striking itself, is his relationship with pressure. He doesn't shy from it; he courts it. He doesn't wilt; he locks in. Fonseca demands attention, and he performs, displaying a magnetic brand of confidence in his equally magnetic game. I can't look away.",
          "link": "https://defector.com/joao-fonseca-loves-the-pressure",
          "publishedOn": "2025-05-29T19:18:04.000Z",
          "wordCount": 8243,
          "title": "João Fonseca Loves The Pressure",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2216983714.jpg"
        },
        {
          "id": "https://defector.com/?p=190780",
          "author": "Luis Paez-Pumar",
          "description": "Welcome to The Backlog, a series in which we will take a look back at 12 games from 2020 that, in one way or another, had a lasting impact on the video game industry. \nXenoblade Chronicles: Definitive Edition, is yet another remake that was released in 2020, and the third such game to appear in this column. The lesson it provides is that sometimes the best way to remake a game is also the simplest.",
          "link": "https://defector.com/xenoblade-chronicles-definitive-edition-is-what-a-remake-should-be",
          "publishedOn": "2025-05-29T17:47:13.000Z",
          "wordCount": 12123,
          "title": "‘Xenoblade Chronicles: Definitive Edition’ Is What A Remake Should Be",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/sc82l3.jpg"
        },
        {
          "id": "https://defector.com/?p=190712",
          "author": "Sabrina Imbler",
          "description": "Becca Beckham grew up around the South in a military family. Beckham's family moved every two to four years, and she grew up, she says, with public service in her heart. \"The military really shaped my family, and I appreciate everything that it's done,\" she said. \"But I knew in my heart that that is not the path that I wanted to take.\" \nBeckham always knew she wanted to experience more of the United States. In college, she became interested in the Peace Corps, and then AmeriCorps—the federal agency that organizes community service across the nation. \"It's this vague, big thing that a lot of people have heard of, but they're not necessarily sure what it does,\" Beckham said. AmeriCorps, envisioned as the national version of the Peace Corps, was created in 1993 under President Bill Clinton. The agency offers people opportunities to serve communities across the U.S., addressing needs such as education, disaster response, and public health. Beckham joined an AmeriCorps program that led a team of 10 people around the nation for a year, working on disaster relief efforts in Missouri, Colorado, Texas, Alabama, and New York.",
          "link": "https://defector.com/an-interview-with-a-fired-americorps-portfolio-manager",
          "publishedOn": "2025-05-29T17:04:12.000Z",
          "wordCount": 14557,
          "title": "An Interview With A Fired AmeriCorps Portfolio Manager",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/image0_f71e98.jpeg"
        },
        {
          "id": "https://defector.com/?p=190830",
          "author": "Sebastian Stockman",
          "description": "Every March, I get an email from Joan Lanigan at City Hall: The Binder has arrived.\nThe Spelling Bee words are in The Binder. I need The Binder because I'm the Pronouncer.",
          "link": "https://defector.com/confessions-of-a-spelling-bee-pronouncer",
          "publishedOn": "2025-05-29T16:09:46.000Z",
          "wordCount": 14951,
          "title": "Confessions Of A Spelling Bee Pronouncer",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-839134850-e1748454221431.jpg"
        },
        {
          "id": "https://defector.com/?p=190907",
          "author": "Lauren Theisen",
          "description": "I'd say it had to be Carter Verhaeghe, and in fact it was, but to give him the full credit for yet another heartbreaking playoff goal would obscure the effort of Aleksander Barkov, who deserves the majority of the applause for the late game-winner in the Panthers' series clincher against the Hurricanes. Thanks to this pair, Florida is heading to the Stanley Cup Final for the third straight year. And they've made it this far looking just as tough, nasty, and talented—if not even more so.\nHurricanes fans couldn't have had much hope after their team went down three games to none, but the next four periods of hockey might have shown them, briefly, a glimmer of light. There was the shutout win on Monday to start, and then on Wednesday, Sebastian Aho managed to beat Sergei Bobrovsky twice in the first period for a 2-0 lead. That early advantage wasn't enough, though. Florida hit them with three goals in the middle of the second period, and after Seth Jarvis struck back to tie it for the home team in the third, Verhaeghe silenced the Carolina crowd for the summer.",
          "link": "https://defector.com/the-panthers-are-a-nightmare-for-the-rest-of-the-nhl",
          "publishedOn": "2025-05-29T15:30:04.000Z",
          "wordCount": 7536,
          "title": "The Panthers Are A Nightmare For The Rest Of The NHL",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2217576203.jpg"
        },
        {
          "id": "https://defector.com/?p=190755",
          "author": "Victoria Zeller",
          "description": "The following excerpt is from Victoria Zeller's debut novel One of the Boys, released from Levine Querido on May 13. The book follows 17-year old Grace, a D-I bound kicker who left the world of football behind (or so she thought) when she came out as trans.",
          "link": "https://defector.com/kicking-practice",
          "publishedOn": "2025-05-29T15:16:02.000Z",
          "wordCount": 15134,
          "title": "Kicking Practice",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-86734626.jpg"
        },
        {
          "id": "https://defector.com/?p=190885",
          "author": "Dave McKenna",
          "description": "Rick Derringer, a rock and roll lifer, a force behind the “rock 'n wrestling” melding of the 1980s and other sporting and music nexuses, is dead.\nDerringer died Monday in Ormond Beach, Fla. No official cause of death was released, but a family member said he'd been suffering from complications from heart surgery earlier this year. He was 77.",
          "link": "https://defector.com/rick-derringer-made-rock-and-roll-fun",
          "publishedOn": "2025-05-29T14:11:12.000Z",
          "wordCount": 8327,
          "title": "Rick Derringer Made Rock And Roll Fun",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-491390151.jpg"
        },
        {
          "id": "https://defector.com/?p=190897",
          "author": "Chris Thompson",
          "description": "\"NBA people will tell you the toughest game to win in the playoffs is the close-out game,\" explained Mike Breen, minutes before the opening tip of Game 5 of the Western Conference final, by way of laying down the stakes. \"And that's OKC's challenge tonight, because Minnesota is playing for their season.\" There was a quality of pleading in Breen's face: A certain matte non-twinkle in the eyes, a tendency of the outer points of features to turn down. He was a man grappling with an expression, actively managing his mouth shapes and struggling to etch something delight-ish into the available margins. Perhaps you are thinking this is an artifact of botox. That is not your damn business! To me Breen's face was succumbing in realtime not to the horrors of botulism but to the burden of forced hope…",
          "link": "https://defector.com/abandon-all-hope-ye-who-enter-oklahoma-city",
          "publishedOn": "2025-05-29T13:01:46.000Z",
          "wordCount": 10238,
          "title": "Abandon All Hope, Ye Who Enter Oklahoma City",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2217577243.jpg"
        },
        {
          "id": "https://defector.com/?p=190781",
          "author": "Maitreyi Anantharaman",
          "description": "The other day, bemoaning the state of his WNBA fantasy team bench, my colleague Jasper mentioned that he’d just picked up a player he’d never heard of: someone named \"K. Westbeld,\" with no photo. This was more or less how the real Phoenix Mercury conducted their offseason business. The team has not owned its first-round pick in five straight drafts. To construct the new “big three” of Kahleah Copper, Alyssa Thomas and Satou Sabally, Phoenix dealt away virtually every other rotation role player they had. Basketball teams tend to have more than three players on them. So began an offseason scrounge through the photoless. \nBut don’t judge a player by her lack of photo! Two weeks into the WNBA season, the Mercury are one of the most fun teams to watch, in large part thanks to international scouting finds the average WNBA fan had not heard of before now. In Kathryn Westbeld—and fellow new signings Monique Akoa Makani, Kitija Laksa and Lexi Held—the Mercury have some real role-player gems. They defend, pass, shoot, and generally make good decisions. At home against the Sky on Tuesday, they led the team to a 94-89 win after trailing by 16 in the third. An incredible fourth quarter saw Laksa, Akoa Makani and Westbeld combine for six threes.",
          "link": "https://defector.com/the-mercury-are-getting-plenty-of-help-from-their-intriguing-randos",
          "publishedOn": "2025-05-28T21:25:43.000Z",
          "wordCount": 8081,
          "title": "The Mercury Are Getting Plenty Of Help From Their Intriguing Randos",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2217415429.jpg"
        },
        {
          "id": "https://defector.com/?p=190854",
          "author": "Patrick Redford",
          "description": "When the nervous peloton began their long, slow ascent up out of the Adda River valley to Bormio to finish Stage 17 of the Giro d'Italia, I thought Isaac Del Toro was cooked. The 21-year-old Mexican rider had put up an admirable fight for the first 16 stages of the Giro, and though he'd clung on to the maglia rosa leader's jersey longer than anyone expected he'd be able to, third weeks of Grand Tours are unforgiving, especially for a young rider who has never faced the pressure of defending a leader's jersey before. \nOne day earlier, Del Toro cracked on the San Valentino, losing over 90 seconds to the hardened Richard Carapaz and the moderately hardened Simon Yates; one climb earlier, Carapaz and Yates made him quiver. It stood to reason that Del Toro's infirmity would compound, and the veterans would do him the courtesy of easing the pain of carrying the jersey. Instead, he seized the initiative and smoked everyone to win his first Grand Tour stage in style.",
          "link": "https://defector.com/isaac-del-toro-meets-the-moment",
          "publishedOn": "2025-05-28T20:50:54.000Z",
          "wordCount": 8857,
          "title": "Isaac Del Toro Meets The Moment",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2217505651.jpg"
        },
        {
          "id": "https://defector.com/?p=190753",
          "author": "Charles P. Pierce",
          "description": "Like brother Magary, I have been re-energized as a fan by this year’s NBA playoffs, although I do admit that watching Jayson Tatum take one of Paris’s arrows harshed my mellow considerably—classical allusion courtesy of the Society of Jesus, circa 1974. It  was partly un-harshed by the emergence of Luke Kornet, Force of Nature. But, otherwise, it has been a voyage of discovery. I knew Anthony Edwards because my friend Tom Crean had recruited him at Georgia, but Jaden McDaniels was a complete mystery to me. I couldn’t keep Luka Doncic and Nikola Jokic straight for the longest time. Tyrese Haliburton might have been the lead singer for the Spinners for all I knew.\nWhen did Shai Gilgeous-Alexander get this good?",
          "link": "https://defector.com/can-the-nba-still-produce-interesting-coaches",
          "publishedOn": "2025-05-28T17:54:07.000Z",
          "wordCount": 9801,
          "title": "Can The NBA Still Produce Interesting Coaches?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2215772113.jpg"
        },
        {
          "id": "https://defector.com/?p=190789",
          "author": "Samer Kalaf",
          "description": "Credit where credit is due: USA Today sports columnist Christine Brennan has tried very hard to establish herself as the nation's foremost Caitlin Clark alarmist. Whenever something routine for a pro athlete happens to the Indiana Fever's star, Brennan's job is to turn it into a matter of existential concern for the WNBA, a league that has 12 other teams. This week's news provided another opportunity. Crisis alert: Caitlin Clark has strained her quad. Can women's basketball as a whole possibly soldier on?\nThe tone of Brennan's latest column might mislead the reader into thinking that Caitlin Clark has died. In reality, the Fever guard is only sidelined for at least a couple of weeks; after Tuesday's practice she was casually putting up three-pointers. In Brennan's reality, this is a recession-level event for the WNBA:",
          "link": "https://defector.com/christine-brennan-caitlin-clark-quad-strain-national-crisis",
          "publishedOn": "2025-05-28T16:50:40.000Z",
          "wordCount": 7393,
          "title": "Christine Brennan Won’t Rest Until Caitlin Clark’s Muscle Strain Is Treated As A National Crisis",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2216880527.jpg"
        },
        {
          "id": "https://defector.com/?p=190800",
          "author": "Ray Ratto",
          "description": "Stuart Skinner offers little in the way of championship onomatopoeia, which is to say his name does not suggest athletic greatness. It suggests the secretary-treasurer of the chess club, or an unprepared con artist trying to spontaneously impersonate Tampa Bay Rays owner Stuart Sternberg.\nBut Skinner owns, for now, the Stanley Cup fate of the Edmonton Oilers, and by extension the possibility that a Canadian team might win it all for the first time since 1993. As the Oilers' goaltender he has defined both the glories and horrors of being an Oil fan, because there is never a guarantee of what level of quality he will provide.",
          "link": "https://defector.com/oh-god-stuart-skinner-controls-the-oilers-destiny",
          "publishedOn": "2025-05-28T16:28:27.000Z",
          "wordCount": 7149,
          "title": "Oh God, Stuart Skinner Controls The Oilers’ Destiny",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2217408375.jpg"
        },
        {
          "id": "https://defector.com/?p=190777",
          "author": "Tom Ley",
          "description": "Donald Trump released yet another deranged statement on Tuesday, demanding that a transgender high school student be barred from participating in the California state track and field championships, which are scheduled to be held this weekend in Clovis, Calif. The inane thoughts that make their way from Trump's obviously diminished mind onto his Playskool social media platform should not demand the attention of any right-thinking Americans, and yet in this case the California Interscholastic Federation (CIF) snapped to attention, rewriting its qualification rules in an attempt to appease those behind what's become a national hate campaign directed at a 16-year-old high school student.\nThe student Trump was referring to in his post is named AB Hernandez. She is set to compete in the high jump, triple jump, and long jump at the state championships, and she has spent the past few months being harassed by a local group of bigots. This group is led by Sonja Shaw and Jessica Tapia, both members of the Save Girls Sports association. Shaw is currently running for California superintendent of public instruction, and Tapia was recently fired from her teaching position at Hernandez's high school for refusing to respect trans and nonbinary students' pronouns. At a qualification meet earlier this month, Tapia and Shaw led a group that spent hours heckling and harassing Hernandez as she competed.",
          "link": "https://defector.com/its-a-great-time-to-be-a-pathetic-loser",
          "publishedOn": "2025-05-28T15:16:25.000Z",
          "wordCount": 7889,
          "title": "It’s A Great Time To Be A Pathetic Loser",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2217150682.jpg"
        },
        {
          "id": "https://defector.com/?p=190785",
          "author": "Jae Towle Vieira",
          "description": "Junior high is tough for everyone. Shifting friendships! Being stuck somewhere between childhood and adolescence! All those hormones! If you’re lucky, you don’t also have to manage a parent who thinks they can backseat-drive you through all the challenges that come with being 13. \nThis week, we’re off to a prestigious private school in the West Village, where our friend-of-a-friend Ellen will have to figure out how involved she wants to get in her daughter’s 8th-grade fundraising competition. Unfortunately, it seems like Ellen’s mom-nemesis, Hazel, has no intention of playing by the rules. Would it be moral to just let Hazel get away with that?",
          "link": "https://defector.com/the-champagne-socialist-and-the-espresso-martini-capitalist",
          "publishedOn": "2025-05-28T14:40:13.000Z",
          "wordCount": 6532,
          "title": "The Champagne Socialist And The Espresso Martini Capitalist",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2023/03/Normal_Gossip_16-9_V2.png"
        },
        {
          "id": "https://defector.com/?p=190769",
          "author": "Albert Burneko",
          "description": "The pattern was: The New York Knicks would scramble the length of the floor in desperation—frantic, wide-eyed, bolts rattling loose, spotting passing and dribbling lanes just as they snapped shut—in search of a bucket. When they got one, it scanned most credibly as an accident. Then, whether the Knicks got one or not, the Indiana Pacers would breeze unimpeded the other way and Tyrese Haliburton would create a wide-open, high-value shot for himself or somebody else within seven seconds. That pattern leads where anybody would expect it to go. The Pacers won Game 4 of the Eastern conference final Tuesday night, 130–121, and now lead the series three games to one.\nWhen the Pacers wasted any tightly distributed handful of the approximately infinite good looks they enjoyed on the night, the Knicks could hang around, aided by 39 free-throw attempts and an unaccountable second-quarter stretch in which they wiped away a 10-point deficit and took a one-point lead with Delon Wright on the floor and Jalen Brunson off it. (Wright found time to commit a double-dribble violation in there, and played a shade under two minutes in the second half.) But the Pacers never relented so long that they couldn't just breeze back out to a multi-possession lead with 90 seconds of focus once they locked back in. Haliburton in particular delivered what's probably, given the circumstances, the best game of his career so far: 32 points, 15 assists, 12 rebounds, four steals, and not a single turnover, despite doing the vast bulk of Indiana's ball-handling and creating over his 38 minutes. Even as his shooting cooled off after a bonkers first quarter, he maintained Indiana's lunatic pace, kept the buzzsaw whirring, and sectioned New York's defense to toothpicks.",
          "link": "https://defector.com/faster-is-better",
          "publishedOn": "2025-05-28T12:58:34.000Z",
          "wordCount": 8120,
          "title": "Faster Is Better",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2217401899.jpg"
        },
        {
          "id": "https://defector.com/?p=190709",
          "author": "Kathryn Xu",
          "description": "Let us approach Shohei Ohtani as naively as possible, while admitting that in the case of Ohtani this decision can hardly be anything but a ruse. For the span of time that he has been on the Los Angeles Dodgers, Ohtani has been a designated hitter, and a very good one: He won the MVP last year in spite of being a designated hitter, and this year has been, depending on how you count, either the second- or third-best offensive player in MLB. The best is Aaron Judge, who is doing Aaron Judge things; the other second- or third-best player is, naturally, Ohtani's teammate Freddie Freeman; Ohtani currently has both of them, as well as every other player in MLB, beat on home run tally.\nHere is what that looks like over the course of a long weekend. The Dodgers came into it in a bit of a mire: a four-game loss streak, followed by a three-game win streak, followed in turn by another loss. Then their designated hitter opened up the final game of their series against the New York Mets by doing this:",
          "link": "https://defector.com/dodgers-so-desperate-for-starting-pitching-they-turn-to-dh",
          "publishedOn": "2025-05-27T17:43:58.000Z",
          "wordCount": 7264,
          "title": "Dodgers So Desperate For Starting Pitching They Turn To DH",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/ohtaniHomerMetsSmileYay.jpg"
        },
        {
          "id": "https://defector.com/?p=190718",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about method acting, fickle stovetops, the Colorado Rockies, and more.\nBrendan:",
          "link": "https://defector.com/jim-irsay-cant-meddle-with-the-colts-anymore-but-his-kids-can",
          "publishedOn": "2025-05-27T17:14:00.000Z",
          "wordCount": 17366,
          "title": "Jim Irsay Can’t Meddle With The Colts Anymore, But His Kids Can",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-1437772403-1.jpg"
        },
        {
          "id": "https://defector.com/?p=190708",
          "author": "Lauren Theisen",
          "description": "The Florida Panthers, as terrifying a hockey team as they are, have made a bit of a habit out of elongating their playoff series. Take their slow start in Toronto last round, or the three they lost while up 3-0 to the Oilers last Stanley Cup Final. In all likelihood, their shutout loss on Monday night will be just another snooze button. But after a trio of wins in the Eastern Conference Final where the Panthers used the Hurricanes like a bonfire does newspaper, the Canes earned at least one victory to hang their helmets on. If nothing else from this series goes Carolina's way—and so far, it hasn't—they'll at least have the excellent stretch of hockey that eventually delivered the game-winner in Game 4.\nThis action was tense until a pair of empty-netters carried the Hurricanes to a 3-0 final. But Carolina did a spectacular job limiting the defending champions' chances on net. Keeping the ice tilted has been the team's personal path to victory year after year, but against the fury, physicality, and plain old talent of Florida, the Canes shrunk into something unrecognizable as they lost three games by a combined score of 16-4. Here, however, the team out-efforted the Pants, particularly from the midpoint of the first period through a Carolina penalty late in the second. In that time, Florida produced absolutely nothing of note on offense and relied on Sergei Bobrovsky to be tidy in goal. At 0-0 with the clincher in sight, Florida might still have felt fairly comfortable, but it was Logan Stankoven who ensured that his Hurricanes' momentum would not go wasted.",
          "link": "https://defector.com/the-hurricanes-avoided-the-garbage-can",
          "publishedOn": "2025-05-27T16:44:20.000Z",
          "wordCount": 7316,
          "title": "The Hurricanes Avoided The Garbage Can",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2217214951.jpg"
        },
        {
          "id": "https://defector.com/?p=190715",
          "author": "Ray Ratto",
          "description": "The end of this clip is why Paul Maurice is the greatest coach of all time in any sport, in one specific category: lectern domination. The whole thing is worth a watch, as all his pressers are, pregame, postgame or even off-day, but the last 10 seconds are killer, especially if you keep in mind that his team just lost a chance to clinch a trip to the Stanley Cup Final by playing a game he admitted he \"didn't like.\"\n\nhttps://www.youtube.com/watch?v=Pt87itZr_kc",
          "link": "https://defector.com/paul-maurice-is-the-jack-adams-of-not-being-a-jackass",
          "publishedOn": "2025-05-27T15:12:41.000Z",
          "wordCount": 8383,
          "title": "Paul Maurice Is The Jack Adams Of Not Being A Jackass",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2215851200.jpg"
        },
        {
          "id": "https://defector.com/?p=190710",
          "author": "Soraya Roberts",
          "description": "I went into Overcompensating knowing very little, except that it was a vehicle for comic Benito Skinner. I know Skinner, like most people know him, through his @bennydrama7 Instagram account. He started it while still a high school student in Ohio—seven was the number on his football jersey—but only began posting his celebrity impressions and campy sketches as a college student at Georgetown. I specifically know him for one of my favorite bits of satire ever. I cannot for the life of me find it anymore, and my description won't do it justice, but it's basically Skinner parodying the work of Brampton bard Rupi Kaur—no one calls her that; all you need to know is that she's an extremely famous extremely terrible Instagram poet (example: “a man who cries – a gift”) who comes from a town near e…",
          "link": "https://defector.com/overcompensating-is-not-a-joke",
          "publishedOn": "2025-05-27T14:31:32.000Z",
          "wordCount": 8990,
          "title": "‘Overcompensating’ Is Not A Joke",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/OVRC_S1_UT_240715_BROJAC_00034_CropRC31_3000.jpg"
        },
        {
          "id": "https://defector.com/?p=190700",
          "author": "Tom Ley",
          "description": "At some point near the start of the fourth quarter of Game 4 of the Western Conference Final, in which the Oklahoma City Thunder defeated the Minnesota Timberwolves, 128-126, a thought occurred to me: These teams are playing too hard. It just didn't seem possible that an NBA game could withstand that much sustained frenzy and focus from its participants. I had a vision of several players suddenly collapsing on the floor, all of their mental and physical energy spent. I saw the fans in the arena becoming nauseous, unable to safely metabolize the potency of the basketball that was unfolding before them. Adam Silver was going to rush the court and put a stop to everything. No, no, you can't do this, he'd shout. You're going to ruin the rest of the games.\nMonday's game was unquestionably the best we've had so far in these playoffs. That's an achievement in and of itself, considering how inert this series felt after the first two games, in which the Thunder seemingly established themselves as several classes above their opponent. But Minnesota caught Oklahoma City with all sorts of haymakers in Game 3, winning that one by 42, and so they came into Game 4 at the very least convinced that they could stand and trade. What resulted from that belief meeting the Thunder's resolve to avenge the embarrassment of Game 3 was a game that reached and stayed at the highest levels of intensity for 48 minutes.",
          "link": "https://defector.com/thats-what-we-all-want-to-see",
          "publishedOn": "2025-05-27T13:05:38.000Z",
          "wordCount": 8316,
          "title": "That’s What We All Want To See",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2217213489.jpg"
        },
        {
          "id": "https://defector.com/?p=190688",
          "author": "Maitreyi Anantharaman",
          "description": "It's time to wrap up the month with a challenging themeless. Keep an eye out for tricky clues and fun wordplay. This week's puzzle was constructed by Geoffrey Schorkopf and Brian Callahan, and edited by Hoang-Kim Vu. Geoffrey is an Atlanta Hawks fan. Brian is a Chicago Bulls fan. In addition to making crosswords together, they’ve bonded over mediocre basketball.\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE.",
          "link": "https://defector.com/the-crossword-may-26-ball-dont-lie-themeless",
          "publishedOn": "2025-05-26T14:56:46.000Z",
          "wordCount": 5953,
          "title": "The Crossword, May 26: Ball Don’t Lie (Themeless)",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2207266371.jpg"
        },
        {
          "id": "https://defector.com/?p=190665",
          "author": "Maitreyi Anantharaman",
          "description": "If Natasha Cloud has stopped smiling at all since mid-March, she has done so only in the privacy of her own home. She beamed when she met Ellie the Elephant at Liberty training camp last month. She and Breanna Stewart laughed it up on Cloud’s Instagram stories during a recent team excursion to Yankee Stadium. After New York’s home opener against the Aces, the crowd cheered at the sight of Cloud’s happy face on the jumbotron; she finished with 22 points, six rebounds and nine assists.\nAnd can you blame her for smiling through it all, in disbelief of her life? The trade that sent her from Phoenix to Connecticut in exchange for Alyssa Thomas this past February scrambled the 33-year-old point guard’s plans. “I just want to be in an organization that truly invests from top to bottom: facilities, team, location, all of that. I want to compete for championships,” she said after the trade, which definitely stood in the way of all that. But then came a second trade, the biggest glamor upgrade she could hope for. Shuffled from a middle-of-the-pack Mercury team to a tanking Sun team to the defending champion Liberty, Cloud was so over and so back in the span of two months.",
          "link": "https://defector.com/natasha-cloud-is-a-kid-in-new-yorks-candy-store",
          "publishedOn": "2025-05-25T21:43:04.000Z",
          "wordCount": 7828,
          "title": "Natasha Cloud Is A Kid In New York’s Candy Store",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2216148206.jpg"
        },
        {
          "id": "https://defector.com/?p=190667",
          "author": "Billy Haisley",
          "description": "Knockout-tournament soccer is the best soccer because of how it amplifies the sport's essence. The magic of the game lies in the tension between unpredictability and mastery. On one foot, the game is so difficult, so low-scoring, and played over such a relatively short timespan, that in 90 minutes truly anyone can beat anyone. On the other, the best players and teams are so good at dictating the encounter's terms and appearing in the match's few critical moments with touches of brilliance, that the outcome is rescued from a randomness that might render it meaningless and becomes imbued with real significance. The knockout tournament heightens both sides of this tension. Teams that reach the final do so by proving their ability to conquer entropy, but they only achieve glory by winning one last game, where anything can happen.\nOn Saturday, Arsenal pulled off a monumental upset by defeating Barcelona in the Women's Champions League final. While this doesn't make the Gunners necessarily the best team, it does I think make them the perfect winners of the club game's best competition.",
          "link": "https://defector.com/arsenal-met-the-moment-and-became-champions",
          "publishedOn": "2025-05-25T20:43:40.000Z",
          "wordCount": 11709,
          "title": "Arsenal Met The Moment And Became Champions",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2216158525.jpg"
        },
        {
          "id": "https://defector.com/?p=190590",
          "author": "David Roth",
          "description": "As a general rule, you do not want to know what sportswriters are eating. Assume that it's happening at strange times and in strange ways. Some of this is due to the specific pressures of the job; some of it is just because sportswriters are strange. Sportswriters, on balance, are probably not as strange about food as the people that talk about sports on TV—Jim Nantz orders his toast briquette style; Ian Eagle claims that he has never \"ingested\" a condiment; Michael Kay once said he had never tried coffee or soup, and didn't eat an egg until he was 62 years old—but sportswriters do not get paid as much, either. Just know that there are a lot of finicky habits in this industry. (Not me, though. I am normal.)\nIn one sense, the strangest thing about the grocery run that New York Post baseball columnist Jon Heyman posted on Twitter on Thursday is that the order itself is not very strange at all. It's the sort of stuff that a sportswriter might enjoy while writing about sports: a big container of blueberries, popcorn (unpopped), Diet Coke, and cashews. Surely Heyman has peers whose last grocery receipts are far more unsettling. But think about the items above, and how much you would pay for them at the store. Would it be nearly $50? Would you be so upset about how close it is to $50 that you post about it online?",
          "link": "https://defector.com/is-jon-heyman-paying-too-much-for-blueberries",
          "publishedOn": "2025-05-23T20:33:28.000Z",
          "wordCount": 10492,
          "title": "Defector Investigates: Is Jon Heyman Paying Too Much For Blueberries?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2207856324.jpg"
        },
        {
          "id": "https://defector.com/?p=190645",
          "author": "Tom Scocca",
          "description": "Welcome to Margin of Error, a politics column from Tom Scocca, editor of the Indignity newsletter.\nOn Wednesday, President Donald Trump sat down for a public meeting with Cyril Ramaphosa, the president of South Africa. Perched on an armchair in the Oval Office, with the White House's newly installed gold-tone decorations stuck to the mantlepiece behind him, Trump declared that Ramaphosa is \"a man certainly in some circles really respected, other circles a little bit less respected, like all of us.\"",
          "link": "https://defector.com/what-do-you-do-about-a-declining-president",
          "publishedOn": "2025-05-23T20:14:30.000Z",
          "wordCount": 13827,
          "title": "What Do You Do About A Declining President?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2216313099.jpeg"
        },
        {
          "id": "https://defector.com/?p=190550",
          "author": "Dave McKenna",
          "description": "The most embarrassing of athletic debates is over: As of midnight last night, camogie players are free to sport the bottoms of their choosing. \nAt an emergency meeting of the Camogie Association held last night in Dublin to quell increasingly loud protests, delegates repealed an antiquated rule that prohibited players of the ancient Gaelic game from wearing shorts, as their male counterparts always could. The vote was one-sided: The Camogie Association said after the meeting that 98 percent of the delegates at its hastily called Croke Park summit voted to do away with the misogynistic mandate immediately.",
          "link": "https://defector.com/dumbass-irish-rule-forcing-female-athletes-to-wear-skirts-finally-repealed",
          "publishedOn": "2025-05-23T17:16:55.000Z",
          "wordCount": 7565,
          "title": "Dumbass Irish Rule Forcing Female Athletes To Wear Skirts Finally Repealed",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2215062184.jpg"
        },
        {
          "id": "https://defector.com/?p=190604",
          "author": "Nicholas Russell",
          "description": "There is a pleasing symmetry to the Mission: Impossible brand cycle: 30 years between the 1966 debut of the original CBS television series created by Bruce Geller to the 1996 cinematic reboot starring Tom Cruise, and again between that first film and what would appear to be the final installment of the franchise this summer with Mission: Impossible–The Final Reckoning. A childhood favorite of Cruise’s, the original show is, for anyone tempted to look back, a portal to an era of American television that was willing to be goofy. Still, Mission: Impossible was always a heist series at heart. Inspired by the 1964 film Topkapi, which features a team of thieves attempting to steal from the titular palace of Sultan Mahmud I, Mission: Impossible the show melded the heist plot with obligatory espionage elements at a time when James Bond and Get Smart followed similar trends. \nBy now, almost no one thinks of the television series, so wholly has the film franchise and its zealous lead actor taken over the past three decades, weathering seachange after seachange in the already turbulent, risky landscape of Hollywood. Behind it all, of course, is Cruise himself, who began Mission: Impossible as the first project for the now-defunct Cruise/Wagner Productions.",
          "link": "https://defector.com/mission-impossible-must-finally-reckon-with-tom-cruises-ego",
          "publishedOn": "2025-05-23T16:26:43.000Z",
          "wordCount": 12006,
          "title": "‘Mission: Impossible’ Must Finally Reckon With Tom Cruise’s Ego",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/MITomCruise.jpg"
        },
        {
          "id": "https://defector.com/?p=190548",
          "author": "Sabrina Imbler",
          "description": "On April 7, the New Yorker and Time ran nearly identical stories that might be better described as press releases for the de-extinction company Colossal Biosciences. The two stories differed slightly: the New Yorker's headline proclaimed \"The Dire Wolf Is Back,\" whereas Time's announced \"The Return of the Dire Wolf.\" While the New Yorker led with a photo of a cub, Time led with a photo of a fully grown wolf. But the effect of these stories was the same, both creating the impression that the dire wolf is indeed back after 10,000 years of extinction.\nWhat these stories seemed less interested in was the fact that the dire wolf was, in fact, not at all back, nor will it return anytime soon. Colossal is a company that runs on PR stunts, and the latest hoopla instigated a wave of criticism from scientists seeking to set the record straight: The \"dire wolf\" on the cover of these glossy magazines was not a dire wolf, meaning an individual of the extinct canine species Aenocyon dirus. Instead, the \"dire wolf\" was a modern wolf with 20 genetic edits, none of which involved the splicing of actual dire wolf DNA. \"It’s not a dire wolf. It’s misleading to call it that,\" Vincent Lynch, an evolutionary biologist at the University at Buffalo, told Chemical and Engineering News. “I can't explain how pissed off it made me, because they're still saying this stuff, and they know it to not be true.”",
          "link": "https://defector.com/colossal-biosciences-cant-have-it-both-ways",
          "publishedOn": "2025-05-23T15:57:01.000Z",
          "wordCount": 7830,
          "title": "Colossal Biosciences Can’t Have It Both Ways",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/2501_DW_3Month_NonExclusive-e1748009708745.jpeg"
        },
        {
          "id": "https://defector.com/?p=190561",
          "author": "Tom Ley",
          "description": "It can be hard to tell when it is safe to officially declare a bad baseball team a historically bad one. You usually kind of know it when you see it, but passing certain mile markers allows you to affirmatively point the finger and declare: These men belong in the piss pot of history.\nOne such signpost arrives when words like \"worst\" and \"since\" start popping up alongside years that start with 18. The Colorado Rockies hit that point on Thursday night, after losing 2-0 to the Philadelphia Phillies to push their season record to 8-42. The Rockies are now sole owners of the worst 50-game start in baseball's modern era. You have to go all the way back to the 1895 Louisville Colonels, who started 7-43, to find a team that performed worse through its first 50 games. This team is squarely on the path trodden by the 2024 White Sox, who spent a good chunk of that campaign threatening to break the 1899 Cleveland Spiders' record for most losses in a season (134), but ultimately had to settle for the modern-era record (121). The Rockies are currently on pace to blow past the White Sox and pip the Spiders with 136 losses.",
          "link": "https://defector.com/rockies-fans-best-hope-might-be-more-losses",
          "publishedOn": "2025-05-23T15:27:26.000Z",
          "wordCount": 7219,
          "title": "Rockies Fans’ Best Hope Might Be More Losses",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2215467127.jpg"
        },
        {
          "id": "https://defector.com/?p=190558",
          "author": "Dan McQuade",
          "description": "There are two main reasons for Philadelphia Eagles fans to hate Jeffrey Lurie: He’s a billionaire, and he owns the Eagles. Under Lurie, who bought the team in 1994 from car dealership magnate Norman Braman, the Eagles have been one of the best and best-run teams in the NFL.\nWhatever. It does not matter that the Eagles have won two Super Bowls in eight seasons. It does not matter that the previous owner charged players for their own socks and pads, or that the owner before that tried to sneak the team out of town. Lurie is a Philadelphia sports team owner. You should hate him! Every Philly sports fan thinks they could do a better job owning the teams they hate and care about than the people that currently own them. I myself have so many ideas. The Eagles would win eight Super Bowls in eight seasons under my ownership. I will not give any of them away here to preserve my advantage.",
          "link": "https://defector.com/substantial-speech-seemingly-saves-sports-shove",
          "publishedOn": "2025-05-23T15:04:37.000Z",
          "wordCount": 7481,
          "title": "Substantial Speech Seemingly Saves Sport’s Shove",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/lurie-pointing-super-bowl-59.jpg"
        },
        {
          "id": "https://defector.com/?p=190566",
          "author": "Ray Ratto",
          "description": "When Paul Maurice was hired out of retirement to heal the Florida Panthers' multitude of competitive leprosies, he was called in some corners \"the enemy of fun.\" This happened because of the way he likes to play—simple, direct, minimizing open-ice flair, and emphasizing all things heavy. He is not a brutish tactician, but he recognized, without ever having the CV to prove it, that winning in April, May, and June requires a devotion to power, persistence, and crowd control in front of the net that hockey’s regular season dilettantes never seem to fully grasp.\nBut, and we're being fair here, Paul Maurice is indeed also the enemy of fun. We can say this because the Panthers' Eastern Conference Final series against the Carolina Hurricanes is already deeply and profoundly un-fun, in the classic only-one-team-is-getting-its-way way. Beating the 'Canes on Thursday night by the frankly rude score of 5-0 was lopsided enough, but other than an offside call that negated Carolina's only real chance of the night, that score was actually a kindness. Put another way, through the first 40 minutes, the only two differences between the 'Canes and Angel Reese were a) there were 17 more of them than her, and b) she got off more shots.",
          "link": "https://defector.com/paul-maurice-and-the-panthers-do-not-care-if-youre-having-fun",
          "publishedOn": "2025-05-23T14:38:18.000Z",
          "wordCount": 7545,
          "title": "Paul Maurice And The Panthers Do Not Care If You’re Having Fun",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2213688240.jpg"
        },
        {
          "id": "https://defector.com/?p=190523",
          "author": "Kelsey McKinney",
          "description": "Welcome to Defector Music Club, where a number of our writers get together to dish about an album. Today, Kathryn Xu, Lauren Theisen, Luis Paez-Pumar, and Kelsey McKinney reminisce over Carly Rae Jepsen's underappreciated pop classic Emotion, which is about to turn 10 years old.",
          "link": "https://defector.com/defector-music-club-really-really-really-really-really-really-likes-carly-rae-jepsen",
          "publishedOn": "2025-05-23T14:07:34.000Z",
          "wordCount": 15146,
          "title": "Defector Music Club Really Really Really Really Really Really Likes Carly Rae Jepsen",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-4711774081.jpg"
        },
        {
          "id": "https://defector.com/?p=190552",
          "author": "Ray Ratto",
          "description": "The Pittsburgh Pirates scored more than four runs in a baseball game for the first time in a month, but because they are the Pittsburgh Pirates, the price of that victory was not only that it was actually another defeat, but that anyone who went to PNC Park to watch it had to sit through a one-hour, fifty-minute rain delay to find out that they can still make five runs look like two. The fan giveaway for the night was a dose of the flu, which all things considered is a metaphorical kiss on the top of the head.\nYes, it's Pirates Baseball in 2025, where the \"don't mind me, I'm just cowboy-sneezing in your beer\" coupon is included in the price of the ticket.",
          "link": "https://defector.com/pirates-avoid-historic-humiliation-suffer-regular-kind-instead",
          "publishedOn": "2025-05-23T12:58:51.000Z",
          "wordCount": 8363,
          "title": "Pirates Avoid Historic Humiliation, Suffer Regular Kind Instead",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2215828928.jpg"
        },
        {
          "id": "https://defector.com/?p=190445",
          "author": "David Roth",
          "description": "It seems safe to say, at this point, that the retrospectively rather quaint debate over whether Trumpism, as a political movement and a politics in itself, could or should be described as \"fascist\" has been settled. The bad news is in how we got to that answer, and in the bad news that every day brings. And with that colossally dispiriting answer come a whole bunch of new questions about what is to be done, and where we actually are, and how to get from here to the other side of things. This week, we were joined by Jason Steinhauer, the historian behind the History Club newsletter and the bestseller History, Disrupted, to discuss those questions, and the historical and cultural forces that created them, and to start working toward some answers. Also, hilariously, we discussed the NBA playoffs at the end.",
          "link": "https://defector.com/notes-of-sparkling-authoritarianism-with-jason-steinhauer",
          "publishedOn": "2025-05-22T18:54:48.000Z",
          "wordCount": 7193,
          "title": "Notes Of Sparkling Authoritarianism, With Jason Steinhauer",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2214714010.jpeg"
        },
        {
          "id": "https://defector.com/?p=190527",
          "author": "Tom Ley",
          "description": "Celebrities are human beings, sure, but they don't move through life like the rest of us do. They will feel sadness and pain and disappointment many times during their years on Earth, just like you and I, but unlike you and I they will maintain access to all the blessings that money and talent and beauty bring them. For the most part, we only ever get to see them in the latter state, and it's easy to conclude that all that good stuff they have makes their lives invariably better than ours on a day-to-day basis.\nSports can be an equalizer in this regard. Think about how bad the days after your worst moments as a sports fan felt. Every time my favorite team gets eliminated from the playoffs, I end up going through the next day in a sickly daze, feeling much like I did the morning after the 2016 election. This is not rational, but it is what being a sports fan does to my brain. Now imagine how much more intense that awful feeling is hitting Knicks fans today, hours after they witnessed their team cough up a playoff game in unthinkable fashion.",
          "link": "https://defector.com/congratulations-you-are-officially-having-a-better-day-than-several-celebrities",
          "publishedOn": "2025-05-22T17:50:59.000Z",
          "wordCount": 6570,
          "title": "Congratulations, You Are Officially Having A Better Day Than Several Celebrities",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2216357029.jpg"
        },
        {
          "id": "https://defector.com/?p=190524",
          "author": "Ray Ratto",
          "description": "Hockey's longstanding fetish for self-effacement got its best material reward in years on Wednesday night, thanks to an amazing comeback win that was at best fifth on the list of anyone’s notice, and that includes you finally doing your laundry. The Dallas Stars parlayed a well-earned 3-1 deficit through two periods of Game 1 of the Western Conference Final into a hilarious 6-3 victory over the much better regarded Edmonton Oilers, and what do they get as the new day dawns?\nCrickets in a coma, that's what they get.",
          "link": "https://defector.com/three-goals-six-minutes-no-response",
          "publishedOn": "2025-05-22T17:03:14.000Z",
          "wordCount": 7719,
          "title": "Three Goals, Six Minutes, No Response",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2216368936.jpg"
        },
        {
          "id": "https://defector.com/?p=190516",
          "author": "Robert Pastore",
          "description": "In April 2025, The Earned Time Act was approved by the New York State Corrections Committee, a small but meaningful step in the proposed law's arduous legislative pathway. This bill, which still needs to pass through the Assembly and Senate before being signed by the Governor and enacted into law, expands the amount of \"good time\" prisoners can earn off our sentences when we avoid disciplinary sanctions and complete our mandatory programs. Currently, New York State prisoners serving time for violent offenses can earn up to 15 percent of good time. Under the new law, we will be able to earn up to 50 percent of good time, along with an additional 25 percent of \"merit time\" for those who obtain a college degree or complete other volunteer programs, such as providing long-term tutoring for pri…",
          "link": "https://defector.com/the-earned-time-act-would-bring-freedom-to-those-who-need-it",
          "publishedOn": "2025-05-22T16:35:41.000Z",
          "wordCount": 9784,
          "title": "The Earned Time Act Would Bring Freedom To Those Who Need It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-1229328574.jpg"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=853928",
          "author": "Mark Polishuk",
          "description": "Seth Lugo made his return to the Royals’ rotation yesterday, and the right-hander showed some rust in allowing four runs over 3 1/3 innings in Kansas City’s 7-5 loss to Detroit.  A sprained middle finger sent Lugo to the 15-day injured list on May 14, and in the corresponding roster move for Lugo’s activation, the…",
          "link": "https://www.mlbtraderumors.com/2025/05/royals-activate-seth-lugo-place-lucas-erceg-on-15-day-il.html",
          "publishedOn": "2025-05-31T12:44:38.000Z",
          "wordCount": 3551,
          "title": "Royals Activate Seth Lugo, Place Lucas Erceg On 15-Day IL",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/LucasErceg-2025-1024x694.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=853728",
          "author": "Anthony Franco",
          "description": "The Royals officially released Hunter Renfroe yesterday, according to the MLB.com transaction log. This was the expected outcome after Kansas City designated the veteran outfielder for assignment last week. K.C.’s surprising two-year free agent investment in Renfroe did not work. The Royals guaranteed him $13.5MM on a deal that also included an opt-out clause after the…",
          "link": "https://www.mlbtraderumors.com/2025/05/royals-release-hunter-renfroe.html",
          "publishedOn": "2025-05-30T00:04:32.000Z",
          "wordCount": 3538,
          "title": "Royals Release Hunter Renfroe",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/USATSI_26273637-1024x652.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=853633",
          "author": "Steve Adams",
          "description": "The Royals’ offensive struggles aren’t exactly a secret. Kansas City is contending in the American League not because of its lineup but in spite of its lineup. Arguably no contender in MLB has been as anemic at the plate as the Royals, who sport a .246/.301/.361 batting line as a team. The resulting 83 wRC+…",
          "link": "https://www.mlbtraderumors.com/2025/05/royals-rumors-jac-caglianone-call-up-june.html",
          "publishedOn": "2025-05-29T16:38:30.000Z",
          "wordCount": 5696,
          "title": "When Will The Royals Promote Jac Caglianone?",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/jac-caglianone-royals-spring-scaled-e1746806904214-1024x750.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=853612",
          "author": "Anthony Franco",
          "description": "The Royals released Nelson Velázquez this afternoon. The news was announced by their Triple-A affiliate in Omaha. The club also announced that they’ve activated Cavan Biggio, suggesting the veteran infielder has agreed to accept the minor league assignment after being optioned over the weekend. Velázquez had already been outrighted off Kansas City’s 40-man roster during…",
          "link": "https://www.mlbtraderumors.com/2025/05/royals-release-nelson-velazquez.html",
          "publishedOn": "2025-05-29T01:15:51.000Z",
          "wordCount": 3316,
          "title": "Royals Release Nelson Velazquez",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/06/Nelson_Velazquez_Royals-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=853564",
          "author": "Darragh McDonald",
          "description": "The Royals announced that they have selected the contract of right-hander Andrew Hoffmann. Left-hander Evan Sisk has been optioned to Triple-A Omaha as the corresponding active roster move. The club’s 40-man roster had a couple of vacancies and moves to 39 with this move. Hoffmann, 25, gets up to the big leagues for the first…",
          "link": "https://www.mlbtraderumors.com/2025/05/royals-select-andrew-hoffmann.html",
          "publishedOn": "2025-05-28T20:10:50.000Z",
          "wordCount": 3421,
          "title": "Royals Select Andrew Hoffmann",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/Andrew_Hoffmann_Royals-scaled-e1748461556306-1024x619.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=853300",
          "author": "Darragh McDonald",
          "description": "The Royals announced that they have selected the contract of outfielder John Rave. Infielder Cavan Biggio has been optioned to Triple-A Omaha as the corresponding active roster move, which was reported yesterday. The Royals had three vacancies on their 40-man roster due to Luke Maile, Chris Stratton and Hunter Renfroe recently being designated for assignment.…",
          "link": "https://www.mlbtraderumors.com/2025/05/royals-select-john-rave.html",
          "publishedOn": "2025-05-26T16:15:08.000Z",
          "wordCount": 3572,
          "title": "Royals Select John Rave",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/John_Rave_Royals-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=853276",
          "author": "Nick Deeds",
          "description": "The Royals optioned infielder Cavan Biggio to the minor leagues following the club’s game against the Twins today, according to a report from Anne Rogers of MLB.com. As a player with five years of service time, Biggio has the ability to refuse an optional assignment, and Rogers reports that he’ll be able to decide between…",
          "link": "https://www.mlbtraderumors.com/2025/05/royals-reportedly-option-cavan-biggio.html",
          "publishedOn": "2025-05-26T00:35:39.000Z",
          "wordCount": 4085,
          "title": "Royals Reportedly Option Cavan Biggio",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/USATSI_26269373-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=852571",
          "author": "Darragh McDonald",
          "description": "May 24: The Royals announced this afternoon that Maile has cleared outright waivers and accepted an assignment to Triple-A. The 34-year-old will remain in the organization going forward to serve as non-roster catching depth behind the club’s tandem of Perez and Fermin. May 19: The Royals announced that right-hander Taylor Clarke has been reinstated from the…",
          "link": "https://www.mlbtraderumors.com/2025/05/royals-designate-luke-maile-for-assignment.html",
          "publishedOn": "2025-05-25T02:17:16.000Z",
          "wordCount": 3429,
          "title": "Royals Outright Luke Maile",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/Luke_Maile_Royals-copy-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=852993",
          "author": "Darragh McDonald",
          "description": "The Royals have acquired infielder Diego Castillo from the Mets, according to his transactions tracker at MLB.com. He has been assigned to Triple-A Omaha. The log doesn’t specify what the Mets are receiving in return but it seems likely to be a cash deal. Castillo is a 27-year-old infielder and not to be confused with…",
          "link": "https://www.mlbtraderumors.com/2025/05/royals-acquire-diego-castillo.html",
          "publishedOn": "2025-05-23T22:30:03.000Z",
          "wordCount": 3351,
          "title": "Royals Acquire Diego Castillo",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/07/diego-castillo-twins-infielder-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=852981",
          "author": "Steve Adams",
          "description": "The Royals announced Friday that they’ve designated veteran outfielder Hunter Renfroe for assignment. Infielder Nick Loftin has been recalled from Triple-A Omaha in a corresponding move. Renfroe is being paid $7.5MM in the second season of a two-year, $13MM contract and will very likely be released in the coming days. More to come.",
          "link": "https://www.mlbtraderumors.com/2025/05/royals-dfa-hunter-renfroe.html",
          "publishedOn": "2025-05-23T16:11:29.000Z",
          "wordCount": 3107,
          "title": "Royals Designate Hunter Renfroe For Assignment",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/hunter-renfroe-royals-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=852454",
          "author": "Mark Polishuk",
          "description": "May 22: Stratton was released as expected, according to the MLB.com transaction log. May 18: The Royals announced that right-hander Chris Stratton has been designated for assignment.  Fellow righty Jonathan Bowlan was called up from Triple-A in the corresponding move. The DFA probably closes the book on what has been a disappointing season-plus for Stratton…",
          "link": "https://www.mlbtraderumors.com/2025/05/royals-designate-chris-stratton-for-assignment.html",
          "publishedOn": "2025-05-23T03:24:14.000Z",
          "wordCount": 3805,
          "title": "Royals Release Chris Stratton",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/ChrisStratton-2025Royals-1024x683.jpg"
        }
      ]
    },
    {
      "title": "Flaming Hydra",
      "feedUrl": "https://flaminghydra.com/rss/",
      "siteUrl": "https://flaminghydra.com/",
      "articles": [
        {
          "id": "6838ac5941d7a90001308e09",
          "author": "Hamilton Nolan",
          "description": "Breakfast is my favorite meal. Why? Because its boundaries are well defined. You don’t have to worry too much about what you’re going to eat. There are only certain things that are okay to eat for breakfast. \nEggs, for example. Eggs are a classic breakfast",
          "link": "https://flaminghydra.com/delineations-of-breakfast/",
          "publishedOn": "2025-05-30T19:31:42.000Z",
          "wordCount": 596,
          "title": "Delineations of Breakfast",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/breakfasters-IMG_8088.jpg"
        },
        {
          "id": "6839dcb741d7a9000130a083",
          "author": "The Editors",
          "description": "Breakfast with Hamilton Nolan, and Zito Madu on sports superstitions",
          "link": "https://flaminghydra.com/issue-330/",
          "publishedOn": "2025-05-30T19:30:25.000Z",
          "wordCount": 508,
          "title": "Square meal / Routine comforts",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/waff.jpg"
        },
        {
          "id": "68399e5241d7a9000130a00d",
          "author": "Zito Madu",
          "description": "One of the great things about watching sports with people who usually don’t watch sports is that they ask obvious-seeming questions that cause knowledgeable sports fans to realize how ridiculous the games and the culture around them can be. This ridiculousness isn’t necessarily bad, it’",
          "link": "https://flaminghydra.com/just-for-luck/",
          "publishedOn": "2025-05-30T19:30:11.000Z",
          "wordCount": 710,
          "title": "Just for Luck",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/sports-pitch-2.png"
        },
        {
          "id": "6838a7d841d7a90001308ddd",
          "author": "The Editors",
          "description": "Crashing the Venice Biennale with Tod Seelie",
          "link": "https://flaminghydra.com/issue-329/",
          "publishedOn": "2025-05-29T22:43:25.000Z",
          "wordCount": 553,
          "title": "Fancy flotilla",
          "imageUrl": "https://flaminghydra.com/content/images/2025/05/Serenissima-FlamingHydra-24-edit-16x9-1.jpg"
        },
        {
          "id": "68386a0541d7a90001308cd4",
          "author": "Tod Seelie",
          "description": "It’s a long story that started with a dream and some junk rafts. \nFour years after setting off on a journey that started on the Mississippi River in Minneapolis and took us as far as the Hudson River and NYC, the crew of the Swimming Cities were",
          "link": "https://flaminghydra.com/art-bateau/",
          "publishedOn": "2025-05-29T22:42:57.000Z",
          "wordCount": 471,
          "title": "Art Bateau",
          "imageUrl": "https://flaminghydra.com/content/images/2025/05/Serenissima-FlamingHydra-24-edit-16x9.jpg"
        },
        {
          "id": "68378ec841d7a900013079f6",
          "author": "The Editors",
          "description": "Brian Hioe on the death of a friend; the first voting round of our new word game",
          "link": "https://flaminghydra.com/issue-328/",
          "publishedOn": "2025-05-28T23:45:03.000Z",
          "wordCount": 648,
          "title": "Fallen comrades",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/RIP-CROP-duo-1.jpg"
        },
        {
          "id": "68374ad341d7a900013078c9",
          "author": "The Editors",
          "description": "The time of reckoning is here.",
          "link": "https://flaminghydra.com/hydranym-no-1-vote/",
          "publishedOn": "2025-05-28T23:41:41.000Z",
          "wordCount": 337,
          "title": "HYDRANYM No. 1: Vote!",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/Screenshot-2025-05-22-at-4.37.57-PM-1--2.jpg"
        },
        {
          "id": "683788a041d7a900013079c3",
          "author": "Brian Hioe",
          "description": "It’s a strange feeling, attending a memorial in a faraway land for someone you’ve never met. I was there for a business trip and it overlapped with the funeral of the friend of a friend, who had died the previous year.\nShe had been jailed after",
          "link": "https://flaminghydra.com/a-funeral-for-someone-i-never-met/",
          "publishedOn": "2025-05-28T23:41:21.000Z",
          "wordCount": 690,
          "title": "A Funeral for Someone I Never Met",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/RIP-CROP-duo.jpg"
        },
        {
          "id": "68364194e506350001724041",
          "author": "The Editors",
          "description": "Jennie Rose Halperin on the women trying to protect the Library of Congress; a new word game for subscribers",
          "link": "https://flaminghydra.com/issue-327/",
          "publishedOn": "2025-05-28T01:27:51.000Z",
          "wordCount": 694,
          "title": "Shelf abuse / Initial effort",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/corrupt.jpg"
        },
        {
          "id": "68364325e50635000172404f",
          "author": "Jennie Rose Halperin",
          "description": "On May 8, Librarian of Congress Carla Hayden received an email from Trent Morse, the deputy director of White House personnel, in which he fired her with no cause “effective immediately,” “on behalf of President Donald J. Trump.” Hayden, who was nominated to serve by President",
          "link": "https://flaminghydra.com/defending-the-library-of-congress/",
          "publishedOn": "2025-05-28T01:26:43.000Z",
          "wordCount": 722,
          "title": "Defending the Library of Congress",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/Corrupt-Legislation-Vedder-Highsmith-16x9.jpg"
        },
        {
          "id": "68362da5e506350001723fba",
          "author": "The Editors",
          "description": "A word game for subscribers of FLAMING HYDRA",
          "link": "https://flaminghydra.com/introducing-hydranym/",
          "publishedOn": "2025-05-28T01:26:26.000Z",
          "wordCount": 417,
          "title": "Introducing: HYDRANYM",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/Screenshot-2025-05-22-at-4.37.57-PM-1-.jpg"
        },
        {
          "id": "6830e7d98d87ce0001fca408",
          "author": "The Editors",
          "description": "Maria Bustillos on Sam Altman, Jony Ive, and money",
          "link": "https://flaminghydra.com/issue-326/",
          "publishedOn": "2025-05-24T00:19:04.000Z",
          "wordCount": 613,
          "title": "Suspect device",
          "imageUrl": "https://flaminghydra.com/content/images/2025/05/Jon_Ive_and_Dieter_Rams_works_-cropped_2--16x9-1.jpg"
        },
        {
          "id": "6830c8608d87ce0001fca22f",
          "author": "Maria Bustillos",
          "description": "",
          "link": "https://flaminghydra.com/movie-review-sam-jony/",
          "publishedOn": "2025-05-24T00:10:19.000Z",
          "wordCount": 605,
          "title": "MOVIE REVIEW: Sam & Jony",
          "imageUrl": "https://flaminghydra.com/content/images/2025/05/Jon_Ive_and_Dieter_Rams_works_-cropped_2--16x9.jpg"
        },
        {
          "id": "682fcd7c8d87ce0001fc903f",
          "author": "The Editors",
          "description": "Arwa Mahdawi on the 1996 disappearance of Susan Walsh",
          "link": "https://flaminghydra.com/issue-325/",
          "publishedOn": "2025-05-23T02:10:18.000Z",
          "wordCount": 335,
          "title": "Police theories",
          "imageUrl": "https://flaminghydra.com/content/images/2025/05/MISSING-PERSON-featured-1.jpg"
        },
        {
          "id": "682facb08d87ce0001fc8fca",
          "author": "Arwa Mahdawi",
          "description": "In July 1996, 36-year-old Susan Walsh supposedly left her house in New Jersey and never came back. She is presumed dead but a body has never been found. This is Part Three of a series on my five-year investigation into her unsolved disappearance.\nTo catch up, here are Part",
          "link": "https://flaminghydra.com/how-to-solve-a-murder-part-six/",
          "publishedOn": "2025-05-23T02:09:58.000Z",
          "wordCount": 712,
          "title": "How to Solve a Murder: Part Six",
          "imageUrl": "https://flaminghydra.com/content/images/2025/05/MISSING-PERSON-featured.jpg"
        }
      ]
    },
    {
      "title": "Today in Tabs",
      "feedUrl": "https://rss.beehiiv.com/feeds/ZRiesnGI0u.xml",
      "siteUrl": "https://www.todayintabs.com/",
      "articles": []
    },
    {
      "title": "Bad Faith Times",
      "feedUrl": "https://bad-faith-times.ghost.io/rss/",
      "siteUrl": "https://badfaithtimes.com/",
      "articles": [
        {
          "id": "6839bff2c038030001ee5f8e",
          "author": "Denny Carter",
          "description": "Elected Democrats can't move on this time.",
          "link": "https://badfaithtimes.com/holding-elon-musk-accountable-is-a-matter-of-national-survival/",
          "publishedOn": "2025-05-30T15:26:16.000Z",
          "wordCount": 1305,
          "title": "Holding Elon Musk Accountable Is A Matter Of National Survival",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/05/Screenshot-2025-05-30-at-11.21.04---AM.png"
        },
        {
          "id": "68387469c038030001ee5a12",
          "author": "Denny Carter",
          "description": "It's well past time social media companies are forced to face the horrors they've created",
          "link": "https://badfaithtimes.com/theres-a-way-to-stop-the-algorithmic-spread-of-hate/",
          "publishedOn": "2025-05-29T15:23:07.000Z",
          "wordCount": 2236,
          "title": "There's A Way To Stop The Algorithmic Spread Of Hate",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/05/Screenshot-2025-05-29-at-11.21.48---AM.png"
        },
        {
          "id": "6834ba23f649e30001830614",
          "author": "Denny Carter",
          "description": "The idea of a Rogan-style podcaster sympathetic to liberal causes betrays a misunderstanding of Rogan himself",
          "link": "https://badfaithtimes.com/heres-what-a-left-wing-joe-rogan-might-sound-like/",
          "publishedOn": "2025-05-27T11:46:19.000Z",
          "wordCount": 2042,
          "title": "Here's What A Left-Wing Joe Rogan Might Sound Like",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/05/Screenshot-2025-05-26-at-3.31.55-PM-1-1.png"
        },
        {
          "id": "682f662df649e3000182fa4d",
          "author": "Denny Carter",
          "description": "Alexandria Ocasio-Cortez is the ultimate “kitchen table” politician, whether Republicans like it nor not (they do not).",
          "link": "https://badfaithtimes.com/bread-and-butter-and-bad-faith/",
          "publishedOn": "2025-05-22T20:42:59.000Z",
          "wordCount": 2736,
          "title": "Bread And Butter And Bad Faith",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/05/Screenshot-2025-05-22-at-4.34.50-PM.png"
        },
        {
          "id": "682f662df649e3000182fa4d",
          "author": "Denny Carter",
          "description": "Alexandria Ocasio-Cortez is the ultimate “kitchen table” politician, whether Republicans like it nor not (they do not).",
          "link": "https://bad-faith-times.ghost.io/bread-and-butter-and-bad-faith/",
          "publishedOn": "2025-05-22T20:42:59.000Z",
          "wordCount": 2736,
          "title": "Bread And Butter And Bad Faith",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/05/Screenshot-2025-05-22-at-4.34.50-PM.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}