{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": []
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=187401",
          "author": "Tom Ley",
          "description": "Lotsa games today! Lotsa games tomorrow, too. Feel free to hang out here and chat while you binge on all that spectacular hoops action.",
          "link": "https://defector.com/get-busy-in-the-nba-playoffs-open-thread",
          "publishedOn": "2025-04-19T16:02:58.000Z",
          "wordCount": 4568,
          "title": "Get Busy In The NBA Playoffs Open Thread",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2208937271.jpg"
        },
        {
          "id": "https://defector.com/?p=187330",
          "author": "Patrick Redford",
          "description": "Have you seen this? Are you aware of this? The NBA playoffs are about to begin! This is real. I would not lie to you.\nThis means that the time has come for you, the casual basketball fan, the dunce that you are, the grime on the bottom of a true basketball-knower's shoe, to begin scrambling around for information about this so-called \"NBA postseason.\" There are 16 damn teams in the field, and you need to know stuff about all of them, lest you be driven from the village for your foolishness!",
          "link": "https://defector.com/silence-you-are-summoned-to-read-a-preview-of-the-2024-25-nba-playoffs",
          "publishedOn": "2025-04-18T17:31:19.000Z",
          "wordCount": 23786,
          "title": "Silence! You Are Summoned To Read A Preview Of The 2025 NBA Playoffs",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-515426258.jpg"
        },
        {
          "id": "https://defector.com/?p=187214",
          "author": "Israel Daramola",
          "description": "Welcome to Listening Habits, a column where I share the music I’ve been fixated on recently.",
          "link": "https://defector.com/the-case-for-a-new-mtv",
          "publishedOn": "2025-04-18T15:21:47.000Z",
          "wordCount": 9893,
          "title": "The Case For A New MTV",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-76629515.png"
        },
        {
          "id": "https://defector.com/?p=187190",
          "author": "Sabrina Imbler",
          "description": "After weeks of receiving insulting emails from the federal government, Sarah Boim learned she was fired from her dream job at the Centers for Disease Control and Prevention at 8 p.m. on a Saturday. The email, which adhered to a template sent to all probationary workers, cited Boim's performance as the reason she was being let go. \"That was devastating to me to read, even though I knew that it wasn't true,\" Boim said, adding that she had received a 4.66 out of five on her last annual performance review. Boim was overwhelmed with feelings from shock to depression. \"I basically went through the stages of grief,\" she said. Then she arrived on a more galvanizing emotion: anger.\nBoim and other probationary employees fired from the CDC scrambled to get more information about their situation. \"Everybody was so scared, first of all that we were being spied on, which I'm sure we were,\" she said. They created a Signal chat and crowdsourced information, but they found a thicket of misinformation. \"So a small group of us decided to start a newsletter to cut through some of that noise and increase access to facts,\" Boim said.",
          "link": "https://defector.com/an-interview-with-a-fired-cdc-health-communications-manager",
          "publishedOn": "2025-04-18T14:16:57.000Z",
          "wordCount": 13440,
          "title": "An Interview With A Fired CDC Health Communications Manager",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/Boim_Headshot.jpg"
        },
        {
          "id": "https://defector.com/?p=187308",
          "author": "Ray Ratto",
          "description": "The NHL postseason stands in the exalted place it does because of two counterintuitive yet almost inviolable truths: that the regular-season standings and the achievements attached therein are an utter lie, and that the most fun is always found in the first round, when even the unworthy teams offer delicious levels of entertainment.\nProof of Truth 1: The last time the team with the best regular season record won the Cup in a regulation-length season was 2008.",
          "link": "https://defector.com/the-stanley-cups-got-to-return-to-canada-sometime-nhl-playoffs",
          "publishedOn": "2025-04-18T12:59:55.000Z",
          "wordCount": 7702,
          "title": "The Stanley Cup’s Got To Return To Canada Sometime, Right?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2149367580.jpg"
        },
        {
          "id": "https://defector.com/?p=187242",
          "author": "David Roth",
          "description": "It's not quite a large enough sample to be significant, and too inherently insignificant to really be worth the sampling, but we've done enough Drew Is About To Go On Vacation episodes of the podcast by now that I can detect their specific vibrational energy. Drew is both a little bit more eager than usual to wrap things up and just absolutely relaxed; I am maybe a bit more inclined to wander afield and go long and as close to absolutely relaxed as I get, as if I was getting some sort of residual contact high from the vacation that the big fella is about to take. It is not quite the episode that would be recorded from a vacation—we've done some of those, too, and likely will do some more—but it has all the energy of having more or less wrapped up work. All of which is to say that, at this anxious and ominous broader moment, I found this week's episode to be kind of a relief, and to reiterate I am not even going on vacation.",
          "link": "https://defector.com/at-beautiful-mount-airy-lodge",
          "publishedOn": "2025-04-17T19:36:18.000Z",
          "wordCount": 6719,
          "title": "At Beautiful Mount Airy Lodge",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-1314698254.jpg"
        },
        {
          "id": "https://defector.com/?p=187293",
          "author": "Nicholas Russell",
          "description": "One of the earliest photos of me features my grandfather, a doctor from the Philippines, cradling me as a newborn while wearing a face mask. He had a cold at the time and I was as vulnerable as a human being can be. That photo didn’t normalize the idea of wearing face masks for me, though I did feel comparatively inured to the sight as I grew up. Relatives would show up to gatherings wearing them and, in a family of medical professionals, all manner of PPE was unremarkable. I’d be lying if I said there wasn’t a cultural element to this as well. Up there with that common, meme-ified image of an elderly Asian man out for a leisurely, inquisitive stroll with his hands clasped behind his back is the image of an elderly Asian person out in public with a face mask on. Sometimes, the images are o…",
          "link": "https://defector.com/why-i-keep-masking",
          "publishedOn": "2025-04-17T19:03:11.000Z",
          "wordCount": 9911,
          "title": "Why I Keep Masking",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-1363359698.jpg"
        },
        {
          "id": "https://defector.com/?p=183012",
          "author": "Dan McQuade",
          "description": "A player can look good on the front of his card, but it's what’s on the back that matters. That's where the player's stats and accomplishments appear, and where the bigger story of their career really rounds into shape: what they've done and where they've done it, how well and for how long. The photo on the front might show a guy's only home run all season; if so, the back of the card will tell you.\nBecause they're all grounded in the same categories and expressed in similarly shaped statistics, the numbers on the backs of all those cards can blur together somewhat; they are all different, but they don't really look that different. For instance there is Bill Hanzlik, who averaged 7.2 points per game during his 10 years in the NBA, spent mostly with the Denver Nuggets. The 6-foot-7 small forward was mostly known for his defense, which means that a lot of what he did best didn't show up on the back of his trading cards. But he was there, and the proof is in the 12-card set of Nuggets trading cards that the Denver Children's Hospital released for the 1989–90 season.",
          "link": "https://defector.com/dont-put-poison-in-your-mouth-and-other-great-tips-from-80s-and-90s-trading-cards",
          "publishedOn": "2025-04-17T17:57:39.000Z",
          "wordCount": 18787,
          "title": "“Don’t Put Poison In Your Mouth,” And Other Great Tips From ’80s And ’90s Trading Cards",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/psa-cards-header.jpg"
        },
        {
          "id": "https://defector.com/?p=187261",
          "author": "Chris Thompson",
          "description": "Washington Nationals reliever Jorge López was tossed from a game Wednesday night. He came on in relief in the seventh inning and—in the fashion preferred by members of this insanely terrible bullpen—immediately immolated his own team's chances of winning what had been a one-run game. First he allowed two singles and an RBI-groundout; then with two outs, he threw a first-pitch sinker up and in and plunked Bryan Reynolds. Three pitches later, López fired a fastball at the ear of Andrew McCutchen, which McCutchen avoided only by throwing himself onto the ground. While the umpires conferenced, López and McCutchen began to shout at each other, and soon the benches emptied.\n\nhttps://www.youtube.com/watch?v=ehyFBlpWcSI",
          "link": "https://defector.com/a-dangerously-bad-bullpen-is-everyones-problem",
          "publishedOn": "2025-04-17T17:11:45.000Z",
          "wordCount": 8668,
          "title": "A Dangerously Bad Bullpen Is Everyone’s Problem",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210010517.jpg"
        },
        {
          "id": "https://defector.com/?p=187268",
          "author": "Tom Ley",
          "description": "Listen, I will happily devour any article about Nikola Jokic. He's my big special guy and every anecdote that gets published about him keeps a place in the most lovingly curated segment of my mind. So it is with great sadness that I am forced to issue a yellow card on this simile from The Athletic's recent story on Jokic, written by Fred Katz:\nEarly in Brown’s season in Denver, the guard went into a handoff play with Jokić. Once the MVP received the basketball, both his defender and Brown’s followed him, which left Brown open. Brown screamed out the proper terminology.\n“Wolf! Wolf!” he yelled, the Nuggets’ alert that a double team was coming.\nWith no one on him, Brown then cut to the basket, figuring Jokić could hit him for an easy layup. Instead, Jokić tossed a no-look pass far behind him and out of bounds. Later in the game, Jokić explained why.\n“Don’t cut,” he told Brown. “I’m listening to your voice.”\nJokić, like a bat, can tell where people are just by where sound waves originate. From that point on, Brown never cut after yelling for the ball; Jokić hit him with no-look dimes constantly.",
          "link": "https://defector.com/everyone-can-do-that",
          "publishedOn": "2025-04-17T15:47:05.000Z",
          "wordCount": 5508,
          "title": "Everyone Can Do That",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2207522862.jpg"
        },
        {
          "id": "https://defector.com/?p=187256",
          "author": "Luis Paez-Pumar",
          "description": "Despite a comfortable 3-0 home victory in the first leg of its Champions League quarterfinal against Real Madrid, Arsenal must have still felt in danger on Wednesday. Call it the Real Madrid Effect, or call it the Arsenal Had Only Been To Two Champions League Semifinals Ever Conundrum, but nothing felt safe as the Gunners tried to build on their monumental win last week in hopes of advancing. They needn't have worried, though. Despite a couple of ominous mistakes, Arsenal continued to prove that it was just the better team in this match-up, and one that can not only make a semifinal but actually win the whole tournament. The Gunners left the Estadio Santiago Bernabeu with a 2-1 victory, and a 5-1 aggregate romp, that felt as fair as any Real Madrid loss can.\n\nhttps://www.youtube.com/watch?v=hEZDGBlptss",
          "link": "https://defector.com/arsenal-was-perfect-when-it-had-to-be",
          "publishedOn": "2025-04-17T15:29:44.000Z",
          "wordCount": 8194,
          "title": "Arsenal Was Perfect When It Had To Be",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210618529.jpg"
        },
        {
          "id": "https://defector.com/?p=187051",
          "author": "Eva Holland",
          "description": "“I am a modern Inuk woman,” says the actress Anna Lambe, in the opening moments of her new sitcom, North of North. “…Whatever that means.” Lambe plays Siaja, a twenty-something undergoing a quarter-life crisis in her tiny Arctic hometown: Ice Cove, a fictional place built on the realities of life in Nunavut’s two dozen far-flung hamlets. \nAs the pilot episode unfolds, Siaja decides that she’s spent too much time putting other people first. She was forced to self-parent during the years before her single mom, Neevee, got sober; then she married right after high school and had a daughter soon after. Now she’s a stay-at-home mother, the wife to an oblivious husband, and she desperately needs a change. Across the eight short episodes of the show’s first season, Siaja tries to remake her life—often while spinning from one awkward disaster into another.",
          "link": "https://defector.com/north-of-north-is-an-arctic-comedy-that-will-warm-your-heart",
          "publishedOn": "2025-04-17T14:12:48.000Z",
          "wordCount": 7553,
          "title": "‘North Of North’ Is An Arctic Comedy That Will Warm Your Heart",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/AAAAQW1EX_YQYuFfZXuljlYraX7DzdUH5oh9otuClUKDx562Mi37DhDmda1PPGfxBT9zzgVIBEAv7wpmgGt3p_9QskOi4Eq2eye3btml45cOQHYB8Qa10lkS_pXU698urol8qbutNRWHzSG72Nq3-3RL4PHNnOk.jpg"
        },
        {
          "id": "https://defector.com/?p=187252",
          "author": "Tom Ley",
          "description": "If the play-in tournament is good for anything, it's throwing an annual spotlight on some of the NBA's most stuck-in-the-mud franchises. Whereas 9- and 10- seeds used to be able to slink into the offseason in relative anonymity, they are now dragged into the light for one more nationally televised, win-or-go-home game that is sure to leave everyone who watches muttering something like, \"Oh boy, this is a mess.\"\nThis year, it's the Sacramento Kings whose asses are in the jackpot. This is thanks to the humiliating 120-106 loss they suffered to the post-Luka Mavericks on Wednesday night, bringing an end to a season in which the Kings went 40-42, fired their coach, and traded their best player. A casual observer tuning into last night's game, checking in on the Kings for maybe the first time all season, would have been confronted with some alarming developments: DeMar DeRozan needed 28 shots to score his 33 points; Domantas Sabonis could muster only 11 points while committing five turnovers; Zach LaVine is on this team now.",
          "link": "https://defector.com/extinguish-the-beam-sacramento-kings",
          "publishedOn": "2025-04-17T13:11:52.000Z",
          "wordCount": 6901,
          "title": "Extinguish The Beam",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210653934.jpg"
        },
        {
          "id": "https://defector.com/?p=186982",
          "author": "Maitreyi Anantharaman",
          "description": "On the morning of the WNBA draft, Dominique Malonga stepped out onto the observatory deck of the Empire State Building, sporting a huge, winsome smile and a tiny camcorder in her hand. Against a canvas of groggy faces in matching hoodies, Malonga’s own bright face stood out. She and her fellow draft prospects were midway through a tiring multi-day circuit of media engagements and rookie orientation meetings. (At the draft that night, the writer Mel Greenberg called this procession “the car wash.”) So you could forgive them all for looking less than enthused to ceremonially “light” a building that would not actually be lit for many more hours because it was 9:00 a.m.\nMaybe it was the smile that won me over. Maybe it was the tiny camcorder. Maybe I felt some extra affection on account of Malonga’s youth. International pros are subject to looser age restrictions than players drafted from the NCAA. At 19, the French center is one of the youngest members of this rookie class. Someone from the league’s in-house media staff asked Malonga a few questions about her game and her WNBA goals for a video. With the city skyline behind her, the 6-foot-6 Malonga spoke about her versatility and said she was most excited to discover American culture. (I have some bad news, Dominique.) She was then asked what she wanted fans to know about her. “That I’m, like, a smiley person,” she said—how else?—smiling.",
          "link": "https://defector.com/dominique-malonga-is-ready-to-light-up-the-wnba",
          "publishedOn": "2025-04-16T20:45:00.000Z",
          "wordCount": 6926,
          "title": "Dominique Malonga Is Ready To Light Up The WNBA",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2209775439.jpg"
        },
        {
          "id": "https://defector.com/?p=187196",
          "author": "Tom Ley",
          "description": "Chuck Grassley, Iowa's 91-year-old Republican Senator, held a town hall with some of his constituents yesterday in Fort Madison, Iowa. After reviewing eight minutes of footage from the meeting, I have to say that the people of Fort Madison were really getting Chuck's ass.\n\nhttps://www.youtube.com/watch?v=gbfPt8o8h5A",
          "link": "https://defector.com/angry-interjections-from-chuck-grassleys-chippy-town-hall-meeting-ranked",
          "publishedOn": "2025-04-16T18:35:47.000Z",
          "wordCount": 5152,
          "title": "Angry Interjections From Chuck Grassley’s Chippy Town Hall Meeting, Ranked",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/Chuch-Grassley-getting-owned.png"
        },
        {
          "id": "https://defector.com/?p=187154",
          "author": "Kathryn Xu",
          "description": "On March 30, fencer Stephanie Turner was disqualified from the Cherry Blossom Open, a minor Division I-A tournament in Maryland, for kneeling and refusing to compete against her opponent, college fencer Red Sullivan, who is a trans woman. The incident was recorded and immediately posted to Twitter; shortly afterward, Turner participated in an interview with Fox News, stating, \"I looked at the ref and I said, 'I'm sorry, I cannot do this. I am a woman, and this is a man, and this is a women's tournament. And I will not fence this individual.'\" The referee then gave Turner, who is 31 years old, a black card for refusing to fence, in accordance with the International Fencing Federation rules, which was later upheld by USA Fencing. Sullivan, who is 19 and a self-described \"mid\" competitor, went on to place 24th out of 39 fencers at the competition, winning two out of her six bouts.\nThe incident has predictably ballooned far outside of the original event's scope or results. J.K. Rowling, whose primary vocation nowadays is spamming posts about trans issues on Twitter, quote-tweeted the video with \"What a heroine looks like.\" After stating that her stunt would temporarily ruin her life, Turner received a $5,000 \"Courage Wins Champions\" prize from XX-XY Athletics, a sportswear brand centered around \"protecting women's sports.\" Most eye-wateringly, on Tuesday, Congresswoman and DOGE subcommittee chair Marjorie Taylor Greene announced a hearing on USA Fencing's policy allowing trans women to compete in women's events, and invited Turner to testify. The hearing is scheduled for May 7.",
          "link": "https://defector.com/the-doge-fencing-hearing-reveals-the-latest-in-anti-trans-grift",
          "publishedOn": "2025-04-16T17:46:34.000Z",
          "wordCount": 6329,
          "title": "The DOGE Fencing Hearing Reveals The Latest In Anti-Trans Grift",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/mtg.jpeg"
        },
        {
          "id": "https://defector.com/?p=187156",
          "author": "Patrick Redford",
          "description": "The competitive dynamic of Tuesday night's Grizzlies–Warriors play-in was brutally simple: The Warriors were more skilled and generally better, but the Grizzlies were bigger, more athletic, and nastier. The winner would be the team that could enforce its style of play, and while Golden State eventually did so, there was a solid 24 or so minutes spanning the back half of the second quarter through most of the fourth when they couldn't do a thing against Memphis's physicality. I was particularly enamored of—and the Warriors were particularly plagued by—Zach Edey.\nEdey is a curious player. His considerable strengths (vertical) and weaknesses (horizontal) are evident to anyone who watches him move around the court for one single play, and the Warriors made hay early by repeatedly isolating him and having Jimmy Butler and Steph Curry attack him in space. That was often the right play, though Edey is so huge and so rugged that he warps the space on the court in a way no other player in the league does. Butler would feint and flex his way into the paint, beating Edey to the spot, or Curry would drive past an overplaying defender and into the paint, and neither superstar would convert on the sort of easy opportunity they have for a collective 30 seasons, due to Edey forcing a miss. Curry destroyed the Kings for 50 points in 2023 with these sorts of drives, but Edey, slow as he is, is just too big.",
          "link": "https://defector.com/zach-edey-is-a-force",
          "publishedOn": "2025-04-16T17:02:26.000Z",
          "wordCount": 6808,
          "title": "Zach Edey Is A Force",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210503726.jpg"
        },
        {
          "id": "https://defector.com/?p=187101",
          "author": "Post-Postdoc",
          "description": "I was actually having a pretty good conversation with the avatar interviewer. We had discussed my current work, my PhD thesis, and recent research developments I found compelling. It only took a few seconds to adjust to the reality: that this was the interview, that I would talk only to this avatar, that this avatar had accurately regurgitated some of the more arcane phrases related to particularly new research techniques that it probably hadn't heard before, that this avatar was steering this conversation in predetermined directions about as well as some human \"recruiters\" I'd spoken to. I thought back to previous conversations I'd had, at similar phases of similar job applications, and, honestly, this wasn't so different. \"There's a formula,\" I'd been told, and it pretty much was that way. Now it had been formalized, finalized, and rendered.\nAnd then it asked me some questions I hadn't gotten before in an interview like this: What made a good multiple choice question? And if I were to write a multiple choice question, what would make for a difficult incorrect answer?",
          "link": "https://defector.com/how-i-became-highly-educated-grist-for-the-ai-mill",
          "publishedOn": "2025-04-16T16:43:17.000Z",
          "wordCount": 15139,
          "title": "How I Became Highly Educated Grist For The AI Mill",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/AI-Gig-Work.jpg"
        },
        {
          "id": "https://defector.com/?p=187114",
          "author": "Luis Paez-Pumar",
          "description": "Over the last 10 years or so, no team has suffered more heartbreaking collapses in the Champions League than Paris Saint-Germain. The Ligue 1 monolith has, on three separate occasions, held a two-goal advantage at some point in the second leg of a tie, only to lose in demoralizing fashion. The list doubles as a horror story for PSG fans: First was the famous Barcelona comeback in 2017, in which PSG blew a four-goal lead, then came a two-goal disintegration by Manchester United two seasons later. Finally, in 2022, PSG gave up a hat trick to Karim Benzema and Real Madrid in 17 minutes, turning a 2–0 overall lead into a 3–2 aggregate defeat.\nGiven all that history, there's no way PSG should have felt comfortable heading into Tuesday's second leg of the Champions League quarterfinals against Aston Villa with a 3–1 lead. Something like comfort may have started to creep in after PSG scored the first two goals of Tuesday's game, giving them a 5–1 lead on aggregate. After all, the Parisians trounced Liverpool in the previous round, and Aston Villa is, on paper, no Liverpool. And yet, fear and panic arrived right on schedule, and it took every single bit of resilience PSG had, along with a healthy dose of Gianluigi Donnarumma goalkeeping heroics, to hang onto narrow a 5–4 aggregate victory.",
          "link": "https://defector.com/paris-saint-germain-escaped-its-past-for-now",
          "publishedOn": "2025-04-16T15:33:45.000Z",
          "wordCount": 8131,
          "title": "Paris Saint-Germain Escaped Its Past, For Now",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2209873635.jpg"
        },
        {
          "id": "https://defector.com/?p=187141",
          "author": "Jae Towle Vieira",
          "description": "Much has been said about small towns. As someone with the dubious pleasure of living in a small town from birth to college, I think small towns have earned every aspect of their reputation. But when you’ve got a small town on a remote island, all those pressures double. Everyone knows everyone else’s business, and it’s harder to escape! Hell is even more hell and other people are even more other people. \nThis week, we’ve brought you a story from the beating heart of one such island town: the volunteer firefighting squad. Get ready for a juicy power struggle featuring nepotism, inept boyfriends, and goji berries.",
          "link": "https://defector.com/lit-up-on-bleep-island",
          "publishedOn": "2025-04-16T15:13:38.000Z",
          "wordCount": 5469,
          "title": "Lit Up On Bleep Island",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2023/03/Normal_Gossip_16-9_V2.png"
        },
        {
          "id": "https://defector.com/?p=186894",
          "author": "Sabrina Imbler",
          "description": "When Joel Runnels graduated from college, he followed the age-old tradition of young people who don't quite know what they want to do with their lives, which is to say he applied to the Peace Corps. Runnels had studied American Sign Language in college and, as someone who grew up with a speech impediment, he also had a lifelong affinity for working with people with disabilities. The Peace Corps, under the mistaken impression that there's one universal sign language, invited him to pioneer their Deaf Education Program in Kenya. Runnels only knew ASL, so he had to learn Swahili and Kenyan Sign Language as well.\nIn Kenya, Runnels's students kept asking him if he'd heard of an African-American educator and missionary named Andrew Foster, who is often called the father of Deaf education in Africa. Runnels hadn't, and back in the U.S. he found no books about Foster's life or legacy. \"I thought, if I want to read the book, I have to write it,\" he said. Runnels ended up getting a PhD so that he could write a biography of Foster as his dissertation. \"I felt, if he has served as a bridge between America and Africa for 30 years, I can give up a few of my years to give his life and legacy a scholarly treatment,\" he said.",
          "link": "https://defector.com/an-interview-with-a-fired-usaid-education-officer",
          "publishedOn": "2025-04-16T14:43:08.000Z",
          "wordCount": 14742,
          "title": "An Interview With A Fired USAID Education Officer",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/IMG_5316-e1744809494962.jpeg"
        },
        {
          "id": "https://defector.com/?p=187117",
          "author": "Ray Ratto",
          "description": "It was a game with a hundred turning points, each more compelling than the one before it, building to a crescendo that ended with…an inbound violation? Well, that's something else for the Memphis Grizzlies to work on before Friday, we suppose.\nIn a mesmerizing yet jagged game to determine which of the two top play-in teams was better suited to deal with the precocious Houston Rockets this weekend in the first round of the actual Western Conference playoffs, the Golden State Warriors out-experienced the Grizz, 121-116. That experience and the steady relentlessness it made was the one thing Memphis could not overcome. They refused to take the knee after a befuddled start and then just kept on refusing, forcing the Warriors to draw 75 points from Jimmy Butler and Stephen Curry in order to survive the kind of scare they are both too old to endure too often. The correct team won, but only after working far harder than they either had meant to or logically can be expected to do repeatedly.",
          "link": "https://defector.com/the-warriors-really-had-to-work-for-it",
          "publishedOn": "2025-04-16T13:39:26.000Z",
          "wordCount": 7593,
          "title": "The Warriors Really Had To Work For It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210501742.jpg"
        },
        {
          "id": "https://defector.com/?p=187081",
          "author": "Barry Petchesky",
          "description": "Objectively speaking, the Minnesota Wild's final regular-season game against the Ducks Tuesday was a crucial one. They needed to gain a single standings point, by hook or by crook, to clinch one of the West's suddenly competitive wild card spots. The Blues won their game, clinching their own spot, and a regulation loss for the Wild would've left their fate in the hands of the pursuing Flames, who have one more game left. Subjectively speaking, it was even more important for everyone involved that the Wild lock down that point so that Marc-Andre Fleury could get a proper home send-off.\nFleury, 40 years old and playing his 21st and final season, has been on something of a farewell tour as Minnesota's backup. He's been honored in every city, and opponents have formed handshake lines just for him. He's a one-man NHL institution, the rare first-overall goaltender pick way back in 2003, and one of just two players left who played before the lockout. He's been a rock: second all-time in wins and games played. He won three Cups with the Penguins, though, for my money, his most impressive feat was having a career year at age 36 with Las Vegas, winning his first Vezina after most of his contemporaries had already hung up their pads. He's also (and this is a technical term) a good dude, beloved by teammates, fans, and media. He was never truly a dominant netminder, and I think that humanity only made him more endearing as he handled various goaltender controversies and benchings and one unceremonious Vegas eviction with nothing but equanimity. He easily could have retired then, but he still enjoyed playing hockey and so put in the work for a woeful Chicago team, and was rewarded with a third lease on life in Minnesota. The Twin Cities embraced him, as had all his previous homes, and it was as good a situation as any to go out on.",
          "link": "https://defector.com/one-last-nice-moment-for-marc-andre-fleury-who-deserves-them-all",
          "publishedOn": "2025-04-16T13:14:55.000Z",
          "wordCount": 7014,
          "title": "One Last Nice Moment For Marc-Andre Fleury, Who Deserves Them All",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210498342.jpg"
        },
        {
          "id": "https://defector.com/?p=187061",
          "author": "Tom Ley",
          "description": "Tomorrow, the Dallas Mavericks will be tipping off a play-in game against the Sacramento Kings. Win, and their hopes of making the postseason stay alive. Lose, and their season ends. Obviously, today was the perfect day for the front office to orchestrate a strange, semi-secretive sit-down with selected members of the local media, the purpose of which seems to have been getting everyone really agitated about the Luka Doncic trade again.\nThe meeting was organized by Mavs general manager Nico Harrison and CEO Rick Welts. According to DLLS Sports reporter Tim Cato, there were about 15 people present at the meeting, including several Mavericks staffers. The reporters who attended the meeting had to agree not to record any audio, and were told that no video cameras would be allowed into the room. Surely these restrictions were put in place because Harrison and Welts had something new to say to the media, perhaps even a piece of information so explosive that it could not be appropriately revealed without strict messaging controls in place. Surely these two bozos did not drag a dozen or so reporters down to the team facility this morning so that they could sit there and say \"Defense wins championships\" over and over again.",
          "link": "https://defector.com/nico-harrison-picks-ideal-moment-to-piss-off-everyone-again",
          "publishedOn": "2025-04-15T21:11:24.000Z",
          "wordCount": 6237,
          "title": "Nico Harrison Picks Ideal Moment To Piss Off Everyone Again",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2209448222.jpg"
        },
        {
          "id": "https://defector.com/?p=186041",
          "author": "Rick Paulas",
          "description": "The idea came in a flash while I was on a barstool in Bed-Stuy’s Do Or Dive. The bartender snapped off the music to swap in the Jeopardy! theme, but I couldn’t find Trebek until I followed my fellow bargoers' gaze to the top of a fridge, where the smallest black and white TV I’ve ever seen rested. In no way was it an appropriate size to show anything, but for a show based mostly in audio it worked fine enough. I wanted my own right away. \nI went to eBay, steering clear of those with DVD players because they felt wrong, and eventually finding one with a VCR built-in because that felt right. It was from Sylvania, with a whopping 9-inch screen, and came with a power source that hooks up into your car’s cigarette lighter for when the grid goes down and we’re fucked. It cost me $120, and it’s the best thing I’ve ever purchased.",
          "link": "https://defector.com/the-best-thing-i-own-is-my-tiny-tv-vcr",
          "publishedOn": "2025-04-15T19:53:15.000Z",
          "wordCount": 7930,
          "title": "The Best Thing I Own Is My Tiny TV/VCR",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/image1-4.jpeg"
        },
        {
          "id": "https://defector.com/?p=186986",
          "author": "Albert Burneko",
          "description": "On Monday, the singer Katy Perry, the TV personality Gayle King, Fight Club star Lauren Sánchez, and a few others took a 10-minute, 21-second ride aboard the New Shepard rocket operated by Jeff Bezos's Blue Origin aerospace company. For some brief period of time—a mere fraction of the flight's overall duration—the rocket and its inhabitants reportedly reached or exceeded 330,000 feet of altitude, or what is known as the Kármán Line, a popular but by no means universally agreed-upon definition of the \"edge of space.\" Bezos himself has made this trip before, as have a few others with his Blue Origin company or with competing outfits; each time, the press deferentially reports that the travelers went \"to space\" or \"to outer space.\"\nCharitably, let's grant that the Kármán Line does in fact represent the edge of space. The line's namesake, scientist Theodore von Kármán, chose it as a rough estimate of the altitude at which a vehicle in flight would no longer be kept aloft by aerodynamic lift, but rather entirely by inertia. OK! Fine. Works for me. Grant that the Kármán Line really is a line, and is the edge of space, and grant that the vehicle bearing Katy Perry, Gayle King, et. al. traveled to and possibly past it. Have they \"been to space\"?",
          "link": "https://defector.com/at-what-point-has-one-actually-been-to-space",
          "publishedOn": "2025-04-15T18:52:44.000Z",
          "wordCount": 8378,
          "title": "At What Point Has One Actually “Been To” Space?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/blueorigin.jpeg"
        },
        {
          "id": "https://defector.com/?p=186985",
          "author": "Patrick Redford",
          "description": "Bill Belichick's University of North Carolina football team, college sports' strongest argument for open records laws, began spring practices this past weekend. As the 72-year-old head coach sorts through position battles and figures out who's going to play quarterback, the real fun for outside observers is in getting a sense of how much Jordon Hudson, his 24-year-old girlfriend, will be doing for the program.\nBelichick stocked his coaching ranks with various unsuccessful friends and associates, all of whom seem to understand this might be their final opportunity to harvest a salary from the putrescent corpse of the ex–New England Patriots coach's legacy. According to emails uncovered by The Assembly in March, Belichick is farming out correspondence duties to Hudson, asking a UNC administrator to copy her on all emails sent to him. This week, the Athletic revealed some of those emails, which are pretty funny. Hudson does not work for the university, but she's operating as some sort of professional liaison for her septuagenarian boyfriend and his big-headed son.",
          "link": "https://defector.com/bill-belichicks-girlfriend-asks-that-her-boyfriends-son-receive-the-upmost-respect",
          "publishedOn": "2025-04-15T18:00:46.000Z",
          "wordCount": 6252,
          "title": "Bill Belichick’s Girlfriend Asks That Her Boyfriend’s Son Receive The “Upmost Respect”",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2198457470.jpg"
        },
        {
          "id": "https://defector.com/?p=186969",
          "author": "Tom Ley",
          "description": "During Monday's White House visit by the FCS national champion Ohio State Buckeyes, former Ohio Senator and current Vice President JD Vance attempted to pick up the National Championship trophy and did not succeed. Vance fumbled both the top and the bottom of the trophy, the base of which tumbled to the ground. Here, Defector presents two perspectives on the incident.\n\nhttps://www.youtube.com/watch?v=YwOa4m0WRps",
          "link": "https://defector.com/point-counterpoint-jd-vance-drops-the-national-championship-trophy",
          "publishedOn": "2025-04-15T17:40:59.000Z",
          "wordCount": 10397,
          "title": "Point/Counterpoint: JD Vance Drops The National Championship Trophy",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2209746962.jpg"
        },
        {
          "id": "https://defector.com/?p=186915",
          "author": "Kathryn Xu",
          "description": "My computer recently prompted me to \"look back at your memories!\" along with a photo of a woman, who was not me, sitting down on a nondescript swath of pavement, surrounded by garbage. Now, while I did not personally attend the Grand National at Aintree, just outside of Liverpool, last year, it is true that I have fond memories of my time spent going through photos of that event. The Grand National is ostensibly a horse race, but after conducting my second detailed survey of Getty Images, I can conclusively say that it is actually an excuse for English people to get extremely drunk and sit on nondescript swaths of pavement whilst surrounded by garbage. And sometimes in shrubs. Here is the evidence.",
          "link": "https://defector.com/please-enjoy-these-photos-of-drunk-people-at-an-english-horse-race-2",
          "publishedOn": "2025-04-15T13:37:34.000Z",
          "wordCount": 8470,
          "title": "Please Enjoy These Photos Of Drunk People At An English Horse Race",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2207842014.jpg"
        },
        {
          "id": "https://defector.com/?p=186951",
          "author": "Jen Vafidis",
          "description": "I am going to start with a confession: I used to do theater. I say “do theater,” because I did it all: I acted, I directed, I wrote. I designed costumes, I studied the Meisner technique, I rolled around on the floor in a leotard—I even made puppets. None of this was professional, it mainly took place in black boxes for hire, school auditoriums, and the workshops of eager hobbyists. But theater was my first love, and like it is with many first loves, my former feelings now often embarrass me—not just because I no longer feel them, but because falling out of love was so decisive, so shattering, so apocalyptic that the person I was when I did theater is a person who will never exist again.    \nIf this sounds dramatic, well, I did just confess to being a theater kid, and what prevented me from becoming a theater adult was character actor Richard Kind. You might be a little confused, wondering how someone who is fairly successful and otherwise innocuous could be an instigator for such discouragement. I can assure you that he did nothing bad; in fact, what he did was beautiful. I heard what he said to me very loudly and clearly at first, then more subtly over the course of my life, as I’ve returned to it and understood it differently at new ages, while he probably gave it less than two seconds of thought at the time.",
          "link": "https://defector.com/how-meeting-richard-kind-changed-the-course-of-my-life",
          "publishedOn": "2025-04-15T13:06:37.000Z",
          "wordCount": 9681,
          "title": "How Meeting Richard Kind Changed The Course Of My Life",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2190366948.jpg"
        },
        {
          "id": "https://defector.com/?p=186878",
          "author": "Israel Daramola",
          "description": "Over the weekend, the Tennessee Volunteers and quarterback Nico Iamaleava went their separate ways, following a contract dispute and brief holdout in which Iamaleava didn't show up to the team's practice on Friday. His camp—mainly his father and agent—had been negotiating for around $4 million for the upcoming season, a significant raise over his expected $2.2 million. Iamaleava first garnered attention in 2022 for originally receiving an $8 million NIL deal over the length of his college career, when he was still a high school recruit. After one year as Tennessee's starting QB, he'll be looking for a new team.\nAfter quarterbacks Carson Beck and Darian Mensah used the transfer portal to find better NIL deals at Miami and Duke, respectively, it seems Iamaleava's camp was seeking something similar. According to ESPN, this contract dispute had been \"a growing source of frustration among administrators at Tennessee and within the locker room,\" with Iamaleava increasing demands as the spring transfer portal is set to open from April 16-25. When Iamaleava missed practice on Friday and didn't communicate with team staff, head coach Josh Heupel made the decision to move on.",
          "link": "https://defector.com/nico-iamaleava-leaves-tennessee-to-seek-more-money-in-the-transfer-portal",
          "publishedOn": "2025-04-14T19:33:46.000Z",
          "wordCount": 6636,
          "title": "Nico Iamaleava Leaves Tennessee To Seek More Money In The Transfer Portal",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2186658674.jpg"
        },
        {
          "id": "https://defector.com/?p=186853",
          "author": "Kathryn Xu",
          "description": "Would it be so unreasonable to say that Oscar Piastri will one day win a World Drivers' Championship? Describing a driver as World Championship material is an entirely different matter from declaring that a driver will one day win. The statistics aren't in anyone's favor; the factors necessary (i.e. fast car, good strategy) are outside of any driver's control. Just ask Charles Leclerc. But with Red Bull's sharp decline in performance (or, perhaps, lack of necessary improvement), this year's McLaren is the undisputed fastest car on the grid. Perhaps the most unreasonable part of that declaration is the \"one day\" framing, which implies some far-off future, beyond rules overhauls and roster shake-ups. If Piastri is to someday win a championship, his best shot might be this year, when all he needs to do is beat Lando Norris. The Bahrain Grand Prix served as proof that he can.\nNorris looked beatable all weekend, and was open about it, too. He struggled to find pace, culminating in a P6 finish in qualifying. \"I feel like I've just never driven a Formula 1 car before,\" Norris said after the session. He managed to make up three places on the first lap of the race with an excellent start, but was penalized for being over his grid box. (Max Verstappen, lined up beside Norris on the grid in a struggling Red Bull, wasted no time in immediately calling him out over the radio.) After the first pit stops, Norris was overtaken by Leclerc's Ferrari, thanks to a rare Ferrari strategy win, and thus after the second pit stops had to try to pass both Leclerc and George Russell—perpetually seen in a podium position without quite being sure how he got there—in order to claim P2. He managed Leclerc to secure the podium; after an ill-judged attempt on Russell in the closing lap of the race, that was all he got.",
          "link": "https://defector.com/oscar-piastri-takes-it-to-lando-norris",
          "publishedOn": "2025-04-14T17:23:16.000Z",
          "wordCount": 7155,
          "title": "Oscar Piastri Takes It To Lando Norris",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/oscarPiastriBahrain-e1744650861475.jpg"
        },
        {
          "id": "https://defector.com/?p=186858",
          "author": "Chris Thompson",
          "description": "What I like about that image up there is that it gives very little away. The shortened depth of field, which swirls the faces of spectators in lovely bokeh, leaves you with the raw emotions of the photo's subject. That subject is Rory McIlroy, the face of men's golf; the photo was taken Sunday on the 18th green of Augusta National, upon the completion of the final hole of the Masters Tournament. What is McIlroy feeling, there? Whatever it is, he is feeling a lot of it. I, the all-powerful blogger, know the answer. You, poor reader, are my prisoner: I could tell you anything! That is maybe an image of a man losing a golf tournament, and succumbing to crippling disappointment. Or, hell, maybe his caddy just told him that his grandmother died. Maybe the glow that lights this scene from behind the photographer is that of a huge mushroom cloud, and McIlroy is going Sarah Connor mode in his final moments. You don't know!\nThere are other, similar photos from this moment, only slightly less ambiguous. Is this anguish? Rage? Could it be joy? Surely it cannot be pure joy.",
          "link": "https://defector.com/rory-mcilroy-feels-it-all-on-sunday",
          "publishedOn": "2025-04-14T16:45:30.000Z",
          "wordCount": 8962,
          "title": "Rory McIlroy Feels It All On Sunday",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2210155039.jpg"
        },
        {
          "id": "https://defector.com/?p=186844",
          "author": "Ray Ratto",
          "description": "It may be quite easy to please baseball commissioner Rob Manfred, but you’d never know it. Credit to him, the man always looks like a traffic cop on a rainy day. Manfred long ago was accused of not enjoying baseball; based on his usual expression, he has clearly copped a plea on that particular change in lieu of mounting any kind of defense.\nBut there is one team that Manfred can love unreservedly. They do baseball like all the other teams, absolutely, but most important to Stopwatch Rob, they do it quickly. Absurdly so, in fact. They are the Cincinnati Reds, and if Manfred understands what his audience wants correctly, which is less of what they have paid for per serving, those Reds are the team that will save the game.",
          "link": "https://defector.com/the-cincinnati-reds-are-going-nowhere-in-particular-more-quickly-than-any-team-ever-has",
          "publishedOn": "2025-04-14T16:18:34.000Z",
          "wordCount": 8602,
          "title": "The Cincinnati Reds Are Going Nowhere In Particular More Quickly Than Any Team Ever Has",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2209630497.jpg"
        },
        {
          "id": "https://defector.com/?p=186835",
          "author": "Luis Paez-Pumar",
          "description": "What's another Premier League loss to a team in 15th place? For Tottenham Hotspur, the answer is both \"not much\" and \"a sign of incoming apocalypse.\" Despite having more money and talent than plenty of teams above them on the table, Spurs continued their lost season on Sunday, traveling to Wolverhampton and coming away with a 4-2 defeat to Wolves, one of the few teams below the North London side in the standings. There's not much difference between 15th and, say, 13th, where Tottenham would have been with a victory, but on the eve of the most important match of its season, this side looks ready to limp to an underwhelming finish.\n\nhttps://www.youtube.com/watch?v=XySTGD-GPV0",
          "link": "https://defector.com/tottenham-has-one-last-chance-to-avert-disaster",
          "publishedOn": "2025-04-14T15:52:54.000Z",
          "wordCount": 8056,
          "title": "Tottenham Has One Last Chance To Avert Disaster",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2209457734.jpg"
        },
        {
          "id": "https://defector.com/?p=186832",
          "author": "Dan McQuade",
          "description": "I always intend to take my parents' recommendations, but I never seem to get around to them. They’ll tell me to watch a movie or some TV series, and I really do want to. They have good taste, and I like talking to them about this sort of thing. Even the bonnet dramas my mom watches tend to be pretty entertaining. They recommended Jury Duty, and that became one of our favorite shows in a long while.\nBut my wife and I have a 16-month-old child. After he goes to bed, we are usually so exhausted that we just put on some reality schlock, and discuss whether 8 p.m. is too early for two adults to go to bed. So I had not seen The Pitt, the buzzy medical drama set in a Pittsburgh emergency room. My parents recommended it to me before the buzz got loud. As I started to hear from others about the show, I even told my parents that we planned to watch it. And we really did: As a man in my 40s, I try not to lie to my parents too often. But then exhaustion set in, and we watched the Golden Girls episode from Season 6 where Sonny Bono and Lyle Waggoner, playing themselves, woo Bea Arthur.",
          "link": "https://defector.com/for-a-good-time-and-great-laughs-try-the-pitt",
          "publishedOn": "2025-04-14T15:36:25.000Z",
          "wordCount": 7082,
          "title": "For A Good Time And Great Laughs, Try ‘The Pitt’!",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/the-pitt-rats-season-finale.jpg"
        },
        {
          "id": "https://defector.com/?p=186854",
          "author": "Maitreyi Anantharaman",
          "description": "Step up and solve our Monday crossword. This week's puzzle was constructed by Brandon Koppy and edited by Hoang-Kim Vu. Brandon lives in Dripping Springs, Texas, just outside Austin, with his wife and two little girls. You can also find his puzzles in The New York Times or on his blog, see17across.com.\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE. Note that we're pausing open submissions until April 18.",
          "link": "https://defector.com/the-crossword-april-14-statlines",
          "publishedOn": "2025-04-14T15:00:00.000Z",
          "wordCount": 4937,
          "title": "The Crossword, April 14: Statlines",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2151124343.jpg"
        },
        {
          "id": "https://defector.com/?p=186838",
          "author": "Barry Petchesky",
          "description": "It has been a nightmare season for the New York Rangers, who were eliminated Saturday to become just the fourth team in NHL history to miss the playoffs one year after putting up the league's best record. In appropriate fashion, this season is ending with disgruntlement and dysfunction. Trade deadline acquisition Calvin de Haan said the way he's been treated by the team has been \"fucked,\" and told a reporter he wanted to talk about it. Team PR stepped in and suddenly de Haan was no longer talking.\nNearly everything that could go wrong has in New York. The team's veteran core all seemed to age five years overnight. Offseason dramas with Jacob Trouba and Barclay Goodrow spiraled and appeared to infect the rest of the locker room. Talented youths failed to take the next step. Trouba, the captain, along with Kaapo Kakko, Filip Chytil, Ryan Lindgren, Reilly Smith, and Jimmy Vesey were all important parts of the lineup last year who were shipped out during this campaign. The team alienated its longest-tenured player, Chris Kreider, by leaking its willingness to move him. Instead he finished up what is expected to be the end of his stay on Broadway just as the rest of the team did: with an ineffective whimper. Elite goaltending and special teams carried the Rangers to the conference final last year, but when they regressed, what was left was a team that just wasn't very good. \"So many things went together to bring us here,\" Artemi Panarin said after elimination.",
          "link": "https://defector.com/mark-messier-namesake-and-sole-voter-of-mark-messier-leadership-award-presented-by-mark-messier-knows-how-to-fix-the-rangers-mark-messier",
          "publishedOn": "2025-04-14T14:55:53.000Z",
          "wordCount": 6754,
          "title": "Mark Messier, Namesake And Sole Voter Of Mark Messier Leadership Award Presented By Mark Messier, Knows How To Fix The Rangers: Mark Messier",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/messiergraphic.jpeg"
        },
        {
          "id": "https://defector.com/?p=186797",
          "author": "Barry Petchesky",
          "description": "There are prospects and then there are prospects. Gavin McKenna is talented enough and young enough, tearing up the WHL as a teen, and hockey-knowers have a good enough track record of identifying franchise-changing youths early, that the 2026 NHL Draft is settled at the top more than 14 months out. If you listen to the hype—and he's done nothing but live up to it so far—McKenna is the rare 17-year-old who already belongs in the consciousness of the casual fan, not just that of the scouts and the weirdos who are really into juniors. So, here's what a number of shitty NHL teams are going to be tanking for next year:\n\nhttps://www.youtube.com/watch?v=ITC8zeYHZTA",
          "link": "https://defector.com/its-never-too-early-to-get-ready-for-gavin-mckenna",
          "publishedOn": "2025-04-14T13:23:25.000Z",
          "wordCount": 6795,
          "title": "It’s Never Too Early To Get Ready For Gavin McKenna",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2191871454.jpg"
        },
        {
          "id": "https://defector.com/?p=186794",
          "author": "Patrick Redford",
          "description": "A permanent axiom of the NBA: the style of play changes between the regular season and the playoffs. This is because the postseason's structure flattens out several key asynchronicities, like rest, travel, and other scheduling quirks, and because each possession becomes significantly more precious, and therefore subject to greater scrutiny. Rotations tighten as stars play more, the game slows down as laggardly transition defenders dedicate themselves to sprinting back after misses, and systemic and personnel deficiencies are exploited to ruthless extremes. Winning often hinges on which team's star can more effectively score one-on-one; defenses do not gamble.\nBut this year, winning in the regular season looks more different than winning in the playoffs ever has. Several of the best and most interesting teams in the league have found their success by leaning further away from the style that has tended to work in the playoffs. Teams like the Rockets, Thunder, and Grizzlies are winning with large groups of younger players, all of whom are running all over the place all the time. These teams are all different from each other, some in very significant ways, but they all play deep rotations and they all exert concerted pressure on opponents with their collective speed. They apply the principles of early small ball with a bunch of huge guys. They all play an adversarial defense that refuses to allow opponents with the ball to dictate terms of engagement. In other words, they play in such a way that is not going to work in the playoffs if opponents can successfully enforce the historic playoff style.",
          "link": "https://defector.com/the-nba-playoffs-will-be-a-clash-of-generations-and-styles",
          "publishedOn": "2025-04-14T13:00:00.000Z",
          "wordCount": 8378,
          "title": "The NBA Playoffs Will Be A Clash Of Generations And Styles",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2208678166.jpg"
        },
        {
          "id": "https://defector.com/?p=186778",
          "author": "Patrick Redford",
          "description": "For three decades, the U.S. women's national team has enjoyed the incredible luxury of stability between the posts. Keepers sustain notably longer and more stable primes than other players, and therefore turn over at the international and club levels far less often. But even then, the USWNT getting 30 years of world-class goalkeeping from Briana Scurry, Hope Solo, and Alyssa Naeher is extremely special. Their excellent, slightly overlapping careers cover every major tournament the USWNT has played since the 1991 World Cup. It is hard to imagine the team winning four World Cups and five Olympic gold medals without those six hands.\nBut Naeher retired from the USWNT last December, leaving the team without a no-shit first option for the first time in 30 years. Turnover was never a problem in past eras, as Solo was pushing Scurry for the No.1 shirt for years before she took over, just as Naeher pushed Solo. Nobody in the American player pool quite ever pushed Naeher, as the next-most-capped keeper, Casey Murphy, has faded from the picture. The three keepers called up for a pair of April friendlies against Brazil came to camp with 12 total caps. Emma Hayes has a minor succession crisis on her hands.",
          "link": "https://defector.com/phallon-tullis-joyce-makes-her-case-as-the-uswnt-holds-first-keeper-tryout-in-30-years",
          "publishedOn": "2025-04-13T20:49:44.000Z",
          "wordCount": 6890,
          "title": "Phallon Tullis-Joyce Makes Her Case As The USWNT Holds First Keeper Tryout In 30 Years",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2209487521.jpg"
        },
        {
          "id": "https://defector.com/?p=186765",
          "author": "Billy Haisley",
          "description": "Eight minutes into the match, after Eberechi Eze had calmly side-footed the ball over an undefended goal line to give Crystal Palace an early lead, I had for the first time this season the feeling that Manchester City really might not get off the mat.\nThroughout City's season from hell, it has always felt like the squad was too strong, the manager too great, and the team too experienced to end the year in truly disastrous fashion by finishing outside of the Champions League places. Surely the midseason slump would eventually come to an end. Surely the superstars we've watched dominate the best league in the world in unprecedented fashion would finally find some form. Surely, even after it had become clear that there would be no magical click that would transform this team into the swaggering City of old, the Citizens would eventually stop bleeding points, play some simply decent soccer, and nab one of the Premier League's five Champions League spots. But then Eze put Palace ahead in what was for City a must-win home game, and I looked at the standings of this preposterously tight EPL top-five race, and I had to confront the idea that maybe City wouldn't ever wake up from this nightmare.",
          "link": "https://defector.com/kevin-de-bruyne-has-one-more-job",
          "publishedOn": "2025-04-13T20:12:43.000Z",
          "wordCount": 9303,
          "title": "Kevin De Bruyne Has One More Job",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2209249546.jpg"
        },
        {
          "id": "https://defector.com/?p=186731",
          "author": "Patrick Redford",
          "description": "Pauline Ferrand-Prévot was not supposed to take the start line at Paris-Roubaix on Saturday, though the framework of expectation and surprise is insufficient when applied to a rider like Ferrand-Prévot; everything about her 2025 season has been and necessarily will be a surprise. Ferrand-Prévot is back on the road this year after a six-year hiatus spent dominating the mountain biking scene. She decided to swap out her thick tires for skinny ones after winning gold in Paris at last summer's Olympics, completing the career sweep in the process, and she's returned to a very different peloton than the one she left in 2018. Ferrand-Prévot is a former road-race world champion, so it's not like she doesn't know what she's doing. But she'd never raced against latter-day crushers like Demi Vollering and Lorena Wiebes. Could PFP beat the new generation?\nAs it turns out: yes, with flair. Ferrand-Prévot has been one of the best riders through the early-season cobbled classic swing, taking third at Strade Bianche, second at last weekend's Tour of Flanders, and continuing her linear ascent of podia by winning Paris-Roubaix on Saturday. Each performance has been more impressive than the last: she won a small-group sprint in Italy, made the elite four-rider selection and finished second in the sprint for the win in Belgium, then escaped all alone to win at home in France.",
          "link": "https://defector.com/pauline-ferrand-prevots-quick-return-makes-a-great-cycling-season-better",
          "publishedOn": "2025-04-13T18:29:06.000Z",
          "wordCount": 8084,
          "title": "Pauline Ferrand-Prévot’s Quick Return Makes A Great Cycling Season Better",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2209264921.jpg"
        },
        {
          "id": "https://defector.com/?p=186748",
          "author": "Tom Scocca",
          "description": "Welcome to Margin of Error, a politics column from Tom Scocca, editor of the Indignity newsletter.\nGretchen Whitmer, the Democratic governor of Michigan, went to the White House on Wednesday hoping to have a constructive policy discussion with Donald Trump about, among other things, his escalating tariff war. Beforehand, she made public remarks:",
          "link": "https://defector.com/the-bargain-vs-the-boot",
          "publishedOn": "2025-04-11T19:48:13.000Z",
          "wordCount": 9491,
          "title": "The Bargain Vs. The Boot",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2208756375.jpg"
        },
        {
          "id": "https://defector.com/?p=186733",
          "author": "Soraya Roberts",
          "description": "I haven’t been as excited to see a movie as I was to see Drop in possibly years. I saw the trailer a couple of months ago at the beginning of some other movie I don’t remember, and this is how the trailer goes: Ginormous house. Warm lighting. A little R&B. Meghann Fahy. “It’s just a date.” A soft halcyon vignette you know can only be prologue to a massive shitshow. Fahy leaves her cute kid with her cute kid sister at home, and now she’s wearing too much makeup and looking up at a ginormous skyscraper. The restaurant at the top of it, also ginormous, is a golden room with glowing orbs for lights and wrap-around windows overlooking a glowing city. Everything here looks like it costs $9 million. R&B picks up. A bargain-bin Indiana Jones (Brandon Sklenar, and no I don’t know who he is either) waves at her. Her date. Lame banter (“Sorry, I got a drink because I was nervous.” “I had a couple in the car on the way over.” Hahahaha.) Then. The titular drop.\nFahy’s phone buzzes, the music degrades, she starts getting AirDrops left and right, and she and Indiana Jones can’t figure out who it is. Then the music takes another dive because the AirDropper has told her to look at her security cameras and she goes from room to room until she finally sees him: THE MASKED MAN IN HER HOUSE. THIS MAN WILL LITERALLY KILL HER CUTE CHILD—THE AIRDROPPER USES CAPS A LOT—UNLESS SHE DOES ONE THING: KILL HER DATE. I mean, I’ll do it.",
          "link": "https://defector.com/drop-is-not-a-90s-thriller-because-the-90s-are-unfortunately-over",
          "publishedOn": "2025-04-11T17:59:22.000Z",
          "wordCount": 9179,
          "title": "‘Drop’ Is Not A ’90s Thriller Because The ’90s Are Unfortunately Over",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/2589_D026_00434R_CROP.jpg"
        },
        {
          "id": "https://defector.com/?p=186663",
          "author": "Billy Haisley",
          "description": "While all of the reasons to be morally opposed to the Paris Saint-Germain sportswashing project still apply, it must be said that the team as presently constituted is exceptionally cool.\nThis certainly isn't the first great team of PSG's Qatar era, and even after Wednesday's 3-1 home win over Aston Villa, which has the Parisiens on the precipice of the Champions League semifinals, there's still a ways to go before it can match or possibly improve on that 2020 UCL final in terms of coming closest to finally delivering the prize its Qatari overlords have so rapaciously coveted. Almost every previous iteration of PSG has been distasteful for a variety of reasons: the chintzy Galácticos cosplay, the market-warping signings of Neymar and Kylian Mbappé, the jealousy with which they've guarded their golden-caged prisoners, the flaunting of their riches and the simultaneous anger when anyone brings up the grossness of how those riches came about, the self-righteous whining about the schadenfreude their habitual humiliations inspire in the rest of the soccer world. Nevertheless, the current team is surprisingly hard to hate.",
          "link": "https://defector.com/desire-doue-is-the-coolest-of-the-cool",
          "publishedOn": "2025-04-11T17:24:23.000Z",
          "wordCount": 7526,
          "title": "Désiré Doué Is The Coolest Of The Cool",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2209439884.jpg"
        },
        {
          "id": "https://defector.com/?p=186688",
          "author": "John Semley",
          "description": "Like all worthwhile endeavours, the (semi)annual celebration of independent record store culture called Record Store Day started with an idea. Specifically, it started with a dashed-off email with a subject line reading, simply, “idea.”\n“[I]t could be a national event that drives people to indie stores,” Chris Brown, of Portland, Maine-based indie retailer Bull Moose Records, wrote to a consortium of colleagues. “We would need some nice licensed pieces–maybe something along the lines of the upcoming Guided By Voices rarities box…There is a huge press angle here too.  Indies rule. We haven't gone anywhere…Video, print and online testimonials from artists would run in every market to promote the event…Try to include movie stars and game developers…”",
          "link": "https://defector.com/how-record-store-day-became-the-stupidest-day-in-music",
          "publishedOn": "2025-04-11T16:21:12.000Z",
          "wordCount": 9342,
          "title": "How Record Store Day Became The Stupidest Day In Music",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2147943236.jpg"
        },
        {
          "id": "https://defector.com/?p=186637",
          "author": "Tom Ley",
          "description": "Tom Ley: Wow, I can’t believe this. After having been separated for more than a year, the Reacher Creatures have once again come back together to help each other in our time of need. The mission: Try to find something that any of us actually liked about Season 3 of Reacher. \nRoth, I believe you are the only one among us who had a good time watching this season. Perhaps you could explain to us your values? Now?",
          "link": "https://defector.com/is-reacher-too-big-now-a-roundtable-discussion",
          "publishedOn": "2025-04-11T15:07:31.000Z",
          "wordCount": 12669,
          "title": "Is Reacher Too Big Now? A Roundtable Discussion",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/Screenshot-2025-04-10-at-10.40.49 AM.png"
        },
        {
          "id": "https://defector.com/?p=186715",
          "author": "Tom Ley",
          "description": "Good news for Adam Silver: Ja Morant is no longer pretending to shoot a gun after hitting big shots. Potentially bad news for Adam Silver: Ja Morant is now lobbing imaginary grenades into the crowd.\n\nhttps://www.youtube.com/shorts/eWsgIoW9hKw",
          "link": "https://defector.com/ja-morant-is-doing-a-new-thing-and-that-thing-is-grenade",
          "publishedOn": "2025-04-11T13:59:07.000Z",
          "wordCount": 5288,
          "title": "Ja Morant Is Doing A New Thing, And That Thing Is Grenade",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2209656506.jpg"
        },
        {
          "id": "https://defector.com/?p=186646",
          "author": "Israel Daramola",
          "description": "Growing up in Florida, I have always maintained that the state as a whole should be thought of as America's id. Florida is the country's truest self, and wherever the nation is headed, it's likely that Florida was there first and rightfully mocked for it in the moment. The hard right turn into conspiracy and spite, the dismantling of education and social services, an economy built completely out of fraud and scamming—that's us, and has been us. If you were to visit Miami right now, you would see an entire city seemingly catered to fraud: credit card scams, fake medical practices, and, of course, crypto. So, so much crypto.\nOn Wednesday, the president of the United States backed away from some of his more extravagant tariff threats and checked down to smaller, still very dangerous tariffs—for every nation except China, that is, with which we now seem to be in full-blown trade war. While Trump claims that the tariff experiment was merely some sort of test, and his lackeys have framed it as an act of dealcraft beyond mortal comprehension, those explanations land with the same amount of sincerity as a Drake diss record. It sure looks like Trump saw the economy tanking and decided to kill two birds with one stone, readjusting the S&P and also allowing his rich friends who had shorted the economy to make a lot of money off its rebound. That's very clearly insider trading, and will also very clearly not be dealt with in any meaningful way, because consequences don't exist if you have enough money and power. Florida was early to that one, too.",
          "link": "https://defector.com/welcome-to-the-scam-century",
          "publishedOn": "2025-04-11T13:02:27.000Z",
          "wordCount": 8618,
          "title": "Welcome To The Scam Century",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2209431950.jpg"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=848937",
          "author": "Mark Polishuk",
          "description": "The Royals announced that outfielder MJ Melendez has been optioned to Triple-A Omaha.  The move opens up a roster spot for Mark Canha, as the veteran outfielder/first baseman was reinstated from the 10-day injured list. More to come…",
          "link": "https://www.mlbtraderumors.com/2025/04/royals-option-mj-melendez-to-triple-a-activate-mark-canha-from-10-day-il.html",
          "publishedOn": "2025-04-19T14:07:31.000Z",
          "wordCount": 3073,
          "title": "Royals Option MJ Melendez To Triple-A, Activate Mark Canha From 10-Day IL",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/04/MJMelendez-2025-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=848721",
          "author": "Steve Adams",
          "description": "The increasing popularity of opt-outs/player options as a means to close the gap in free agent signings and extensions has changed the face of free agency entirely. Not long ago, opt-outs were perks reserved for the game’s truly elite stars — a benefit to help differentiate nine-figure offers and secure the game’s top stars. In…",
          "link": "https://www.mlbtraderumors.com/2025/04/player-option-opt-out-update-april-edition.html",
          "publishedOn": "2025-04-18T23:25:14.000Z",
          "wordCount": 6059,
          "title": "Player Option/Opt-Out Update: April Edition",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/04/USATSI_25938284-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=848271",
          "author": "Mark Polishuk",
          "description": "The Royals announced that left-hander Sam Long has been placed on the 15-day injured list due to inflammation in his throwing elbow.  Fellow southpaw Evan Sisk was called up from Triple-A in the corresponding move, and Sisk will be making his MLB debut whenever he appears in his first game. Something has clearly seemed amiss…",
          "link": "https://www.mlbtraderumors.com/2025/04/royals-place-sam-long-on-15-day-il-call-up-evan-sisk.html",
          "publishedOn": "2025-04-13T14:39:23.000Z",
          "wordCount": 3690,
          "title": "Royals Place Sam Long On 15-Day IL, Call Up Evan Sisk",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/04/SamLong-2025-1024x702.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=848243",
          "author": "Nick Deeds",
          "description": "The Royals seem to have avoided what could’ve been a brutal blow this evening when infielder Jonathan India exited the club’s game against the Guardians due to what the club later announced was a bout of right quad tightness. After the game, manager Matt Quatraro told reporters (including MLB.com’s Anne Rogers) that the tightness India…",
          "link": "https://www.mlbtraderumors.com/2025/04/royals-notes-india-outfield-wright.html",
          "publishedOn": "2025-04-13T02:25:16.000Z",
          "wordCount": 3751,
          "title": "Royals Notes: India, Outfield, Wright",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/03/USATSI_25458411-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=848100",
          "author": "Steve Adams",
          "description": "3:10pm: Anne Rogers of MLB.com relays some more info from manager Matt Quatraro. Harvey’s strain is grade 1, the lowest severity. He will be re-evaluated next week. 2:04pm: The Royals announced that they’ve placed right-hander Hunter Harvey on the 15-day injured list due to a teres major strain. Fellow righty Steven Cruz has been recalled…",
          "link": "https://www.mlbtraderumors.com/2025/04/royals-hunter-harvey-injured-list-teres-major-strain.html",
          "publishedOn": "2025-04-11T20:10:03.000Z",
          "wordCount": 3613,
          "title": "Royals Place Hunter Harvey On Injured List",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/08/HunterHarvey-Royals-1024x683.jpg"
        }
      ]
    },
    {
      "title": "Flaming Hydra",
      "feedUrl": "https://flaminghydra.com/rss/",
      "siteUrl": "https://flaminghydra.com/",
      "articles": [
        {
          "id": "680294b3105fa700014bef72",
          "author": "The Editors",
          "description": "Jennie Rose Halperin on the life and work of Michael Hurley",
          "link": "https://flaminghydra.com/issue-302/",
          "publishedOn": "2025-04-18T21:49:40.000Z",
          "wordCount": 594,
          "title": "Easy listening",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/hurley-cover-detail-1.png"
        },
        {
          "id": "6802b4ed105fa700014befdb",
          "author": "Jennie Rose Halperin",
          "description": "YOU CAN SHARE THIS POST ON BLUESKY THANK YOU\nI first heard Michael Hurley play in a small, mostly empty venue in Berlin in 2013. It was an early set; the bar was muted, brown, and dingy in dusty late spring light, but when he came in he lit up",
          "link": "https://flaminghydra.com/goodbye-to-the-godfather-of-freak-folk/",
          "publishedOn": "2025-04-18T21:48:49.000Z",
          "wordCount": 668,
          "title": "Goodbye to the Godfather of Freak Folk",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/hurley-cover-detail.png"
        },
        {
          "id": "680180bd105fa700014bddd3",
          "author": "The Editors",
          "description": "Arwa Mahdawi nears the end of an investigation",
          "link": "https://flaminghydra.com/issue-301/",
          "publishedOn": "2025-04-17T23:40:06.000Z",
          "wordCount": 569,
          "title": "Trouble at home",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/police-information-only-1.png"
        },
        {
          "id": "68017557105fa700014bddaa",
          "author": "Arwa Mahdawi",
          "description": "In July 1996, 36-year-old Susan Walsh supposedly left her house in New Jersey and never came back. She is presumed dead but a body has never been found. This is Part Three of a series on my five-year investigation into her unsolved disappearance.\nTo catch up, here are Part One",
          "link": "https://flaminghydra.com/how-to-solve-a-murder-part-five/",
          "publishedOn": "2025-04-17T23:39:54.000Z",
          "wordCount": 628,
          "title": "How to Solve a Murder: Part Five",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/police-information-only.png"
        },
        {
          "id": "68001b35105fa700014bcac0",
          "author": "The Editors",
          "description": "Nathan Munn on Canadian medicine, and Hollywood gossip on the road with Jack Pendarvis",
          "link": "https://flaminghydra.com/film-a-hand-break-a-leg/",
          "publishedOn": "2025-04-16T22:54:05.000Z",
          "wordCount": 612,
          "title": "Film a hand / Break a leg",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/abe-vigoda-jury-duty-duo-16x9-crop-1.png"
        },
        {
          "id": "67ffcf22105fa700014bc9bc",
          "author": "Jack Pendarvis",
          "description": "Ace Goes to Hollywood is a continuing transcript of a ride from Oxford, Mississippi, to Memphis, Tennessee, during which Jack Pendarvis interviewed Ace Atkins about his work on the Pauly Shore film Jury Duty.\nEpisode 4: Bring Me the Hands of Abe Vigoda\nAce has just answered his phone, and",
          "link": "https://flaminghydra.com/ace-goes-to-hollywood-episode-4/",
          "publishedOn": "2025-04-16T22:52:12.000Z",
          "wordCount": 636,
          "title": "Ace Goes to Hollywood: Episode 4",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/abe-vigoda-jury-duty-duo-16x9-crop.png"
        },
        {
          "id": "680007dd105fa700014bca4e",
          "author": "Nathan Munn",
          "description": "If you, a Canadian, should catastrophically break your femur and dislocate your hip doing something stupid, as I did 20 years ago, you’ll quickly find your screaming, shivering form scooped up by friendly paramedics, delivered to hospital, triaged, X-rayed, repaired by world-class surgeons (alongside radiologists, nurses, anaesthesiologists, etc.",
          "link": "https://flaminghydra.com/health-care-you-can-trust/",
          "publishedOn": "2025-04-16T22:50:12.000Z",
          "wordCount": 570,
          "title": "Health Care You Can Trust",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/Screenshot-2025-04-16-at-5.23.29-PM.jpg"
        },
        {
          "id": "67fead90b249b300019cbb7b",
          "author": "The Editors",
          "description": "Ben Ehrenreich sweeps forward; dance class with Amy Chu",
          "link": "https://flaminghydra.com/issue-299/",
          "publishedOn": "2025-04-15T23:15:02.000Z",
          "wordCount": 766,
          "title": "New life / Aging legs",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/trees-16x9-IMG_2928-1.jpg"
        },
        {
          "id": "67febb68b249b300019cbbd9",
          "author": "Amy Chu",
          "description": "a collective of 60 writers, on fire and hard to kill",
          "link": "https://flaminghydra.com/adult-ballet-class/",
          "publishedOn": "2025-04-15T23:14:47.000Z",
          "wordCount": 297,
          "title": "Adult Ballet Class",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/Church.jpg"
        },
        {
          "id": "67fe93d9b249b300019cbb3c",
          "author": "Ben Ehrenreich",
          "description": "At some point in the next few days or even hours, my partner will give birth to a child. Her delivery date came and went earlier in the week, but with so much going on and the markets all yippy, who has time for the miracle of life? I’",
          "link": "https://flaminghydra.com/soon/",
          "publishedOn": "2025-04-15T23:14:26.000Z",
          "wordCount": 806,
          "title": "Soon",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/trees-16x9-IMG_2928.jpg"
        },
        {
          "id": "67fd77905aa1bd00010c6888",
          "author": "The Editors",
          "description": "Brian Hioe on global authoritarians; a history lesson with Trevor Alixopulos",
          "link": "https://flaminghydra.com/issue-298/",
          "publishedOn": "2025-04-14T22:09:42.000Z",
          "wordCount": 600,
          "title": "Modern problems / Ancient moods",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/FridaysForFuture_protest_Berlin_2025-04-11_167-crop-1-.jpg"
        },
        {
          "id": "67fd620a5aa1bd00010c6769",
          "author": "Trevor Alixopulos",
          "description": "a collective of 60 writers, on fire and hard to kill",
          "link": "https://flaminghydra.com/hysterical-classicism/",
          "publishedOn": "2025-04-14T22:07:39.000Z",
          "wordCount": 289,
          "title": "Hysterical Classicism",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/hystclasthumb.png"
        },
        {
          "id": "67fd40ba5aa1bd00010c6707",
          "author": "Brian Hioe",
          "description": "The turbulent character of our times seems to have gone global; each day the news is like seeing the same film adapted in different languages. Draconian budget cuts? Youth-led protests? Resurgent authoritarianism? These could be taking place almost anywhere in the world.\nWell, okay… only one country in the",
          "link": "https://flaminghydra.com/we-are-the-world/",
          "publishedOn": "2025-04-14T22:07:19.000Z",
          "wordCount": 616,
          "title": "We Are the World",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/FridaysForFuture_protest_Berlin_2025-04-11_167-crop.jpg"
        },
        {
          "id": "67f9793d5aa1bd00010c5251",
          "author": "The Editors",
          "description": "All the world’s a stage, says Zito Madu, and an announcement from Diana Moskovitz",
          "link": "https://flaminghydra.com/issue-297/",
          "publishedOn": "2025-04-11T21:54:37.000Z",
          "wordCount": 792,
          "title": "Evil emoji / Feline friends",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/Othello_and_Iago-16x9-1.png"
        },
        {
          "id": "67f956fd5aa1bd00010c514a",
          "author": "Zito Madu",
          "description": "Most of the actors I’ve seen play Iago, the villain of Shakespeare’s Othello, portray him as a serpentine character—literally, as an extension of the serpent in the garden of Eden, a slippery, slithering trickster and deceiver who leads everyone to their destruction with his",
          "link": "https://flaminghydra.com/the-bad-men-are-no-mystery/",
          "publishedOn": "2025-04-11T21:52:06.000Z",
          "wordCount": 794,
          "title": "The Bad Men Are No Mystery",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/Othello_and_Iago-16x9.png"
        },
        {
          "id": "67f96add5aa1bd00010c519e",
          "author": "Diana Moskovitz",
          "description": "a collective of 60 writers, on fire and hard to kill",
          "link": "https://flaminghydra.com/whats-new-pussycats/",
          "publishedOn": "2025-04-11T21:51:22.000Z",
          "wordCount": 297,
          "title": "What’s New: Pussycats",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/cattz.jpg"
        }
      ]
    },
    {
      "title": "Today in Tabs",
      "feedUrl": "https://rss.beehiiv.com/feeds/ZRiesnGI0u.xml",
      "siteUrl": "https://www.todayintabs.com/",
      "articles": []
    },
    {
      "title": "Bad Faith Times",
      "feedUrl": "https://bad-faith-times.ghost.io/rss/",
      "siteUrl": "https://bad-faith-times.ghost.io/",
      "articles": [
        {
          "id": "68028ec00951470001ef0769",
          "author": "Denny Carter",
          "description": "The United States can't be saved unless SCOTUS is saved first",
          "link": "https://bad-faith-times.ghost.io/imagine-a-pro-democracy-supreme-court-if-you-can/",
          "publishedOn": "2025-04-18T18:51:16.000Z",
          "wordCount": 1713,
          "title": "Imagine A Pro-Democracy Supreme Court – If You Can",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/04/2894165178_1b3be5fac1_b.jpg"
        },
        {
          "id": "680118e20951470001ef01a7",
          "author": "Denny Carter",
          "description": "Rejecting the civil libertarian interpretation of the First Amendment is more important than ever",
          "link": "https://bad-faith-times.ghost.io/we-need-a-new-concept-of-free-speech-and-we-need-it-now/",
          "publishedOn": "2025-04-17T15:32:33.000Z",
          "wordCount": 2846,
          "title": "We Need A New Concept Of Free Speech, And We Need It Now",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/04/6219961958_e15d5cdec6_b.jpg"
        },
        {
          "id": "67fe72d8040a00000123f9a7",
          "author": "Denny Carter",
          "description": "Know that these nightmare alterations were done for one man.",
          "link": "https://bad-faith-times.ghost.io/mutilating-your-face-for-big-daddy-dictator/",
          "publishedOn": "2025-04-15T15:36:08.000Z",
          "wordCount": 910,
          "title": "Mutilating Your Face For Big Daddy Dictator",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/04/Screenshot-2025-04-15-at-10.33.42-AM-1.png"
        },
        {
          "id": "67fd4ca6f023ed0001ef23f2",
          "author": "Denny Carter",
          "description": "Everything we're seeing today can be traced back to 2020",
          "link": "https://bad-faith-times.ghost.io/bad-faith-and-the-backlash-against-wokeism/",
          "publishedOn": "2025-04-14T18:08:04.000Z",
          "wordCount": 567,
          "title": "Bad Faith And The Backlash Against 'Wokeism'",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/size/w1200/2025/04/Screenshot-2025-04-14-at-2.07.17-PM.png"
        },
        {
          "id": "67f926528b52b30001dcb20e",
          "author": "Denny Carter",
          "description": "It's no game.",
          "link": "https://bad-faith-times.ghost.io/to-be-insulted-by-these-fascists-is-so-degrading/",
          "publishedOn": "2025-04-11T15:10:17.000Z",
          "wordCount": 1445,
          "title": "To Be Insulted By These Fascists Is So Degrading",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/04/Screenshot-2025-04-11-at-11.07.12-AM.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}