{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": []
    },
    {
      "title": "The Pitch",
      "feedUrl": "https://www.thepitchkc.com/feed/",
      "siteUrl": "https://www.thepitchkc.com/",
      "articles": [
        {
          "id": "https://www.thepitchkc.com/?p=861402",
          "author": "Pitch Staff",
          "description": "Art by Keegan Hudspeth   Bryan Busby KMBC 9 Meteorologist  The book, You are a badass, by Jen Sincero. It is a self-help book like no other, using very directed, frank wording. With a title like that, you can only imagine the language she uses to motivate you. I have given friends and my protégés this book as a holiday...",
          "link": "https://www.thepitchkc.com/the-pitchs-2024-holiday-self-gift-guide-for-spoiling-yourself/",
          "publishedOn": "2024-11-28T14:00:26.000Z",
          "wordCount": 8290,
          "title": "The Pitch’s 2024 Holiday Self-Gift Guide for spoiling yourself",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/l/x/giftguidesocial-head-1024x683.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=861989",
          "author": "Tiffany Watts",
          "description": "Q39 // Photo By Tiffany Watts If you’re on the hunt for the best chicken wings in Kansas City, you’re in luck. From smoky BBQ to bold international flavors, these local gems are redefining what it means to serve unforgettable wings. Here’s your ultimate guide to KC’s wing scene—grab your wet wipes and prepare for a flavor-packed journey. Mr. Wingz...",
          "link": "https://www.thepitchkc.com/kansas-city-wing-tour-six-must-try-spots-for-chicken-wing-lovers/",
          "publishedOn": "2024-11-27T22:00:22.000Z",
          "wordCount": 2451,
          "title": "Kansas City Wing Tour: Six must-try spots for chicken wing lovers",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/06/s/l/q39-photo-by-tiffany-watts-scaled.jpeg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=863493",
          "author": "Michael Mackie",
          "description": "Photo by Don Ipock Not unlike the arrival of Mariah Carey, the holidays aren’t the holidays without KCRep’s annual performance of the beloved holiday classic, Charles Dickens’s A Christmas Carol. Over the decades, the play—which runs through Dec. 28 at Spencer Theatre—has become an iconic KC tradition.  If you’ve been living under a rock, the show tells the tale of the...",
          "link": "https://www.thepitchkc.com/four-inane-questions-with-a-christmas-carols-nedra-dixon/",
          "publishedOn": "2024-11-27T20:00:23.000Z",
          "wordCount": 1913,
          "title": "Four Inane Questions with A Christmas Carol’s Nedra Dixon",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/11/m/m/screenshot-2024-11-26-090029.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=863643",
          "author": "Anna Spoerre",
          "description": "An opinion issued by Missouri Attorney General Andrew Bailey states that while any statutes prohibiting abortion prior to fetal viability will no longer be enforceable in their entirety, the state can still enforce some laws (photo submitted). Missouri Attorney General Andrew Bailey believes the state can still enforce some abortion restrictions even after voters lifted the state’s ban earlier this...",
          "link": "https://www.thepitchkc.com/missouri-ag-lays-out-abortion-restrictions-he-argues-remain-in-place-despite-amendment-3/",
          "publishedOn": "2024-11-27T18:17:41.000Z",
          "wordCount": 2477,
          "title": "Missouri AG lays out abortion restrictions he argues remain in place despite Amendment 3",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/11/g/t/screenshot-2024-11-27-at-121336pm-1024x609.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=863644",
          "author": "Tim Carpenter",
          "description": "Tony Mattivi, director of the Kansas Bureau of Investigation, urged the 2025 Legislature to approve plans for a new $114.4 million headquarters building in Topeka. He said the existing facilities posed fire-safety risks, lacked a suitable perimeter and were otherwise inadequate to complete the agency’s law enforcement mission. (Tim Carpenter/Kansas Reflector) TOPEKA — The director of the Kansas Bureau of...",
          "link": "https://www.thepitchkc.com/kbi-seeks-114-4-million-for-new-headquarters-and-exit-from-horrible-neighborhood-in-topeka/",
          "publishedOn": "2024-11-27T18:12:43.000Z",
          "wordCount": 2282,
          "title": "KBI seeks $114.4 million for new headquarters and exit from ‘horrible’ neighborhood in Topeka",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/11/q/e/screenshot-2024-11-27-at-121047pm-1024x573.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=861391",
          "author": "Pitch Staff",
          "description": "Photo by Chris Ortiz. // Art by Cassondra Jones ONGOING Dec 6 & 7 Sam Jay, Comedy Club KC Dec 6-8 Kansas City Symphony Presents Handel’s Messiah, Kauffman Center for the Performing Arts Dec 6-24 Kansas City Ballet Presents The Nutcracker, Kauffman Center for the Performing Arts Dec 19-22 Kansas City Symphony Presents Christmas Festival, Kauffman Center for the Performing Arts...",
          "link": "https://www.thepitchkc.com/our-december-2024-events-calendar-showcases-justin-timberlake-the-allman-betts-band-and-holiday-season-happenings/",
          "publishedOn": "2024-11-27T17:00:03.000Z",
          "wordCount": 1948,
          "title": "Our December 2024 Events Calendar showcases Justin Timberlake, The Allman Betts Band, and holiday season happenings",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2022/12/i/m/pitch-calendar-01-1.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=863616",
          "author": "Scott Poore",
          "description": "Photo by Krystle-Lee You may remember Apollo—a senior pup who was adopted from Great Plains SPCA six years ago. The team at Great Plains removed a benign mass from his hind leg and reunited him with his owner. In late October, Apollo was rushed back to our shelter in the midst of a medical emergency—an infection in his front leg,...",
          "link": "https://www.thepitchkc.com/creature-feature-meet-apollo-an-incredibly-persistent-pup/",
          "publishedOn": "2024-11-27T16:01:02.000Z",
          "wordCount": 1627,
          "title": "Creature Feature: Meet Apollo, an incredibly persistent pup",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/11/t/o/screenshot-2024-11-27-095415.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=863575",
          "author": "Tiffany Watts",
          "description": "Lutfi’s // Photo By Tiffany Watts Lutfi’s When the craving for fried fish hits, there’s only one logical move: follow the scent of golden batter to the best spot in town. This time, my taste buds led me to Lutfi’s Fried Fish in the Northland—a local treasure that Kansas City swears by. With their reputation for crispy comfort food that...",
          "link": "https://www.thepitchkc.com/dish-drink-kc-soulful-flavors-at-lutfis-fried-fish-and-happy-hour-at-beer-kitchen/",
          "publishedOn": "2024-11-27T14:00:51.000Z",
          "wordCount": 2270,
          "title": "Dish & Drink KC: Soulful flavors at Lutfi’s Fried Fish and happy hour at Beer Kitchen",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/11/k/k/beer-kitchen-photo-by-tiffany-watts-2-scaled.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=863558",
          "author": "Abby Olcese",
          "description": "Courtesy Disney Let’s start here: Moana 2 was initially meant to be a Disney+ series. This is helpful context to have in mind as you watch the sequel to the 2016 original, if only to temper your expectations. The follow up to Moana has nowhere near the same musical, dramatic and thematic richness of its predecessor, but it’s fine as...",
          "link": "https://www.thepitchkc.com/disneys-moana-2-stitches-fragments-of-a-cancelled-tv-show-into-a-lackluster-unit-of-entertainment/",
          "publishedOn": "2024-11-26T23:57:38.000Z",
          "wordCount": 2195,
          "title": "Disney’s Moana 2 stitches fragments of a cancelled TV show into a lackluster unit-of-entertainment",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/11/j/f/screenshot-2024-11-26-at-55436pm-1024x537.png"
        }
      ]
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=174490",
          "author": "Patrick Redford",
          "description": "The United States Women's National Team is currently in Europe to play a pair of friendlies that will thoroughly stretch the meaning of that designation.\nFirst up is a date with England at Wembley, both a homecoming for USWNT coach Emma Hayes and a fascinating opportunity to consider the dynamics of the transatlantic soccer exchange on both the Olympic champions and the European champions. Hayes, of course, made her name managing Chelsea for over a decade, though she got her start coaching in New York, a bit north of where Three Lionesses manager Sarina Wiegman played college soccer. USWNT vets have enjoyed short stints in England, and so many England players have tussled in the NWSL that The Athletic ran a long story with quotes from each payer about how physical and demanding the standard of play was stateside. The game is not exactly a referendum on whose development environment is better, though it does provide an occasion to think seriously about at the state of the best women's club league and the second-best as it closes the gap. It's also a serious test for both teams with close to their full rosters.",
          "link": "https://defector.com/enjoy-the-lily-yohannes-victory-lap",
          "publishedOn": "2024-11-29T21:23:07.000Z",
          "wordCount": 6769,
          "title": "Enjoy The Lily Yohannes Victory Lap",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2187000462.jpg"
        },
        {
          "id": "https://defector.com/?p=174670",
          "author": "Patrick Dubuque",
          "description": "Defector has partnered with Baseball Prospectus to bring you a taste of their work. They write good shit that we think you’ll like. If you do like it, we encourage you to check out their site and subscribe.\nThis story was originally published at Baseball Prospectus on November 22.",
          "link": "https://defector.com/the-last-pitcher",
          "publishedOn": "2024-11-29T17:24:11.000Z",
          "wordCount": 8728,
          "title": "The Last Pitcher",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-1387469914.jpg"
        },
        {
          "id": "https://defector.com/?p=174198",
          "author": "Felix Kent",
          "description": "I recently stayed at a blandly business-oriented hotel in San Jose in order to celebrate my birthday, drink a tall boy, and watch the Sharks lose. You know this type of hotel. There were white duvet covers, white sheets, beige walls, dark wood for the closet and bathroom doors. There was a nice light under a wall bench to help you find your way to the bathroom in the middle of the night. The soundproofing was good.\nThere was also, of course, a picture on the wall. There is always a picture on the wall in hotel rooms. It was a photograph and it showed a cement wall and floor belonging to what seemed to be a warehouse building.",
          "link": "https://defector.com/why-does-hotel-art-look-like-that",
          "publishedOn": "2024-11-29T14:00:40.000Z",
          "wordCount": 10070,
          "title": "Why Does Hotel Art Look Like That?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-1265276272.jpg"
        },
        {
          "id": "https://defector.com/?p=174669",
          "author": "David Roth",
          "description": "It is not important how late I stayed up watching Rutgers defeat Notre Dame on Tuesday night, in one of the many Thanksgiving-season college basketball tournaments happening right now. It is sufficient to say that it was late enough that I felt both tired and stupid the next morning, and arrived at my parents' house the next evening to help with Thanksgiving prep both a little droopy and decently primed for the cascading excesses of this season. Staying up to watch tournaments sponsored by the manufacturers of the orange-shaped chocolate thing my in-laws like, or the early rounds of the Bad Boy Mowers Battle 4 Atlantis, is a kind of gluttony in itself. It's less literal than the kind that generally defines Thanksgiving, but it comes from the same place—the instinct, when presented with an abundance of something/anything, to let yourself have a little treat, and then maybe another after that.",
          "link": "https://defector.com/staying-up-late-and-being-stupid",
          "publishedOn": "2024-11-28T17:21:21.000Z",
          "wordCount": 7074,
          "title": "Staying Up Late And Being Stupid",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2186464399-1.jpg"
        },
        {
          "id": "https://defector.com/?p=174547",
          "author": "Drew Magary",
          "description": "Drew Magary’s Thursday Afternoon NFL Dick Joke Jamboroo runs every Thursday at Defector during the NFL season. Got something you wanna contribute? Email the Roo. And buy Drew’s book, The Night The Lights Went Out, through here.\nIt’s Thanksgiving today, and I have only one message for you, the Holiday-American: please pass the salt. Do not hog the salt. Do not set the table without salt and pepper, as if the food you’ve cooked has already been flawlessly seasoned. And do NOT, under any circumstances, give me any guff when I ask for more salt on my food.",
          "link": "https://defector.com/pass-the-salt",
          "publishedOn": "2024-11-28T15:14:07.000Z",
          "wordCount": 14686,
          "title": "Pass The Salt",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-175040791.jpg"
        },
        {
          "id": "https://defector.com/?p=174698",
          "author": "Dan McQuade",
          "description": "Trent Green does not have a long acting career. His IMDb page is basically his football career. For example, it lists him as appearing in 11 episodes of NFL On Fox as “Self,” while quarterbacking Washington, St. Louis, and Kansas City. Now Green has a real credit to his name, though he’s still playing himself—Trent Green is in a Hallmark Christmas movie.\nEarlier this week, Alex, Kelsey, Sabrina and I discussed Christmas in the Spotlight. That was a Lifetime Christmas movie featuring not-so-thinly veiled versions of Taylor Swift and Travis Kelce. It was like any other football movie that existed in a world outside the NFL, in that the teams were fake—the Kelce character, Gonzo, played for the Bay Springs Bombers—and the extra-large end zones in the football scenes were proof that the film was made in Canada. But Trent Green’s movie debut features the real Kansas City Chiefs. Holiday Touchdown: A Chiefs Love Story, which premieres Saturday, is an actual honest-to-God NFL-licensed Hallmark Christmas movie. Score one for Hallmark in the annual contest for made-for-TV Christmas supremacy.",
          "link": "https://defector.com/they-put-trent-green-in-this-hallmark-christmas-movie",
          "publishedOn": "2024-11-27T18:43:54.000Z",
          "wordCount": 7651,
          "title": "They Put Trent Green In This Hallmark Christmas Movie",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/trent-green-holiday-touchdown.jpg"
        },
        {
          "id": "https://defector.com/?p=174752",
          "author": "Justin Ellis",
          "description": "Growing up my grandma lived in a small green house that sat under a towering cottonwood tree on the southside of Minneapolis. She had many old things, or at least things that felt old to my young brain: a cast iron fire place that looked like it could forge steel, a massive wooden cabinet TV that hummed and seemed almost radioactive, a whole rainbow's worth of colorful mixing bowls that were sturdy enough to survive in the oven.\nThe bowls are what I remember the most, because I remember the kitchen more vividly than anything else. On holidays like Thanksgiving, Christmas and Easter, work would start in the narrow galley of a kitchen very early and it would go late, until family arrived, until the very minute everyone sat at the table, through the comabtive games of Uno to decide who would do dishes after no one was foolish enough to eat more.",
          "link": "https://defector.com/when-does-a-recipe-become-your-own",
          "publishedOn": "2024-11-27T18:25:00.000Z",
          "wordCount": 7456,
          "title": "When Does A Recipe Become Your Own?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-566024743.jpg"
        },
        {
          "id": "https://defector.com/?p=174525",
          "author": "Lauren Theisen",
          "description": "Current Delaware state senator Sarah McBride was elected to the U.S. House of Representatives as a Democrat earlier this month, replacing Lisa Blunt Rochester, who moved to the Senate to replace the retiring Tom Carper. McBride is the first known trans person to serve in the U.S. Congress.\nThe left wing of the trans community was not that enthused by McBride's victory, in part because the representative-elect positioned herself during the campaign as a staunch Israel hawk even as its military continues to inflict apocalyptic conditions on Palestinians in Gaza (including, obviously, our siblings in the queer community). Given her ties to Joe Biden and the aggressively centrist Human Rights Campaign, plenty of trans people (myself included) resisted any framing of McBride's election as groundbreaking. In nearly every respect, she is an extremely typical middle-of-the-road politician.",
          "link": "https://defector.com/the-purpose-of-a-bathroom-law",
          "publishedOn": "2024-11-27T18:09:00.000Z",
          "wordCount": 7081,
          "title": "The Purpose Of A Bathroom Law",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-1206236347.jpg"
        },
        {
          "id": "https://defector.com/?p=174697",
          "author": "Kathryn Xu",
          "description": "Even though you knew about the great rice/wheat cultivation divide, the extent to which you missed rice after one-and-a-half weeks in China surprised you. But now—after countless delicious but rice-less meals with millet porridge, mantou, and/or dumplings as the primary carb delivery vessels—you and your older sister are finally let loose upon the city of Qingdao to pick a meal for yourself.\nIt is 4:30 p.m. on a weekday. You ate so much at the hotel breakfast that lunch was patched up with a snack, but now you are very hungry. It is time for something spicy and ricey. You are armed with Chinese fluency and a working Alipay. But no creature is perfect, and so you are also functionally illiterate.",
          "link": "https://defector.com/consider-the-fruit-tea-dilemma",
          "publishedOn": "2024-11-27T17:40:06.000Z",
          "wordCount": 6889,
          "title": "Consider The Fruit Tea Dilemma",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/fruittea.jpg"
        },
        {
          "id": "https://defector.com/?p=174710",
          "author": "Ray Ratto",
          "description": "Be amazed all you like by the Los Angeles Dodgers firing out another $182 million for the next five years of Blake Snell’s services. Wonder how much deferred money they will have to pay Snell, the offseason's finest domestic pitching prize, after the club’s current management team is either retired or dead. Speculate in rage about how the Dodgers will invariably get Juan Soto before Christmas and then pick up Roki Sasaki while they're standing in the checkout line like he was a damned Almond Joy. Complain to your spleen's content about how, if the Dodgers ever keep everyone healthy, they will win 146 games and be awarded the World Series by acclamation after the American League champion declares \"screw it\" and goes on vacation early. They're still doing this world domination thing wrong.\nWhat they should be doing, simply put, is eliminating the middleman. The Dodgers should simply buy Scott Boras.",
          "link": "https://defector.com/the-dodgers-should-cut-to-the-chase",
          "publishedOn": "2024-11-27T17:12:13.000Z",
          "wordCount": 7089,
          "title": "The Dodgers Should Cut To The Chase",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2177674463.jpg"
        },
        {
          "id": "https://defector.com/?p=174709",
          "author": "Jae Towle Vieira",
          "description": "Speaking from experience, buying into symbolism will drive you mad. I cannot tell you how many times I’ve been absolutely certain that a certain gesture definitively means a person is now my enemy. My long-suffering therapist always tries to remind me that there are other potential explanations for most things. But why shouldn’t I believe my own interpretations, especially if my enemies are making themselves known?\nI’m convinced my therapist would be eaten alive if they stepped in the neighborhood where today’s episode takes place. We’ve got divorce lore, hot young lawn boys, cryptic Instagram posts, and garden parties. Everyone’s favorite vehicle for flexing on each other is a gigantic bronze sculpture of a fig. Love the fig, hate the fig, pretend indifference to the fig—it’s up to you. But one thing is certain and unavoidable: On this street, there is no such thing as neutrality.",
          "link": "https://defector.com/bitter-fruit-from-the-fig-of-deceit",
          "publishedOn": "2024-11-27T16:51:14.000Z",
          "wordCount": 5297,
          "title": "Bitter Fruit From The Fig Of Deceit",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2023/03/Normal_Gossip_16-9_V2.png"
        },
        {
          "id": "https://defector.com/?p=174465",
          "author": "Kelsey McKinney",
          "description": "Welcome back to The Not-So-Great Defector Bake Off, where Kelsey and Chris attempt to complete the technical challenges from the newest season of The Great British Bake Off in their own home kitchens, with the same time parameters as the professional-grade bakers competing on the show.",
          "link": "https://defector.com/the-not-so-great-defector-bake-off-must-alas-die-die-for-patisserie-week",
          "publishedOn": "2024-11-27T15:44:38.000Z",
          "wordCount": 31583,
          "title": "The Not-So-Great Defector Bake Off Must Alas Die, Die For Pâtisserie Week",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/Screenshot-2024-11-26-at-10.16.17 AM.png"
        },
        {
          "id": "https://defector.com/?p=174545",
          "author": "Luisa Rollenhagen",
          "description": "BERLIN — When Germans woke up on the morning of Nov. 6th, it felt like déjà vu: Once again the country had been on the edge of its seat following the U.S. presidential elections, with a qualified left-leaning female candidate losing to an erstwhile reality star turned right-wing political icon. And once again, there was the question: What now?\nGermany's relationship with the U.S. is based on decades of economic ties, shared democratic values, and strategic cooperation on multilateral issues, particularly global security concerns. While a certain anti-Americanism has always persisted in Germany, especially since the U.S. invasion of Iraq in 2003, and German public opinion on the United States fluctuates significantly with whoever is president at the time, the majority of Germans consider the U.S. to be a key partner.",
          "link": "https://defector.com/donald-trump-is-everyones-problem-even-in-germany",
          "publishedOn": "2024-11-27T15:19:32.000Z",
          "wordCount": 11633,
          "title": "Donald Trump Is Everyone’s Problem, Even In Germany",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2004989819.jpg"
        },
        {
          "id": "https://defector.com/?p=173228",
          "author": "Maitreyi Anantharaman",
          "description": "There was no big Defector-style Professional Women’s Hockey League season preview last year, because I was (shameless plug) a little busy reporting this feature on the league’s formation. But it’s also tough to preview an inaugural season. Ideally the preview writer is offering special wisdom, honed over many years, manifested in cute and knowing references. How could I do that with a brand-new league? It would have been the blind previewing for the blind—an insult, frankly, to your intelligence. Only now, after one whole year of PWHL fandom, do I feel comfortable sharing a preview with you, valued reader. Let’s see what the league’s second season might have in store. The games start Saturday.\nThe six teams are listed below in draft order, each entry highlighting a cool veteran and a rookie. If you’re new to watching the PWHL, welcome! At the very end of this preview, there’s an FAQ section with some extra notes, tips, and reminders of the rules. As noted in that FAQ section, the PWHL point system distinguishes between wins in regulation and overtime or shootout wins, so each team’s record is formatted in the following order: regulation win-overtime win-overtime loss-regulation loss.",
          "link": "https://defector.com/all-your-questions-will-be-answered-in-this-2024-25-pwhl-season-preview",
          "publishedOn": "2024-11-27T14:10:22.000Z",
          "wordCount": 16850,
          "title": "All Your Questions Will Be Answered In This 2024-25 PWHL Season Preview",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/11/GettyImages-2155746223.jpg"
        }
      ]
    },
    {
      "title": "Joe's Weather Blog | In-depth Kansas City forecasts | FOX4KC",
      "feedUrl": "http://fox4kc.com/category/weather/weather-blog/feed/",
      "siteUrl": "https://fox4kc.com",
      "articles": [
        {
          "id": "https://fox4kc.com/?p=3744369",
          "author": "Joe Lauria",
          "description": "It's not a wide band, but it's a mighty one. About 10-15 miles from north to south around that band there are little or no impact, and in the band, there are crashes and road closures. This is what I've been concerned about for two days and last night I hit this hard. I had [...]",
          "link": "https://fox4kc.com/weather/weather-blog/joes-blog-band-of-snow-creates-a-mess-in-kc-sat-11-30/",
          "publishedOn": "2024-11-30T15:50:00.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Band of snow creates a mess in KC (SAT-11/30)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11304.png?w=570",
            "type": "image/png",
            "length": "920469"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11304.png?w=570"
        },
        {
          "id": "https://fox4kc.com/?p=3744369",
          "author": "Joe Lauria",
          "description": "It's not a wide band, but it's a mighty one...roughly 10-15 miles from north to south...around that band there is little or no impacts and in the band there are crashes and road closures. This is what I've been concerned about for two days and last night I hit this hard. I had a bad [...]",
          "link": "https://fox4kc.com/email-alerts/joes-weather-blog-email-alerts/joes-blog-band-of-snow-creates-a-mess-in-kc-sat-11-30/",
          "publishedOn": "2024-11-30T15:50:00.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Band of snow creates a mess in KC (SAT-11/30)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11304.png?w=570",
            "type": "image/png",
            "length": "920469"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11304.png?w=570"
        },
        {
          "id": "https://fox4kc.com/?p=3743490",
          "author": "Joe Lauria",
          "description": "As we head toward the last day of November tomorrow, Mother Nature may give us a last day of November snow, and perhaps, it may be more than just a casual amount for parts of the area",
          "link": "https://fox4kc.com/weather/weather-blog/joes-blog-fast-moving-snows-saturday-fri-11-29/",
          "publishedOn": "2024-11-29T16:50:24.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Fast moving snows Saturday (FRI-11/29)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11298.png?w=900",
            "type": "image/png",
            "length": "1885239"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11298.png?w=900"
        },
        {
          "id": "https://fox4kc.com/?p=3741713",
          "author": "Joe Lauria",
          "description": "With this colder pattern, two disturbances will be moving towards the region. One rainmaker and one snowmaker.",
          "link": "https://fox4kc.com/email-alerts/joes-weather-blog-email-alerts/joes-blog-watching-for-snow-on-saturday-wed-11-27/",
          "publishedOn": "2024-11-27T15:38:41.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Watching for snow on Saturday (WED-11/27)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11275.png?w=900",
            "type": "image/png",
            "length": "796433"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/11/11275.png?w=900"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=832223",
          "author": "Darragh McDonald",
          "description": "The latest episode of the MLB Trade Rumors Podcast is now live on Spotify, Apple Podcasts, and wherever you get your podcasts! Make sure you subscribe as well! You can also use the player at this link to listen, if you don’t use Spotify or Apple for podcasts. This week, host Darragh McDonald is joined by Tim Dierkes of…",
          "link": "https://www.mlbtraderumors.com/2024/11/mlbtr-podcast-yusei-kikuchi-the-aggressive-angels-and-the-singer-india-trade.html",
          "publishedOn": "2024-11-27T15:49:51.000Z",
          "wordCount": 3366,
          "title": "MLBTR Podcast: Yusei Kikuchi, The Aggressive Angels, And The Singer/India Trade",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/11/USATSI_24320643-1024x683.jpg"
        }
      ]
    },
    {
      "title": "local food",
      "feedUrl": "https://www.kcur.org/tags/local-food.rss",
      "siteUrl": "https://www.kcur.org/tags/local-food",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}