{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": [
        {
          "id": "https://blogs.fangraphs.com/?p=462523",
          "author": "Eric Longenhagen",
          "description": "Plus, an update on Braves right-hander Didier Fuentes.",
          "link": "https://blogs.fangraphs.com/scouting-todays-call-ups-chase-petty-noah-cameron-and-aj-blubaugh/",
          "publishedOn": "2025-04-30T18:30:09.000Z",
          "wordCount": null,
          "title": "Scouting Today’s Call-Ups: Chase Petty, Noah Cameron, and AJ Blubaugh",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=188614",
          "author": "Brandy Jensen",
          "description": "In order to watch The Settlers, I first had to fraudulently assert my right to do so. The latest film by much-lauded documentarian Louis Theroux was broadcast earlier this week on BBC Two, and is available to stream via BBC iPlayer, which you can only access with an IP address in the UK (an international release date is apparently coming soon.) So I lied in order to have the thing I wanted, which seemed fitting enough. \nTheroux has made a name for itself over the years as someone uniquely skilled at getting people to reveal truths they might rather hide. He approaches his subjects—often people with reprehensible beliefs, like Afrikaner separatists or members of the Westboro Baptist Church—with a disarming affability. His slightly naive persona is matched by his physical presence: generally folding in on himself as if embarrassed about his height, bespectacled face often scrunched in a quizzical expression, looking always in danger of tripping over something. He invites people to explain themselves without passing judgment in the moment, relying instead on heavy silences or a voiceover.",
          "link": "https://defector.com/the-settlers-makes-louis-theroux-say-what-he-thinks",
          "publishedOn": "2025-05-04T19:25:42.000Z",
          "wordCount": 7275,
          "title": "‘The Settlers’ Makes Louis Theroux Say What He Thinks",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/p0l6gyd1.jpg"
        },
        {
          "id": "https://defector.com/?p=188589",
          "author": "Sabrina Imbler",
          "description": "In the light of the moon glimmering over just six square miles of a mountain range on O‘ahu, a little egg waited to hatch.",
          "link": "https://defector.com/the-very-grisly-caterpillar",
          "publishedOn": "2025-05-04T17:54:02.000Z",
          "wordCount": 8633,
          "title": "The Very Grisly Caterpillar",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/bone-collector-1.jpeg"
        },
        {
          "id": "https://defector.com/?p=188582",
          "author": "A. Harpy Eagle",
          "description": "Let's get one thing straight: We eagles obey no courts of law. We heed no judges. We've never even heard of the concept that you call \"police.\" So however many times you try to tell me that everything I say can and will be used against me in a court of law, your threats mean nothing to me. The carceral system is for you puny humans, not us noble eagles. I don't come into your home and tell you how to live your life! OK? OK. With that understanding, I will now share my side of the story.\nI was minding my business in the tropical forests of French Guiana, which, as you may imagine, is my home. I live by the Kourou River Basin, near the coast, and aside from the occasional ecotourist, my home is undisturbed. Would I prefer a home free of uninvited guests? Yes, obviously. But do I generally put up with a few sightseers? Yes, because I am not an asshole. I watch these tourists as they take photos of smaller, less noble birds, like those annoying-as-hell great kiskadees squawking all day long or those twangy silver-beaked tanagers. All the real big players in the forest, like me and the jaguars, are too smart to be \"captured\" by a \"content creator.\" But occasionally, when I'm feeling generous or having a great feather day, I'll cock my head and emerge from my perch high in the canopy to give them a little show. I watch them as they snap photos of me with their obscenely phallic camera lenses. In this, at least, we are aligned: I'm literally stunning. If I saw me perched elegantly overhead, I too would have to stop and stare.",
          "link": "https://defector.com/yes-i-attacked-that-woman-and-id-do-it-again",
          "publishedOn": "2025-05-04T15:09:02.000Z",
          "wordCount": 9066,
          "title": "Yes, I Attacked That Woman, And I’d Do It Again",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/ece371266-fig-0002-m.jpg"
        },
        {
          "id": "https://defector.com/?p=188581",
          "author": "Tom Ley",
          "description": "Considered from an appropriate distance, there is nothing all that noteworthy about the Denver Nuggets prevailing in their first-round series against the Los Angeles Clippers. An evenly matched series eventually broke in the direction of the team with home-court advantage; the team with the best player in the series won it; the Clippers looked noticeably gassed throughout Game 7 after spending a great deal of physical and mental energy to stave off elimination in Game 6. This is pretty much how all this stuff is supposed to go. The fun of watching sports, however, is not just in observing outcomes. It's in feeling the texture of each moment leading up to a result. It's in all the little stories that get told about players and teams over the course of a seven-game series.\nComing into this series, the story of the Nuggets season was one of angst. The team proved just how disappointing a 50-win season can feel, and the end-of-season firings of head coach Michael Malone and general manager Calvin Booth were the front office's way of admitting that an untenable toxicity had infected the whole organization. Through no fault of his own, the source of all this anxiety was Nikola Jokic. Booth and Malone split the franchise into warring factions due to their inability to agree on how best to build a winning roster around the best player in the world. Every loss and stretch of lifeless play stung so bad precisely because of how great of an individual season Jokic was having. Everyone was letting the big fella down, and everyone felt terrible about it.",
          "link": "https://defector.com/nikola-jokics-friends-showed-up-when-he-needed-them-most",
          "publishedOn": "2025-05-04T14:09:41.000Z",
          "wordCount": 7690,
          "title": "Nikola Jokic’s Friends Showed Up When He Needed Them Most",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2212726152.jpg"
        },
        {
          "id": "https://defector.com/?p=188372",
          "author": "David Roth",
          "description": "It is only sort of true to say that you know what you're going to get when Donald Trump sits for a television interview. It is true in the sense that, after a decade spent alternately threatening and occupying the White House, everyone knows how he is going to act. There is some more uncertainty when it comes to what Trump is actually going to do, but even these variables aren't notably variable. He is going to act like Donald Trump, or some version of Donald Trump. This is something that can be prepared for, to some extent.\nIf he is being interviewed by someone from one of the television channels he likes, Trump will be drawling and digressive in his familiar toastmaster mode, the tone he puts on when he is Making Some Remarks before an audience that he senses is eager to applaud him. \"A little secret,\" he told Fox News' Laura Ingraham while showing her around his increasingly cluttered and gilded oval office, \"throughout the years, people have tried to come up with a gold paint that would look like gold. And they've never been able to do it.\" No, Ingraham agreed, in a tone of hushed awe, while the Fox camera focused on a dorky little golden cherub above a door. \"That's why it's gold.\" He sounds like he's talking in his sleep, murmuring through a dream in which he is doing exactly this sort of thing. That's one version.",
          "link": "https://defector.com/talking-to-the-president",
          "publishedOn": "2025-05-02T21:09:04.000Z",
          "wordCount": 11163,
          "title": "Talking To The President",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/TrumpWhiteHouseInterview.png"
        },
        {
          "id": "https://defector.com/?p=188560",
          "author": "Ray Ratto",
          "description": "\"Long-suffering\" in a sporting context is largely nonsense, for the very simple reason that the people who complain about it are doing no suffering whatsoever. They're choosing to watch an unaccomplished team, and that's all. We don't need to run down the list of people who are actually suffering, given that the list is growing hourly, but it surely isn't sports fans. In other words, please take time out of your busy and productive days to shut the hell up. \nBesides, suffering even in this milieu is entirely an eye-of-the-beholder deal. New York Knicks fans suffer far less than, say, Charlotte Hornets/ Bobcats/Hornets Again fans, who since losing their original team in 2002, have gotten a new one, missed the playoffs 18 of 21 years, and lost the only three series they have ever played in. Next to this, the prototypical Knicks fan suffers only because of their own idiotic expectations. The notion that because they haven't won a title in 52 years means they're due is exactly the way gamblers go broke.",
          "link": "https://defector.com/wild-fans-this-is-just-your-life-now",
          "publishedOn": "2025-05-02T18:07:38.000Z",
          "wordCount": 6182,
          "title": "Wild Fans, This Is Just Your Life Now",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2212980784.jpg"
        },
        {
          "id": "https://defector.com/?p=188399",
          "author": "Dave McKenna",
          "description": "If you enjoy old-timey American pastimes, have I got a weekend for you! Three consecutive nights of televised title fights! Who invited the mid-1950s? \nThe fistic windfall kicks off tonight with a poorly planned and bizarrely promoted but intriguing-as-all-getout three-fight, Saudi-sponsored pay-per-view outdoor card at Times Square in New York, with a feature match pitting Ryan Garcia coming back from a PED suspension and intoxicant-addled haze to face Rolly Romero for a welterweight world championship belt. Then on Saturday, boxing's top international draw, Mexico's Canelo Alvarez, celebrates another Cinco de Mayo season in the ring in Riyadh, boxing's new Las Vegas, where he'll fight perhaps the most anonymous champion extant, William Scull, for a super middleweight title. And the capper, maybe best bout of 'em all, comes Sunday in the old Las Vegas, as Japanese KO king Naoya Inoue brings his powers to the west to face Ramon Cardenas for the undisputed junior featherweight championship.",
          "link": "https://defector.com/jim-lampley-knows-friday-nights-alright-for-fighting",
          "publishedOn": "2025-05-02T16:56:21.000Z",
          "wordCount": 10202,
          "title": "Jim Lampley Knows Friday Night’s Alright For Fighting",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-1886403997.jpg"
        },
        {
          "id": "https://defector.com/?p=188494",
          "author": "Drew Magary",
          "description": "Things are happening in Minnesota. While Rudy Gobert is still busy collecting his 96th rebound against a Lakers team that tried to advance in the NBA playoffs without a frontcourt, the Vikings have used this week as an occasion to unofficially cap off a rebuilding project that they started three years ago:\n\nhttps://www.youtube.com/watch?v=BNjTAESsqAg",
          "link": "https://defector.com/the-vikings-belong-to-j-j-mccarthy-now-as-does-my-cold-black-heart",
          "publishedOn": "2025-05-02T16:25:35.000Z",
          "wordCount": 7803,
          "title": "The Vikings Belong To J.J. McCarthy Now, As Does My Cold Black Heart",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2165720848.jpg"
        },
        {
          "id": "https://defector.com/?p=188270",
          "author": "Lauren Theisen",
          "description": "TOKYO — Last year, when I visited Major League ballparks in Philadelphia and Minnesota for the first time, I made the same obvious-but-still-true observation: \"It looks like it does on TV.\" Well, Korakuen Hall feels like it does on TV, or at least, on the Japanese wrestling streams I watch on my laptop: unadorned, practical, dignified. Arriving at Tokyo's wrestling epicenter last month, my brain still reeling from an international flight that had landed only the night earlier, I had a hard time distinguishing between my actual presence and the idea that I might be dreaming the whole thing. It was as if the setting had sprung out of two dimensions. The simple bleachers; the \"East\" and \"West\" signs, in kanji and English, on either end; the small balconies with banners hanging from them—I had seen it all before, kind of. I had never been within 5,000 miles of it, yet this was a room I knew intimately.\nI went to Tokyo, basically, to see Korakuen Hall. I'm about to turn 30, and I have the normal feelings about that. Plus, I'd never traveled internationally except to Canada. I wanted to mark the big 3-0, and also see what it was like out there. So I did some big-time flying around the Pacific, the majority of it by myself, with a few specific destinations in mind. It was an amazing trip, one that affirmed my confidence in my resourcefulness and independence while also reminding me of my incredible luck. But I really think the crown jewel of it all—four cities in four different countries on three continents—was the pro wrestling. I went to three shows at Korakuen—plus one mini-adventure to the outlying wrestling shed Shin-Kiba 1st Ring to see an intimate show from the deathmatch promotion Freedoms—and this building that I had admired from so far away, miraculously, gave me exactly what I was hoping to find.",
          "link": "https://defector.com/i-went-to-japan-to-see-one-building",
          "publishedOn": "2025-05-02T15:39:20.000Z",
          "wordCount": 9091,
          "title": "I Went To Japan To See One Building",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/20250409_193800.jpg"
        },
        {
          "id": "https://defector.com/?p=188438",
          "author": "Luis Paez-Pumar",
          "description": "Welcome to The Backlog, a series in which we will take a look back at 12 games from 2020 that, in one way or another, had a lasting impact on the video game industry. \nFinal Fantasy VII is one of the most important video games in history. The game, which came out in 1997, was the first Final Fantasy to go 3D and use 32-bit graphics, a departure from the 16-bit style of (the phenomenal) Final Fantasy VI. It sold beyond anyone's wildest expectations, notching over a million sales in its first week, and introduced a host of players to the series, which had been consistently excellent but perhaps overlooked in the West. And its story, an environmentalist fable that cast the player as part of an eco-terrorist group called Avalanche, was simple yet masterfully executed. For fans of Japanese role-playing games, Final Fantasy VII was manna from heaven, a guiding step forward for the genre.",
          "link": "https://defector.com/final-fantasy-vii-remake-tore-down-the-past-to-build-a-new-future",
          "publishedOn": "2025-05-02T15:01:51.000Z",
          "wordCount": 12204,
          "title": "‘Final Fantasy VII Remake’ Tore Down The Past To Build A New Future",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/ffviir-zoom-cloud-shinra.jpg"
        },
        {
          "id": "https://defector.com/?p=188505",
          "author": "Tom Ley",
          "description": "Neither of the Knicks and Pistons ever really channeled the necessary competence to win their first-round playoff series in convincing fashion, and so its outcome was largely left to the bounces of fate. The series, which ended 4-2 in favor of the Knicks after last night's 116–113 victory, could have just as easily gone the other way had a few moments (and one particularly big one) unfolded differently. The same can be said about a lot of playoff series, though, and what usually ends up making the difference are the players who can cut through the randomness at the right time.\nJalen Brunson, who finished with 40 points on 15-of-33 shooting in Game 6, does not always feel like one of those players. He is undoubtedly one of the best clutch performers in the league, but his style of play often makes it feel like he is guided through those moments not by athletic genius, but a intrinsic Mr. Magoo–style talent for ending up where he needs to be. At its worst, this looks like a lot of flopping. At its best, this looks like Brunson dribbling and jump-stopping himself into trouble, and then using his incredible footwork and body control to force open a shooting angle that didn't previously exist. Watching this series mostly left me with the certainty that Brunson would drive me absolutely insane if he was playing against my team. Stop letting him do that stuff! He's too tiny for that!",
          "link": "https://defector.com/jalen-brunson-got-away-clean",
          "publishedOn": "2025-05-02T13:57:36.000Z",
          "wordCount": 6161,
          "title": "Jalen Brunson Got Away Clean",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2212980207.jpg"
        },
        {
          "id": "https://defector.com/?p=188333",
          "author": "Sabrina Imbler",
          "description": "As a child, Claire Sneed had a morbid fascination with natural disasters. In first grade, she followed NOAA's online storm tracker. Later she witnessed Hurricanes Irene and Sandy sweep past her home in the Philadelphia area. On visits to Santa Fe to see her grandfather, Sneed marveled at the dramatic cliffs of Bandelier National Monument, which were formed by staggering volcanic explosions a million years ago. In 2000, a prescribed fire escaped, whipped by high winds, and eventually burned around 1,000 acres across the monument. Sneed was fascinated by how such a massive landscape was altered by wildfire. \"I think it was just a combination of how powerless you feel in the sense when you're met with natural disasters,\" she said. \"There's a lot of resilience, both in the natural world and in human communities, that comes together after natural disasters.\"\nWhile in college, Sneed spent her summer breaks working on AmeriCorps programs in the West. She worked on wilderness trail crews clearing fallen trees, constructing bridges, and repairing trails affected by wildfire and erosion in Colorado. \"All of that was trail crew related work, but I kind of fell in love with public lands,\" she said. After Sneed graduated in May 2024, she started a permanent seasonal position as a hydrologic technician at Bridger-Teton National Forest in Wyoming. There, she worked to ensure streams, rivers, and wetlands complied with environmental regulations like the Wild and Scenic Rivers Act, a designation that determines how much water can be removed from a river sustainably.",
          "link": "https://defector.com/an-interview-with-a-fired-u-s-forest-service-hydrologic-technician",
          "publishedOn": "2025-05-02T13:02:26.000Z",
          "wordCount": 14844,
          "title": "An Interview With A Fired U.S. Forest Service Hydrologic Technician",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/JPEG-image-424D-91A0-2C-0-e1746105565172.jpeg"
        },
        {
          "id": "https://defector.com/?p=188394",
          "author": "David Roth",
          "description": "It is the nature of the NBA, for reasons that only intermittently have anything to do with the league itself, that it is discussed as if it's in crisis. A lot of this is just how sports are talked about now, which is as reflexive and sour as every other big public discourse. The NBA regular season really is too long, but still it must be said: We are into the good part now, and the playoffs have been—pardon the jargon here—extremely fun and good. So Drew and I welcomed Patrick Redford, one of Defector's foremost basketball likers, to talk about that.",
          "link": "https://defector.com/im-feeling-like-steve-with-patrick-redford",
          "publishedOn": "2025-05-01T20:19:08.000Z",
          "wordCount": 6708,
          "title": "I’m Feeling Like Steve, With Patrick Redford",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211868269.jpg"
        },
        {
          "id": "https://defector.com/?p=184459",
          "author": "Barry Petchesky",
          "description": "I've already completed my bucket list. It had one item on it. I didn't know that item was on my bucket list until I did it, or even that I had a list. But now I know that I will die having seen the rings of Saturn through a telescope. I would like you to make sure that you, too, die that way. Wait, that sounds ominous.\nLet me back up. It was about a decade ago, at some open house event at my neighborhood arts center, and someone had brought a telescope. I don't think he worked there; I think he just liked bringing his telescope places and letting people look through it. It wasn't even a particularly large telescope, to my eye: easily portable, set up on a tripod, and with a line of just two or three people waiting to use it. Can I look?, I asked, stupidly. You bet.",
          "link": "https://defector.com/i-implore-you-to-look-at-saturn-through-a-telescope",
          "publishedOn": "2025-05-01T18:34:33.000Z",
          "wordCount": 7852,
          "title": "I Implore You To Look At Saturn Through A Telescope",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/03/GettyImages-102724750.jpg"
        },
        {
          "id": "https://defector.com/?p=188422",
          "author": "Luis Paez-Pumar",
          "description": "As if in response to my minor complaint about the cagey first leg of the Arsenal vs. Paris Saint-Germain Champions League semifinal, the other semifinal, between Barcelona and Internazionale, served as a stark counterpart. A wide-open 3-3 thriller, up there with the best first-leg knockout matches of the tournament's last decade, had almost too much action to recap. The goals came hard and fast, and with almost otherworldly quality, from both sides, and Inter especially weathered a furious storm to pick its spots and send the tie back to Italy for the second leg all knotted up.\nThat's not to say, though, that all the goals, or even all the performances, were created equal. If ever a six-goal masterpiece could be distilled down to the exploits of one player, it was Wednesday's match. That player was, as it already has been in big-ticket showdowns and as it looks like it might be for years to come, Lamine Yamal, Barcelona's 17-year-old (17!) winger who isn't just the best prospect in the world by a mile; he might already be the best player on the planet, a whirlwind of technical prowess and creativity that European soccer hasn't seen since, well, another teenager suited up in the same club's colors.",
          "link": "https://defector.com/on-a-spectacular-night-lamine-yamal-shone-brightest",
          "publishedOn": "2025-05-01T16:45:04.000Z",
          "wordCount": 8709,
          "title": "On A Spectacular Night, Lamine Yamal Shone Brightest",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2212162593.jpg"
        },
        {
          "id": "https://defector.com/?p=188388",
          "author": "Samer Kalaf",
          "description": "Because of the widely negative reaction to Bill Belichick's tense and awkward interview on CBS Sunday Morning, he and Jordon Hudson, his girlfriend and managerial-type figure, have attempted to take back control of the narrative. The strategy so far: more open contempt. Let's see how this goes for them.\nOn Wednesday afternoon, the North Carolina football coach released a statement through the school, claiming that CBS and interviewer Tony Dokoupil had breached some kind of agreement to keep the topics limited to Belichick's new book:",
          "link": "https://defector.com/bill-belichicks-shit-isnt-flying-anymore",
          "publishedOn": "2025-05-01T16:23:08.000Z",
          "wordCount": 6933,
          "title": "Bill Belichick’s Shit Isn’t Flying Anymore",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/belichick-cbs-interview-2.jpg"
        },
        {
          "id": "https://defector.com/?p=188410",
          "author": "Kate Wagner",
          "description": "In April, after months of tech-dipshit palace intrigue, photos of Mark Zuckerberg’s long-rumored D.C. mansion finally spread their way through social media. Because Zuckerberg is an immensely disliked figure for democracy-destroying and culture-annihilating reasons, mass architectural criticism was equally swift.\nTo social media users, the house looked like everything from a dorm at a mid-sized state college to, well, a McMansion—which it is, in spirit. The building itself, designed by long-time domestic architect for various elites, Robert Gurney, is not particularly flamboyant, at least as far as rich people's houses are concerned. (Certainly it lacks the foam appliques so beloved by Donald Trump.) Clad monotonously in red brick, it features a central pared-down gable complete with a garage-door-esque picture window, flanked on either side by similarly gabled and frankly barn-like wings, each connected by breezeways.",
          "link": "https://defector.com/mark-zuckerberg-still-cant-buy-taste",
          "publishedOn": "2025-05-01T15:11:32.000Z",
          "wordCount": 8572,
          "title": "Mark Zuckerberg Still Can’t Buy Taste",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/ZuckHouse.jpg"
        },
        {
          "id": "https://defector.com/?p=188397",
          "author": "Chris Thompson",
          "description": "The Minnesota Timberwolves eliminated the higher-seeded Los Angeles Lakers Wednesday night, in Game 5 of their first-round series. The final score, 103–96, suggests a closely fought contest, but what it really shows is the Timberwolves missing way more than the usual number of three-pointers, plus, sure, some dignity in defeat from the Lakers. Minnesota led, in Los Angeles, for every minute of the first half, and often by double digits; the Lakers scrambled back in the third quarter, but Minnesota just eased away without a whole lot of extraordinary effort down the stretch of the fourth. You had the sense, by the end, that if these teams played for another two or six or 30 games, the Wolves would spend the bulk of the time ahead by 11 points, with some wobbles in there to account for streaky shooting.\nLately, when the Timberwolves win, you expect it to be because Anthony Edwards did something cool, or possibly even incredible. It's hard sometimes even to imagine how this year's Timberwolves win games without their All-NBA shot-creator creating and making lots of shots for himself. When they edged the Lakers in Game 4, it was largely because Edwards manufactured a huge fourth quarter against an exhausted Lakers lineup missing any semblance of rim protection. Not so Wednesday: Edwards made just five shots in 42 minutes in Game 5, bricked all 11 of his three-point attempts, and finished with just 15 points, tied for his fifth-lowest scoring output of the entire season. He scored just once in the fourth quarter, and made it to the free-throw line not at all. That is not to say he played poorly—Edwards grabbed 11 rebounds on the night and was credited with eight assists, did not turn the ball over even once, and had a game-high three steals—but the Wolves never got, and in the end never needed, one of his big signature scoring explosions.",
          "link": "https://defector.com/big-lakers-ambitions-squished-by-of-all-people-rudy-gobert",
          "publishedOn": "2025-05-01T13:01:03.000Z",
          "wordCount": 10331,
          "title": "Big Lakers Ambitions Squished By, Of All People, Rudy Gobert",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/05/GettyImages-2212832934.jpg"
        },
        {
          "id": "https://defector.com/?p=188368",
          "author": "Ray Ratto",
          "description": "The Kentucky Derby is the undisputed crown jewel of a sport that has been diminishing in national notice for decades now, but it can stand in line on that. Kids just don't go to the track anymore, which is a shame because it remains a great place for young people to learn to smoke cigarettes and leave the butts in someone else's beer. The only real lure for fans outside Churchill Downs is the occasional Derby party, which is also the only time anyone drinks a mint julep. It's an industry that screams old folks' amusement.\nYou know, like the favorite in this year's race, Journalism.",
          "link": "https://defector.com/are-you-sure-you-want-to-bet-on-journalism",
          "publishedOn": "2025-04-30T19:11:29.000Z",
          "wordCount": 6918,
          "title": "Are You Sure You Want To Bet On Journalism?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212756259.jpg"
        },
        {
          "id": "https://defector.com/?p=188258",
          "author": "Tom Ley",
          "description": "ESPN published a fun oral history yesterday about how much it sucks to pitch at the Colorado Rockies' ballpark. The writers of the story wisely got in touch with current and former pitchers who have experienced the ERA-inflating effects of high-altitude pitching, and then let them recount their horror stories. I enjoyed the story a great deal, but one particular anecdote, from former Rockies reliever and current Seattle Mariners general manager Jerry Dipoto, stuck out to me.\nFrom the article:",
          "link": "https://defector.com/which-towering-dinger-in-denver-is-jerry-dipoto-actually-talking-about",
          "publishedOn": "2025-04-30T18:43:03.000Z",
          "wordCount": 7757,
          "title": "Which Towering Dinger In Denver Is Jerry Dipoto Actually Talking About?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-122852247.jpg"
        },
        {
          "id": "https://defector.com/?p=188332",
          "author": "Kathryn Xu",
          "description": "FLUSHING, N.Y. — To be honest, I wanted to see Corbin Carroll and Juan Soto have a game. I was faintly aware of the Arizona Diamondbacks bravely holding up the rear of the competitive teams in the NL West (four of them!), but during an obligatory pre-game database check, I learned that Carroll was having an obscene start. Per FanGraphs, he has been the second-best position player this season; per a cursory glance at Baseball Savant sliders, he had pivoted from a hitting profile traditional to players primarily described as \"fast\"—above-average plate discipline that'll get a guy on base well enough—to a faster swing and strikeout-happier approach that could—could!—mean he's now a bona fide slugger who also happens to be extremely fast. Meanwhile for Soto, it was a bit simpler: Surely he was due a game at this point.\nIn the way these things usually go, I got neither. Carroll went 0-for-4. Soto, despite two smoked line drives into the outfield, went 0-for-3 with a walk. The game itself carried little tension. In spite of David Roth doomposting in Slack about the post-blog Mets being struck down by possible season-ending surgery and a stomach bug, the lineup smacked around Diamondbacks starter Eduardo Rodríguez in the third and fourth inning to rack up a near-unloseable 7–0 lead. At that point, for the underprepared game-goer trembling in the Citi Field 500-level like a chihuahua that more closely resembles a stick insect than a dog, the only rooting interests were for some highlights to get pumped up about, and a kind ending time with respect to the NJ Transit train schedule.",
          "link": "https://defector.com/its-all-coming-up-mets",
          "publishedOn": "2025-04-30T17:37:19.000Z",
          "wordCount": 7487,
          "title": "It’s All Coming Up Mets",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/tyroneTaylorMetsDefense.jpg"
        },
        {
          "id": "https://defector.com/?p=188349",
          "author": "Patrick Redford",
          "description": "As any broadcast crew will point out the second he starts cooking, Jamal Murray owns a strange and wondrous NBA distinction: No player increases their scoring average more between the regular season and playoffs than Murray does. One can interpret that stat a number of ways, including asking the logical question of why someone who is so mission-critical to the Denver Nuggets winning anything serious can barely play himself onto all-star snub lists, but Murray's masterclass performance in Tuesday's Game 5 against the Los Angeles Clippers provided insurmountable evidence that his game is built for the biggest moments.\nMurray dropped 43 points on 26 shots, adding three steals, seven assists, and five boards—according to Basketball Reference's holistic game-score stat, his second-best postseason performance ever—and was comfortably the best player on the floor, as James Harden and Nikola Jokic neutralized each other, Kawhi Leonard was Fine, and Ivica Zubac had a good game on his government-mandated supply of six-foot half-hooks and putbacks. Everyone seemed, if not nervous, then exhausted from the mental and physical strain of the series, a conference-final wolf in first-rounder's clothing.",
          "link": "https://defector.com/jamal-murray-was-arrogant-and-generous-enough-to-craft-another-classic",
          "publishedOn": "2025-04-30T16:24:46.000Z",
          "wordCount": 7033,
          "title": "Jamal Murray Was Arrogant And Generous Enough To Craft Another Classic",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212108951.jpg"
        },
        {
          "id": "https://defector.com/?p=188357",
          "author": "Jae Towle Vieira",
          "description": "Certain friends make you braver. Sure, you might call friends like this a “bad influence,” but adventures with them are always memorable. \nHowever, when giggling with your friend over getting kicked out of a magic show turns into a flame war with the magician on Facebook—and when that magician happens to be a local celebrity with free time to burn and infinite capacity for honing a grudge—maybe it’s time to shift your focus from making memories to getting the hell out of town.",
          "link": "https://defector.com/a-run-in-with-the-mysterious-steve",
          "publishedOn": "2025-04-30T15:53:32.000Z",
          "wordCount": 5392,
          "title": "A Run-In With The Mysterious Steve",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2023/03/Normal_Gossip_16-9_V2.png"
        },
        {
          "id": "https://defector.com/?p=188315",
          "author": "Barry Petchesky",
          "description": "If—if!—one wanted to identify a trend, one might point out the successive results in the Maple Leafs–Senators series. In Game 1 the Leafs dominated. Games 2 and 3 required overtime to settle, with Toronto winning both. Game 4 also went to prolongation, this time with Ottawa finally breaking through. Tuesday night's Game 5 was a mostly comfortable 4-0 Sens win. Using my elite pattern recognition, honed by millions of years of evolution, I could note that the Senators have played increasingly well in each game, and the Maple Leafs increasingly worse. Ottawa's scoring by game is a line trending only up, while Toronto's veers dirtward.\nAnd if—if!!!—I chose to retreat to my mind palace to catalog and cite past events for the purposes of providing context for this series, I might reflect upon the fact that the Maple Leafs have a history of choking to death, especially in the first round, often against objectively less talented teams that nonetheless stop fearing them as the series moves along and the Leafs fail to clinch when the opportunity is available. Why, I might even observe that their core is 1-13 in series-clinching games, and 0-6 at home. I'm not saying any of this means the Leafs are gonna blow it again! I am not saying that. I'm just noticing things.",
          "link": "https://defector.com/do-not-say-the-leafs-could-blow-this-series-dont-even-think-it",
          "publishedOn": "2025-04-30T14:42:38.000Z",
          "wordCount": 6427,
          "title": "Do Not Say The Leafs Could Blow This Series. Don’t Even Think It!",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212092716.jpg"
        },
        {
          "id": "https://defector.com/?p=188306",
          "author": "Tom Ley",
          "description": "Dads can be embarrassing. The flashlight on their smart phone is always on for no reason, they put way too much effort into creating a rapport with waitstaff, and they are always nearly getting themselves killed by Giannis Antetokounmpo on national television.\nAs far as we know, only that last one applies to Tyrese Haliburton's father, who managed to turn himself into the big storyline of last night's Game 5 clash between the Bucks and Pacers, which ended in a series-clinching win for Indiana following a horrendous collapse by Milwaukee. Let's run through the collapse before we get to the dad content.",
          "link": "https://defector.com/haliburton-father-antetokounmpo",
          "publishedOn": "2025-04-30T13:24:04.000Z",
          "wordCount": 7021,
          "title": "Bucks Collapse Leads To Giannis Antetokounmpo Delivering Fatherhood Lessons To Tyrese Haliburton’s Dad",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212663683.jpg"
        },
        {
          "id": "https://defector.com/?p=188300",
          "author": "Luis Paez-Pumar",
          "description": "With the removal of the away goals rule, Champions League match-ups have tended towards more open play and riskier attacks in search of goals, particularly in the first legs. It makes sense. Without away goals hanging on the home team's head, it can push forward more often, knowing that giving up a goal is merely bad instead of potentially catastrophic. With that in mind, though, the first leg of the first semifinal, the one between Arsenal and Paris Saint-Germain, felt more like a match from the away goals era.\nIn part this is because of the lateness of this tie in the competition. It is only natural for both clubs to play conservatively, not wanting to fall right on the doorstep of the final (this is also why most, though not all, Champions League finals tend to be a bit underwhelming as actual matches), and so the order of the day for both the host Gunners and the visiting Parisians appeared to be safety. The other reason, however, is that PSG scored its first half-chance on a day of half-chances, a goal that immediately changed the complexion of the whole tie just four minutes in, and one that showed the difference between the two sides, particularly in attack.",
          "link": "https://defector.com/all-psg-needed-was-a-half-chance",
          "publishedOn": "2025-04-30T12:58:40.000Z",
          "wordCount": 9047,
          "title": "All PSG Needed Was A Half-Chance",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212066208.jpg"
        },
        {
          "id": "https://defector.com/?p=187703",
          "author": "Sabrina Imbler",
          "description": "Madyson Miller's Florida childhood was almost like a crash course in marine biology. She grew up going to the beach and going with her grandparents to see Shamu—\"which I obviously realize now is not the kind of value system I have when it comes to animal care,\" Miller caveats. But she wasn't sure if she wanted to pursue science—she dreamed of being on Broadway—until a teacher told her she had what it takes.\nMiller, a first-generation college student, initially struggled in university. \"I was a terrible test-taker, and my first year my grades just were not great,\" she said. \"I really thought, like, I'm not going to be able to do this.\" But then a professor offered Miller the chance to work in her lab studying the environmental DNA—genetic material shed by animals in their environment—of creatures like lionfish and salamanders. This experience in the lab cemented Miller's passion for biology, as well as her confidence that she could make it in the field.",
          "link": "https://defector.com/an-interview-with-a-fired-noaa-program-analyst",
          "publishedOn": "2025-04-29T19:59:33.000Z",
          "wordCount": 14810,
          "title": "An Interview With A Fired NOAA Program Analyst",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/Miller-Headshot.png"
        },
        {
          "id": "https://defector.com/?p=188221",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about country clubs, fixing your news diet, beard dandruff, and more.\nYour letters:",
          "link": "https://defector.com/its-time-for-mel-kiper-to-go",
          "publishedOn": "2025-04-29T18:44:45.000Z",
          "wordCount": 16342,
          "title": "It’s Time For Mel Kiper To Go",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-1252451670.jpg"
        },
        {
          "id": "https://defector.com/?p=187068",
          "author": "Diana Moskovitz",
          "description": "Todd Golden smiled as the orange and blue confetti fell around him. He had accomplished what no Florida Gators men's basketball coach had in nearly two decades—a national championship—bringing a title home to a university and a fan base desperate for a win. (The last national championship for Florida in football or basketball came in 2008, just a year after Apple announced the iPhone.) All those years of disappointment later, the scene played out exactly as it was supposed to. Florida players hugged and cried. Fans screamed. The marching band blasted the university fight song. Play-by-play broadcaster Ian Eagle called out on the TV broadcast a slight twist on the phrase every Florida student learns, \"It's a great day to be a Gator!\"\nAnd it was. The streets of Gainesville filled with jubilant students. The university's social media accounts boasted and bragged. Alumni young and old swelled with pride. All the years of losing, of coming up short, of watching other schools hoist trophies was swept away—as was any public memory of the two investigations involving two Florida basketball coaches: head coach Golden and one of his assistants, Gators legend Taurean Green.",
          "link": "https://defector.com/florida-built-a-black-box-and-put-the-todd-golden-case-inside-it",
          "publishedOn": "2025-04-29T17:56:30.000Z",
          "wordCount": 13322,
          "title": "Florida Built A Black Box And Put The Todd Golden Case Inside It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2208509825-e1744751146639.jpeg"
        },
        {
          "id": "https://defector.com/?p=188245",
          "author": "Jack Hanson",
          "description": "Curzio Malaparte was the shape-shifting Zelig of the catastrophe of Italian fascism, a political and social operator of such profound equivocation that in his writings he seems almost to convince even himself of his own sincerity. In Maurizio Serra’s comprehensive biography, first published in Italian in 2011 and now available in English from New York Review Books, we follow Malaparte’s skittering movements across a century to which he seems uniquely suited and yet, near daily, increasingly familiar to our own. \nBest known for his nightmarish 1944 novel of the Second World War, Kaputt, Malaparte—a novelist, journalist, playwright, diplomat, and filmmaker—wrote like a cross between Ernst Jünger and Thomas Pynchon, and lived like a daredevil prince. He was forever on the move, forever aggrieved, forever on the verge of world fame, even immortality, or, at the very least, slipping through whatever net was closing around him. He began his adult life as a fascist and became a communist in his later years (a conversion he seemed to think was more a shift of emphasis—his first book, 1931’s Coup d’Etat: The Technique of Revolution, argued that it was Mussolini’s own youthful Marxism that had made him such an effective revolutionary), before embracing Catholicism on his deathbed in 1957.",
          "link": "https://defector.com/the-perfect-fascist",
          "publishedOn": "2025-04-29T17:04:57.000Z",
          "wordCount": 12355,
          "title": "The Perfect Fascist",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-154070952.jpg"
        },
        {
          "id": "https://defector.com/?p=188218",
          "author": "Chris Thompson",
          "description": "First, some good news: The Colorado Rockies got a big early homer against the Atlanta Braves Monday, off the bat of designated hitter Hunter Goodman. The Rockies had two men on, and Atlanta's Bryce Elder threw a big fat cement-mixer of a slider, and Goodman put some mighty wood to it. Rockies play-by-play guy Drew Goodman (unrelated) couldn't immediately accept that something had happened to cause the home team to have more runs than the opposition. Here is the proof:\n\nhttps://www.youtube.com/watch?v=El9-UalE7JQ",
          "link": "https://defector.com/the-rockies-are-bad-at-every-part-of-baseball",
          "publishedOn": "2025-04-29T16:15:08.000Z",
          "wordCount": 7835,
          "title": "The Rockies Are Bad At Every Part Of Baseball",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211801549.jpg"
        },
        {
          "id": "https://defector.com/?p=188227",
          "author": "Patrick Redford",
          "description": "One reason the NBA Playoffs are great is that the postseason's competitive structure and tactical complexity make something like the Buddy Hield Game not only possible, but necessary.\nThe Golden State Warriors won a thriller in San Francisco on Monday night to take a 3–1 lead in their first-round series against the offensively inept and defensively murderous Houston Rockets, and they did so despite a straight-up bad game from Steph Curry. Watch any of the first three games from this series, and consider the state of Jimmy Butler's ass, and you would come to the logical conclusion that the Warriors were not set up to win any less-than-stellar Curry game, let alone a game in which Fred VanVleet made eight three-pointers. Unless Curry is forcing double-teams and bending Houston's strong, flexible defensive structure, Golden State's offense is largely incapable of making the Rockets sweat. Draymond Green, once and occasionally still a good passer, has been excised from the attack, and on Monday, Curry didn't have it.",
          "link": "https://defector.com/buddy-hield-to-the-rescue",
          "publishedOn": "2025-04-29T15:40:53.000Z",
          "wordCount": 7100,
          "title": "Buddy Hield To The Rescue",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/buddy-hield.jpeg"
        },
        {
          "id": "https://defector.com/?p=187997",
          "author": "Soraya Roberts",
          "description": "Anything I say about “Magnetic,” the lead single off TV On The Radio frontman Tunde Adebimpe’s first solo album, Thee Black Boltz, won’t live up to hearing it for the first time. Go listen to it. Better yet, go watch the video. It’s super simple. It’s black and white and it’s basically just Adebimpe shouting this perfect song into his mic all in black—those muscles, that bleached hair—and a woman (dancer Brooke Shepherd) in white bouncing and flailing around a massive amp with her supernaturally long arms clapping, thighs pumping, dreads flying. It’s the perfect dance, whatever it is, for this perfect music, whatever it is. Every time it ends, I have the impulse to turn it right back on again. It feels like life. Or like life’s supposed to feel. “I was thinkin' 'bout my time in space/I was thinkin' 'bout the human race/In the age of tenderness and rage/Had me kickin' through the end of days.” If you’re not writing this as the opening to your opening song, why’re you even bothering?\nMy favorite part, right before the chorus, right after Adebimpe sings, “We’re gonna crash your matrix/And how you gonna feel about that?\" has him following up with: “Why you wanna come like that”—and then a big, long pause—“for.” The chorus goes nuts. “Magnetic” is a great representative for this entire album, which gives space to whatever it wants.",
          "link": "https://defector.com/tunde-adebimpes-solo-debut-channels-the-gift-of-the-mixtape",
          "publishedOn": "2025-04-29T15:13:18.000Z",
          "wordCount": 8134,
          "title": "Tunde Adebimpe’s Solo Debut Channels The Gift Of The Mixtape",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/tundeadebimpe-theeblackboltz-4000px.jpg"
        },
        {
          "id": "https://defector.com/?p=187751",
          "author": "David Roth",
          "description": "When Steve Cohen bought the New York Mets near the end of the 2020 season, he acquired a property that was valuable, scarce, and absolutely lousy with toxic mold and crawling with skunks. The value was easy to see; there are only so many Major League Baseball franchises and they're not making new ones at the moment, which makes this both a good business to be in and one that doesn't do much to discourage the sort of laziness that led to those unaddressed mold/skunk issues under previous ownership. It is more difficult and more persistently demanding to be a smart baseball organization than a stupid one, and far more cost-effective in the long run, but from an owner's perspective it doesn't really make much of a difference. Smart teams win and dumb teams mostly don't, but owners do fine either way; the family that spent the better part of two decades making the Mets as mediocre and repellent as they could possibly be banked $2 billion in profit from the sale of the property they'd desecrated.\nThat sour mediocrity was the result not of a lack of effort, but of a heroic surplus of the worst and wrongest kinds of effort; neglect would have been a marked improvement upon the sort of toxic attention the owners lavished upon the organization. It wasn't that the Wilpons didn't want to win; they did, but only if it meant that the dumb things they cared about—a crabbed half-ideology devoted to various antique and idiotic rules and hierarchies, except when and where it was dictated by patronage or some salty executive whim—to be winning things, when they were not.",
          "link": "https://defector.com/the-mets-are-doing-the-hard-stuff-now",
          "publishedOn": "2025-04-29T13:03:24.000Z",
          "wordCount": 10743,
          "title": "The Mets Are Doing The Hard Stuff Now",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2209827443_52c067.jpg"
        },
        {
          "id": "https://defector.com/?p=188143",
          "author": "Chris Thompson",
          "description": "LeBron James failed to score a point in the fourth quarter of Game 4 of the Western Conference first-round series between his Lakers and the Minnesota Timberwolves. The Wolves erased a 12-point third-quarter deficit and won the game by a single bucket; with the victory they pulled into a 3–1 series lead over the higher-seeded Lakers, who are now a loss away from elimination. Worse, perhaps, than James's failure to score was Los Angeles's difficulty even getting him opportunities: The NBA's all-time leading scorer—fresh off a regular season in which he averaged 24.4 points per game on an outrageous 64 percent true shooting—attempted just two field goals in the fourth quarter of the most important game of his team's season. This, in technical terms, just ain't right.\nHowever much what I am a…",
          "link": "https://defector.com/jj-redick-pushed-the-panic-button-and-lost-anyway",
          "publishedOn": "2025-04-28T19:17:43.000Z",
          "wordCount": 9107,
          "title": "JJ Redick Pushed The Panic Button And Lost Anyway",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211794240.jpg"
        },
        {
          "id": "https://defector.com/?p=188157",
          "author": "Lauren Theisen",
          "description": "When you listen to a game on the radio, all you have is the noise. And in Montreal on Sunday night, stimulated by two dramatic events late in the second period, the Habs' arena swelled to the point of deafening, with a force that made me believe the home team might really have the power to knock out the No. 1 seed in the East. But after a giddy intermission under the banner of a 2-1 score, Canadiens fans watched—and I listened—helplessly as the prospect of a tied series was ripped away by a ruthless and experienced Washington Capitals group that took the breaks the local boys couldn't.\nFirst, the high point. With two minutes to go in the second and the score 1-1, a Capitals player was sent the box for one of several hits on both sides that got punished by the refs throughout a particularly physical game. But this wasn't just any player: This was the Greatest Goal Scorer Of All Time™, Alexander Ovechkin, who took the two for interference by trucking Jake Evans at the edge of the Caps' attacking zone. The Quebecois screams, shouts, and boos overwhelmed the announcement of the penalty, and for good reason. The newly crowned scoring king entering the sin bin for the first time in almost two months felt like an event in itself—the kind of rare, odd misstep that can doom a favorite in a tricky series.",
          "link": "https://defector.com/theres-nothing-like-the-sound-of-a-goal-in-montreal",
          "publishedOn": "2025-04-28T19:00:24.000Z",
          "wordCount": 6704,
          "title": "There’s Nothing Like The Sound Of A Goal In Montreal",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211798585.jpg"
        },
        {
          "id": "https://defector.com/?p=188047",
          "author": "Samer Kalaf",
          "description": "Bark at the Park is always a fun promotion. While a dog might not fully appreciate the crack of the bat, the pop of the mitt or James Wood's opposite-field power, they can perhaps enjoy a little piece of sausage that fell on the ground. And if there's anything a dog loves more than floor food, it's a barrage of extremely loud, booming noises. The Washington Nationals were happy to accommodate last weekend.",
          "link": "https://defector.com/the-nationals-know-what-goes-great-together-dogs-and-fireworks",
          "publishedOn": "2025-04-28T18:04:00.000Z",
          "wordCount": 6058,
          "title": "The Nationals Know What Goes Great Together: Dogs And Fireworks",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/washington-nationals-dogs-fireworks.jpg"
        },
        {
          "id": "https://defector.com/?p=188141",
          "author": "Patrick Redford",
          "description": "The Milwaukee Bucks got smoked by the Indiana Pacers in Game 4 on their home court, in a loss that felt less like ending a chapter and more like slamming a book shut, incinerating it, and purging the memory of ever having read it. They are now down 3–1 to a team that has proved matchup poison for them even in the best of times; Giannis Antetokounmpo's game is stretched as thin as his patience; they have swiftly degraded from a team with a strong identity to a team about nothing, playing yesterday's game with yesterday's players. Their only other good player just wrecked his leg, they handed their archrival a title in pursuing said good player, and because of that, they have no future. Four years after the Bucks won a championship, things are looking unimaginably bleak in Milwaukee.\nHalfway through the first quarter of Sunday's Game 4, Damian Lillard burst forward to tap an offensive rebound to the corner, then crumpled and instantly grabbed at the back of his left leg. As of this writing he has not received an official diagnosis, but everyone in the know is reporting that he probably did in his Achilles. With Lillard in the lineup, the Bucks had an essentially even point differential, with his 24.9 points per game being largely canceled out by his inability to even contain anyone with a live dribble. Still, they needed his offensive dynamism in the playoffs, because without him, the offense funnels to Bobby Portis and Kevin Porter Jr., and that's if the Bucks are lucky enough not to be dragged into a Kyle Kuzma game. Antetokounmpo is still the best player in this series, but everything he gets is very tough, and Indiana's extremely connected defense is never really stressed out by anything he does—again, because his team is butt.",
          "link": "https://defector.com/the-milwaukee-bucks-are-dead",
          "publishedOn": "2025-04-28T17:15:30.000Z",
          "wordCount": 7332,
          "title": "The Milwaukee Bucks Are Dead",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212317303.jpg"
        },
        {
          "id": "https://defector.com/?p=188114",
          "author": "Luis Paez-Pumar",
          "description": "If Liverpool wins the Premier League and no one is in the stands to celebrate it, does it count? Well, yes, but there's nothing quite like winning the club's record-tying 20th first-division title in front of a roaring Anfield crowd, as Liverpool found out on Sunday. Despite getting the Premier League trophy monkey off its back in the COVID-delayed 2019-20 season, Liverpool finished this season, the first after Jürgen Klopp and the first under Arne Slot, in style, shrugging off some cup disappointments with the one trophy that, for this club, means more than any other. Thanks to a comprehensive 5-1 victory over middling Tottenham, Anfield got its long-awaited party on Sunday, and now Liverpool once again sits atop its historic perch as the most successful club in English soccer history.\n\nhttps://www.youtube.com/watch?v=PVFSJRFNvXQ\n\"The Slot machine pays out the jackpot\" is such a dumb thing to say, I love it.",
          "link": "https://defector.com/liverpool-was-always-in-control",
          "publishedOn": "2025-04-28T16:13:22.000Z",
          "wordCount": 8141,
          "title": "Liverpool Was Always In Control",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212280586.jpg"
        },
        {
          "id": "https://defector.com/?p=188135",
          "author": "Ray Ratto",
          "description": "The Winnipeg Jets were the best hockey team in the world, largely because they had the best goalie in the world, until they weren’t and didn’t. They are now facing down the possibility of being the biggest disappointment in the sport, because their goalie has been the biggest disappointment. Again.\nTherein lies the problem Jets coach Scott Arniel arose to today: What to do about a three-year trend that plays itself out the same way every time. It's Wile E. Coyote sending away to Acme for the same contraption that breaks every time he uses it.",
          "link": "https://defector.com/the-jets-have-a-connor-hellebuyck-problem-and-the-only-solution-is-more-connor-hellebuyck",
          "publishedOn": "2025-04-28T15:30:11.000Z",
          "wordCount": 6716,
          "title": "The Jets Have A Connor Hellebuyck Problem, And The Only Solution Is More Connor Hellebuyck",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211195796.jpg"
        },
        {
          "id": "https://defector.com/?p=188093",
          "author": "Chris Thompson",
          "description": "The Texas Rangers found an excellent way to lose a baseball game Sunday night. Or, if they didn't find it or invent it, they at least deserve recognition for having iterated this delightful method. They were tied at two runs apiece with the San Francisco Giants in the bottom of the ninth inning, in what had been a somewhat choppy and frustrating game for both teams. Heliot Ramos of the Giants squibbed a first-pitch slider from Rangers reliever Luke Jackson; the ball left Ramos's bat at 58.7 miles per hour and traveled maybe 50 feet onto the left side of the infield grass. This is not what you want from whoever is leading off a late inning, but to Ramos's credit, he at least tore ass up the first-base line, forcing Jackson to attempt a quick and athletic play.\nThis is where things first went bad. Jackson, whose pitching motion has him falling off the mound toward first base, raced back the other way to field the ball on the move. Ramos was chugging. A wiser fielder might've pocketed this baseball and lived to fight another day. Jackson felt the pressure to make a play. He grabbed the ball bare-handed, rolled his throwing shoulder under his upper body, and almost blindly fired the ball to first, against his momentum and while crashing onto his back. It would've been an incredible, highlight out, except that Jackson's throw was really nowhere close, sailing up the field and well out of the reach of first-baseman Jake Burger. The ball bounced at the edge of the outfield and rolled away. Disaster!",
          "link": "https://defector.com/horrible-rangers-loss-also-really-funny",
          "publishedOn": "2025-04-28T15:08:56.000Z",
          "wordCount": 7670,
          "title": "Horrible Rangers Loss Also Really Funny",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212301111.jpg"
        },
        {
          "id": "https://defector.com/?p=188064",
          "author": "Maitreyi Anantharaman",
          "description": "It's time to wrap up the month with a challenging themeless. Keep an eye out for tricky clues and fun wordplay. This week’s puzzle was constructed by Rebecca Goldstein and edited by Hoang-Kim Vu. Rebecca is a research scientist and crossword constructor in the Bay Area. She is also a co-director of Westwords, a crossword tournament taking place in Berkeley, Calif., and online on June 22.\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE.",
          "link": "https://defector.com/the-crossword-april-28-you-dropped-this-king-themeless",
          "publishedOn": "2025-04-28T15:00:00.000Z",
          "wordCount": 5117,
          "title": "The Crossword, April 28: You Dropped This, King (Themeless)",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2159838184.jpg"
        },
        {
          "id": "https://defector.com/?p=188115",
          "author": "Tom Scocca",
          "description": "What does a successful Democratic opposition—or a successful Democratic presidency—look like? Patrick Healy, the deputy opinion editor of the New York Times, convened a roundtable of experts to discuss what he thought was that question. \"I caught some heat this winter from Democrats when I raised the idea that the party is in deeper trouble with voters than its leaders are admitting,\" Healy wrote. \nHealy is dedicated to the panel format. He spent election season working on a sort of anti-journalism project for the Times, in which the Opinion section, collaborating with professional political consultants, gathered focus groups of what it took to be regular Americans and encouraged them to express their ignorance, confusion, and secondhand beliefs, so that the newspaper could publish them as if they were facts. For instance:",
          "link": "https://defector.com/the-era-of-meek-government-is-over",
          "publishedOn": "2025-04-28T14:03:36.000Z",
          "wordCount": 10374,
          "title": "The Era Of Meek Government Is Over",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/clintons.jpeg"
        },
        {
          "id": "https://defector.com/?p=188087",
          "author": "Barry Petchesky",
          "description": "Give the Kings and Oilers this: Their commitment to never making anything easy has led to some pretty great TV. The games in this first-round series have mostly followed the same basic outline. The Kings nab a multi-goal lead; the Oilers score a couple to get back in it. The moments where the game scripts have differed—why the series is tied 2-2 rather than already decided, in either team's favor—have all come in act 3, and have hinged on whether L.A. can close out what it started, or whether Edmonton has enough time left for its furious late-game rallies. Neither is a particularly envious position to be in. But all else being equal, I'd rather be the team that gets better as games wear on rather than the one that mostly seems to get tired.\nThe Oilers took Game 4 in Edmonton 4-3 in overtime Sunday night, by—what else?—a multi-goal, third-period comeback. It doesn't even get to the extra frame without Quinton Byfield failing to clear the puck and instead turning it over to Evan Bouchard with under a minute left. I'll chalk it up to being gassed—heavy legs and low oxygen levels make for bad decisions and worse execution—and Byfield, who's going to be a huge star if he's not there already, ended up playing a whopping 38 shifts in this one, most among forwards on either team. But fail to clear he did, and Bouchard scored his second unanswered of the period to tie things up.",
          "link": "https://defector.com/the-kings-are-wearing-out",
          "publishedOn": "2025-04-28T13:41:53.000Z",
          "wordCount": 7239,
          "title": "The Kings Are Wearing Out",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211817890.jpg"
        },
        {
          "id": "https://defector.com/?p=188062",
          "author": "Samer Kalaf",
          "description": "It was a bad weekend for football coaches' zoomer sons. During the early stages of Shedeur Sanders's unexpectedly protracted draft experience, he was faked out by a phone call on Friday from someone pretending to be New Orleans Saints general manager Mickey Loomis. \"We're going to take you with our next pick right here, man,\" the caller said. \"But you're going to have to wait a little bit longer, man. Sorry about that.\" As pranks go, this was mostly confusing; Sanders's response to the call was to ask the guests at his draft party, \"What does that mean?\" While it was just one of many indignities heaped upon Sanders during the draft, the call was inarguably the rudest.\nOn Sunday, the culprit was identified: Jax Ulbrich, the 21-year-old son of Atlanta Falcons defensive coordinator Jeff Ulbrich. Presumably the NFL's investigation was pretty efficient, because these idiots recorded themselves making the prank call and put it online. Here's the call from both sides:",
          "link": "https://defector.com/jeff-ulbrich-jax-ulbrich-shedeur-sanders-prank-call-nfl-draft",
          "publishedOn": "2025-04-28T13:06:28.000Z",
          "wordCount": 7138,
          "title": "Jeff Ulbrich’s Dreadful Son Was Behind The Shedeur Sanders Prank Call",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2190107261.jpg"
        },
        {
          "id": "https://defector.com/?p=188058",
          "author": "Ray Ratto",
          "description": "In a just world, Tim Hardaway Jr. makes that three-pointer from the corner, and the Detroit Pistons beat the New York Knicks, 96-94. Not, \"In a just world, David Guthrie calls that foul,\" even though he performed that rarest of mea culpae: the official's admission of doctrinal error. This may seem like a needle's-eye distinction, but we're not here to indulge a rant about bad officiating. If that's you, you deserve to drink alone, outside. In a hailstorm. In Scotland.\nBut we're also willing to say that in a just world, Cade Cunningham makes that 14-footer seven seconds earlier, and the Pistons beat the Knicks, 95-94. Not because we care about the Pistons, or for that matter the Knicks. In a good and entertaining series, the team that is behind should always tie the series up to increase the chances of Game 7 Christmas, and Knicks-Pistons is indeed that. That New York survived Sunday, 94-93, and took a 3-1 lead over Detroit is not good, not good at all, because it could make Game 5 on Tuesday the clincher, and there has never been a seven-game series that ends in five that has been worth a damn or remembered as anything special.",
          "link": "https://defector.com/the-knicks-got-away-with-that-one",
          "publishedOn": "2025-04-27T21:44:53.000Z",
          "wordCount": 6334,
          "title": "The Knicks Got Away With That One",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212283506.jpg"
        },
        {
          "id": "https://defector.com/?p=188048",
          "author": "Samer Kalaf",
          "description": "Former New England Patriots head coach Bill Belichick isn't one for non-mandatory media appearances, but those with a book to sell don't really have a choice. The North Carolina football coach sat down with Tony Dokoupil for a CBS Sunday Morning conversation that started out as routine and then turned agonizing when the interviewer began to ask questions that might actually interest the public.\n\nhttps://youtu.be/ZStmSZoc_Ps?si=BBK1DGv1xK_wzP04&t=328",
          "link": "https://defector.com/bill-belichick-brings-his-trademark-charm-to-excruciating-cbs-interview",
          "publishedOn": "2025-04-27T20:44:40.000Z",
          "wordCount": 5815,
          "title": "Bill Belichick Brings His Trademark Charm To Excruciating CBS Interview",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/bill-belichick-cbs.jpg"
        },
        {
          "id": "https://defector.com/?p=188051",
          "author": "Ray Ratto",
          "description": "NBC football gabbler Jon Champion said it early in Liverpool's crowning achievement on Sunday: \"Tottenham is in many ways the ideal opponent for this occasion.\" Even though it wasn't a stretch to realize that, he nailed it, for it was the sentence that served both as an upraised finger to celebrate the Reds' Premier League championship nearly two hours before it was made official, and a thumb straight in the eye of a Tottenham side that fully laid down to insure the title celebration.\n\nhttps://www.youtube.com/watch?v=3POvYkYFo30",
          "link": "https://defector.com/tottenham-was-a-polite-guest-for-liverpools-title-party",
          "publishedOn": "2025-04-27T19:21:36.000Z",
          "wordCount": 6014,
          "title": "Tottenham Was A Polite Guest For Liverpool’s Title Party",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2211732588.jpg"
        },
        {
          "id": "https://defector.com/?p=188044",
          "author": "Ray Ratto",
          "description": "If Eugenio Suárez had his preference, he might have chosen a different day to hit four home runs in a game. But given that he entered Saturday's game batting .167 for the season, he was in no position to be picky. To his credit, neither he nor the Arizona Diamondbacks are so ungracious.",
          "link": "https://defector.com/eugenio-suarez-picked-a-bad-day-to-hit-four-homers",
          "publishedOn": "2025-04-27T16:18:32.000Z",
          "wordCount": 6553,
          "title": "Eugenio Suárez Picked A Bad Day To Hit Four Homers",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212166943.jpg"
        },
        {
          "id": "https://defector.com/?p=188037",
          "author": "Samer Kalaf",
          "description": "Nikola Jokic knew his shot wasn't going in. After the conclusion of Game 4 on Saturday, he shared his thoughts while the ball traveled through the air: \"This is gonna be bad.\" He was correct. But out of nowhere, his teammate Aaron Gordon arrived to turn an airball into a buzzer-beating dunk, allowing the Denver Nuggets to escape with a 101-99 win that guaranteed at least two more games in an incredible series against the Los Angeles Clippers.\n\nhttps://www.youtube.com/watch?v=N0PE3BwrJIQ",
          "link": "https://defector.com/aaron-gordon-bails-out-nuggets-with-buzzer-beating-dunk",
          "publishedOn": "2025-04-27T14:51:53.000Z",
          "wordCount": 6335,
          "title": "Aaron Gordon Bails Out Nuggets With Buzzer-Beating Dunk",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212156613.jpg"
        },
        {
          "id": "https://defector.com/?p=188031",
          "author": "Samer Kalaf",
          "description": "Hours before the NFL Draft began on Thursday, Shedeur Sanders expressed his readiness. \"I’m built for whatever today may bring,\" the quarterback prospect tweeted. After the first round ended without a team picking Sanders, the gag wrote itself: What about tomorrow? When nobody selected him in the second or third rounds on Friday, and a prank caller interrupted his live-streamed draft party to deliver false hope, it all became a bit sad.\n\nhttps://www.youtube.com/shorts/a49Qsn4poAE",
          "link": "https://defector.com/shedeur-sanders-nfl-draft-cleveland-browns",
          "publishedOn": "2025-04-27T14:11:18.000Z",
          "wordCount": 6834,
          "title": "Shedeur Sanders’s Weekend Of Humiliation Ends With Him Going To The Browns",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2212126365.jpg"
        },
        {
          "id": "https://defector.com/?p=187969",
          "author": "Samer Kalaf",
          "description": "Even by the standards of Fox Corp, Fox Sports 1 seems like a pretty sinister place for an employee. Over the past few months, enough lawsuits, complaints, and allegations have emerged to suggest that the workplace environment is so rotten and sinister that it might be best to raze it and start over.",
          "link": "https://defector.com/seal-up-the-pit-that-contains-fox-sports-1",
          "publishedOn": "2025-04-25T20:36:19.000Z",
          "wordCount": 6842,
          "title": "Seal Up The Pit That Contains Fox Sports 1",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/undisputed-skip-shannon.jpg"
        },
        {
          "id": "https://defector.com/?p=187970",
          "author": "Albert Burneko",
          "description": "Grave editorial failure only seldom can be located in something as precise as a single word choice. The following block-quoted sentence, from a Thursday article by New York Times technology reporter Kevin Roose, contains one, and it feels like journalistic malpractice that his editor or editors let him type it. I bet you can spot the word:\nThere is a small body of academic research on A.I. model welfare, and a modest but growing number of experts in fields like philosophy and neuroscience are taking the prospect of A.I. consciousness more seriously, as A.I. systems grow more intelligent.",
          "link": "https://defector.com/only-kevin-rooses-editors-despise-him-more-than-i-do",
          "publishedOn": "2025-04-25T18:23:11.000Z",
          "wordCount": 8046,
          "title": "Only Kevin Roose’s Editors Despise Him More Than I Do",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/robot-guy.jpeg"
        },
        {
          "id": "https://defector.com/?p=187927",
          "author": "Dave McKenna",
          "description": "Boxing needs big events. And here comes one, maybe: A three-fight card made up of some of the biggest names in the game–Teofimo Lopez, Devin Haney, and headlining headcase Ryan Garcia–is scheduled for Friday, May 2, outdoors in Times Square. \nThe bill is intriguing enough. Garcia, who somehow remains a sympathetic figure despite being a very insistent and public asshole coming off a cheating suspension, is as compelling a character as the fight game offers these days. But the Times Square setting takes things to another level.",
          "link": "https://defector.com/saudi-arabias-latest-boxing-spectacle-is-a-times-square-fight-card-with-no-start-time-and-no-tickets",
          "publishedOn": "2025-04-25T16:26:45.000Z",
          "wordCount": 7292,
          "title": "Saudi Arabia’s Latest Boxing Spectacle Is A Times Square Fight Card With No Start Time And No Tickets",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/04/GettyImages-2190296061.jpg"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=850671",
          "author": "Darragh McDonald",
          "description": "The Royals announced that they have selected the contract of catcher Luke Maile. Infielder Tyler Tolbert was optioned to Triple-A Omaha to open an active roster spot. To get Maile onto the 40-man, right-hander Alec Marsh was transferred to the 60-day injured list. More to come.",
          "link": "https://www.mlbtraderumors.com/2025/05/royals-select-luke-maile.html",
          "publishedOn": "2025-05-02T20:13:43.000Z",
          "wordCount": 3021,
          "title": "Royals Select Luke Maile",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/Luke_Maile_Royals-scaled-e1746216777663-1024x706.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=850622",
          "author": "Steve Adams",
          "description": "The Royals have released infielder/outfielder Nick Gordon, who’d been with their Triple-A affiliate in Omaha, per the transaction log at MiLB.com. He’s free to explore opportunities with other teams. Gordon, 29, has spent time with the Triple-A affiliates for both the Orioles and Royals already in 2025. Kansas City acquired him from Baltimore in exchange…",
          "link": "https://www.mlbtraderumors.com/2025/05/royals-release-nick-gordon.html",
          "publishedOn": "2025-05-02T16:41:03.000Z",
          "wordCount": 3486,
          "title": "Royals Release Nick Gordon",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/05/nick-gordon-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=850450",
          "author": "Steve Adams",
          "description": "The Royals have selected the contract of righty Taylor Clarke from Triple-A Omaha and optioned lefty Noah Cameron back to Triple-A after yesterday’s MLB debut, per a team announcement. Righty James McArthur was transferred from the 15-day IL to the 60-day IL to open a spot on the 40-man roster for Clarke. McArthur has been…",
          "link": "https://www.mlbtraderumors.com/2025/05/royals-select-taylor-clarke-option-noah-cameron.html",
          "publishedOn": "2025-05-01T15:26:39.000Z",
          "wordCount": 3558,
          "title": "Royals Select Taylor Clarke, Option Noah Cameron",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2023/12/taylor-clarke-royals-1024x673.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=850213",
          "author": "Anthony Franco",
          "description": "Left-hander Noah Cameron is listed as the Royals’ probable starter for Wednesday evening’s game against the Rays. He’ll go opposite Drew Rasmussen in his major league debut. Cameron was added to the 40-man roster last November, but Kansas City will need to recall him while making a corresponding active roster move involving a pitcher. This would…",
          "link": "https://www.mlbtraderumors.com/2025/04/royals-to-promote-noah-cameron.html",
          "publishedOn": "2025-04-29T23:00:54.000Z",
          "wordCount": 3419,
          "title": "Royals To Promote Noah Cameron",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/04/USATSI_25787800-1024x1024.jpg"
        }
      ]
    },
    {
      "title": "Flaming Hydra",
      "feedUrl": "https://flaminghydra.com/rss/",
      "siteUrl": "https://flaminghydra.com/",
      "articles": [
        {
          "id": "68150bf69d3b0600014e9b60",
          "author": "The Editors",
          "description": "Diana Moskovitz of the BTS ARMY reporting for duty; new fiction from Luke O’Neil",
          "link": "https://flaminghydra.com/issue-312/",
          "publishedOn": "2025-05-02T20:32:36.000Z",
          "wordCount": 582,
          "title": "Share the glow / leave the ashes",
          "imageUrl": "https://flaminghydra.com/content/images/2025/05/BTS_Love_Yourself_-_Speak_Yourself_tour_at_Rose_Bowl-_Pasadena_-California--_4_May_2019_04-16w-1.jpg"
        },
        {
          "id": "681396c39d3b0600014e84fa",
          "author": "Luke O'Neil",
          "description": "The fullest extent of the law\nThe morning after the wildfires had spread widely enough that they begged addressing the mayor stood up outside of the charred strip mall where we used to get takeout Korean and assured the public that any looters would be dealt with in the harshest",
          "link": "https://flaminghydra.com/almost-beautiful/",
          "publishedOn": "2025-05-02T20:32:03.000Z",
          "wordCount": 477,
          "title": "Almost Beautiful",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/05/SAVE-TIME-FIRE-DAMAGE-edit-sharp-000727-0022-000660.jpg"
        },
        {
          "id": "6814f6fa9d3b0600014e9abc",
          "author": "Diana Moskovitz",
          "description": "I fell into BTS fandom during the height of the COVID-19 pandemic, when all the news was bad and I had plenty of time on my hands to learn what exactly was going on with this Korean boy band that people kept talking about. So I really did want to",
          "link": "https://flaminghydra.com/lightsticks/",
          "publishedOn": "2025-05-02T20:28:30.000Z",
          "wordCount": 606,
          "title": "Lightsticks",
          "imageUrl": "https://flaminghydra.com/content/images/2025/05/BTS_Love_Yourself_-_Speak_Yourself_tour_at_Rose_Bowl-_Pasadena_-California--_4_May_2019_04-16w.jpg"
        },
        {
          "id": "6813b7789d3b0600014e85a0",
          "author": "The Editors",
          "description": "Today: Kim Kelly, author of FIGHT LIKE HELL: The Untold History of American Labor and founding editor of Salvo; Tom Scocca, editor of Indignity; and writer and editor Maria Bustillos.\n\nIssue No. 311\nHappy May Day, fellow workers!\nKim Kelly\nThe Wrong Side of History\nTom Scocca and Maria",
          "link": "https://flaminghydra.com/issue-311/",
          "publishedOn": "2025-05-01T19:30:07.000Z",
          "wordCount": 1767,
          "title": "Fight the bosses / Leave them kids alone",
          "imageUrl": "https://flaminghydra.com/content/images/2025/05/San_Jose_May_Day_01-crop-1.jpg"
        },
        {
          "id": "681360a19d3b0600014e8435",
          "author": "Kim Kelly",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/happy-may-day-fellow-workers/",
          "publishedOn": "2025-05-01T19:29:54.000Z",
          "wordCount": 324,
          "title": "Happy May Day, fellow workers!",
          "imageUrl": "https://flaminghydra.com/content/images/2025/05/San_Jose_May_Day_01-crop.jpg"
        },
        {
          "id": "6813aefe9d3b0600014e8552",
          "author": "Tom Scocca",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/the-wrong-side-of-history/",
          "publishedOn": "2025-05-01T19:29:40.000Z",
          "wordCount": 323,
          "title": "The Wrong Side of History",
          "imageUrl": "https://flaminghydra.com/content/images/2025/05/David_Horowitz_by_Gage_Skidmore-crop-duo-tight-16x9.jpg"
        },
        {
          "id": "681282fa13780600015fbbac",
          "author": "The Editors",
          "description": "Myriam Gurba talks with journalist Daniel Alvarenga about El Salvador",
          "link": "https://flaminghydra.com/issue-310/",
          "publishedOn": "2025-04-30T23:24:50.000Z",
          "wordCount": 642,
          "title": "Speak now",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/nayib.jpg"
        },
        {
          "id": "68127dc513780600015fbb8d",
          "author": "Myriam Gurba",
          "description": "An Interview with Daniel Alvarenga",
          "link": "https://flaminghydra.com/when-disobedience-saves-lives/",
          "publishedOn": "2025-04-30T22:47:32.000Z",
          "wordCount": 618,
          "title": "When Disobedience Saves Lives",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/nayib-2.jpg"
        },
        {
          "id": "6811276d13780600015fa7f9",
          "author": "The Editors",
          "description": "Anna Merlan, TikTok habitué; Joe MacLeod phones in to Andy Richter",
          "link": "https://flaminghydra.com/issue-309/",
          "publishedOn": "2025-04-29T22:27:10.000Z",
          "wordCount": 638,
          "title": "Shared suffering / Loyal listener",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/pear-16x9-1.jpg"
        },
        {
          "id": "681132e813780600015fa828",
          "author": "Joe MacLeod",
          "description": "I LOVE TO listen to radio in all its forms. I enjoy podcasts, satellite radio, and regular “terrestrial” radio, the original Radio! Mostly, I like to listen to funny stuff, and I have been listening to The Andy Richter Call-In Show on satellite radio, that I pay for,",
          "link": "https://flaminghydra.com/first-time-long-time-last-time/",
          "publishedOn": "2025-04-29T22:26:30.000Z",
          "wordCount": 544,
          "title": "First Time Long Time Last Time",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/andy-richter-call-in-panel-16w-flat.jpg"
        },
        {
          "id": "6810d49513780600015fa701",
          "author": "Anna Merlan",
          "description": "I started watching TikTok videos as research for work, but in the way bad habits tend to do, this one eventually bled outwards into the rest of my life. Now, while doing chores around the house, any time there’s some dead air I want to fill, I inevitably",
          "link": "https://flaminghydra.com/symphony-of-destruction/",
          "publishedOn": "2025-04-29T22:26:11.000Z",
          "wordCount": 656,
          "title": "Symphony of Destruction",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/pear-16x9.jpg"
        },
        {
          "id": "680fe6750d4ed5000161656f",
          "author": "The Editors",
          "description": "Zach Rabiroff on the war on immigrants; all the way to Memphis with Jack Pendarvis",
          "link": "https://flaminghydra.com/issue-308/",
          "publishedOn": "2025-04-28T23:48:32.000Z",
          "wordCount": 793,
          "title": "Brutal anonymity / Famous names",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/braceros-1.jpg"
        },
        {
          "id": "680c08760d4ed50001614d7e",
          "author": "Jack Pendarvis",
          "description": "a collective of 60 writers, on fire and hard to kill",
          "link": "https://flaminghydra.com/ace-goes-to-hollywood-episode-5/",
          "publishedOn": "2025-04-28T23:46:21.000Z",
          "wordCount": 320,
          "title": "Ace Goes to Hollywood: Episode 5",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/teenie.jpg"
        },
        {
          "id": "680fa52b0d4ed5000161642f",
          "author": "Zach Rabiroff",
          "description": "“The president directed the Departments of Homeland Security and Justice to ‘apprehend, restrain, secure, and remove every’ Venezuelan migrant, 14 and older, who is deemed to be a part of Tren de Aragua and who lacks U.S. citizenship or permanent residency.” So began the news",
          "link": "https://flaminghydra.com/the-name-of-kilmar-abrego-garcia/",
          "publishedOn": "2025-04-28T23:46:00.000Z",
          "wordCount": 814,
          "title": "The Name of Kilmar Ábrego García",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/04/braceros.jpg"
        },
        {
          "id": "680bebb80d4ed50001614cf9",
          "author": "The Editors",
          "description": "In-flight superhero analysis with Brian Hioe",
          "link": "https://flaminghydra.com/issue-307/",
          "publishedOn": "2025-04-25T22:52:35.000Z",
          "wordCount": 304,
          "title": "Formless evil",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/capt-explodin-cop-car-1.jpg"
        },
        {
          "id": "680be7ee0d4ed50001614c92",
          "author": "Brian Hioe",
          "description": "a collective of 60 writers, on fire and hard to kill",
          "link": "https://flaminghydra.com/airplane-movies/",
          "publishedOn": "2025-04-25T22:42:18.000Z",
          "wordCount": 302,
          "title": "Airplane Movies",
          "imageUrl": "https://flaminghydra.com/content/images/2025/04/capt-explodin-cop-car.jpg"
        }
      ]
    },
    {
      "title": "Today in Tabs",
      "feedUrl": "https://rss.beehiiv.com/feeds/ZRiesnGI0u.xml",
      "siteUrl": "https://www.todayintabs.com/",
      "articles": []
    },
    {
      "title": "Bad Faith Times",
      "feedUrl": "https://bad-faith-times.ghost.io/rss/",
      "siteUrl": "https://bad-faith-times.ghost.io/",
      "articles": [
        {
          "id": "6813a5ece5dfee00015e7550",
          "author": "Denny Carter",
          "description": "JB Pritzker gets it",
          "link": "https://bad-faith-times.ghost.io/bft-podcast-the-leader-of-the-fight-caucus-is-here/",
          "publishedOn": "2025-05-01T17:11:10.000Z",
          "wordCount": 593,
          "title": "BFT Podcast: The Leader Of The Fight Caucus Is Here",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/size/w1200/2025/05/Screenshot-2025-05-01-at-1.03.55-PM.png"
        },
        {
          "id": "68124fb6934fee0001f1e649",
          "author": "Denny Carter",
          "description": "A message from after the Great Redo",
          "link": "https://bad-faith-times.ghost.io/a-blog-post-from-the-glorious-future/",
          "publishedOn": "2025-04-30T16:50:29.000Z",
          "wordCount": 1745,
          "title": "A Blog Post From The Glorious Future",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/04/Screenshot-2025-04-30-at-12.43.16-PM.png"
        },
        {
          "id": "680fb3bdce5fdd0001296435",
          "author": "Denny Carter",
          "description": "Senator Elissa Slotkin says Democrats need the \"goddamn alpha energy\" of Dan Campbell. She's half right.",
          "link": "https://bad-faith-times.ghost.io/alpha-energy-is-not-what-you-think-it-is/",
          "publishedOn": "2025-04-28T17:23:35.000Z",
          "wordCount": 1649,
          "title": "'Alpha Energy' Is Not What You Think It Is",
          "imageUrl": "https://bad-faith-times.ghost.io/content/images/2025/04/Screenshot-2025-04-28-at-1.20.16-PM.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}