{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": [
        {
          "id": "https://blogs.fangraphs.com/?p=466262",
          "author": "David Laurila",
          "description": "The pitcher-turned-broadcaster faced a lot of hitters over his 14 big league seasons. How well does he remember them?",
          "link": "https://blogs.fangraphs.com/mark-gubicza-tackles-a-challenging-career-quiz/",
          "publishedOn": "2025-06-20T14:00:55.000Z",
          "wordCount": null,
          "title": "Mark Gubicza Tackles a Challenging Career Quiz",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=193615",
          "author": "Kathryn Xu",
          "description": "On Thursday, ESPN's Jeff Passan published a blog about Jacob Wilson, the West Sacramento A's rookie shortstop currently having a very impressive offensive season of the Luis Arráez variety. He is rocking the second-lowest strikeout rate in the league (behind Arráez) and the second-highest squared-up contact rate in the league (behind Arráez), and, perhaps expected of a man born in the Year of our Lord 2002, Wilson attributes his success to Fortnite.\n\"Kids are going to love this one. Parents are going to hate me,\" Wilson said. \"I am a big believer in video games. It's fast decision-making strategy. I think that gets me ready for the game, because when you're in the box, you have to process a lot.\"",
          "link": "https://defector.com/i-am-sick-and-tired-of-these-normie-gamer-athletes",
          "publishedOn": "2025-06-26T17:42:42.000Z",
          "wordCount": 7225,
          "title": "I Am Sick And Tired Of These Normie Gamer Athletes",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/jacobWilsonNormieGamer2.jpg"
        },
        {
          "id": "https://defector.com/?p=193617",
          "author": "Patrick Redford",
          "description": "The run-up to every NBA Draft has a pleasant, familiar rhythm. Some prospects distinguish themselves in workouts, while some leap up or crash down draft boards after their wingspans and standing reaches are measured. People deploy some of the most fluorescent comparative language you will ever see. Every year, one or two mysterious prospects—Shaedon Sharpe a few years ago, Cedric Coward this year—will vault from the fringes into the lottery despite precious little tape. Mock drafts are never correct in their particulars, though the rough mosaic they form serves well enough as a guide and a baseline to measure all the surprises against. If you listen to what scouts and insiders say, there is always a pivot point early in the draft, a team with obscure intentions or a notably polarizing prospect who terrifies both the teams that pass on him and the team that ends up taking him in equal measure. This year, the hinge of the draft was the fifth pick, which the Utah Jazz used to select Ace Bailey out of Rutgers.\nBailey came into his lone season of college basketball with sky-high expectations. He was the second-ranked recruit in his class behind only Cooper Flagg, and it was pretty obvious why: He's a spindly, athletic 6-foot-8, possessed of rare shooting and shot-creation abilities for someone that big and athletic. No player in college could stop him from getting to his spots and pulling up. Bailey made his defenders look like so many flailing nephews as he confidently dribbled through traffic, bumped his way into an inch of space, and pulled up with one of the sweetest gathers you'll ever see in an 18-year-old player. He was also a pretty nasty rebounder, which tends to be one of the more translatable NBA skills, and he also showed some real flashes as a defensive playmaker. If you squinted, you could see the outline of a multi-time all-star.",
          "link": "https://defector.com/after-all-that-ace-bailey-ends-up-in-utah",
          "publishedOn": "2025-06-26T17:15:18.000Z",
          "wordCount": 8920,
          "title": "After All That, Ace Bailey Ends Up In Utah",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2222172302.jpg"
        },
        {
          "id": "https://defector.com/?p=193595",
          "author": "Chris Thompson",
          "description": "I want Jacob Misiorowski's internet. This fresh-faced child gets wholesome baseball. \"I feel like everything I swiped was me and Skenes, me and Skenes, me and Skenes,\" said Milwaukee's fire-breather of a rookie pitcher, of the days before his start Wednesday, the third of his career. \"I had to mute it, turn it off.\" You dear sweet lad, whatever algorithm you're plugged into beats the hell out of mine: Everything I swiped was, well, the entire rest of reality, which sucks turbo ass. Imagine muting the only remotely bitchin' thing left in the universe: A mid-week duel of 23-year-old phenoms, featuring baseball's scariest pitcher versus some damn kid from out of nowhere who is somehow even scarier. Before last week I think I had never even heard of Jacob Misiorowski. Whitney Tilson? Israel Katz? Thomas Fugate? If I cannot plug into Misiorowski's web, the very next best thing would be someone splitting my head right down the middle with a wood ax.\nFor a dog-days rubber match in the dreaded NL Central, this Pirates-Brewers tilt was a pretty big deal. For one thing, all Paul Skenes starts are events, even if the sad-sack Pirates have gotten next to nothing this season from his brilliance. Skenes entered Wednesday's start one of just four qualified pitchers in baseball with an earned-run average below 2.00; he was also in the top five in innings pitched, WHIP, and fielding-independent pitching, and was best in baseball in pitching wins above replacement, per Baseball Reference. The other two starting pitchers in the majors who began Wednesday allowing fewer than two earned runs per nine innings have a combined record of 18–5. Skenes, meanwhile, was 4–7, and the Pirates had played to a morally unacceptable 8–8 record in his starts. It's an embarrassment, is what it is.",
          "link": "https://defector.com/mighty-brewers-lad-out-duels-paul-skenes",
          "publishedOn": "2025-06-26T16:43:26.000Z",
          "wordCount": 10408,
          "title": "Mighty Brewers Lad Out-Duels Paul Skenes",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2222179165.jpg"
        },
        {
          "id": "https://defector.com/?p=193605",
          "author": "Tom Ley",
          "description": "The first round of the NBA draft on Thursday was pretty boring, with a few exceptions. Ace Bailey's strange, oafish attempts to get himself on an East Coast team of his choosing ended with him going to the Utah Jazz at No. 5. The New Orleans Pelicans made what appears to be a very dumb trade in order to take Derik Queen at No. 13. The Brooklyn Nets drafted one million guards. But nothing was as exciting as the arrival of Yang Hansen.\nYang, projected to be taken in the late first or second round, ended up going to the Portland Trail Blazers at No. 16. The 20-year-old, 7-foot-2 center has spent the last few seasons playing pro ball in the Chinese league. He's the kind of player who generally profiles as a long-developing project, which makes the Blazers' decision to take him in the middle of the first round something of a historic reach. So what gives? How did Yang jump so many spots?",
          "link": "https://defector.com/the-nba-draft-provides-blessed-phrases-like-chinese-jokic",
          "publishedOn": "2025-06-26T16:17:09.000Z",
          "wordCount": 6662,
          "title": "The NBA Draft Provides Blessed Phrases Like “Chinese Jokic”",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2222181956.jpg"
        },
        {
          "id": "https://defector.com/?p=193327",
          "author": "Annie Howard",
          "description": "“In 20 yrs, this will all be commonplace.”\nThese words were first penned in 2008 by Chloe Dzubilo. A trans femme, recovered heroin addict, and long-term HIV survivor who had stayed alive more than three decades after she was first diagnosed with a virus that killed her partner in the late ‘80s, Chloe knew what it meant to play the long game, to endure trials that nobody should have to face. By 2008, she’d lived many lives: champion show-horse jumper, drug addict, lead singer of a band called the Transsisters, and advocate for younger trans women and sex workers. Looking two decades into the future—still three incomprehensible years from where we stand today—she envisioned a world where trans life was obvious and indisputable. Still, she knew that the future required a fight. In a life marked by long-term disability and routine dehumanization by medical professionals, Chloe held her head high, the act of daily survival elevated to an artful refusal to accept the world’s hostile terms. The challenges she wove into her life and left behind in her art are ones we still face today, making her a critical teacher for troubled times.",
          "link": "https://defector.com/chloe-dzubilo-and-the-perilous-path-forward-for-trans-life",
          "publishedOn": "2025-06-26T15:21:55.000Z",
          "wordCount": 12773,
          "title": "Chloe Dzubilo And The Perilous Path Forward For Trans Life",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/Chloe-Dzubilo-–-Untitled-Crossed-the-Street.jpg"
        },
        {
          "id": "https://defector.com/?p=193508",
          "author": "Samer Kalaf",
          "description": "If there is one takeaway from Zohran Mamdani's victory in the New York City Democratic mayoral primary on Tuesday, it's that there is no one takeaway. The democratic socialist and his wide-ranging canvassing team built a coalition that brought in voters of all backgrounds, leading to a defeat of Andrew Cuomo by a significant margin. There wasn't one sole factor that handed Mamdani the win, and everyone will have their own opinions on which campaign promise or tactic mattered the most. That said, it feels safe to say that one familiar opposition strategy resoundingly did not work.\nMamdani's primary agenda on his platform is to make New York City more affordable for its residents, through specific initiatives: freezing rent, free buses, no-cost childcare. While many of his opponents took time to pick at these progressive policies, they also relentlessly attacked his Muslim faith and support for Palestinians. In a race for mayor of New York City, they tried to make fealty to the state of Israel a strict qualification.",
          "link": "https://defector.com/the-politics-of-fear-dont-work-against-a-candidate-who-isnt-scared",
          "publishedOn": "2025-06-26T13:16:19.000Z",
          "wordCount": 9587,
          "title": "The Politics Of Fear Don’t Work Against A Candidate Who Isn’t Scared",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2221992032.jpg"
        },
        {
          "id": "https://defector.com/?p=193208",
          "author": "Diana Moskovitz",
          "description": "LOS ANGELES — Few have been spared in the raids. They’ve taken people who came to Southern California from Mexico, El Salvador, Guatemala, Cambodia, Laos, and Vietnam. They’ve taken people from garment shops, street carts, farms, packinghouses, taquerias, big-box stores, home-improvement stores, and car washes. They've taken a union president (since released) and multiple U.S. citizens. They’ve taken people from what feels like every zip code, from the far-flung Coachella Valley to the manicured lawns of Pasadena, which shut down multiple city programs on Saturday after people got taken from a local park, to the grimy streets of Hollywood, where masked agents targeted a Home Depot in the heart of the city—just off a freeway, two blocks from local TV news station KTLA, and pretty widely known as one of the easiest spots in town to find a day laborer.\nThe fear of more raids has bled into everyday life, and led countless people to stay home. Even if you aren't afraid, you have friends or family or coworkers who are and it's impossible to avoid the constant warnings about the latest ICE raids springing up across social media. There is the sense of communities trying to stand up an immune system under duress, the better to warn vulnerable people in time.",
          "link": "https://defector.com/the-dodgers-are-disappointing-the-people-who-want-to-love-them-the-most",
          "publishedOn": "2025-06-25T20:18:10.000Z",
          "wordCount": 15434,
          "title": "The Dodgers Are Disappointing The People Who Want To Love Them The Most",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2221397688-smaller-e1750646930528.jpeg"
        },
        {
          "id": "https://defector.com/?p=193528",
          "author": "Kelsey McKinney",
          "description": "In the winter, my television mostly stays off. The winter is when my brain is at its best. I am reading. I am writing. I am maybe watching a couple episodes of a show a week. But this feels crazy to type right now, at this moment in the summer, because I currently have a minimum of four hours of television I must watch every single day. I do not have time to read or have hobbies or do anything else, because I am too busy being locked the hell in. \nTelevision has been my best friend for several weeks because of two shows that come on every day. The first show is baseball. I am a Phillies fan, and baseball teams play 162 games over the course of six months every year. I watch most of them. But then I am also committed to another kind of sport, called Love Island.",
          "link": "https://defector.com/i-love-my-daily-sports-shows-baseball-and-love-island",
          "publishedOn": "2025-06-25T19:27:58.000Z",
          "wordCount": 8236,
          "title": "I Love My Daily Sports Shows: Baseball And ‘Love Island’",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/Screenshot-2025-06-25-at-2.28.10 PM.png"
        },
        {
          "id": "https://defector.com/?p=193393",
          "author": "Billy Haisley",
          "description": "Like many great Brazilian funk albums, pressing play on Halc DJ's Bruxaria Não É Phonk is a little like fitting a jackhammer bit into your ear canal and waiting for the impending sonic onslaught to render you utterly, blissfully destroyed. Surprisingly, Halc makes you wait a bit for it. The album begins with \"Phonk É o Caralho,\" a tour de force of funkery that, with no less than eight beat switch-ups across just three minutes, takes you on a breakneck journey through the breadth of the DJ/producer's talents and of the genre's possibilities. But you have to get a little more than 30 seconds into the opener, when its second beat-switch fades, an appropriately ominous voice belches the word \"bruxaria,\" and a shrill whistle—these kinds of tinnital chirps are known as \"tuim/tuin,\" the prevalence of tuim being one of the hallmarks of the bruxaria subgenre—rings steadily and then begins to strobe overtop a ratty, red-lining bass pulse. It's only then that Halc really drags you into the depths of the underworld where this type of joyously brain-scrambling funk lives and thrives.\n\nhttps://www.youtube.com/watch?v=jQSwEBAryu8",
          "link": "https://defector.com/halc-djs-brazilian-funk-album-fights-a-righteous-war-against-the-algorithms",
          "publishedOn": "2025-06-25T17:22:16.000Z",
          "wordCount": 13267,
          "title": "Halc DJ’s Brazilian Funk Album Fights A Righteous War Against The Algorithms",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/halc-good.jpg"
        },
        {
          "id": "https://defector.com/?p=193480",
          "author": "Lauren Theisen",
          "description": "It's the hottest week of the year in New York City, but the Mets have been ice cold. Leaders of the NL East by five-and-a-half games less than two weeks ago, the boys from Queens now trail the Phillies by 1.5 because of a putrid ongoing stretch where they've lost 10 of 11. That slide includes Tuesday night's fall-from-ahead defeat at home, where even the much-anticipated team debut of 29-year-old reliever Richard \"Dicky\" Lovelady didn't provide the fans any pleasure.\nPart of the sting of the Mets' slump has come from the fact that they're losing to three of the most frustrating and annoying franchises on the schedule. They got swept by the Rays in three by a combined score of 24-9. They managed one win in Philly to break up 10-2 and 7-1 drubbings. And if you didn't know already, I bet you can guess the remaining tormentor: the Atlanta Braves.",
          "link": "https://defector.com/not-even-dicky-lovelady-could-rescue-the-mets",
          "publishedOn": "2025-06-25T15:49:07.000Z",
          "wordCount": 7083,
          "title": "Not Even Dicky Lovelady Could Rescue The Mets",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2221263267.jpg"
        },
        {
          "id": "https://defector.com/?p=193479",
          "author": "Chris Thompson",
          "description": "Ketel Marte was 23 years old when his mother died in July 2017. He'd recently been summoned to the Arizona Diamondbacks from Triple-A Reno, where he'd been clobbering to smithereens the best pitching of the minor leagues. Marte had already played an accumulated season-plus of major-league games as a member of the Seattle Mariners, but following a trade to Arizona he was initially blocked at his positions of choice by veterans, and so the Diamondbacks made the unusual decision to ship a productive top prospect back to the minors for half a season. Marte's call-up came at the end of June; on July 29, in his 24th game with the big club, Marte took a mighty rip at a 2–0 pitch from Cardinals reliever Kevin Siegrist and crushed a laser of a dong over the wall in left, his fourth homer as a Diamondback. The moment carried some personal significance, as it was Marte's 10th home run at two combined levels that season, a benchmark he'd circled with a little inspiration from mom.\n\"When I was playing softball in the Dominican with my friend, she saw me hit a long homer,\" Marte told the Arizona Republic, back in 2017. \"One day, before I came to spring training, she said, 'I want 10 homers this year.' Now, I’ve got 10 homers. When I hit my last homer, I called her. She had watched the game. I said, 'Now you’ve got 10 homers, how about that?' She was crying.\" Marte spoke again to his mother the following day, Sunday, after the rubber match in St. Louis and before boarding a plane for a short team flight to Chicago. While Marte and the Diamondbacks were in the air, a vehicle struck Marte's mother, Elpidia Valdez, as she drove a moped in the Dominican Republic. Marte learned of the accident when the team flight landed, but was given the impression that it was minor and that Elpidia would recover. That evening, at a team dinner, he received a phone call and was told that she'd died.",
          "link": "https://defector.com/simply-dont-be-a-shithead",
          "publishedOn": "2025-06-25T15:14:44.000Z",
          "wordCount": 9129,
          "title": "Simply Don’t Be A Shithead",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/Ketel-Marte-Upset.png"
        },
        {
          "id": "https://defector.com/?p=191659",
          "author": "Joshua Needelman",
          "description": "A yoga empire struggles to reckon with its past after its guru is named as an abuser.",
          "link": "https://defector.com/what-the-guru-left-behind",
          "publishedOn": "2025-06-25T13:06:03.000Z",
          "wordCount": 25522,
          "title": "What The Guru Left Behind",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/Yoga-guru-sex-abuse-smaller.jpeg"
        },
        {
          "id": "https://defector.com/?p=193426",
          "author": "Barry Petchesky",
          "description": "Eagle-eyed trackheads following the Ostrava Golden Spike in Czechia might have noticed American hurdler Chris Robinson, an NCAA champion at Alabama, winning the 400 meters with some unorthodox form. Midway through the event, Robinson began reaching, after every hurdle, to adjust himself in a way familiar to any penis-haver. Surely even a top track athlete would not be able to win a race, let alone in a season-best 48.05 seconds, with his dong flapping around. Going balls out usually does not lend itself to going balls out.\nSome research was needed. Track's not a huge deal here in the States, and the only video existed as a livestream on a subscription service. So we turn to the Swedes, who you'd expect to be all over a penis if one presented itself in Lane 3. From national sport newspaper Sportbladet:",
          "link": "https://defector.com/hurdler-wins-400-meter-race-despite-his-dick-and-balls-falling-out-several-times",
          "publishedOn": "2025-06-24T19:39:11.000Z",
          "wordCount": 6874,
          "title": "Hurdler Wins 400-Meter Race Despite His Dick And Balls Falling Out Several Times",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2217397672.jpg"
        },
        {
          "id": "https://defector.com/?p=193406",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about socks, mowing the lawn, filth, and more.\nMy apologies for a shorter than usual bag today. I’m just coming off of a week of work in the field for SF Gate, and I’ve already started in on Why Your Team Sucks, the debut which is on the horizon. So I’ve been a touch squeezed. But fear not, the take lab is still bustling and ready to produce more sterling content for you in the coming weeks and months.",
          "link": "https://defector.com/fuck-sore-losers",
          "publishedOn": "2025-06-24T18:48:32.000Z",
          "wordCount": 14835,
          "title": "Fuck Sore Losers",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2192542155-1.jpg"
        },
        {
          "id": "https://defector.com/?p=193385",
          "author": "Tom Ley",
          "description": "Back in January, an arbitration case between the NFL and the NFL Players' Association came to a quiet end. The case was initiated by a grievance filed by the NFLPA in 2022, which argued that NFL owners had colluded with each other to deny players fully guaranteed contracts. The arbitrator's final ruling, that the league's owners had not engaged in collusion, was public, but the details of his ruling were not. The arbitrator's full report was published today by Meadowlark Media's Pablo Torre, and it reveals how the NFL's corporate structure makes it possible for owners to openly discuss collusion without technically breaking any rules.\nThe full ruling, which Torre covers at length in his latest podcast episode, is primarily concerned with a March 2022 meeting between NFL owners and the NFL Management Council (NFLMC). This meeting occurred just a few weeks after Deshaun Watson signed an unprecedented five-year, $230 million contract with the Cleveland Browns that was fully guaranteed. The NFLPA argued that during this meeting the owners conspired to ensure that Watson's contract would be the last of its kind, and that evidence of this conspiracy can be found in part by the fact that quarterbacks Lamar Jackson, Kyler Murray, and Russell Wilson were not offered fully guaranteed deals upon entering free agency after Watson's deal was signed.",
          "link": "https://defector.com/how-the-nfl-gets-away-with-it",
          "publishedOn": "2025-06-24T17:44:52.000Z",
          "wordCount": 8112,
          "title": "How The NFL Gets Away With It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2213573511.jpg"
        },
        {
          "id": "https://defector.com/?p=193348",
          "author": "Patrick Redford",
          "description": "In the hours before Game 7 of the NBA Finals on Sunday, ESPN desk analyst Kendrick Perkins fielded a contrived gambling question about whether or not Chet Holmgren would score 15 points. His reasoning was that Holmgren would, since the Oklahoma City Thunder big had expressed frustration with his previous performance. Or anyway, that's all the reasoning Perkins could fit in before Stephen A. Smith cut him off to scream about how his co-host was annoying him, because things are different in the NBA Finals. Right before the segment mercifully cut to commercial, Bob Myers mounted a defense of Perkins that wound up being a scathing indictment of the whole operation. \"Just because you yell something, doesn't mean it's true,\" he said.\n\nhttps://www.youtube.com/watch?v=2ztug-Ebgss",
          "link": "https://defector.com/espns-nba-finals-coverage-was-a-pretty-rough-watch",
          "publishedOn": "2025-06-24T16:45:32.000Z",
          "wordCount": 8515,
          "title": "ESPN’s NBA Finals Coverage Was A Pretty Rough Watch",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/nbadesk.jpg"
        },
        {
          "id": "https://defector.com/?p=193267",
          "author": "Maitreyi Anantharaman",
          "description": "The Las Vegas Aces are bad. Not “bad by their championship standards\"—just kind of bad. Two years ago, they lost six games total. In less than a quarter of this season, they have lost seven. By the grace of the incredibly forgiving WNBA playoff system, they are, with a 6-7 record, the last team in. So it was actually kind of heartening to see them gut out a win at home on Sunday afternoon, rallying in the fourth quarter to beat the Indiana Fever and avoid their first four-game losing streak since 2018. Ahead of what could be some morale-boosting games against Connecticut and Washington this week, here was proof that the Aces can still lock in. \nIt was not looking that way at halftime this weekend, after what might have been A’ja Wilson’s worst half of professional basketball. Missed layups, contested pull-ups and battles with Aliyah Boston had kept her to 2-of-12 shooting. “I just want to apologize to everybody that was watching. That was not a normal A’ja Wilson night,” she said in the postgame interview on ESPN. Spinning to the cup and timing up big blocks on the defensive end, she had already played the second half like an apology. At the end of the night, Wilson's line was a sightlier 8-of-21, but she apologized again for good measure. “Sorry if you had to see that, but we got the dub.”",
          "link": "https://defector.com/can-you-count-out-the-aces",
          "publishedOn": "2025-06-24T16:10:17.000Z",
          "wordCount": 9149,
          "title": "Can You Count Out The Aces?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2221621505.jpg"
        },
        {
          "id": "https://defector.com/?p=193380",
          "author": "Ray Ratto",
          "description": "Look at that image above. Really look at it. Now. And do not avert your eyes. Satan went to a lot of work to make this happen, and that work must be honored with your attention.\nYes, that is Rob Manfred and John Fisher, shown commemorating the upcoming 70th anniversary of the creation of The Jetsons, in Las Vegas. These two came complete with ill-fitting hard hats jammed unconvincingly onto their hydrocephalic heads, just in case lightning finally, belatedly strikes them down. They are there to celebrate the production of a sign that says a baseball field will be built on a specific site, and they are smiling to celebrate their mutual refusal to consider the evil and greed and stupidity and general imperviousness to failure that they are honoring this day. They look happy, all told.",
          "link": "https://defector.com/take-a-look-at-these-ghouls",
          "publishedOn": "2025-06-24T15:44:42.000Z",
          "wordCount": 7900,
          "title": "Take A Look At These Ghouls",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2221756409.jpg"
        },
        {
          "id": "https://defector.com/?p=192765",
          "author": "Sarah Brouillette",
          "description": "In July of 2022, Joyce Carol Oates tweeted that her literary agent friend told her editors are no longer interested in reading first novels by young white male writers, “no matter how good.” She was saying this in support of an article by former New York Times columnist Pamela Paul, who argued that the publishing industry is being destroyed by “illiberal scolds” keen to stifle free speech. Among Paul’s examples are the industry’s recourse to sensitivity readers, who ostensibly scold authors, and the backlash against 2020 bestseller American Dirt on the grounds that its white author Jeanine Cummins was not the right person to tell the story of poor Mexican migrants. Paul is implying, in other words, that calls for publishing to address its whiteness problem amount to a form of woke censorship. In sharing Paul’s piece and adding her own anecdote about young white men being overlooked, Oates was connecting their fate to Paul’s complaint: White men are the victims of the industry’s takeover by the DEI mafia.\nThe idea that white male writers today face diminishing opportunities has since occasioned considerable debate and several attempts to lay out in greater detail the forces behind their recent marginalization. Jacob Savage’s explanation is that they are “vanishing” because, having been castigated as toxic masculinists and told there are no “Good White Men,” they no longer feel that they are allowed to have a voice. Tim Lott argues that an industry now dominated by women editors and agents, who are naturally biased toward manuscripts that center their own experiences, is guilty of the same inequality that women once complained about, except now it is men who are excluded.",
          "link": "https://defector.com/the-plight-of-the-white-male-novelist",
          "publishedOn": "2025-06-24T15:19:58.000Z",
          "wordCount": 12744,
          "title": "The Plight Of The White Male Novelist",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-53272364.jpg"
        },
        {
          "id": "https://defector.com/?p=193250",
          "author": "David Roth",
          "description": "There is a specific and lacerating shame that comes with talking about New York City politics in places where people who do not live in New York City can hear you. This is not just because the people involved are so often so embarrassing. The alpha goofiness of current Mayor Eric Adams, for instance, actually helps with this, if only because the existence of a luridly corrupt and grandiose elected official with a half-dozen Livestrong-style motivational bracelets on each wrist, who has governed more or less as Influencer Cop, is at least strange enough that it might interest someone whose experience of public life does not depend, to some extent, on that particular Influencer Cop's moods, rivalries, and federal legal entanglements.\nIt is accurate, if not quite sufficient, to say that the j…",
          "link": "https://defector.com/andrew-cuomo-is-a-future-of-the-democratic-party",
          "publishedOn": "2025-06-24T12:44:16.000Z",
          "wordCount": 12611,
          "title": "Andrew Cuomo Is A Future Of The Democratic Party",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2220753701.jpg"
        },
        {
          "id": "https://defector.com/?p=193191",
          "author": "Billy Haisley",
          "description": "The base, corrupting, disenchanting influence of money has allegedly been right on the cusp of ruining everything good, noble, and just plain fun about soccer for almost a century and a half now. An easy year to point to here would be 1885, when England FA's settled the roaring debate about amateurism by allowing soccer players to be paid to play. So much of the game's history since then—the development of the great clubs, the existence of the great leagues and tournaments, the emergence and movement of the great players—has been determined first and foremost by the pursuit of the almighty dollar. Rather than a point of departure, the current, baldly avaricious version of the Club World Cup is but the latest instantiation of trends that have dominated soccer for forever.\nClearly, soccer has not yet been ruined. In spite of everything—the widening gap between teams at the tippity top and those below, clubs getting coopted as money- and reputation-laundering fronts, the steady distancing between clubs and their local fan bases, globalization's concentration of talent and homogenization of the once richly diverse panoply of styles and strategies, overloaded schedules and overburdened players—the game still produces amazing games, amazing players, and amazing competitions, thrilling its enormous, rapt audience with incredible stories. It's not that the money-mindedness has actually been a good thing, nor that all those who've complained about it since 1885 were necessarily wrong. Rather, it's that even in inauspicious conditions, after decisions that seem to fly directly in the face of what has made soccer what it is, the game itself and the people who care about it usually endure.",
          "link": "https://defector.com/south-america-rules-the-club-world-cup",
          "publishedOn": "2025-06-23T19:02:57.000Z",
          "wordCount": 11492,
          "title": "South America Rules The Club World Cup",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2221217069.jpg"
        },
        {
          "id": "https://defector.com/?p=193297",
          "author": "Tom Scocca",
          "description": "Welcome to Margin of Error, a politics column from Tom Scocca, editor of the Indignity newsletter.\nFive days and multiple government-inflicted catastrophes ago, Senate Minority Leader Chuck Schumer tried to tell people to get their priorities straight. The Supreme Court had just ruled that Tennessee could ban medical treatment for trans youth, in a decision that Justice Sonia Sotomayor described in dissent as \"indefensible\" and having \"no constitutional justification.\" In response to that news, Schumer put up a post on Bluesky:",
          "link": "https://defector.com/no-time-for-theatrics",
          "publishedOn": "2025-06-23T17:56:10.000Z",
          "wordCount": 11613,
          "title": "No Time For Theatrics",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/masked-federal-agents.jpeg"
        },
        {
          "id": "https://defector.com/?p=193262",
          "author": "Alex Shultz",
          "description": "In January 2024, Semafor media reporter Max Tani published a small scoop: Pennsylvania Senator John Fetterman and writer Buzz Bissinger (most famous for authoring Friday Night Lights) were working together on Fetterman’s memoir, which was to be titled Unfettered and focus on his “political rise and struggles with mental health.”\nMuch has changed since then. Fetterman’s warmongering—he just proudly endorsed President Trump’s psychotic decision to bomb Iran—is one of many reasons his popularity has nosedived among Democratic voters over the last year-and-a-half. He's isolated himself from fellow senators and hemorrhaged staffers, many of whom have departed from his office and then spoken to the press, both on the record and anonymously, about his reportedly erratic behavior and his obsession with supporting Israel’s genocide against the people of Gaza. A New York magazine investigation published in May assigned a much darker definition of “unfettered”: a senator who cannot be reasoned with, who suffers from an addiction to social media, who texts and Facetimes while driving, and is plainly unfit for office.",
          "link": "https://defector.com/nobody-wants-to-talk-about-john-fetterman-and-buzz-bissingers-pricey-memoir-project",
          "publishedOn": "2025-06-23T16:38:39.000Z",
          "wordCount": 12032,
          "title": "Nobody Wants To Talk About John Fetterman And Buzz Bissinger’s Pricey Memoir Project",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2218334216.jpg"
        },
        {
          "id": "https://defector.com/?p=193252",
          "author": "Patrick Redford",
          "description": "I was convinced it was happening again. \nWith 7:41 left in Sunday night's NBA Finals Game 7, the Oklahoma City Thunder took a 22-point lead, a lead that would have felt insurmountable against any other team in the league. But there is no other team in the league like the Indiana Pacers, and they took control, pressuring the inbounds pass, springing double- and triple-teams at ball-handlers, and letting Bennedict Mathurin bash his way into the lane. OKC wobbled and the lead tumbled to 12 in three short minutes. The Thunder, playing prevent offense, did not make another basket for the remainder of the game. The pressure forced Shai Gilgeous-Alexander into committing his fifth foul, and Alex Caruso into calling the team's final timeout with over four minutes left. You could feel the arena hold its collective breath. How fitting it would have been, for a postseason defined more by the Pacers doing the impossible than by anything else, for them to win Game 7 on the road by turning on the blender.",
          "link": "https://defector.com/the-pacers-were-too-cool-to-make-sense",
          "publishedOn": "2025-06-23T16:09:39.000Z",
          "wordCount": 7895,
          "title": "The Pacers Were Too Cool To Make Sense",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2218786904.jpg"
        },
        {
          "id": "https://defector.com/?p=193247",
          "author": "Maitreyi Anantharaman",
          "description": "No soap operas, just crosswords. This week's puzzle was constructed by Matthew Stock and edited by Hoang-Kim Vu. Matthew is a crossword constructor in Gainesville, Fla., where he is pursuing a master’s degree in counseling. His puzzles have been published in the New York Times, USA Today, and the New Yorker, among other venues. When he’s not making puzzles, Matthew enjoys cooking, birdwatching and playing ultimate frisbee.\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE. Note that our submissions are closed through July 31.",
          "link": "https://defector.com/the-crossword-june-23-lines-of-business",
          "publishedOn": "2025-06-23T15:00:00.000Z",
          "wordCount": 5931,
          "title": "The Crossword, June 23: Lines Of Business",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-1984269042.jpg"
        },
        {
          "id": "https://defector.com/?p=193253",
          "author": "Ray Ratto",
          "description": "There are a lot of things we deserve as people. A rational world in which killing civilians for amusement is not an acceptable instrument of foreign policy, as just one farfetched example. But for sports fans, \"deserve\" is one of those verbs that works way too hard for its weight class, an advert for entitlement based on the notion that the next thing you see must by definition be more spectacular than the last thing you saw. Five-year-olds spit on your shoes in revulsion.\nBecause, and this will surely surprise all of you who have ever used the phrase \"in my lifetime\" as a useful metric for any athletic achievement, \"deserve\" isn't a word that means anything around here. You get what you get, the way you get it, and there's no refund for dissatisfaction unless you decide to get off your collective hinder and stop watching, attending, and paying. Until that moment, well, the polite way to put it is \"You bought it, so eat it. And on your way out, settle up your bill.\"",
          "link": "https://defector.com/thunder-pacers-game-7-deserve-has-nothing-to-do-with-it",
          "publishedOn": "2025-06-23T14:45:05.000Z",
          "wordCount": 8998,
          "title": "“Deserve” Has Nothing To Do With It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2221575233.jpg"
        },
        {
          "id": "https://defector.com/?p=193207",
          "author": "Chris Thompson",
          "description": "Richard Jefferson's exact words—so help me God—were, \"If Tyrese Haliburton was still playing, and it was a 15-point lead with six minutes to go, that's right where the Pacers like it.\" Neither Mike Breen nor Doris Burke seized the opportunity to club Jefferson over the head with a folding chair, which was a shame, but there followed five seconds of awkward silence. Indiana's deficit was, at that moment, 14 points, and the clock showed 5:38. The Oklahoma City home crowd was chanting \"O-K-C\" at ear-splitting decibels, but the mood was not yet celebratory. The Pacers were mounting a 9–1 run, fueled by free-throws at one end and grinding, ineffective isolation ball at the other. Jalen Williams threw away a possession on hero shit on the right wing, but Lu Dort skittered into the paint for the …",
          "link": "https://defector.com/the-thunder-finished-the-job",
          "publishedOn": "2025-06-23T12:57:48.000Z",
          "wordCount": 11343,
          "title": "The Thunder Finished The Job",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2220897806.jpg"
        },
        {
          "id": "https://defector.com/?p=193195",
          "author": "Israel Daramola",
          "description": "The inevitable has happened. The Phoenix Suns have traded Kevin Durant to the Houston Rockets, as first reported by Shams Charania. In return for the 36-year-old 15-time All-Star, Phoenix gets Jalen Green, Dillon Brooks, the No. 10 pick in this year's draft, and five future second-round picks.\nThe Rockets reportedly made Durant's small list of preferred trade destinations, but the Suns were still able to wrangle a decent haul for the perennially disgruntled superstar. For his part, Durant learned he was being traded while on stage for a panel at Fanatics Fest in New York City.",
          "link": "https://defector.com/houston-wins-the-latest-kevin-durant-sweepstakes",
          "publishedOn": "2025-06-22T21:16:48.000Z",
          "wordCount": 7242,
          "title": "Houston Wins The Latest Kevin Durant Sweepstakes",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2221510582.jpg"
        },
        {
          "id": "https://defector.com/?p=193087",
          "author": "Lucy Bloom",
          "description": "A week before I was hired at Defector, I decided to quit vaping. This was kind of a while ago now, but I still have good days and bad. Today is a good day; I haven't even needed a patch today. Yesterday was a rough one. On rough days, I will go buy one single shitty poverty cigar—the brainchild of the Phillies' owner's dad, the Black & Mild wood tip. This is a multi-pronged strategy: I love wood tips, but I rarely smoke a whole one in a sitting, no matter how hard up I might be. Also, everyone around you will think less of you if you do this. A key feature of cravings is self-loathing, and it sort of feels deserved that people will see me: a questionably dressed yet ostensibly grown woman smoking a cigar that is usually purchased with coins. Weakness ought to feel like weakness.\nLast night, I had already smoked through my cigar of the day. Since my trip to New York, I'm staying with my aunt and uncle in La Crosse, Wis. for a little while before I drive the rest of the way back from to Tacoma. As the evening pushed forward, I was putting on an impressively brave face for them. Across the river in Winona, a thunderstorm had rolled in, lighting up the sky brilliantly, and the air was so thick you had a real sense for what was clapping back together when the lightning left its jagged vacuums. My aunt and uncle are big nerds (complimentary) about weather. They have a little plane and are spending their retirement bouncing around America with only Mother Nature to play defense. I'm a curious sort, so I leaned into that, hanging on every word they spoke. I begged them to explain more about how the wind played tricks on a small aircraft. I was desperate for distraction from the withdrawal. But after a while they got tired and turned in for the night. I couldn't take my car to satisfy my craving, because that would involve noisily opening the garage, which would be an embarrassing reveal of me making a whole trip to collect a second John Middleton product in just one Thursday. So I would go on foot.",
          "link": "https://defector.com/a-weak-night-in-la-crosse",
          "publishedOn": "2025-06-20T21:32:07.000Z",
          "wordCount": 8728,
          "title": "A Weak Night In La Crosse",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-591981472.jpg"
        },
        {
          "id": "https://defector.com/?p=193108",
          "author": "Dave McKenna",
          "description": "Fifty years ago, the hot comedy skit was Saturday Night Live’s “Generalissimo Francisco Franco is still dead!”, a play on the coverage of the Spanish dictator’s demise. That gag came to mind when I read yet another update on the terminally ill Washington Post, a newspaper that I delivered each morning back when the Franco punchline and the newspaper were among the biggest deals in town. \nWashington City Paper reported earlier this week that, after this weekend, the Post will no longer have a standalone Metro section in its print edition. The paper told subscribers about the move in an email from executive editor Matt Murray. From City Paper’s story:",
          "link": "https://defector.com/update-the-washington-post-is-still-dying",
          "publishedOn": "2025-06-20T20:02:58.000Z",
          "wordCount": 7354,
          "title": "Update: The Washington Post Is Still Dying",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2216756203-smaller-e1750443838303.jpg"
        },
        {
          "id": "https://defector.com/?p=193101",
          "author": "Patrick Redford",
          "description": "For the first time in American sports history, a team has been sold on an 11-figure valuation. News broke Wednesday that the Buss family has agreed to sell a controlling share of Los Angeles Lakers to Mark Walter of TWG Global and Guggenheim Partners in a deal valuing the franchise at $10 billion. That is the largest-ever valuation at sale for a North American sports franchise, smashing the high-water mark recently set by the private equity guy who agreed to buy the Boston Celtics for $6.1 billion. Walter taking over and doing so at such a steep price is obviously interesting, though the bigger story is the Buss family finally cashing out, as they were the flag-bearers for a type of sports owner that is quickly being bought out of the business.\nJerry Buss bought the Lakers, the NHL's Kings, and the Los Angeles Forum in 1979 for $67.5 million. At the time, that sale price was a record high for a team, and though sports teams are the sort of asset that always appreciate in value, few would have predicted that the valuation of the team would increase by 15,000 percent over the following 46 years. In that time period, the collective identity of NBA ownership steadily changed. The used car dealer who owned the Utah Jazz sold the team, through his widow, to a tech billionaire. The NBA forced racist slumlord Donald Sterling to sell the Los Angeles Clippers to one of the richest men in the country. The Maloof brothers, inheritors of beer distribution riches, ran out of money and sold the Sacramento Kings to another much richer tech guy. Most of the people who own teams now are billionaires, and 20 percent of the league is now owned by people who made their billions in private equity.",
          "link": "https://defector.com/with-the-lakers-sale-the-nbas-old-ownership-class-is-nearly-extinct",
          "publishedOn": "2025-06-20T19:10:32.000Z",
          "wordCount": 8754,
          "title": "With The Lakers Sale, The NBA’s Old Ownership Class Is Nearly Extinct",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-819777752.jpg"
        },
        {
          "id": "https://defector.com/?p=193122",
          "author": "Maitreyi Anantharaman",
          "description": "The best pitchers in baseball were going to pitch on the same day! In the same place! Walking distance from my home! On a day I didn’t have to work! This dream confluence would give me a chance to watch reigning Cy Young winner Tarik Skubal, always a delight, and my first in-person look at Pirates ace Paul Skenes. Skenes had pitched in Detroit last year—also in the second game of a doubleheader that began with a Skubal start—but I’d missed it because I was in New York at company meetings for my (dumb) job and only caught a few minutes when Jasper gave us breaks from looking at his impressive charts.\nSome fans complained that the two aces would not start in the same game on Thursday, though as someone with plans to attend both, this didn’t especially bother me. What did annoy me was it being a split doubleheader: I’d have to buy separate tickets, and leave and come back. A small price to pay, I reasoned, for what was sure to be the greatest day of my baseball-watching life. Around 12:30, the Tigers announced that the 1:10 first game would begin in a rain delay. A slightly larger but still small price to pay, I reasoned, for what was sure to be the greatest day of my baseball-watching life. I waited out the delay at home, enjoying the broadcast’s interstitial highlight reel of new Pirates manager and former Tiger Don Kelly.",
          "link": "https://defector.com/take-me-out-of-the-ballpark",
          "publishedOn": "2025-06-20T18:48:33.000Z",
          "wordCount": 8888,
          "title": "Take Me Out Of The Ballpark",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2220251361.jpg"
        },
        {
          "id": "https://defector.com/?p=192844",
          "author": "Israel Daramola",
          "description": "Reading or watching the news has become a real nightmare for me, as I imagine it must be for anyone reading this. Each day seems to bring some new horror or tragedy, and if the non-stop procession of bad news itself doesn't desensitize you, there's all those hucksters out there trying to sell you the idea that, actually, your empathy is wrong. It's enough to make you want to check out of everything altogether.\nAnd plenty of people have. One of the worst byproducts of Trump's second electoral victory was a refrain I heard a lot, usually from other black people: this concept of \"resting.\" The idea starts with the fact that, going back at least to the civil rights movement, black people have spent so much time fighting for our humanity and our communal betterment, only to watch the white-supremacist power structure repeatedly thwart any possibility of radical, positive change. And so, if white people and those who hope to sidle up to white supremacy are so determined to hold onto power, even if it means destroying themselves in the process, then we should let them. Our time now is the time to disengage from the political carousal and do what was best for ourselves. Black self-care as a political ideology unto itself.",
          "link": "https://defector.com/so-what-is-it-gonna-take",
          "publishedOn": "2025-06-20T18:14:25.000Z",
          "wordCount": 8900,
          "title": "So What Is It Gonna Take?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2220429644.jpg"
        },
        {
          "id": "https://defector.com/?p=193083",
          "author": "Kathryn Xu",
          "description": "On Thursday night the Los Angeles Dodgers and San Diego Padres, who do not like each other, completed a four-game series in which eight batters were hit by pitches. Even excluding the incidents in the previous three-game series the two teams played earlier this month, that's a lot of hit by pitches! Enough, in fact, to rank.\nWe are innovating in philosophical space here, raising and answering questions such as, Is it possible for a hit-by-pitch to be better quality than another hit by pitch?, and, If so, what makes a hit-by-pitch good? A hit-by-pitch is most meaningful if it is intentional, because otherwise that's just poor control, and poor control is ass to watch. Though intentionality is difficult to presume, pitches with more movement and pitchers with poor control are naturally discounted. A hit-by-pitch is also most meaningful if it carries more risk of hurting your own team—say, hitting a player who doesn't usually get on base, doing it in a close game or on an advantageous count, or doing it with hitters already on base. That is, the best hit-by-pitches are fueled by enough petty spite that they break out of the constrictive traditional frameworks of \"trying to win a baseball game.\"",
          "link": "https://defector.com/every-hit-by-pitch-in-the-dodgers-padres-series-ranked",
          "publishedOn": "2025-06-20T17:50:00.000Z",
          "wordCount": 9008,
          "title": "Every Hit-By-Pitch In The Dodgers–Padres Series, Ranked",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/shoheiOhtaniHBP.jpg"
        },
        {
          "id": "https://defector.com/?p=193082",
          "author": "Kelsey McKinney",
          "description": "True heat—the overwhelming hot wall that hits you the minute you step out of a door, that takes your breath and makes it into more humidity, that rips the thoughts from your brain and crumples them—is oppressive. It's exhausting. It's unlivable. And it is here.\nStarting Friday, a giant hair dryer will be pointed at most of the United States. More than 200 million people are expected to be trapped under a terrible bubble of heat. The Weather Prediction Center is calling this a \"significant and extremely dangerous heat wave.\" And because for most of the Midwest, Great Lakes, Northeast and Mid-Atlantic this spring has been mild and wet, the quick shift to swamp will feel even more brutal. Temperatures will be hot as hell. Humidity will be high enough to curl straight hair. Don't even get me started on the dew point (disgusting). The nights will be muggy and miserable. There will be no wind. It is going to be painful.",
          "link": "https://defector.com/get-ready-for-inside-week-in-america",
          "publishedOn": "2025-06-20T16:23:04.000Z",
          "wordCount": 7116,
          "title": "Get Ready For Inside Week In America",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2220272381.jpg"
        },
        {
          "id": "https://defector.com/?p=192729",
          "author": "Joe Flynn",
          "description": "When it comes to my daughter, I try to live in the moment. I stumbled into this paradigm in March of 2023, when Nora was diagnosed with autism spectrum disorder at the age of 2. Nora is 4 now—a fiery, intelligent young lady who leads her classmates in preschool group activities and directs mommy to the car whenever they are lost in the parking lot—but she still doesn’t speak. On a short enough timeline, that’s perfectly fine; we don’t need to speak to enjoy an hour at the park or share an ice cream cone. Nora is happy. She is healthy. Everything is all right.\nStill, being a parent is a worrying thing, and there are fears that never really go away. What if she never speaks? What if she can’t take care of herself after my wife and I are gone? Lately, this fear has assumed a distressingly hued human form, one frequently seen getting upset in front of Congress and making rounds on the cable news circuit. Health and Human Services Secretary Robert F. Kennedy Jr. will talk to, or at, anyone; like many of the content creators Donald Trump has appointed in his second term, he seems to understand that to be his job. But when it comes to autism, it feels as if he is speaking directly to me.",
          "link": "https://defector.com/robert-f-kennedy-jr-will-not-let-my-daughter-be",
          "publishedOn": "2025-06-20T15:42:43.000Z",
          "wordCount": 10598,
          "title": "Robert F. Kennedy Jr. Will Not Let My Daughter Be",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2218966268.jpg"
        },
        {
          "id": "https://defector.com/?p=193053",
          "author": "Barry Petchesky",
          "description": "It seemed like a small thing at the time. Before last Saturday's game between the Los Angeles Dodgers and San Francisco Giants at Dodger Stadium, the singer Nezza performed \"The Star-Spangled Banner\" in Spanish, even after being told not to by team representatives, in a symbolic protest against the jackbooted deportation raids being carried out around the country and in Los Angeles by faceless federal goons. It is the sort of cruelty that no human being can help but take sides on, but a baseball team is not a human being, and the Dodgers had pointedly declined to offer any comment on the crisis to that point, even as Angelenos' protests in the streets were repeatedly escalated to violence by heavy-handed policing.\n\"We're not going to comment,\" Dodgers executive vice president and chief marketing officer Lon Rosen said that same day. That was in response to questions from the Los Angeles Times about whether the team had anything to say to its fans, a community that the organization proudly boasts is 40 percent Latino, and therefore a disproportionate target of ICE raids. \"We’re not going to comment on anything.\"",
          "link": "https://defector.com/the-dodgers-cant-sit-this-moment-out",
          "publishedOn": "2025-06-20T13:39:46.000Z",
          "wordCount": 8270,
          "title": "The Dodgers Can’t Sit This Moment Out",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2220248722.jpg"
        },
        {
          "id": "https://defector.com/?p=193044",
          "author": "Ray Ratto",
          "description": "The Pacers and Thunder have constructed a series that has put the lie to the notion that there are insurmountable leads in basketball. The 20-point lead, once the gold standard, is now 30, and even then there's a little white-knuckling to be done. But like any absolute counterfactual, sometimes the percentages get in the way. In fact, in every case of a team getting a 30-point lead, it was once a 20-point lead. Sometimes an ass-kicking is just an ass-kicking.\nEnter Game 7 of the NBA Finals, coming Sunday night to a television near you. The Pacers, who have gained their ultra-plucky reputation as the team that lets the other guy get the 20-point lead before eradicating it, finally went nearly wire-to-wire (minus the first three-and-a-half minutes) in a 108–91 beatdown of the Thunder to force El Juego Definitivo.",
          "link": "https://defector.com/the-pacers-thunder-finals-have-given-us-everything-but-an-ending",
          "publishedOn": "2025-06-20T13:02:08.000Z",
          "wordCount": 7785,
          "title": "The Finals Have Given Us Everything But An Ending",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2221036578.jpg"
        },
        {
          "id": "https://defector.com/?p=193015",
          "author": "David Roth",
          "description": "We've all been there. Your buddy and former editor-in-chief Megan Greenwell has an acclaimed new book about the predatory industry that wrecked your previous workplace and is eating away at American life everywhere you look, and she's got an hour to spare on her book tour to talk to you on your podcast. So far, so relatable. But! Your co-host is out of town, and also if it was just you and Megan there's a chance the podcast would be like 40 minutes of questions about Jed Lowrie and Brett Anderson and 20 minutes of answers amounting to \"will you please stop asking me about Brett Anderson.\" Not to belabor the point, but this is one of The Classic Scenarios. And yet, this week, it happened to me.",
          "link": "https://defector.com/a-fine-balance-between-evil-and-stupid-with-kelsey-mckinney-and-megan-greenwell",
          "publishedOn": "2025-06-19T20:26:50.000Z",
          "wordCount": 7281,
          "title": "A Fine Balance Between Evil And Stupid, With Kelsey McKinney And Megan Greenwell",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-1246196649.jpg"
        },
        {
          "id": "https://defector.com/?p=193024",
          "author": "Defector Staff",
          "description": "It’s a holiday, and you won’t be seeing much of us today. Consider this your space to talk about the news, your summer plans, tonight’s Game 6, or anything else you wanna blab about. We’ll be back tomorrow with normal programming.",
          "link": "https://defector.com/your-juneteenth-open-thread",
          "publishedOn": "2025-06-19T13:08:09.000Z",
          "wordCount": 5345,
          "title": "Your Juneteenth Open Thread",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-161065688.jpg"
        },
        {
          "id": "https://defector.com/?p=192154",
          "author": "Sabrina Imbler",
          "description": "Soon after inauguration, the Trump administration announced plans to slash the size of the federal government, seemingly by any means necessary. The administration enlisted Elon Musk's Department of Government Efficiency, or DOGE, to carry out unprecedented waves of widespread firings, buyouts, and reductions in force, many of which faced legal challenges. As of June 6, the labor department has reported the federal government has gotten rid of 59,000 jobs since January. These firings are deeply political. They intend to purge nonpartisan employees and replace them with loyalists.\nThis series puts names and faces to some of the thousands of civil servants whose lives and futures have been upended. They all share a commitment to public service and a belief that the government is supposed to help people.",
          "link": "https://defector.com/meet-the-civil-servants-under-attack-by-the-trump-administration",
          "publishedOn": "2025-06-19T13:00:00.000Z",
          "wordCount": 10622,
          "title": "Meet The Civil Servants Under Attack By The Trump Administration",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/workers-federal.jpg"
        },
        {
          "id": "https://defector.com/?p=192929",
          "author": "Maitreyi Anantharaman",
          "description": "“Wow,” Kahleah Copper tweeted yesterday evening. She was the rare WNBA player with the time to post and spectate on Wednesday. The final day of the group play stage of the league’s in-season Commissioner’s Cup tournament involved six games in one night, the first five overlapping. On account of the odd number of WNBA teams right now, Copper’s Phoenix Mercury were the lucky 13th team out. They could simply kick up their feet and take in one of the more colorful nights the league has seen. What was her \"Wow\" about? We can only guess. These were my own Wows from each game: \nVALKYRIES 71, WINGS 80",
          "link": "https://defector.com/the-wnba-had-too-much-going-on-last-night",
          "publishedOn": "2025-06-18T18:53:26.000Z",
          "wordCount": 8377,
          "title": "The WNBA Had Too Much Going On Last Night",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2219976868.jpg"
        },
        {
          "id": "https://defector.com/?p=192954",
          "author": "Kathryn Xu",
          "description": "Some good news: The New York Yankees have now been shut out for three games in a row. This is in spite of mitigating factors such as facing the \"Los Angeles\" Angels of Anaheim and being newly Giancarlo Stanton'd up. Take a 2–0 loss to the Boston Red Sox, a 1–0 loss in 11 innings in the ghost runner era, and a 4–0 loss to Kyle Hendricks's 86 mile-per-hour fastball, et voilà: The Yankees are now the third team this year to achieve this storied feat, joining the Cincinnati Reds and the Colorado Rockies. That's company you want to be keeping.\nUnlike the Reds and the Rockies, who accomplished the feat through the tried and true strategy of not getting on base, the Yankees have gone the much more convoluted route of getting runners on base and stranding them there. They have left as many runners on base as the Reds and Rockies had combined during their respective streaks. In their 11-inning shutout loss, the Yankees had the bases loaded and Hunter Strickland on the mound. Anthony Volpe grounded out to end the game. A classic mishap of putting in more effort to get the exact same results: zero runs, zero wins. In some ways, you have to respect it.",
          "link": "https://defector.com/will-the-yankees-ever-score-another-run-no",
          "publishedOn": "2025-06-18T17:34:14.000Z",
          "wordCount": 6422,
          "title": "Will The Yankees Ever Score Another Run? No",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/newYorkYankeesShutoutLOL.jpg"
        },
        {
          "id": "https://defector.com/?p=192234",
          "author": "Defector Staff",
          "description": "Summer happens slowly, then all at once: longer nights, a drink on the porch followed by one more, the trickle then flood of every publication writing (or getting AI to write) a list of summer books you should read. Just as predictable is the kind of books that will appear on these lists. These books are recent, they are already well-publicized, and they are generally described as suited to one particular location (the beach). But summer, and summer reading, is capacious. It's more than the feeling of being on vacation and more than the books you might buy at the airport. This is why we decided to give you a different kind of summer reading guide.\nOur list is full of books that we genuinely endorse that are not all super new or super popular. We tried to pick books that went with summer's various and specific moods, or that we might not have a good excuse to recommend otherwise. Here are 35 good books perfect for everything from sipping a spritz abroad to finding your first beautifully ripe tomato.",
          "link": "https://defector.com/books-we-think-you-should-read-this-summer",
          "publishedOn": "2025-06-18T17:14:43.000Z",
          "wordCount": 12106,
          "title": "Books We Think You Should Read This Summer",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/painting-lead-summer-reading.jpg"
        },
        {
          "id": "https://defector.com/?p=192875",
          "author": "Patrick Redford",
          "description": "The United States will host the men's World Cup in a little under one year. The vibe around the program could not possibly be worse, and enthusiasm levels could not possibly be lower.\nSome of this funk can be explained by the U.S. team getting embarrassed on the field. Until they hung five goals on poor Trinidad and Tobago over the weekend, the USMNT had lost four straight games by an aggregate score of 9-2. Two of those were competitive games against CONCACAF rivals and two were friendly losses to legit European teams, though there's little point in drawing a distinction between the pairs of matches, because the stakes in both were the same: nothing. Losing is one thing. The larger and thornier issue is that if the team were winning, all they could win would be a reprieve from people paying attention to the program's structural bustedness.",
          "link": "https://defector.com/the-usmnt-is-going-nowhere",
          "publishedOn": "2025-06-18T16:02:39.000Z",
          "wordCount": 9718,
          "title": "The USMNT Is Going Nowhere",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2206579097.jpg"
        },
        {
          "id": "https://defector.com/?p=192845",
          "author": "Albert Burneko",
          "description": "\"You can't be a serious critic,\" New York Times technology reporter Kevin Roose wrote on Tuesday, on Bluesky, about artificial intelligence, \"if you're in denial about how useful it is.\" Narrowly, in strict terms, this is true: You can't be a serious critic of anything if you are in denial about any part of it, where \"in denial\" describes an irrational and unfounded rejection of empirical reality. That's hardly even worth saying, but it's also not really what Roose is saying.\nWhat Roose wants is to put an entire suite of claims about the technology presently doing business as \"artificial intelligence\"—not just that it has more than zero uses (a thing nobody really denies) but that it truly is artificial intelligence or anything like it; that it represents a profound leap forward for technology and human endeavor; that it is the future; that, as such, adopting it and integrating it into day-to-day work and life processes is the smart move—beyond dispute. He wants to marginalize the many technology experts, media knowers, and sharp lay readers who have for years been calling his work on behalf of those claims appalling boobery. He wants his readers to view all of those critics as coterminous with whatever minor body of irrelevant five-follower internet loons might bother trying to argue the literal uselessness of a predictive text generator or a program that collates search engine results into layperson's language. He wants his readers to think of all the critics as united in an essentially pathological relationship with the observable world. And he wants the juice of dancing this shitty little passive-aggressive jig on Bluesky, the social-media platform where many of those critics will encounter his work and, while dunking on it, also share it around to some number of people who will read it.",
          "link": "https://defector.com/toward-a-theory-of-kevin-roose",
          "publishedOn": "2025-06-18T15:15:30.000Z",
          "wordCount": 11871,
          "title": "Toward A Theory Of Kevin Roose",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/roose.jpeg"
        },
        {
          "id": "https://defector.com/?p=192878",
          "author": "Chris Thompson",
          "description": "William Langewiesche died on Sunday. He was a damn titan. Langewiesche hit his stride in longform magazine journalism round about 1998, applying the concept of system accidents to the downing of ValueJet Airlines Flight 592, a McDonnell Douglas DC-9 aircraft that had crashed into the Florida Everglades in 1996. Langewiesche had been doing international affairs essays for The Atlantic—those were also good, and he kept at this work for the rest of his career—but here was a story in his true wheelhouse. It's a great blog: Langewiesche, a professional pilot, had the aviation chops to comprehend the accident like few of his journalistic peers, but what grabs you about the best Langewiesche jams is his talent for stitching together a timeline of events, using as thread the little quiet things th…",
          "link": "https://defector.com/each-william-langewiesche-disaster-story-was-an-event-in-itself",
          "publishedOn": "2025-06-18T14:45:17.000Z",
          "wordCount": 11476,
          "title": "Each William Langewiesche Disaster Story Was An Event In Itself",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-81214731.jpg"
        },
        {
          "id": "https://defector.com/?p=192459",
          "author": "David Roth",
          "description": "There are some things you can learn about fascism before you actually learn them during fascism, and there are others that you can only learn through experience. The fundamental instability of fascist political formations is one of those. The stupid and scattershot brutality of every moment, the relentless and obvious lying and the variously shameful ways in which institutions quail or qualify or quit in the face of it, the regular paroxysms of political violence and self-harm, the freakish and orgiastic backstabbing and self-dealing and perversity of a depraved new ruling class—all of this is real, but day by day they are experienced less as identifiable attributes of fascism and more as the dumb daily fact of it.\nBoth in the literature and in the moment, that stupid and strident chaos is the natural result of the scammers and degenerates and opportunists that populate those regimes doing the things they do, and of the desperate and deluded political moments and populaces that tend to produce fascism, and of the self-annihilating grandiosity of the gold-plated godheads that squat atop it all, trying to freeze that churn into permanence through the application of state violence and sheer idiot will. It is all jarring and idiotic and miserable, and as it fails around you there really isn't much comfort in the knowledge that it Actually Doesn't Work. In the long run, it absolutely doesn't, but the people in charge do not believe in the long run; the work of their project is to freeze the present in place, and to defy whatever reckoning tomorrow might bring. Everyone else is trapped in that unending day with them, a place where bad things are always happening but nothing ever resolves. Reading about fascism will tell you about how it begins and how it works and even how it tends to end, but it can only tell you so much about how it feels.",
          "link": "https://defector.com/against-the-day",
          "publishedOn": "2025-06-18T14:11:23.000Z",
          "wordCount": 11909,
          "title": "Against The Day",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2219685328.jpg"
        },
        {
          "id": "https://defector.com/?p=192905",
          "author": "Ray Ratto",
          "description": "Only two teams have ever lost three consecutive Stanley Cup Finals, and they were both under special and antediluvian circumstances. The 1938–40 Toronto Maple Leafs managed it when the National Hockey League was only seven or eight teams deep and all you had to do to compete was not go bankrupt, and the 1968–70 St. Louis Blues got swept three consecutive times as an expansion team when one of the two divisions was all expansion teams.\nThus, it is hard to conceive of the Edmonton Oilers as they are this morning, first beaten and then hammered by the Florida Panthers in successive years, not having to live with this feeling for years to come. Knowing that the other guy is better one year is hard to endure, but knowing that the same guy got almost incalculably better a year later makes this a more existential defeat.",
          "link": "https://defector.com/its-getting-dark-edmonton-oilers",
          "publishedOn": "2025-06-18T13:34:24.000Z",
          "wordCount": 7623,
          "title": "It’s Getting Dark In Edmonton",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2220653261.jpg"
        },
        {
          "id": "https://defector.com/?p=192879",
          "author": "Barry Petchesky",
          "description": "The Panthers are the reason your favorite team stinks. Not because they've ruined all those other teams' records, though they have, but because Florida has successfully built what every front office in a copycat league has and will continue to ineffectively flail toward. Everyone holds up \"toughness\" as the ideal form of playoff hockey. They want to get \"tougher.\" Meaner. More physical. They ignore the part, or take shortcuts around it because it's difficult to achieve, where Florida's toughness is merely a flavor of its skill. The Panthers are good. They score goals and they wear down defenses and generally make life difficult for opposing skaters because they finish their checks and protect their guys and drive you slobberingly insane with rage because they know where the line is, and play comfortably just on either side of it. \nYour favorite team, in search of toughness to help get over a playoff hump, will do things like—say—sign Ryan Reaves for three years. The Panthers, on the other hand, will do things like trade for Matthew Tkachuk and let him define their whole identity, or acquire Sam Bennett for a song and watch him win the Conn Smythe, or get Brad Marchand (poster boy for \"good enough that he doesn't need to do the extracurriculars, but better for having them in his bag\") at the deadline.",
          "link": "https://defector.com/the-panthers-grind-all-before-them-to-dust",
          "publishedOn": "2025-06-18T13:04:55.000Z",
          "wordCount": 8662,
          "title": "The Panthers Grind All Before Them To Dust",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2219982955.jpg"
        },
        {
          "id": "https://defector.com/?p=192784",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about AI, coin flips, talk shows, weed, and more.\nKevin:",
          "link": "https://defector.com/bachelor-parties-are-strictly-optional",
          "publishedOn": "2025-06-17T19:04:50.000Z",
          "wordCount": 16768,
          "title": "Bachelor Parties Are Strictly Optional",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-119728739.jpg"
        },
        {
          "id": "https://defector.com/?p=192764",
          "author": "Luis Paez-Pumar",
          "description": "The Club World Cup kicked off over the weekend in the United States, and it's been a wild ride so far, in the most derogatory way possible. It's not so much about the games themselves, which have been mostly either stodgy goalless draws or one-sided beat-downs (thanks for coming, Auckland City, enjoy your 10-0 defeat to Bayern Munich!) in front of small, generally disinterested crowds (who could've imagined that a Monday afternoon match between Chelsea and LAFC in Atlanta wouldn't exactly pack the stadium?). Instead, the real action for this rebranded and expanded version of the tournament has come off the pitch, as the tournament kicks off amidst nationwide protests and Donald Trump's quest to be the most special dictator he can be. Luckily for Trump, he has FIFA bending the knee left and right.\nThe concept of the Club World Cup itself may be exciting on paper—never-before-seen matchups! true global representation! concrete proof that MLS does indeed suck!—but all of its ostensibly commendable aims are undermined by the core truth that this tournament exists solely to make FIFA lots of money, player welfare, fan interest, and competitive integrity be damned. That core truth is why the newfangled tournament never seemed all that compelling for those of us who don't stand to make millions from either producing or participating in it; the Trumpy specifics of this particular edition—all the reports about ICE and Customs and Border Protection showing up to games, as well as requests that everyone attending bring proof of citizenship, residency, or their visas—soured an already sour proposition.",
          "link": "https://defector.com/fifa-says-yes-to-racism",
          "publishedOn": "2025-06-17T18:37:06.000Z",
          "wordCount": 7777,
          "title": "FIFA Says Yes To Racism",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2215173016.jpg"
        },
        {
          "id": "https://defector.com/?p=192787",
          "author": "Ray Ratto",
          "description": "The San Francisco Giants are about to test the notion that one team's misalignment is another team's salvation. In fact, they have already done it even though the Shiny New Toy In Question hasn't even been unwrapped yet, let alone aligned.\nIn moving four certified mammals to the Boston Red Sox for designated hitter and apparent pain in the ass Rafael Devers, the Giants finally achieved the big get they hadn't managed since they outbid themselves by $40 million for Barry Zito in 2006. That one was an analytic misstep, unless you count Zito’s two postseason starts in 2012, in which he won Game 5 of the NL Championship Series (with the Giants down 3-1 to the St. Louis Cardinals) and then Game 1 of the World Series. Those two starts made the deal a barg . . . well, okay, not a bargain. But at least some value for the money. Also he could play guitar.",
          "link": "https://defector.com/buster-posey-made-the-big-deal-giants-fans-have-been-waiting-for",
          "publishedOn": "2025-06-17T17:06:25.000Z",
          "wordCount": 8445,
          "title": "Buster Posey Made The Big Deal Giants Fans Have Been Waiting For",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2218003548.jpg"
        },
        {
          "id": "https://defector.com/?p=192747",
          "author": "Kathryn Xu",
          "description": "At some point this season, Shohei Ohtani pitching and hitting will once again become ordinary, and only when he does something truly extraordinary will it be worth writing about. We are not yet at that point in the season. The Ohtani coverage will continue until the pitch count improves. It speaks to the absurd density of what has changed about Shohei Ohtani that this is the situation of his first start in nearly two years: He threw his first 28 pitches in a Dodgers uniform on the same day that his former interpreter, Ippei Mizuhara, reported to federal prison.\nI would like to hype up the outing with more than that. Ohtani's return to the mound is not a novelty, as some might have feared after he left the Los Angeles Angels—for any criticism allotted to the Angels, you have to admit that they were in a position to let Ohtani do whatever he wanted. As previously noted, the Dodgers desperately need starting pitching. And so they had to take the option of a glorified rehab start, considering the minor league dilemma: As pitcher Ohtani and hitter Ohtani are the same person (allegedly; I have only seen one of him at any given time), his rehab start necessarily had to take place against the San Diego Padres as opposed to, say, the Round Rock Express. It was arguably overshadowed by Dylan Cease hitting Andy Pages with a fastball, and Padres manager Mike Shildt shouting, \"Who the fuck do you think you are?\" after Pages expressed some displeasure at taking 98 miles-per-hour to the arm. In otherwise, average Dodgers–Padres June game shenanigans.",
          "link": "https://defector.com/shohei-ohtani-is-getting-back-to-abnormal",
          "publishedOn": "2025-06-17T16:25:30.000Z",
          "wordCount": 6689,
          "title": "Shohei Ohtani Is Getting Back To Abnormal",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/shoheiOhtaniStartingPitcher.jpg"
        },
        {
          "id": "https://defector.com/?p=192744",
          "author": "Lauren Theisen",
          "description": "I guess you could read that headline as some sort of condemnation of the Oilers' brass—that we're at Game 6 of the Stanley Cup Final, an elimination game for Edmonton, and there's still so much uncertainty surrounding a key position. But I mean it in the most literal sense possible. Kris Knoblauch presumably knows by this point who it will be, but if anyone tells you they know who's the better option, they're lying. Nobody knows!\nWhile the Panthers have made it to within a game of clinching their second straight Cup on the back of Sergei Bobrovsky and only Sergei Bobrovsky, the Oilers got through the past two months with a chaotic combo in net. They began with their primary starter, Stuart Skinner. The 26-year-old looked like the answer to their crease problem when he first slotted into the role a couple of years ago, but has only declined from there. Skinner almost handed the team an early exit, looking absolutely helpless in his first couple games against the Kings. He was replaced by the 33-year-old Pickard, a fringe NHLer whose only season as a starter saw him lead the league in losses for Colorado in 2017. Inexplicably, Pickard won four straight for the Oilers to get the series win, and even though a couple of those games were 7-4 and 6-4, Edmonton was in no position to complain.",
          "link": "https://defector.com/nobody-knows-who-the-oilers-should-start-at-goalie-in-the-most-important-game-of-the-season",
          "publishedOn": "2025-06-17T15:39:07.000Z",
          "wordCount": 8041,
          "title": "Nobody Knows Who The Oilers Should Start At Goalie In The Most Important Game Of The Season",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2219405875_7de849.jpg"
        },
        {
          "id": "https://defector.com/?p=192742",
          "author": "Post-Postdoc",
          "description": "You're a streetcar operator. If you need more specifics, let's say it's fin de siècle Vienna and you've got a jaunty cap.\nOh no! Your streetcar is barreling down on a group of people. But you observe that they lie just beyond a junction in the track whose switch you control. If you pull the lever, your streetcar will move to the other track—and safety!",
          "link": "https://defector.com/when-an-ai-agent-tries-to-kill-you-who-goes-to-jail",
          "publishedOn": "2025-06-17T15:05:22.000Z",
          "wordCount": 10862,
          "title": "When An AI Agent Tries To Kill You, Who Goes To Jail?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-1237571109.jpg"
        },
        {
          "id": "https://defector.com/?p=192733",
          "author": "Chris Thompson",
          "description": "There was a sequence in the fourth quarter of Game 5 Monday night where I very nearly chewed through my shirt collar. I should not have had it in my mouth to begin with, but there I was, nibbling on my own shirt like a damn toddler. It was nerves! The Pacers, behind and on the back foot all night long, had pulled to within five points on a Pascal Siakam three-pointer from the corner. Shai Gilgeous-Alexander, for once not doing the heaviest lifting for Oklahoma City's offense, used a screen from Kenrich Williams, of all people, to engineer a switch onto Bennedict Mathurin, a confident and well-meaning third guard who sometimes defends as if awoken mid-possession from a happy food dream. Indiana just gave away the switch, man. A Finals team schemes and charts and toils away at the grueling w…",
          "link": "https://defector.com/the-thunder-are-sharpening-their-knives",
          "publishedOn": "2025-06-17T13:07:45.000Z",
          "wordCount": 12290,
          "title": "The Thunder Are Sharpening Their Knives",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-2220487614.jpg"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=856904",
          "author": "Darragh McDonald",
          "description": "The latest episode of the MLB Trade Rumors Podcast is now live on Spotify, Apple Podcasts, and wherever you get your podcasts! Make sure you subscribe as well! You can also use the player at this link to listen, if you don’t use Spotify or Apple for podcasts. This week, host Darragh McDonald is joined by Anthony Franco of…",
          "link": "https://www.mlbtraderumors.com/2025/06/mlbtr-podcast-the-braves-say-they-wont-sell-jeimer-candelario-dfad-and-injured-d-backs.html",
          "publishedOn": "2025-06-25T14:48:40.000Z",
          "wordCount": 3362,
          "title": "MLBTR Podcast: The Braves Say They Won’t Sell, Jeimer Candelario DFA’d, And Injured D-Backs",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/05/USATSI_23293408-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=856839",
          "author": "Darragh McDonald",
          "description": "Longtime infielder/outfielder Whit Merrifield has announced his retirement, via his agency at Warner Sports Management. “Hey guys,” Merrifield says, “You all should know that I decided a while back to retire. When it came down to it, it was an easy decision. Many factors played a role in my decision, but the main one was…",
          "link": "https://www.mlbtraderumors.com/2025/06/whit-merrifield-announces-retirement.html",
          "publishedOn": "2025-06-24T21:55:38.000Z",
          "wordCount": 4046,
          "title": "Whit Merrifield Announces Retirement",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2021/07/whitmerrifield-2021-1024x660.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=856739",
          "author": "Darragh McDonald",
          "description": "The Royals announced today that right-hander Kyle Wright has been reinstated from the 15-day injured list and optioned to Triple-A Omaha. He had been pitching on a rehab assignment but the club has decided to have him stick in the minors a while longer, as opposed to adding him to the big league roster. As…",
          "link": "https://www.mlbtraderumors.com/2025/06/royals-option-kyle-wright.html",
          "publishedOn": "2025-06-23T21:52:19.000Z",
          "wordCount": 3849,
          "title": "Royals Option Kyle Wright",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/06/Kyle_Wright_Royals-copy-scaled-e1750712978353-1024x653.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=856652",
          "author": "Nick Deeds",
          "description": "While days off and postponements leave each clubs around the league without a uniform number of games played, one of the games in this week’s slate will represent the halfway point in the season for every team across MLB. With an MVP set to be crowned in both leagues after the season, that means two…",
          "link": "https://www.mlbtraderumors.com/2025/06/poll-al-mvp-race-check-in.html",
          "publishedOn": "2025-06-23T20:55:24.000Z",
          "wordCount": 5553,
          "title": "Poll: AL MVP Race Check-In",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/11/Aaron_Judge_Yankees-copy-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=856242",
          "author": "Darragh McDonald",
          "description": "Royals left-hander Cole Ragans went on the 15-day injured list due to a rotator cuff strain on June 11th, retroactive to June 8th. It was reported shortly thereafter that he would be getting a second opinion on his shoulder. Anne Rogers of MLB.com reports that the second opinion confirmed the rotator cuff strain, with a…",
          "link": "https://www.mlbtraderumors.com/2025/06/latest-on-cole-ragans.html",
          "publishedOn": "2025-06-19T22:02:42.000Z",
          "wordCount": 3553,
          "title": "Latest On Cole Ragans",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/06/USATSI_26100547-1024x639.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=856120",
          "author": "Steve Adams",
          "description": "Rich Hill is still cruising along at 45 years young, biding his time in the minor leagues with the Royals while waiting for a big league opportunity. The southpaw recently passed on a June 15 opt-out date in his minor league arrangement with Kansas City, Robert Murray of FanSided reports, but that doesn’t necessarily mean…",
          "link": "https://www.mlbtraderumors.com/2025/06/rich-hill-rumors-royals-opt-out-clause.html",
          "publishedOn": "2025-06-18T16:26:49.000Z",
          "wordCount": 4300,
          "title": "Latest On Rich Hill, Royals",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/01/rich-hill-pitching-1024x683.jpg"
        }
      ]
    },
    {
      "title": "Flaming Hydra",
      "feedUrl": "https://flaminghydra.com/rss/",
      "siteUrl": "https://flaminghydra.com/",
      "articles": [
        {
          "id": "685c4f4ce9904f00019707c5",
          "author": "The Editors",
          "description": "Laurie Woolever talks with Michael Shaikh, author of 'The Last Sweet Bite'",
          "link": "https://flaminghydra.com/issue-348/",
          "publishedOn": "2025-06-25T23:13:45.000Z",
          "wordCount": 719,
          "title": "Fugitive food",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/cooking-1.jpg"
        },
        {
          "id": "685c08e4e9904f0001970679",
          "author": "Laurie Woolever",
          "description": "A conversation with Michael Shaikh",
          "link": "https://flaminghydra.com/cooking-to-survive/",
          "publishedOn": "2025-06-25T23:13:30.000Z",
          "wordCount": 682,
          "title": "Cooking to Survive",
          "imageUrl": "https://flaminghydra.com/content/images/2025/06/cooking-edit.jpg"
        },
        {
          "id": "685af870e9904f000196f107",
          "author": "The Editors",
          "description": "David Moore visits a DIY data market",
          "link": "https://flaminghydra.com/issue-347/",
          "publishedOn": "2025-06-24T23:58:11.000Z",
          "wordCount": 334,
          "title": "Personal data",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/papaya-1.jpg"
        },
        {
          "id": "685ac9253bb39300017f8db6",
          "author": "David Moore",
          "description": "Above the near-deserted streets of Manhattan’s Financial District, one Sunday a few weeks back, a market was held high in a tower office building; but instead of buying artisanal butter or fresh-cut flowers, visitors could buy, and make, art derived from homegrown datasets. \nAt one table, collaborators",
          "link": "https://flaminghydra.com/the-internet-you-make/",
          "publishedOn": "2025-06-24T23:57:22.000Z",
          "wordCount": 515,
          "title": "The Internet You Make",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/papaya.jpg"
        },
        {
          "id": "685b2a94e9904f000196f1f4",
          "author": "The Editors",
          "description": "PLAY the word game just for Flaming Hydra subscribers. \nSubscribe to Flaming Hydra to play HYDRANYM! It's bizarrely fun, plus you get to read the newsletter each weekday AND participate in the Comments Section, whoohooo!\n\nTHE RULES\nCreate an ENTERTAINING and APT acronym from the letters provided. Use",
          "link": "https://flaminghydra.com/hydranym-no-5/",
          "publishedOn": "2025-06-24T23:56:46.000Z",
          "wordCount": 543,
          "title": "HYDRANYM No. 5",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/HYDRANYM-12.jpg"
        },
        {
          "id": "6840c47130ca9b00011015e3",
          "author": "Luke O'Neil",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/the-little-vacuum-hose/",
          "publishedOn": "2025-06-24T00:06:19.000Z",
          "wordCount": 329,
          "title": "The little vacuum hose",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/luke1.jpg"
        },
        {
          "id": "68595e4c2be0680001c60ce2",
          "author": "The Editors",
          "description": "Kọ́lá Túbọ̀sún on Minnesota, a land of contrasts; new fiction from Luke O’Neil",
          "link": "https://flaminghydra.com/issue-346/",
          "publishedOn": "2025-06-24T00:04:40.000Z",
          "wordCount": 370,
          "title": "Lake effect / Wreck yourself",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/timwalz-1.jpg"
        },
        {
          "id": "685999932be0680001c60d67",
          "author": "Kọ́lá Túbọ̀sún",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/minnesota-vice/",
          "publishedOn": "2025-06-24T00:01:04.000Z",
          "wordCount": 333,
          "title": "Minnesota Vice",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/timwalz.jpg"
        },
        {
          "id": "6855cc3e2be0680001c5f531",
          "author": "The Editors",
          "description": "John Saward on 'Jaws' at 50",
          "link": "https://flaminghydra.com/issue-345/",
          "publishedOn": "2025-06-20T23:16:57.000Z",
          "wordCount": 339,
          "title": "Entertainment with teeth",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/shaw2-2.jpg"
        },
        {
          "id": "6855cafa2be0680001c5f513",
          "author": "John Saward",
          "description": "'Jaws' at 50",
          "link": "https://flaminghydra.com/dread-in-the-water/",
          "publishedOn": "2025-06-20T23:14:45.000Z",
          "wordCount": 342,
          "title": "Dread in the Water",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/shaw2-1.jpg"
        },
        {
          "id": "685481db3ee0000001eee0a2",
          "author": "The Editors",
          "description": "Tod Seelie photographs No Kings in Los Angeles",
          "link": "https://flaminghydra.com/issue-344/",
          "publishedOn": "2025-06-20T00:07:00.000Z",
          "wordCount": 656,
          "title": "Show of strength",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/No-Kings-Day-Protest-Tod-Seelie-9-2.jpg"
        },
        {
          "id": "685476e73ee0000001eee069",
          "author": "Tod Seelie",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/no-kings-los-angeles/",
          "publishedOn": "2025-06-20T00:05:39.000Z",
          "wordCount": 327,
          "title": "No Kings: Los Angeles",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/No-Kings-Day-Protest-Tod-Seelie-9-1.jpg"
        },
        {
          "id": "68548b683ee0000001eee0f0",
          "author": "The Editors",
          "description": "Friends, please enjoy this learned and amusing selection of entries from which to choose your champion.\nJoin in by subscribing! It’s fun, and you will also receive our glorious email newsletter each weekday AND support press freedom.\nTHE RULES\nPlayers create an ENTERTAINING and APT acronym from the",
          "link": "https://flaminghydra.com/hydranym-no-4-vote/",
          "publishedOn": "2025-06-20T00:00:30.000Z",
          "wordCount": 545,
          "title": "HYDRANYM No. 4: Vote!",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/HYDRANYM-11.jpg"
        },
        {
          "id": "6853542ab09b580001e1941e",
          "author": "Jídé Salawu",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/driving-tests/",
          "publishedOn": "2025-06-19T02:06:28.000Z",
          "wordCount": 323,
          "title": "Driving Tests",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/ZEBRA-CROSSING-16x9.png"
        },
        {
          "id": "68534badb09b580001e19398",
          "author": "The Editors",
          "description": "Trevor Alixopulos greets the sunrise, and Jídé Salawu gets behind the wheel",
          "link": "https://flaminghydra.com/issue-343/",
          "publishedOn": "2025-06-19T02:03:59.000Z",
          "wordCount": 348,
          "title": "Hang time / Road rules",
          "imageUrl": "https://flaminghydra.com/content/images/2025/06/muddlethumb-1-.png"
        },
        {
          "id": "685346c6b09b580001e19341",
          "author": "Trevor Alixopulos",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/muddle-in-the-middle/",
          "publishedOn": "2025-06-19T02:03:14.000Z",
          "wordCount": 324,
          "title": "Muddle in the Middle",
          "imageUrl": "https://flaminghydra.com/content/images/2025/06/muddlethumb.png"
        },
        {
          "id": "6851ecf1b09b580001e175e0",
          "author": "The Editors",
          "description": "Zach Rabiroff and Josephine Riesman on a tormented, forgotten genius at Marvel Comics",
          "link": "https://flaminghydra.com/issue-342/",
          "publishedOn": "2025-06-18T02:19:28.000Z",
          "wordCount": 681,
          "title": "Peter Parker papers",
          "imageUrl": "https://flaminghydra.com/content/images/2025/06/face-it-tiger-16x9-1.png"
        },
        {
          "id": "6851da1fb09b580001e17543",
          "author": "Zach Rabiroff",
          "description": "The best-kept secret in the history of Marvel Comics was in high dudgeon by the time he sat down at his typewriter. It was a July afternoon in 1971, and Ron Whyte, a playwright and activist, was about to hammer out an ill-advised letter. Truth be told, there may have",
          "link": "https://flaminghydra.com/a-swingin-surprise-or-two/",
          "publishedOn": "2025-06-18T02:18:06.000Z",
          "wordCount": 713,
          "title": "A Swingin’ Surprise or Two",
          "imageUrl": "https://flaminghydra.com/content/images/2025/06/face-it-tiger-16x9.png"
        },
        {
          "id": "6851df0bb09b580001e1759e",
          "author": "The Editors",
          "description": "PLAY the word game just for Flaming Hydra subscribers.\nSubscribe to Flaming Hydra to play HYDRANYM! It's bizarrely fun, plus you get to read the newsletter each weekday AND participate in the Comments Section?! Heck yes.\n\nTHE RULES\nCreate an ENTERTAINING and APT acronym from the letters provided.",
          "link": "https://flaminghydra.com/hydranym-no-4/",
          "publishedOn": "2025-06-18T02:15:56.000Z",
          "wordCount": 547,
          "title": "HYDRANYM No. 4",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/06/HYDRANYM-8.jpg"
        }
      ]
    },
    {
      "title": "Today in Tabs",
      "feedUrl": "https://rss.beehiiv.com/feeds/ZRiesnGI0u.xml",
      "siteUrl": "https://www.todayintabs.com/",
      "articles": [
        {
          "id": "https://www.todayintabs.com/p/completely-gunked-up-with-cortisol-c288",
          "author": "Rusty Foster",
          "description": "Two prototype thnickels in my hand.",
          "link": "https://www.todayintabs.com/p/completely-gunked-up-with-cortisol-c288",
          "publishedOn": "2025-06-24T20:00:45.000Z",
          "wordCount": 9536,
          "title": "Completely Gunked Up With Cortisol",
          "enclosure": {
            "url": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/e1b5807a-1ad5-4cde-82cf-669edfcc51ce/labubu-1750346198-1000x1500.jpg",
            "length": "177750",
            "type": "image/jpeg"
          },
          "imageUrl": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/e1b5807a-1ad5-4cde-82cf-669edfcc51ce/labubu-1750346198-1000x1500.jpg"
        }
      ]
    },
    {
      "title": "Bad Faith Times",
      "feedUrl": "https://bad-faith-times.ghost.io/rss/",
      "siteUrl": "https://badfaithtimes.com/",
      "articles": [
        {
          "id": "685d45eed663ab0001f832e2",
          "author": "Denny Carter",
          "description": "\"Democrats who promise policy initiatives but don’t discuss court reform are living in a land of make believe.\"",
          "link": "https://badfaithtimes.com/this-u-s-senate-candidate-wants-to-fix-the-rogue-supreme-court/",
          "publishedOn": "2025-06-26T14:43:41.000Z",
          "wordCount": 1889,
          "title": "This U.S. Senate Candidate Wants To Fix The Rogue Supreme Court",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/06/Screenshot-2025-06-26-at-10.31.09---AM-1.png"
        },
        {
          "id": "6859906f4380030001a5f4aa",
          "author": "Denny Carter",
          "description": "Curtis Yarvin refuses to say what he means.",
          "link": "https://badfaithtimes.com/bft-podcast-americas-leading-monarchist-seems-unwell/",
          "publishedOn": "2025-06-24T11:59:46.000Z",
          "wordCount": 511,
          "title": "BFT Podcast: America's Leading Monarchist Seems Unwell",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/06/Screenshot-2025-06-23-at-2.07.49---PM.png"
        },
        {
          "id": "685980734380030001a5eef0",
          "author": "Denny Carter",
          "description": "Being an asshole is a choice.",
          "link": "https://badfaithtimes.com/self-censorship-is-actually-good/",
          "publishedOn": "2025-06-23T17:19:08.000Z",
          "wordCount": 2603,
          "title": "Self Censorship Is Actually Good",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/06/Screenshot-2025-06-23-at-1.15.04---PM.png"
        },
        {
          "id": "68541004d8dd090001a14dc3",
          "author": "Denny Carter",
          "description": "Anti-democracy forces know they will lose. For now, they're coping.",
          "link": "https://badfaithtimes.com/monarchy-is-not-on-the-menu/",
          "publishedOn": "2025-06-19T16:16:00.000Z",
          "wordCount": 2028,
          "title": "Monarchy Is Not On The Menu",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/06/245375.png"
        },
        {
          "id": "6852c7656b68f90001a5d11c",
          "author": "Travis Wright",
          "description": "The insurrectionist senator is upset about courts getting in the way of all-out authoritarianism.",
          "link": "https://badfaithtimes.com/josh-hawley-is-against-court-injunctions-unless-hes-not/",
          "publishedOn": "2025-06-18T14:51:38.000Z",
          "wordCount": 1667,
          "title": "Josh Hawley Is Against Court Injunctions Unless He's Not",
          "imageUrl": "https://badfaithtimes.com/content/images/size/w1200/2025/06/Screenshot-2025-06-18-at-10.49.28---AM.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}