{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": [
        {
          "id": "https://blogs.fangraphs.com/?p=468145",
          "author": "Michael Baumann",
          "description": "If you're giving up nothing to upgrade a position of weakness, make sure you're actually upgrading the position and actually giving up nothing.",
          "link": "https://blogs.fangraphs.com/trade-season-comes-in-like-a-lamb/",
          "publishedOn": "2025-07-17T13:00:05.000Z",
          "wordCount": null,
          "title": "Trade Season Comes in Like a Lamb",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://blogs.fangraphs.com/?p=467973",
          "author": "Jay Jaffe",
          "description": "Several contending teams are having some trouble up the middle.",
          "link": "https://blogs.fangraphs.com/the-2025-replacement-level-killers-catcher-second-base/",
          "publishedOn": "2025-07-14T15:25:24.000Z",
          "wordCount": null,
          "title": "The 2025 Replacement-Level Killers: Catcher & Second Base",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://blogs.fangraphs.com/?p=467789",
          "author": "Ben Clemens",
          "description": "Young power threats, inside-the-park chaos, and overly optimistic baserunning.",
          "link": "https://blogs.fangraphs.com/five-things-i-liked-or-didnt-like-this-week-july-11/",
          "publishedOn": "2025-07-11T13:00:50.000Z",
          "wordCount": null,
          "title": "Five Things I Liked (Or Didn’t Like) This Week, July 11",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=195825",
          "author": "Lauren Theisen",
          "description": "For Bill Guerin, who's been GM of the Minnesota Wild since 2019, the beginning of this month must have felt like finally taking off an extremely tight pair of pants after a very long day. As a consequence of the team buying out both Zach Parise and Ryan Suter, they were stifled by three years of salary cap weight totaling over $10 million annually. That burden severely limited the Wild's ability to build around superstar winger Kirill Kaprizov, particularly in a 2023–24 campaign where his 46 goals went to waste without even a playoff appearance. Now, however, the impact of the Parise and Suter contracts is negligible on Minnesota's finances, so Guerin is free to do deals without those 30x30 skinny jeans crushing his waist. The results? Well, actually, not that much so far.\nThe one thing you need to know, if you want to know anything about the Minnesota Wild, is that they are the most \"slightly above average\" franchise in the history of the NHL. Dating back to 2013, they have missed the postseason only twice. But in that time, they have won exactly two playoff series, and none since 2015. Their regular seasons are usually pretty solid, but time and again they get walloped in a best-of-seven. By the time trophies are being polished, nobody anywhere is thinking about the Wild.",
          "link": "https://defector.com/the-wilds-offseason-has-been-pretty-tame",
          "publishedOn": "2025-07-17T16:10:00.000Z",
          "wordCount": 7404,
          "title": "The Wild’s Offseason Has Been Pretty Tame",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-13304130521.jpg"
        },
        {
          "id": "https://defector.com/?p=195534",
          "author": "Israel Daramola",
          "description": "Let's face it, we have been living through a pop cultural age—particularly in cinema—made in Quentin Tarantino's image. Before Marvel, before George Lucas sold Star Wars to Disney, Tarantino made nerd culture mainstream, showing that a movie- and culture-obsessed kid could bring that obsession to life in their own art, to great success.\nTarantino wasn't the only one, of course. He was part of a generation of auteurs who were the right age to have grown up watching TV their whole lives, who made post-modernist art that seemed to be just as much a commentary on the things they consumed as they were new and unique works in their own right. Tarantino was just the first one to hit the jackpot, emerging in the early '90s with a showy directorial debut Reservoir Dogs and two buzzy scripts eventually adapted by big-name filmmakers Tony Scott and Oliver Stone. Then in 1994 he cemented his place at the front of this new wave with Pulp Fiction, one of the finest independent films of the decade, a cultural earthquake that is still felt to this day.",
          "link": "https://defector.com/how-kill-bill-changed-the-action-blockbuster",
          "publishedOn": "2025-07-17T15:45:42.000Z",
          "wordCount": 10754,
          "title": "How ‘Kill Bill’ Changed The Action Blockbuster",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/AAAABUpPogGMpXf1Uylknch49JzYJTrH-HZJhIa7SlTSVfBV9Ao7zx4h3eXfrX49XBOkUY1f4uADMCakQG9GaQy8Cb7ERO0FWw7Aebx8.jpg"
        },
        {
          "id": "https://defector.com/?p=195493",
          "author": "Phillip Maciak",
          "description": "This post was originally published on the author's Substack on June 24. It has been republished here in conjunction with Bills Week. \nEverybody knows about the MAGA hat. It’s red. It says what it says on it. The content of the MAGA hat is obvious. It’s a team hat, a cult uniform, a panting, sniveling dare for you to say something about it. It is, for better or worse, iconic at this point, the single image or object that exemplifies this movement, the illustration that will appear in future history books so long as Elon Musk hasn’t had Grok “rewrite the entire corpus of human knowledge” by then. But its iconicity is not just limited to its color and its catchphrase. The FORM of this hat matters, in part because it’s such a telling one.",
          "link": "https://defector.com/cultural-capitulation",
          "publishedOn": "2025-07-17T15:19:25.000Z",
          "wordCount": 10558,
          "title": "Cultural Capitulation",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2221647538.jpg"
        },
        {
          "id": "https://defector.com/?p=195882",
          "author": "Lauren Theisen",
          "description": "You oughta know by now: This is Defector Music Club, where a number of our writers get together to dish about an album. Today, in honor of Bills Week, Dave McKenna, David Roth, and Lauren Theisen debate Billy Joel's 1977 smash The Stranger.\nMcKenna: Stunning how few rock and roll Bills are out there! But Lauren’s suggestion that we take up Billy Joel and The Stranger took me back. Everything takes me back at this age, sure, but this record hit the bins at the end of the Summer of 1977, which I spent with my cousins in Astoria, Queens, when my feelings for Billy Joel were their fondest. I was into guitars and dirtball rock. The only keyboard guys I gave my time to were bombastic longhair prog rockers with walls of organs and synths, like Rick Wakeman of Yes or Keith Emerson of Emerson, Lake and Palmer. (This nostalgia wave got me to dig out the Yes belt buckle I bought on Steinway Street in Astoria for $5 that summer.)",
          "link": "https://defector.com/you-should-never-argue-with-a-crazy-m-m-music-club",
          "publishedOn": "2025-07-17T14:27:03.000Z",
          "wordCount": 12746,
          "title": "You Should Never Argue With A Crazy M-M-Music Club",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-5766254461.jpg"
        },
        {
          "id": "https://defector.com/?p=195592",
          "author": "Billy Haisley",
          "description": "To call it a \"pleasant surprise\" wouldn't quite be right. As someone with an abiding interest in the colorful names and nicknames of Brazilian athletes—my all-time favorite remains that of Leandro Matos Souza, who went by \"Gatorade\"—I had a hunch that a particular theme week–inspired Google search would turn up the result I was hoping for. So, while certainly pleasant, it was hardly surprising that typing \"bill footballer\" into my search bar brought me to not one, but two mononymous Brazilian Bills.\nThough I'm sure the player Wikipedia designates \"Bill (footballer, 1999)\" has an interesting story of his own, today we are going to focus on the life and times of one Rosimar Amâncio, the better known of the two Bills. Our chosen Bill is a 41-year-old striker who has traversed the globe in one of those far-flung journeyman careers that are pretty unique to a certain class of Brazilian player. Brazil not only produces more professional-caliber soccer players than any other country, but the nationality itself, with its redolence of jogo bonito and World Cup wins and flashy tricks and Pelé and Romário and Ronaldinho and Neymar and the like, means that the Brazilian player is highly coveted globally both for what they can do and for what they represent. Couple that with the Brazilian economy, which is relatively advanced but nevertheless struggles to provide a comfortable living for its entire population, and you can understand why it's so common to find a handful of Portuguese names on the rosters of tertiary soccer leagues the world over.",
          "link": "https://defector.com/the-inspiring-soccer-odyssey-of-the-man-they-call-bill",
          "publishedOn": "2025-07-17T13:56:04.000Z",
          "wordCount": 11242,
          "title": "The Inspiring Soccer Odyssey Of The Man They Call Bill",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1238237416.jpg"
        },
        {
          "id": "https://defector.com/?p=195785",
          "author": "Victoria Zeller",
          "description": "The Buffalo Bills of my childhood are not the Buffalo Bills I live with now. They are certainly not the Buffalo Bills I’ve written about before on this website.\nIt’s weird to think about in retrospect. The Bills went from clockwork ineptitude to clockwork competence with only a handful of transition years in the middle, from the team I finally saw suit up for a playoff game when I was 19 years old to the team that has won five division titles in a row. From the basement to the top of the league.",
          "link": "https://defector.com/lets-remember-some-bills",
          "publishedOn": "2025-07-17T13:01:06.000Z",
          "wordCount": 14488,
          "title": "Let’s Remember Some Bills",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-455454810.jpg"
        },
        {
          "id": "https://defector.com/?p=195791",
          "author": "Defector Staff",
          "description": "Keen observers of the independent media space might be aware that we at Defector have done some informal consulting over the years to help other emerging worker-owned publications find their footing. Without overstating our contributions to their efforts—generally we’re providing just an hour or two on the phone, and a couple email responses—we always find […]",
          "link": "https://defector.com/we-won-a-grant",
          "publishedOn": "2025-07-16T18:38:58.000Z",
          "wordCount": 5679,
          "title": "We Won A Grant",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/Press_Forward_Logo_Stacked_Blue.png"
        },
        {
          "id": "https://defector.com/?p=195796",
          "author": "Patrick Redford",
          "description": "TOULOUSE, France — They were going to make it. After working with three riders all day, staving off the pursuit of five others, and eventually holding off the determined charge of a former world champion, Uno-X's Jonas Abrahamsen and Jayco's Mauro Schmid rode into Toulouse together to contest Stage 11 of the Tour de France. One of them was going to earn their first career Tour de France stage win. The other would leave with nothing. All I knew as I saw the pair wind up for the sprint was: I was going to talk to the loser.\nBreakaways succeed only rarely and only for reasons that are legible in retrospect. You need to be a strong rider to win from a breakaway, but more than that you need to be a good gambler, which is code for: blessed by divine providence. Moves off the front of a race only succeed when the strongest teams decide against expending the energy necessary to chase them down or, in quite rare cases, do some gambling of their own and leave the chasing too late. Chasing everything down is usually worth the best teams' while, so many breaks are by their nature doomed. That makes the ones that work extra precious.",
          "link": "https://defector.com/what-its-like-to-lose-from-the-winning-move",
          "publishedOn": "2025-07-16T18:20:01.000Z",
          "wordCount": 9235,
          "title": "What It’s Like To Lose From The Winning Move",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/abrahamsenschmid.jpeg"
        },
        {
          "id": "https://defector.com/?p=195767",
          "author": "Albert Burneko",
          "description": "Here at Defector we are laser focused on serving readers Bill and everything related to Bill. At first I had a hard time with this mandate—I could not think of anything \"newsy\" related to Bill—until I remembered that in the 1979 television miniseries Salem's Lot there is a scene in which a guy yells \"Bill!\" a bunch of times. What could be more salient to the interests of Defector readers than that, I ask you—nothing!\n\nhttps://www.youtube.com/watch?v=hc_mUIkiDX4",
          "link": "https://defector.com/bill",
          "publishedOn": "2025-07-16T17:17:26.000Z",
          "wordCount": 9646,
          "title": "Bill!",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/bill2.jpeg"
        },
        {
          "id": "https://defector.com/?p=195781",
          "author": "Ray Ratto",
          "description": "Nobody does self-loathing quite like baseball, so it comes as little surprise that its governing body has yet again veered away fearfully yet violently from its essential product, so it can avoid doing more of the thing it purports to celebrate. There is nothing sacred about the All-Star Game, and nothing really to mourn about the fact that a game that was tied after nine innings didn’t proceed to the tenth. But the fact remains that the Most Valuable Player in Tuesday night's exhibition officially went 0-for-2 with a walk during that game, and that the box score does not in any way reflect the only thing about that game that people are discussing today.\nIndeed, that very box score reflects the historical, artistic and essentially pastoral nature of the same with these famous and memory-invoking stars:",
          "link": "https://defector.com/the-all-star-games-confusing-ending-fit-the-bill-for-a-confused-league",
          "publishedOn": "2025-07-16T16:56:40.000Z",
          "wordCount": 8550,
          "title": "The All-Star Game’s Confusing Ending Fit The Bill For A Confused League",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2224660049.jpg"
        },
        {
          "id": "https://defector.com/?p=195473",
          "author": "Defector Staff",
          "description": "We are forced once again to interrupt Bills Week in order to bring an important matter to your attention: Defector is adding the Nothing But Respect basketball podcast to its robust and ever-growing portfolio of media offerings. For those of you who are not familiar with Nothing But Respect, it is a weekly basketball podcast […]",
          "link": "https://defector.com/in-paradigm-shifting-business-maneuver-defector-acquires-basketball-podcast",
          "publishedOn": "2025-07-16T16:35:40.000Z",
          "wordCount": 5691,
          "title": "In Paradigm-Shifting Business Maneuver, Defector Acquires Basketball Podcast",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/nbrring.png"
        },
        {
          "id": "https://defector.com/?p=195765",
          "author": "Drew Magary",
          "description": "The Buffalo Bills open training camp a week from today and running back James Cook isn’t happy. A year ago, Cook flourished when new offensive coordinator Joe Brady introduced the team to the concept of handing the ball off. Now Cook would like to be compensated for his services before he falls off the running back cliff, just as his brother Dalvin did in 2023. James Cook is no dummy. He wants his money while he can still get it.\nFor other teams, this would be fairly garden-variety standoff that results in a camp hold-in before both sides agree to a deal sometime in August. But this is Buffalo, where any ripple in the waves causes Bills fan to have Bills fan thoughts. You never want to have Bills fan thoughts. A minor contract dispute with the RB1 begets thoughts about the rest of the team’s backfield depth, which begets thoughts about Josh Allen running the ball himself far too often, which begets thoughts about the passing game, which begets DEAR CHRIST WILL WE EVER WIN A SUPER BOWL OR DID I STICK AROUND THIS FROZEN WASTELAND MY WHOLE LIFE FOR NOTHING?",
          "link": "https://defector.com/who-the-fuck-is-josh-allen-gonna-give-the-ball-to",
          "publishedOn": "2025-07-16T16:20:47.000Z",
          "wordCount": null,
          "title": "Who The Fuck Is Josh Allen Gonna Give The Ball To?",
          "imageUrl": null
        },
        {
          "id": "https://defector.com/?p=195485",
          "author": "Luis Paez-Pumar",
          "description": "For a series with little by way of story, it's impressive how many iconic non-player characters Pokémon has spawned. There is of course Professor Oak, who sets the player on their path to be a master trainer in the original games, as well as Brock and Misty, gym leaders who grew to be fan favorites in the anime series. And who can forget Blue a.k.a. Gary, the rapscallion first rival in Generation One? These are just a few of the endearing NPCs who have left a mark on both the series and popular culture across the series' nine generations of games. (There's also Hop, from Generation Eight, who is very annoying.) However, my favorite NPC is also, in my opinion, the most helpful: Bill, the Pokémon Maniac from Red, Blue, and Yellow.\nWhen the player first meets Bill at his house at the Cerulean Cape, near the second gym, he is not human. Bill, a Pokémon obsessive who is also something of a mad scientist, has seen a Pokémon teleportation experiment of his backfire, which has physically combined him with one. The player helps get Bill fixed up, and it's all cute and silly. What is not silly is what Bill does for the player, giving them access to the Pokémon storage system, afterwards known as \"Bill's PC.\"",
          "link": "https://defector.com/an-ode-to-bill-the-pokemon-maniac",
          "publishedOn": "2025-07-16T15:48:29.000Z",
          "wordCount": null,
          "title": "An Ode To Bill, The Pokémon Maniac",
          "imageUrl": null
        },
        {
          "id": "https://defector.com/?p=195308",
          "author": "Alex Sujong Laughlin",
          "description": "We interrupt Bills Week to bring you some good news: Defector is launching two new podcasts in partnership with Radiotopia!  When Kelsey and I handed off Normal Gossip to Rachelle and Se’era in December, people asked what was next, and we said “:) I don’t know yet :)” but that was a lie—at least on […]",
          "link": "https://defector.com/try-hard-only-if-you-get-caught-defector-podcasts",
          "publishedOn": "2025-07-16T14:51:42.000Z",
          "wordCount": null,
          "title": "Defector Is Launching New Podcasts",
          "imageUrl": null
        },
        {
          "id": "https://defector.com/?p=194954",
          "author": "Barry Petchesky",
          "description": "Let's rank bird bills, from best bill to least-best bill.\n1 (TIED): Toucan",
          "link": "https://defector.com/bill-shapes-ranked",
          "publishedOn": "2025-07-16T14:19:29.000Z",
          "wordCount": null,
          "title": "Bill Shapes, Ranked",
          "imageUrl": null
        },
        {
          "id": "https://defector.com/?p=195525",
          "author": "Lauren Theisen",
          "description": "When Major League Baseball announced the roster for the 2025 All-Star Game, it was no surprise to see William \"Will\" \"Bill\" Smith listed as the starting catcher for the National League. The backstop has been tremendous for the Dodgers since he debuted in 2019, and this season is on track to be his own personal best. Showing sturdy power, savvy plate discipline, and a sweet swing, Bill was apparently tired of hearing people say he \"hits well for a catcher.\" Among NL batters, Bill is leading the field in average and on-base percentage, and his OPS is second only to his L.A. teammate Shohei Ohtani.\nSaid fellow Dodger Freddie Freeman, “People are gonna tune into the All-Star Game, they’ll throw his numbers up on the TV, and they’re gonna be like, ‘Whoa, that’s a really good season.’”",
          "link": "https://defector.com/how-did-will-bill-smith-do-at-the-mlb-all-star-game",
          "publishedOn": "2025-07-16T13:40:08.000Z",
          "wordCount": null,
          "title": "How Did Will “Bill” Smith Do At The MLB All-Star Game?",
          "imageUrl": null
        },
        {
          "id": "https://defector.com/?p=195229",
          "author": "Ray Ratto",
          "description": "It's been a few weeks since we heard anything salacious, greedy, stupid or just plain time-wasting from Bill Belichick, which is a surprise as well as a blessing given that he is one of those sports figures who producers and station managers never tire of churning. In short, enjoy the sounds of nature in a vacuum, because fall practice starts soon and we are about to relearn what it's like to be angry at and sick of the North Carolina Tar Heels the way we were the New England Patriots.\nBut that's no longer the standard, because as much as he wants his new job to be about football, he knows in a corner of his mind that he is actually a science experiment on the hoof. Specifically, how Old Folks America can pretend to be interested in a team just because he's there at a time when that team is in a sport that's shrinking back into a regional entertainment. It is a question of how long bankable fame actually lasts before it turns into something pejorative, or worse. It is also a test case on how long teenagers in an open market can be moved by someone who is a hero to their parents and grandparents.",
          "link": "https://defector.com/bill-belichicks-talent-is-becoming-tiresome",
          "publishedOn": "2025-07-15T18:31:03.000Z",
          "wordCount": 7266,
          "title": "Bill Belichick’s Talent Is Becoming Tiresome",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/bills-week-belichick.jpg"
        },
        {
          "id": "https://defector.com/?p=195498",
          "author": "Giri Nathan",
          "description": "Financier Bill Ackman has been widely shamed for his appearance in a professional tennis tournament last week. Since shame is no longer operative in American culture, he's continued to explain every painstaking detail of the experience in his tweets, which read like a transcript of a front-facing video filmed in a car. In the course of defending his embarrassing appearance at the Hall of Fame Open, Ackman is approaching something like performance art.\nAckman denied the charge that his doubles match at the tournament was a pay-for-play situation. \"Many also claimed that I bribed the [International Tennis Hall of Fame] for the wildcard, which is entirely untrue,\" he wrote on Sunday. \"The HOF asked me for nothing and I made no commitments to the HOF. I had in the past donated to the HOF, but had done nothing in recent years.\" When denying a bribe, it's always important to complete the terms of the bribe: Ackman announced a few paragraphs later that he would be granting the Hall of Fame a \"$10 million endowment that I will manage for free.\"",
          "link": "https://defector.com/bill-ackman-weird-sad-tennis-farce",
          "publishedOn": "2025-07-15T18:09:00.000Z",
          "wordCount": 6506,
          "title": "Bill Ackman Says He’ll Give Tennis Hall Of Fame $10 Million After His Weird, Sad Match",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2213174215.jpg"
        },
        {
          "id": "https://defector.com/?p=195429",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about the national anthem, Kevin Costner, desert island actors, action film musicals, and more.\nFinal reminder: Why Your Team Sucks returns to these fine servers next week, so get your submissions in here before I go turning off the spigot. We’ve got a lot of NFL teams to preview and a lot of sucking to cover, so don’t fuck around. Get me that hate and get it to me fast.",
          "link": "https://defector.com/and-now-a-letter-from-a-bill",
          "publishedOn": "2025-07-15T17:45:40.000Z",
          "wordCount": 17365,
          "title": "And Now, A Letter From A Bill",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-170428350.jpg"
        },
        {
          "id": "https://defector.com/?p=195438",
          "author": "Alex Sujong Laughlin",
          "description": "When I was growing up, my mother kept notebooks where she meticulously recorded every dollar our family spent. She never talked about them with me, she just left the notebooks on the kitchen table where I could see them. I would flip through the lines of expenses, horrified at the dollars and cents I’d incurred by just existing, terrified that I would bankrupt our family. \nMy parents were young and making it work on a second lieutenant's salary, so they didn’t earn much money to begin with—as the child of Korean War survivors, my mom learned to hold tight to what little she had. With her savvy budgeting, she kept me fed and clothed and even entertained. We spent countless afternoons at the library and in the children’s department of the city’s free art museum. Decades later, my family’s financial situation has improved drastically, but the years of scarcity have shaped us both. She still records her expenses in the notebooks and hides the majority of her money from herself so she won’t spend it. From her, I learned that money is a source of fear and shame.",
          "link": "https://defector.com/i-have-found-a-personal-finance-influencer-who-isnt-as-bad-as-personal-finance-influencer-sounds",
          "publishedOn": "2025-07-15T17:18:42.000Z",
          "wordCount": 8579,
          "title": "I Have Found A Personal Finance Influencer Who Isn’t As Bad As “Personal Finance Influencer” Sounds",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/Untitled-design.png"
        },
        {
          "id": "https://defector.com/?p=195170",
          "author": "Kelsey McKinney",
          "description": "One advantage I have always held in the literary arts is speed. I am a fast reader and an even faster scanner. I can draft quickly, churning out hundreds of words as if turning on a spigot. It's an advantage in the age of quantity, and the ability to write a lot all the time is one I never take for granted. But it is a blessing as often as it is a curse. What you lose with speed is often beauty, care, and intention. If I wrote as fast as my brain would prefer (at the speed of light), there would never be a good turn of phrase, and I would hate myself. But I hate myself all the same when I force myself to go slowly in order to make something beautiful and creative, because it is so hard for me to do so.\nFor a piece I really care about, I have a lot of tricks to convince my brain to slow down, and think more critically and carefully about the words in front of me. I sometimes write longhand before transcribing to the computer. To revise, I will read the sentences from bottom to top to make sure they all stand up on their own. And when I'm feeling very bogged down and uninspired by the English language, I read Shakespeare.",
          "link": "https://defector.com/shakespeare-makes-me-a-slower-and-better-reader",
          "publishedOn": "2025-07-15T15:19:00.000Z",
          "wordCount": 10812,
          "title": "Shakespeare Makes Me A Slower And Better Reader",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-929210872.jpg"
        },
        {
          "id": "https://defector.com/?p=195190",
          "author": "Lauren Theisen",
          "description": "There is no shortage of entrepreneurial Bills in New York City. A trip around town can bring you to such businesses as the diner Bill's in Ridgewood, the bike shop Bill's Cyclery in Woodside, the jazz club Bill's Place in Harlem, or Bill's Supper Club in Midtown. (There is also a Brooklyn bar called Post No Bills—a command we are vehemently disregarding this week.) But out of all the Bills in my city, I selected Bill's Wines & Liquors in Sunnyside, Queens.\nI've lived in Brooklyn for the last eight years, but I've recently been spending a lot of time in Astoria, at the northwest tip of Queens, because that's where my boyfriend lives. I can't claim that there's any grander reason why I chose Bill's Wines & Liquors over the other Bills than \"it was the closest.\" So: High marks for Bill's in convenience.",
          "link": "https://defector.com/bills-wines-liquors-the-defector-review",
          "publishedOn": "2025-07-15T14:51:00.000Z",
          "wordCount": 7926,
          "title": "Bill’s Wines & Liquors: The Defector Review",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/20250711_1255191-e1752266180791_jpg.jpg"
        },
        {
          "id": "https://defector.com/?p=195305",
          "author": "Kelsey McKinney",
          "description": "On Monday night, Major League Baseball gathered together all the big boys with their big bats from around the league to show off for us. And they did! Cal \"Big Dumper\" Raleigh showed off the most, and so he won.\nEvery year, MLB gets all these big boys with their big bats, and they line them up on national television and ask them to hit baseballs one million miles. This is cool. I like to watch this! I am in no way a Home Run Derby hater, because I think it's fun when guys who play games for a living get to play games for fun.",
          "link": "https://defector.com/all-star-week-needs-a-cool-catch-contest",
          "publishedOn": "2025-07-15T14:21:49.000Z",
          "wordCount": 7428,
          "title": "All-Star Week Needs A Cool Catch Contest",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-640131990_jpg.jpg"
        },
        {
          "id": "https://defector.com/?p=195417",
          "author": "Sabrina Imbler",
          "description": "Kathryn Xu: This weekend, my family and I went up to Lake Placid, where I saw several loons. As is the case when I see birds of note, I informed Barry Petchesky of this fact, only to discover that I was not the only Defector staffer to recently see loons and subsequently inform Barry Petchesky of the fact. What are the odds!\nSabrina Imbler: I am no statistician, but I imagine they are quite low! I spent the past month in the Adirondacks, and had no idea Kathryn also came up to the beautiful North, and the land of loons. I too saw loons on a lake and informed Barry Petchesky, because this is simply how things are done here. Barry then told me that Kathryn had also seen loons, and this is all the context you need to understand how we arrived here, in this blog. Kathryn, was this your first loon sighting? What did you know of loons before this weekend?",
          "link": "https://defector.com/fatal-battles-in-common-loons-a-subsequent-analysis",
          "publishedOn": "2025-07-15T13:44:35.000Z",
          "wordCount": 10409,
          "title": "Fatal Battles In Common Loons: A Subsequent Analysis",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-624146538_7f9438.jpg"
        },
        {
          "id": "https://defector.com/?p=195283",
          "author": "Tom Ley",
          "description": "Bill Simmons has been a part of my life for about 20 years now. As with any relationship that lasts that long, my feelings about him have evolved. At various points I've been a fan, a hater, a critic, a detached observer, and a begrudging admirer, sometimes all at once. \nI'm not alone in this. I have only recently discovered that I am part of a whole demographic of sports fans for whom Simmons occupies an odd, conflicted space in their media diet. They are dedicated listeners of his podcast, which they primarily consume in order to find things to make fun of him over, and they would be devastated if Simmons were to retire tomorrow. Thousands of these people congregate on a subreddit dedicated to Bill Simmons, where they crack jokes at his expense, maintain the lore of The Bill Simmons Podcast universe, and speak in a language that can only be understood by fellow sickos. Some of them even listen to a podcast about The Bill Simmons Podcast.",
          "link": "https://defector.com/an-interview-with-a-guy-who-hosts-a-podcast-about-the-bill-simmons-podcast",
          "publishedOn": "2025-07-15T13:00:06.000Z",
          "wordCount": 13906,
          "title": "An Interview With A Guy Who Hosts A Podcast About ‘The Bill Simmons Podcast’",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/Bill-simmons-distressed1.png"
        },
        {
          "id": "https://defector.com/?p=195421",
          "author": "Tom Ley",
          "description": "The MLB All-Star Game has unfortunately been handed over to Pat McAfee, who spent Monday kicking off the week's festivities on ESPN. What better way to get baseball fans excited about the Home Run Derby than by subjecting them to a few hours of a poached ex-punter bellowing about a sport he barely follows while he embellishes his yinzer accent?\nMcAfee had a few lowlights today. While emceeing a press conference with Tarik Skubal, Paul Skenes, Dave Roberts, and Aaron Boone, he stammered his way through an answer to some pointed questioning by Jen Ramos Eisen. He also duffed an interview with Shohei Ohtani, at one point instructing Ohtani's interpreter to provide some \"energy on the delivery\" of his question. But McAfee's most embarrassing moment was probably donning a sleeveless jersey while sucking up to MLB commissioner Rob Manfred by stumping for a salary cap:",
          "link": "https://defector.com/bill-skarsgard-nosferatu-pat-mcafee-bills-week",
          "publishedOn": "2025-07-14T21:15:46.000Z",
          "wordCount": 7331,
          "title": "Bill Skarsgard In His Nude ‘Nosferatu’ Getup Would’ve Been A Better MLB All-Star Week Host Than Pat McAfee",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/More-nude-orlok.png"
        },
        {
          "id": "https://defector.com/?p=195330",
          "author": "Billy Haisley",
          "description": "It must be said that the 2024–25 European soccer season belonged to Paris Saint-Germain. After a shaky start, which saw them come within a whisker of failing to even make it out of the forgiving league stage of the new Champions League format, the Parisiens bought a new star, found themselves, and hit their stride. Behind a well-ordered but dizzyingly, dazzlingly fluid style of play, and supernova turns from the likes of Ousmane Dembélé and Vitinha, PSG ended the season blowing away all challengers, capped off by an iconic 5–0 demolition job against Inter in the UCL final. The sumptuous play, imposing results, and the youthfulness of the roster won the team the biggest title in the club game, will likely win Dembélé the Ballon d'Or, and marked this team as a potentially era-defining one.\nAnd yet, at what I guess is the official close of that season, PSG is not the team standing in the spotlight today. Though the French club was the massive favorite to add the title of world champion to its extended list of accolades in Sunday's Club World Cup final, it was actually Chelsea that wound up lifting the trophy by doing what PSG had made its calling card over the last seven months: going up against a great team and beating the hell out of them.",
          "link": "https://defector.com/cole-palmer-demolished-a-bill-less-psg-and-the-rest-is-history",
          "publishedOn": "2025-07-14T20:47:27.000Z",
          "wordCount": 10701,
          "title": "Cole Palmer Demolished A Bill-Less PSG, And The Rest Is History",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2225072549.jpg"
        },
        {
          "id": "https://defector.com/?p=195389",
          "author": "Dave McKenna",
          "description": "Whatever the Thrilla in Manila was, this wasn't that. Katie Taylor and Amanda Serrano, who previously gave the world two of the greatest fights in recent memory, delivered a comparative stinker while capping off their trilogy atop the bill of the first all-women’s professional boxing card on Friday at the sweet science's holiest room, Madison Square Garden.\nTaylor, in what could be the final bout of her incredible career, took a majority decision over Serrano after 10 mostly lackluster two-minute rounds. Judge Mark Lyson scored the fight a 95-95 draw, while Steve Weisfeld and Nicolas Esnault both had Taylor winning easily, 97-93. With the win, Taylor holds onto her undisputed super-lightweight championship.",
          "link": "https://defector.com/taylor-serrano-iii-couldnt-live-up-to-its-historic-billing",
          "publishedOn": "2025-07-14T18:40:14.000Z",
          "wordCount": 8511,
          "title": "Taylor–Serrano III Couldn’t Live Up To Its Historic Billing",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2224081963.jpg"
        },
        {
          "id": "https://defector.com/?p=194834",
          "author": "Barry Petchesky",
          "description": "For all its miracles, the internet has had some drawbacks. Before the internet, people generally had more friends, and more lasting relationships; they went outside more, and were more physically active; the fighting weight of the average cultural product was a little higher. I don't really care about all that unimportant stuff, though. The thing that was most obviously more enjoyable before the internet could tell you everything about everything was pro wrestling. \nI know some people enjoy the backstage stuff as its own soap opera, and more power to them. In what is no way a pathetic nostalgic yearning for the simplicity of childhood, I preferred when angles didn't carry a second, meta element, when watching wrestling didn't require knowing all about the workplace politics that went into its booking. I miss not knowing who a guy was, because then he could be anything. If the current industry is better in many ways, it could never give us a push like Bill Goldberg's.",
          "link": "https://defector.com/bill-goldberg-was-a-star-from-day-1",
          "publishedOn": "2025-07-14T16:30:02.000Z",
          "wordCount": 9882,
          "title": "Bill Goldberg Was A Star From Day 1",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-628271852.jpg"
        },
        {
          "id": "https://defector.com/?p=195259",
          "author": "Barry Petchesky",
          "description": "The Space Shuttle drips romance. Representing nearly a half-century of human spaceflight—from its conception in 1968, even before the Moon landing, until its retirement in 2011—its design and even its name capture a hope that space travel would one day be commonplace. That before long, the first step to heading to the Moon or Mars would be as workaday as boarding a shuttle for a quick jaunt to low Earth orbit. It proved a beautiful, flawed achievement: Two traumatic catastrophes showed early safety analyses were overgenerous, but the Shuttle did provide the freight and manpower for the first tentative steps toward a permanent spacefaring presence, and all the science that came with it. The craft themselves are retrofuturist works of art: gleaming white above, reverse countershaded beneath, all swooping curves and aerodynamic lines. A stately relic of space-age optimism.\nIt's no wonder, upon the program's retirement, that everyone wanted a Shuttle. Twenty-one museums and institutions vied for the right to house one of the four surviving craft. NASA made its selections based on applicants' historical significance and plans to preserve and display the Shuttles, and in 2011 the winners were announced. The Intrepid Museum in New York received Enterprise; Kennedy Space Center in Florida got Atlantis; the California Science Center obtained Endeavour; and the Steven F. Udvar-Hazy Center, an annex of the Smithsonian National Air and Space Museum in Fairfax County, Va., received Discovery.",
          "link": "https://defector.com/the-big-beautiful-bill-is-trying-to-steal-a-space-shuttle",
          "publishedOn": "2025-07-14T15:50:06.000Z",
          "wordCount": 7823,
          "title": "The “Big Beautiful Bill” Is Trying To Steal A Space Shuttle",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-542411136.jpg"
        },
        {
          "id": "https://defector.com/?p=195285",
          "author": "Hamilton Nolan",
          "description": "An old boxing coach of mine became an avid tennis player after he retired from pro fighting. He always said that boxing and tennis were very similar. This never struck me as completely convincing. Yes, both are one-on-one sports, and both require strategic choices about how to attack and defend, how to break an opponent’s will. But in tennis, nobody is punching you in the face. I guess you could say there are both similarities and differences. \nTo see tennis in New York City, take the 7 train way the fuck out in Queens to Willetts Point. Instead of turning left to go to the Mets Stadium, hang a right, over the MTA trainyard, down a long and alarmingly rickety boardwalk whose lumber creaks and moves under your steps. At the end you are rewarded with the sweeping vista of Flushing Meadows Park. The circle at the park’s entrance is named after David Dinkins, New York City’s first black mayor, who helped to bring the US Open to the USTA Tennis Center on the park’s edge. Dinkins was a member of the Democratic Socialists of America, a fact that Zohran Mamdani, our current mayor-in-waiting, brought up every time that one of his primary opponents tried to smear him as a communist due to his own DSA membership.",
          "link": "https://defector.com/the-fighters-pay-the-bills",
          "publishedOn": "2025-07-14T15:22:01.000Z",
          "wordCount": 10387,
          "title": "The Fighters Pay The Bills",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2224227634.jpg"
        },
        {
          "id": "https://defector.com/?p=195289",
          "author": "Maitreyi Anantharaman",
          "description": "This week's puzzle was constructed by Maddy Ziegler and edited by Hoang-Kim Vu. Maddy is an attorney in Madison, Wisconsin. She enjoys watching many sports and playing none. You can find more of her puzzles at poppypuzzles.blogspot.com.\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE. Note that our submissions are closed through July 31.",
          "link": "https://defector.com/the-crossword-july-14-quarterback-scramble",
          "publishedOn": "2025-07-14T15:04:43.000Z",
          "wordCount": 5847,
          "title": "The Crossword, July 14: Quarterback Scramble",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1448389543.jpg"
        },
        {
          "id": "https://defector.com/?p=194645",
          "author": "Lauren Theisen",
          "description": "The VHS/DVD championship season recap is a lost art in the era of Youtube, but I'm old enough to remember when it was the only game in town. I'd see ads for them in the immediate aftermath of a title win—a chance to relive a great run through a curated collection of clips and interviews. We had the tape for the 1998 Red Wings in my home growing up, and a disc for the 2004 Pistons, but neither of those affected me quite as much as a video I borrowed from the library as a young kid, which introduced me to the concept of violent, aggressive basketball—a style I decided I wanted to play.\nThis was a tape recapping the 1988 Detroit Pistons season. That's not a year in which they actually won a title, you might notice, but it was the first time Detroit ever made the Finals, pushing the Lakers to seven games. I was lucky enough to get taken to the library on a regular basis, and I did the thing that kids do when they go, which is grab whatever they see on topics they're interested in. My topics included baseball, hockey, planets, those Eyewitness Books with all the cool pictures, and at some point, the Detroit Pistons.",
          "link": "https://defector.com/bill-laimbeer-made-me-a-youth-basketball-maniac",
          "publishedOn": "2025-07-14T14:13:07.000Z",
          "wordCount": 9692,
          "title": "Bill Laimbeer Made Me A Youth Basketball Maniac",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-522413051.jpg"
        },
        {
          "id": "https://defector.com/?p=195177",
          "author": "Ray Ratto",
          "description": "The choice of Bills Week for this year's What Defector Does When It Needs To Skive Off For A Week Week had an unforeseen deficiency when it was being spitballed by the Phlegm Committee. Specifically, we are historically low on Bills.\nBetween 1950 and 2008, the name Bill (or more specifically William), became gradually and increasingly uncool in the United States, according to data from the Social Security Administration. Even by 1980 a kid might as well have been named Jehoshaphat, Algonquin, or Xythron The Enfeebled. Most likely, Bill is the name of your last living relative, and if it isn't, may he rest in peace. If you have a Bill in your family, cherish the old coot. Water him regularly, and keep the air in front of his easy chair free of things he can trip over. You need him mobile and independent, at least from you.",
          "link": "https://defector.com/where-have-all-the-sports-bills-gone",
          "publishedOn": "2025-07-14T13:48:45.000Z",
          "wordCount": 8219,
          "title": "Where Have All The Sports Bills Gone?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-51685346.jpg"
        },
        {
          "id": "https://defector.com/?p=195224",
          "author": "Tom Ley",
          "description": "Defector will be turning five years old in September. What better way to squander whatever warm feelings our upcoming birthday will elicit from our dedicated readers and subscribers than subjecting them to yet another inscrutable theme week? Hopefully you did not assume that Senators Week, Rays Week, and Wings Week had exhausted us of all […]",
          "link": "https://defector.com/its-bills-week",
          "publishedOn": "2025-07-14T13:00:06.000Z",
          "wordCount": 5386,
          "title": "It’s Bills Week",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/Bills-Week-1.png"
        },
        {
          "id": "https://defector.com/?p=195236",
          "author": "Giri Nathan",
          "description": "How does a person recover from this: holding three championship points in a Roland-Garros final, only to let them slip, fight for two more hours, and lose the whole thing in the fifth-set super-tiebreak, against your internationally beloved arch rival, who was spurred on by the crowd? That experience would pulverize the average person psychologically. But if you had to devise a human who could withstand it, you might end up with something close to Jannik Sinner, master of the emotional reset. Yes, he looked shell-shocked while sitting in his chair in the immediate aftermath of that loss to Carlos Alcaraz. According to his coach Darren Cahill, Sinner and his team had a good cry afterwards. They discussed a few tactical details from the match. And then, after a 24-hour period, they didn't speak of that match again, and simply moved on to the grass season. Barely a month after that catastrophe, faced with the same happy and lethal opponent, with same magnitude of title at stake, Sinner locked in and won Wimbledon, 4-6, 6-4, 6-4, 6-4.\nIt's been a long time since the world's No. 1 player had notched a win over Alcaraz. Though Sinner has a staggering 99-9 record since the start of the 2024 season, five of those nine losses were inflicted by this one man. The defining rivalry of men's tennis had swung in Alcaraz's favor over the last two seasons, after a string of wins in Indian Wells, Roland-Garros, Beijing, Rome, and Roland-Garros again. Several of those matches were defined by Alcaraz's lucid and vicious play in the highest-pressure situations, like the match tiebreaks in Beijing and Paris. More concretely troubling for Sinner was the fact that his clearest advantage over his rival, the serve, had been at or below average in those meetings, in terms of first-serve percentage. In order to shift the matchup back in his favor, he'd have to serve accurately and hold his nerve.",
          "link": "https://defector.com/jannik-sinner-recalibrated-and-got-back-into-his-rivalry-with-carlos-alcaraz",
          "publishedOn": "2025-07-13T22:24:05.000Z",
          "wordCount": 9016,
          "title": "Jannik Sinner Recalibrated And Got Back Into His Rivalry With Carlos Alcaraz",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2224949163.jpg"
        },
        {
          "id": "https://defector.com/?p=195235",
          "author": "Tom Ley",
          "description": "This seems like a pretty embarrassing time to be a member of the NFLPA. Not only has a series of reports revealed that executive director Lloyd Howell Jr. is at best a pushover for the owners and at worst someone whose own interests are actively aligned against those of the players, but now the union has demonstrated itself incapable of releasing a legible statement. \nLast week, ESPN dropped a pair of stories that seemed to herald Howell's resignation. The first reported that NFLPA senior leaders struck a deal with NFL owners, in which they agreed to keep the bombshell results of an arbitration case about collusion a secret from the players. The second report revealed that Howell works as a part-time consultant for the Carlyle Group, which is attempting to buy ownership stakes throughout the league.",
          "link": "https://defector.com/the-nflpa-is-having-communication-issues",
          "publishedOn": "2025-07-13T20:03:15.000Z",
          "wordCount": 6936,
          "title": "The NFLPA Is Having Communication Issues",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2197819398.jpg"
        },
        {
          "id": "https://defector.com/?p=195211",
          "author": "Tom Ley",
          "description": "It's been a little over a month since a judge approved the settlement terms agreed to by the NCAA and lawyers representing Division I athletes who brought several antitrust cases against the NCAA and its conferences in federal court. Things are already getting stupid.\nThe purpose of the settlement was, in broad strokes, to allow schools to begin directly paying college athletes while also reducing the influence of NIL collectives over how much players are compensated. Starting this summer, the settlement gives schools $20.5 million to spend on player compensation while also putting tighter restrictions on what types of NIL deals, which do not count against the $20.5 million cap, will be allowed under new regulations. NIL collectives that were previously able to pay players without much restriction will now have to prove that each deal that is signed serves a \"valid business purpose.\"",
          "link": "https://defector.com/the-business-of-post-settlement-college-sports-is-already-a-mess",
          "publishedOn": "2025-07-13T15:41:16.000Z",
          "wordCount": 7845,
          "title": "The Business Of Post-Settlement College Sports Is Already A Mess",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2224143801.jpg"
        },
        {
          "id": "https://defector.com/?p=195204",
          "author": "Giri Nathan",
          "description": "On a point-by-point basis, I will remember nothing about the women's final at Wimbledon. Iga Swiatek's 6-0, 6-0 win over Amanda Anisimova on Saturday, which lasted just 57 minutes, was the least competitive major final in recent memory. Swiatek had played for five major finals in the past and won all of them easily. Anisimova, a former teenage prodigy who's taken the scenic route back to the top, had never played a final at this level. One player was so comprehensively prepared, and the other so visibly overwhelmed, that the match never really had a chance to cohere. What I'll remember instead of any specific rally is this turning point in the career of Swiatek, a longtime grass-court non-believer who cast off her delusions, and pulled herself out of a title slump in the process.\nBack in 2022, Iga Swiatek established herself as the top player of her generation. She kicked off a two-year, almost uninterrupted stint as the No. 1 player in the world. Here was the tour's most complete baseline game: high-topspin shots powered by elite movement and focus so intense that if often left her opponents holding bagels and breadsticks. During that two-year stretch, at pretty much any tournament, you could pencil her into at least the semifinals.",
          "link": "https://defector.com/iga-swiatek-mastered-all-terrain",
          "publishedOn": "2025-07-13T15:13:47.000Z",
          "wordCount": 8610,
          "title": "Iga Swiatek Mastered All Terrain",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2224826298.jpg"
        },
        {
          "id": "https://defector.com/?p=195048",
          "author": "Tom Ley",
          "description": "Sometimes you find yourself remembering a book. Such was the case a few weeks ago, when someone dropped this tweet into our DRAB Slack channel. \"In 2012 it seemed like every single person in New York City was reading The Art of Fielding,\" it said. \"On Goodreads it has 30,000 more ratings than Infinite Jest, and almost 3x as many readers as 2666. And yet it’s just completely gone. Never discussed. Zero impact.\"\nWell guess what, buddy, we're going to discuss The Art Of Fielding here and now, in the year 2025. It is true that this book was what you might call a \"hot release\" back in 2012—I personally remember every sports and sports-adjacent blogger at the time reading and talking about it—and it's not inaccurate to point out that it doesn't seem to have left much of a cultural impression. But who actually cares about all of that? What we're here to find out is if this book is any good. I was certainly charmed by it when I read it in 2012—It's a baseball book that's also a campus book that's also kind of about Moby Dick? Wow!—and I am curious to find out if the grizzled, 37-year-old version of me will be able to find things to like about it.",
          "link": "https://defector.com/defector-reads-a-baseball-book",
          "publishedOn": "2025-07-11T17:17:55.000Z",
          "wordCount": 6293,
          "title": "Defector Reads A Baseball Book",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/drab-fielding-1.jpg"
        },
        {
          "id": "https://defector.com/?p=194075",
          "author": "Hallie Lieberman",
          "description": "On Jan. 21, 2025, Molly was serving lunch in the prison cafeteria when a fellow trans inmate shared the news with her: A day earlier Donald Trump had signed an executive order declaring the Bureau of Prisons (BOP) was prohibited from spending money on any gender-affirming care for inmates. Molly realized that she and the 2,000 or so transgender people currently being held in federal prison faced a dire future: being prohibited from receiving gender-affirming care such as hormones for their gender dysphoria. \nA month later, Molly learned that a new BOP memo banned gender-affirming commissary items for trans inmates, such as makeup and women’s underwear, calling these offering \"items that align with transgender ideology.\" The memo also required guards to misgender trans inmates. Soon after, makeup, underwear, bras, and other gender-affirming items were removed from Molly's prison commissary.",
          "link": "https://defector.com/how-trans-prisoners-are-dealing-with-the-trump-administrations-attacks",
          "publishedOn": "2025-07-11T16:21:00.000Z",
          "wordCount": 11985,
          "title": "How Trans Prisoners Are Dealing With The Trump Administration’s Attacks",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2197854239.jpg"
        },
        {
          "id": "https://defector.com/?p=195130",
          "author": "Dave McKenna",
          "description": "Katie Taylor and Amanda Serrano go at it again at Madison Square Garden tonight. The fight’s being promoted as the biggest in the history of women’s boxing. Who could argue? It’s the first female trilogy matchup of note, in the most famous boxing arena in the world, and the previous two bouts were iconic thrillers. \nBut as of this week, tickets from greedy Ticketmaster could be had for under $44, greedy fees included. That’s an astonishingly low get-in price for a fistic Garden party of such stature. The cheapest seat at the same building a night later for the \"Weird Al\" Yankovic show will run you about twice as much.",
          "link": "https://defector.com/after-two-iconic-fights-why-is-taylor-serrano-iii-such-an-easy-ticket",
          "publishedOn": "2025-07-11T15:29:20.000Z",
          "wordCount": 9238,
          "title": "After Two Iconic Fights, Why Is Taylor-Serrano III Such An Easy Ticket?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2223843017.jpg"
        },
        {
          "id": "https://defector.com/?p=194890",
          "author": "Veronica de Souza",
          "description": "Welcome back to Make It Nice, Defector’s best design advice column. This month: A search for an attractive ceiling fan, a layout for a tricky bungalow bedroom, and ideas for making the most out of a multi-use workspace.\nAlyssa asks:",
          "link": "https://defector.com/make-it-nice-ceiling-fans-and-tricky-layouts",
          "publishedOn": "2025-07-11T14:53:02.000Z",
          "wordCount": 11057,
          "title": "Make It Nice: Ceiling Fans And Tricky Layouts",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/make-it-nice-july-2015.jpg"
        },
        {
          "id": "https://defector.com/?p=195149",
          "author": "Patrick Redford",
          "description": "Ben Healy races his bike like a Frenchman, which is to say that his creativity, pain tolerance, and willingness to gamble extend beyond the scope of his abilities. The Irish rider debuted at the 2024 Tour de France determined to win a stage, and while he rode bravely and twice put himself in position to win, all he won was hearts. He's done himself one better this year, running away with a career-defining win on Stage 6 of the Tour. It was a gorgeous ride, one that validates Healy's place as one of the peloton's premier artists on the bike.\nAfter the race's elite greedily scarfed up the first five stages of the race, Stage 6 was the first chance for everyone else to get a crack at winning something. Tadej Pogacar had just put a minute into Jonas Vingegaard in the time trial, and after five hard days of patrolling the front of the race, it seemed clear that neither Visma nor UAE would invest yet again in setting up their team leaders. The stage's terrain was rugged, and there are more important battles to fight down the road.",
          "link": "https://defector.com/ben-healy-wins-one-for-the-romantics",
          "publishedOn": "2025-07-11T13:50:39.000Z",
          "wordCount": 8713,
          "title": "Ben Healy Wins One For The Romantics",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/benhealy.jpeg"
        },
        {
          "id": "https://defector.com/?p=194870",
          "author": "Billy Haisley",
          "description": "If a typically tight, unexciting late-stage tournament match can be redeemed with a great goal, João Pedro was the savior that Tuesday's Club World Cup semifinal between Chelsea and Fluminense needed. Twice the Brazilian injected into the game the kind of inspiration and pinpoint precision that was otherwise in short supply. His first goal was a long-range beauty, an almost golf-like shot where João Pedro patiently settled the ball, lined up his target, scoped out the hazards in between him and it, measured his approach, and ripped a drive into the far-side netting. His second goal was even better, a strike of such force and purity and exactitude of footwork that I'm compelled to include the following video, which appropriately focuses on nothing but the shooting technique itself:\n\nhttps://twitter.com/ChelseaFC/status/1942733236205150275",
          "link": "https://defector.com/who-is-winning-at-soccer",
          "publishedOn": "2025-07-11T13:07:47.000Z",
          "wordCount": 12044,
          "title": "Who Is Winning At Soccer?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2223557637.jpg"
        },
        {
          "id": "https://defector.com/?p=193789",
          "author": "Jen Ramos Eisen",
          "description": "Private equity is the steamroller that crushes all your favorite things. Journalism, for one, and also a once iconic toy store; even bowling these days. Now it has come for minor league baseball, where in little more than three years one private equity firm has managed to buy up a healthy percentage of the MiLB teams in the United States. \nDiamond Baseball Holdings, a company backed by the private equity firm Silver Lake, has acquired 45 Minor League Baseball teams since its creation in late 2021. They own teams from coast to coast, in cities big and small. This means one company now owns more than 35 percent of all minor league baseball teams. And it shows no sign of slowing down.",
          "link": "https://defector.com/private-equity-now-owns-more-than-40-minor-league-baseball-teams-and-the-number-keeps-growing",
          "publishedOn": "2025-07-10T18:44:11.000Z",
          "wordCount": 16241,
          "title": "Private Equity Now Owns More Than 40 Minor League Baseball Teams, And The Number Keeps Growing",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/06/GettyImages-1152057926-smaller-e1751082266822.jpeg"
        },
        {
          "id": "https://defector.com/?p=195088",
          "author": "Ray Ratto",
          "description": "The news that the NFL and the Players Association hierarchy colluded to hide an allegation of collusion ought to be more surprising, and not just because the story has been leaking out in drips and drabs for two weeks now. After first being broken by Meadowlark Media's Pablo Torre, ESPN's follow-up, by Don Van Natta Jr. and Kalyn Kahler, is an indication that players are slowly coming to realize that their union leadership did them dirty on the basic task of keeping them informed.\nIn this case, NFLPA leadership opted to join the league in covering up an arbitrator’s finding that owners conspired to avoid handing out guaranteed contracts. The broader cultural tilt toward the powerful has rarely been more pronounced, and the NFLPA leadership has always operated on the notion that keeping the owners happy is the path to survival for the hundreds of players whose careers are too short for them to be willing to endure a lengthy work stoppage, so in the grand scheme this is just a slightly more outrageous ask by the owners, and a slightly more outrageous cave by the union.",
          "link": "https://defector.com/the-nfl-union-busting-is-now-coming-from-inside-the-union",
          "publishedOn": "2025-07-10T17:55:23.000Z",
          "wordCount": 7275,
          "title": "The NFL Union-Busting Is Now Coming From Inside The Union",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2197819375.jpg"
        },
        {
          "id": "https://defector.com/?p=194916",
          "author": "Giri Nathan",
          "description": "Might as well get it out of the way: Bill Ackman's tennis game is not humiliating in itself. If it's Ackman's humiliation you seek, might I direct you to: his hammy and conspiratorial screeds on Twitter; his use of antisemitism as a cheap cudgel against college administrators and students while somehow defending Elon Musk from the same charge; the time he unintentionally called attention to the shoddy scholarship of his own wife; and the way he groveled to Donald Trump, only to go lemon-booty once Trump's White House began a trade war that endangered his money. But the tennis is fine—pretty much what I'd expect if you told me that a fit 59-year-old had spent a decade getting really into tennis with a billionaire's resources. What's humiliating is that Ackman was allowed to display his game on a grass court at a sanctioned ATP Challenger event, which he did on Wednesday, losing his first-round doubles match, 6-1, 7-5.\nHow did we get here? The Hall of Fame Open takes place in Newport, R.I., on the grass courts at the International Tennis Hall of Fame. It is perhaps most noteworthy for being the only tour-level grass-court tournament held outside of Europe. It was an ATP 250 event from 2009 until 2025, when it was downgraded to a Challenger 125 event. Even with this diminished status, it is still an event that active touring professionals are seeking to compete at in order to win ATP points and prize money. It's not an event that random guys can just amble into. Entry is determined by existing ATP ranking points. Ackman, being a 59-year-old hedge fund manager, does not have any ATP ranking points. In a characteristically bloated Twitter essay, he explained how he made his way into the doubles draw:",
          "link": "https://defector.com/bill-ackman-gets-to-play-pretend-in-sanctioned-tennis-farce",
          "publishedOn": "2025-07-10T17:22:18.000Z",
          "wordCount": 9251,
          "title": "Bill Ackman Gets To Play Pretend In Sanctioned Tennis Farce",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2213174315.jpg"
        },
        {
          "id": "https://defector.com/?p=195007",
          "author": "Luis Paez-Pumar",
          "description": "After two full rounds of the 2025 Euros group stage, every title contender has some kind of weakness. Germany can't stop anyone, Spain can't stop any counter attack, and France is in the middle of a generation shift (which is less a flaw and more of an intentional change, though there are still the attendant growing pains). And then there's England, which might be the sturdiest team top-to-bottom in the tournament but which is navigating enough minor questions that have congealed into one large aura of uncertainty.\nWhat if the defense doesn't perform to its potential? What if the Lionesses miss Fran Kirby and Millie Bright more than expected? What if Lauren James isn't/doesn't stay healthy? What if England just Englands it up? (This last one is not fair, admittedly, given that England won the last Euros, albeit on home soil, and made the final of the 2023 World Cup. But hey, England is still England, so an Englanding can never be ruled out.) Even the negative answers to some of these questions aren't necessarily tournament-sinkers, but pile enough of them up and things could turn into nightmare.",
          "link": "https://defector.com/england-unleashed-hell-on-the-netherlands",
          "publishedOn": "2025-07-10T17:03:13.000Z",
          "wordCount": 8932,
          "title": "England Unleashed Hell On The Netherlands",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2224313608.jpg"
        },
        {
          "id": "https://defector.com/?p=194974",
          "author": "Drew Magary",
          "description": "Fair warning: This article is a podcast. I didn’t want you coming into this thinking I was gonna reel off 2,000 touching words about my family or whatever. No, this is a mercenary post. Distraction co-host David Roth is out this week on vacation, fondling gross gas tanks and politely eating lobster rolls. The usual Roth in Maine shit.\nThat means that I got to be in charge of the proceedings this week, so I recruited both longtime pod favorite Rohan Nadkarni and TV/blogging legend Michael Schur to join me for an hour. This was a fun prospect at first, until both men decided to gang up on me—their host, their friend, their inspiration—for always putting bacon on my burger. After that, the show devolved into a vicious assault that arguably merits prosecution. Is it fair to bully me for bacon? THAT is the subject of this week’s Distraction.",
          "link": "https://defector.com/bullied-for-bacon-with-michael-schur-and-rohan-nadkarni",
          "publishedOn": "2025-07-10T16:41:59.000Z",
          "wordCount": 6547,
          "title": "Bullied For Bacon, With Michael Schur And Rohan Nadkarni",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-116397326.jpg"
        },
        {
          "id": "https://defector.com/?p=193695",
          "author": "Lucy Bloom",
          "description": "There was a good deal of weather around La Crosse, Wisconsin while I was there. We had several tornado sirens and a couple of touchdowns in neighboring counties. The street I was staying on flooded a few times, and a couple drivers got their cars stuck in the water. People from the neighborhood came out to try to warn passing cars against trying to cross the water, or to point and laugh when they did it anyways. Sometimes both. There are floods in Texas lately, and there's been plenty of pretty cruel shit said online at the expense of the victims of a red state catastrophe. I think schadenfreude tends to be an expression of the anxiety and profound grief that comes with feeling powerless to help anyone else, and damn near as powerless to stop trying. One soft and slow rule at Defector, I think a good one, is Do not command the audience to do anything. People do not like being commanded. However helpful you think you are being, you aren't. You cannot liberate anyone else for them, nor even gently deviate them from the paths they have chosen: They will get bangs, buy the Jaguars hat, join an obvious cult, get back with their shitty ex, or drive their bimmer full speed straight the fuck into that lake in the middle of the street, and cuss you out afterwards for trying to talk them out of it. I know this because I have watched them, and myself, my whole life, make these mistakes against the advice of everyone who cares about us. Yet here I am, knowing full well it is likely pointless, trying to liberate you from the life you have chosen without NORCO in it.\nIf at any point you feel like you would like to play NORCO, please exit the blog and do so immediately.",
          "link": "https://defector.com/norco2022",
          "publishedOn": "2025-07-10T16:19:29.000Z",
          "wordCount": 10815,
          "title": "‘NORCO’ Should Be A Cult Classic",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/1221250_59-copy.jpg"
        },
        {
          "id": "https://defector.com/?p=195019",
          "author": "Lauren Theisen",
          "description": "I recently started the seminal baseball book Ball Four, Jim Bouton's diary of the 1969 season. As the book opens, Bouton is staring down the last days of his career. He was a young star for a couple of seasons with the Yankees, but his failure to live up to that early promise got him banished to the godforsaken expansion Seattle Pilots. From the very first pages, Bouton writes like a grizzled old man who's seen it all, rueful about past contract negotiations and nostalgic for rowdy pranks. Immediately, I was picturing a narrator who carried with him the weight of experience. Someone like Gandalf. Or King Lear. Or Rich Hill.\nThen I reached this jump scare, dated March 7: \"Okay, boys and girls, tomorrow is my birthday and I'll be thirty years old.\" Yes, at the time of that writing, washed-up Jim Bouton was younger than I am today. The lesson? Baseball makes you old very, very quickly.",
          "link": "https://defector.com/30-year-old-man-zach-mckinstry-hits-athletic-peak",
          "publishedOn": "2025-07-10T15:59:53.000Z",
          "wordCount": 7265,
          "title": "30-Year-Old Man Hits Athletic Peak",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2223423394.jpg"
        },
        {
          "id": "https://defector.com/?p=194962",
          "author": "Chris Thompson",
          "description": "In almost all cases, if I am referring to someone as a Barf Man, the term is not meant to be taken literally. To me there is almost nothing worse than barfing, and there is certainly no substance worse than barf. A Barf Man, therefore, would be a guy who sucks real bad. It's really that simple.\nAdrian Houser, pitcher for the Chicago White Sox, presents a special case. I have no opinions about his character. Maybe he's a sweet and likable fellow, charitable and broadminded, rescues dogs, a ringing tenor! To be honest, I am perfectly satisfied with the information I already possess about this person: he is a pitcher, he pitches for the Chicago White Sox, he used to pitch for the Milwaukee Brewers. He wears a beard, he throws right-handed, and he vomits. Houser is the vomiting guy. Once you become the vomiting guy, unfortunately, you're a thesaurus away from being referred to as Barf Man. It's not personal!",
          "link": "https://defector.com/impressive-blue-jays-win-streak-thwarted-by-noted-barf-man",
          "publishedOn": "2025-07-10T15:12:25.000Z",
          "wordCount": 8676,
          "title": "Impressive Blue Jays Win Streak Thwarted By Noted Barf Man",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2223708328.jpg"
        },
        {
          "id": "https://defector.com/?p=194923",
          "author": "Israel Daramola",
          "description": "Since its inception, the American version of the hit reality dating phenomenon Love Island has been something of a red-headed stepchild. It wasn’t until last season—which produced not only 30-odd episodes of high-octane hijinks but three couples whose relationships remain solid a year after being released from the confines of the villa—that Love Island: USA became the sort of appointment viewing that could rival its British corollary. Several members of last season’s cast have become stars in their own right; a spin-off show, Love Island: Beyond the Villa, will follow six former islanders as they navigate their newfound fame. \nAll to say, Season 7 of Love Island: USA had a lot to live up to. From a financial perspective, it’s safe to say that this season has been nothing short of a success—every week, the show seems to set a new audience high. Still, in the online corridors where Love Island discourse dominates, this season has received its fair share of criticism. There are the two islanders who have been unceremoniously removed from the villa for using racial slurs in the past. There’s the blatant gamesmanship that seems to have, until recent days, trumped most of the islander’s search for love. And then there’s Huda.",
          "link": "https://defector.com/can-we-pull-you-for-a-chat",
          "publishedOn": "2025-07-10T14:30:23.000Z",
          "wordCount": 15992,
          "title": "Can We Pull You For A Chat?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/LoveIslandSeven.jpg"
        },
        {
          "id": "https://defector.com/?p=194664",
          "author": "Maitreyi Anantharaman",
          "description": "Before one copy showed up on a bookstore shelf, Christine Brennan’s new book had women’s basketball abuzz. The longtime sports columnist began reporting On Her Game: Caitlin Clark and the Revolution in Women’s Sports last summer, midway through Clark’s rookie season with the Indiana Fever. Upset by Brennan's lines of questioning during a playoff series between Indiana and Connecticut, the WNBA players’ union rebuked her in a rare public statement last September. “You cannot hide behind your tenure,” it read. Brennan countered that her question—whether DiJonai Carrington had intentionally poked Clark in the eye in a game—was just journalism.\nThus began the book tour. “A news-making and electrifying portrait,” the jacket copy promised. The video of Brennan's appearance on OutKick’s Hot Mic podcast was titled “Blacklisted WNBA Reporter Speaks Out.” She teased new details and scoops: Why was Caitlin Clark really left off the Olympic roster? Two weeks ago, Minnesota Lynx head coach Cheryl Reeve bought the book some extra hype. “Christine Brennan likes to have a villain in her storytelling,” she said in a TV hit. “I am Christine Brennan’s villain. That’s the sword she’s going to die on. And it's a fiction.” The weirder people in Brennan’s replies expect this book to take down the league’s shadowy lesbian cabal.",
          "link": "https://defector.com/christine-brennans-caitlin-clark-book-is-more-about-gripes-than-greatness",
          "publishedOn": "2025-07-10T13:07:00.000Z",
          "wordCount": 11582,
          "title": "Christine Brennan’s Caitlin Clark Book Is More About Gripes Than Greatness",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2212870530.jpg"
        },
        {
          "id": "https://defector.com/?p=194777",
          "author": "Luis Paez-Pumar",
          "description": "Through two games at Euro 2025, Germany hasn't been the most impressive of top sides. The results flatter to deceive. After beating Poland 2-0 in the opener, Germany came back from a 1-0 deficit to beat Denmark 2-1, thereby qualifying for the knockout rounds. That's a tidy resume, even if neither Poland (27th FIFA rank) or Denmark (12th) are truly elite opposition, and there shouldn't be much to quibble from six points out of six, especially after Germany went out in the group stage of the 2023 World Cup. However, the specifics of how Germany is playing and its glaring weaknesses in defense might yet come back to bite the side as the competition gets tougher.\nStill, though, the way Germany came back to beat Denmark deserves some recognition, even if it wasn't free of controversy. In a way, a tough and sloppy match might have been what Germany needed to prove, to itself mostly, that it was no longer carrying an emotional albatross from the last World Cup, a process that began in earnest with an encouraging bronze medal at last summer's Olympics. The first-half one-two-three punch combination the Germans suffered might have sank them if the weight of disappointment still hung around their necks, but on Tuesday, it didn't.",
          "link": "https://defector.com/germany-has-been-good-enough-for-now",
          "publishedOn": "2025-07-09T18:32:42.000Z",
          "wordCount": 9226,
          "title": "Germany Has Been Good Enough, For Now",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2224226928.jpg"
        },
        {
          "id": "https://defector.com/?p=194806",
          "author": "Albert Burneko",
          "description": "When last we checked in on Grok, Twitter's supremely grating and corny embedded chatbot, it had spent an otherwise ordinary weekday in May attempting to impress upon Twitter users the seriousness of the supposed \"white genocide\" not actually happening in Elon Musk's homeland of South Africa, routing even unrelated queries into discussions of \"Kill the Boer\" chants and supposedly racially motivated attacks against white Afrikaner farmers. Hours into this spree, xAI, the Musk-controlled company responsible for Grok's creation and development, issued a statement attributing the chatbot's abrupt lapse into racist conspiracy theory to unspecified \"unauthorized modification\" of Grok's system prompt, before the company hastily moved on from the whole disaster. The question of exactly which (racist, white genocide–obsessed, white Afrikaner) xAI employee, or unaccountable founder, might have been responsible never received any official answer.\nGiven how chatbots work, none of this was very mysterious. Neither were Tuesday's events, in which Grok lapsed into sneering, unalloyed Nazism for several hours.",
          "link": "https://defector.com/elon-musks-idiot-chatbot-turns-into-an-explicit-nazi",
          "publishedOn": "2025-07-09T18:13:32.000Z",
          "wordCount": 10765,
          "title": "Elon Musk’s Idiot Chatbot Turns Into An Explicit Nazi",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/muskgrok.jpeg"
        },
        {
          "id": "https://defector.com/?p=194811",
          "author": "Tom Ley",
          "description": "Mariners catcher Cal Raleigh might just be the best player in baseball this year. There's no need for equivocation when it comes to his nickname, though. \"Big Dumper\" is the finest sobriquet in the league, and no arguments to the contrary will be heard.\nHaving an opposing player named Big Dumper come to town is also easy fodder for local broadcasters, who get to regale viewers with the nickname's backstory—it's what you think it is: he has a huge ass—alongside their astonishment at Raleigh's MVP-caliber numbers. But leave it to Michael Kay, one of the weirdest and most curmudgeonly announcers in baseball, to sneer at the majesty of Raleigh's backside.",
          "link": "https://defector.com/michael-kay-constitutionally-incapable-of-enjoying-an-extended-gaze-at-cal-raleighs-huge-ass",
          "publishedOn": "2025-07-09T16:21:16.000Z",
          "wordCount": 6108,
          "title": "Michael Kay Constitutionally Incapable Of Enjoying An Extended Gaze At Cal Raleigh’s Huge Ass",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/big_dumber.png"
        },
        {
          "id": "https://defector.com/?p=194774",
          "author": "Kathryn Xu",
          "description": "After long-lived rumors of a power struggle among Red Bull leadership, and allegations of misconduct by a female Red Bull employee, and the suspension of said Red Bull employee for being \"dishonest,\" and meticulous displays of wifely affection in the paddock, and Max Verstappen throwing his weight behind team advisor Helmut Marko, and the departure of chief technical officer Adrian Newey, and a car increasingly deteriorating in performance, and a billion second drivers, and the scheduling of that misconduct case to go before an employment tribunal in the United Kingdom in early 2026, and rumors of Verstappen leaving the team for Mercedes ... after all that, CEO Christian Horner is out at Red Bull Racing.\nThe news dropped Wednesday with very little preamble. In its announcement, Red Bull leadership provided no explanation for the choice to fire Horner—or rather, to borrow their phrasing, release Horner from his position with immediate effect. The team simply thanked him for his \"exceptional work over the last 20 years,\" a tidy reminder that Horner had been CEO and team principal since its inception in 2005. Since then, the team has won eight Drivers' Championships and six Constructors' Championships. Depending on how much one values managerial talent, most will credit the vast majority of the success to Newey, Verstappen, and four-time Drivers' Champion Sebastian Vettel, with Horner and Marko only splitting the remainder.",
          "link": "https://defector.com/red-bull-belatedly-fires-team-principal-christian-horner",
          "publishedOn": "2025-07-09T15:56:59.000Z",
          "wordCount": 7313,
          "title": "Red Bull Belatedly Fires Team Principal Christian Horner",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/christianHornerGONE.jpg"
        },
        {
          "id": "https://defector.com/?p=194776",
          "author": "Kelsey McKinney",
          "description": "There is a difference between robbing and burgling. When you burgle, you waltz in somewhere you're not supposed to be—maybe you force your entry, maybe you don't, but it must be illegal for you to be there—with the intention of taking stuff. It is a property crime. Robbery, however, requires a direct victim. When you rob, you are taking an item or items from someone right there in front of you. The Padres love robbing.\nSan Diego is making a habit of this. Last week, center fielder Jackson Merrill leapt up in Philadelphia and yoinked a home run ball back into the field of play. Mine! He might have said. He got a taste for crime, and now he cannot stop. Worse (or better depending on your perspective), his crimes were so beautiful that his teammate Fernando Tatis Jr is copying them!",
          "link": "https://defector.com/the-robbin-padres-are-at-it-again",
          "publishedOn": "2025-07-09T15:28:50.000Z",
          "wordCount": 7031,
          "title": "The Robbin’ Padres Are At It Again",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2223590666-min-1-e1752073316364.jpg"
        },
        {
          "id": "https://defector.com/?p=194727",
          "author": "Asher Elbein",
          "description": "In June, Florida’s attorney general James Uthmeier extolled the benefits of the concentration camp they were rushing to build in the wetlands of the Big Cypress Nature Reserve, west of Miami and just north of the Everglades. The swamp location wasn’t incidental to the 5,000-bed facility, but a plus. \"It presents an efficient, low-cost opportunity to build a temporary detention facility because you don't need to invest that much in the perimeter,\" he crowed.  \"If people get out, there's not much waiting for them other than alligators and pythons.\" \nWhat happened next was, perhaps, predictable. The Department of Homeland Security formally named the camp “Alligator Alcatraz,” a sweaty piece of branding that the rest of the administration picked up with customary glee. DHS social media posted …",
          "link": "https://defector.com/why-do-fascists-dream-of-alligators",
          "publishedOn": "2025-07-09T14:39:33.000Z",
          "wordCount": 11450,
          "title": "Why Do Fascists Dream Of Alligators?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2204165815-1.jpg"
        },
        {
          "id": "https://defector.com/?p=194737",
          "author": "Dan McQuade",
          "description": "Last night on Love Island USA, a game show my wife watches while I'm in the room, the remaining male contestants played basketball. I do not know if this was part of the contest or just a pick-up game where the players happened to be wearing mic packs. However I do know, via osmosis, that one of the dudes on the show is a professional basketball player.\nAccording to an article on NBC.com titled \"Who Is Chris Seeley from Love Island USA? All About His Basketball Career & More,\" the 6-foot-8 forward played in college for Utah, Fresno State and Division II Cal State–Dominguez Hills (the Toros). Stats on kenpom.com show Seeley played 20 Division I games and made 14 of his 30 free throws. Per Eurobasket, he has played in Australia, France, Kosovo, North Macedonia and, this year, Indonesia.",
          "link": "https://defector.com/the-basketball-court-on-love-island-is-all-fucked-up",
          "publishedOn": "2025-07-09T13:40:03.000Z",
          "wordCount": 7526,
          "title": "The Basketball Court On ‘Love Island’ Is All Fucked Up",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/love-island-basketball-court-overhead.jpg"
        },
        {
          "id": "https://defector.com/?p=194707",
          "author": "Tom Ley",
          "description": "It's fitting that 15 years after LeBron James created the most memorable summer in NBA history, we finally have an offseason storyline that threatens to surpass The Decision in its ramifications. It's the question that is dominating every discussion, that every NBA insider is attempting to get answered as they furiously type away at their phones: Is Jonas Valanciunas going to Greece or what?\nValanciunas, a 33-year-old big man and 13-year NBA veteran, started the 2024–25 campaign with the Wizards and was traded to the Kings for a couple of second-round picks during the season. The Kings shipped him off to Denver in exchange for Dario Saric last week. This was the sort of offseason trade that mostly scans as idle shuffling: The Nuggets no longer wanted Saric because he sucks, and the Kings no longer wanted Valanciunas because they don't want to pay him the $10 million he will be owed next season. The Kings got some salary relief (Saric will only make $5 million next season, if he doesn't get bought out), and the Nuggets finally got a true center who can spell Nikola Jokic for 10–14 minutes every night. Everybody got what they wanted.",
          "link": "https://defector.com/the-nuggets-are-in-a-standoff-with-jonas-valanciunas-and-it-somehow-matters",
          "publishedOn": "2025-07-09T12:58:26.000Z",
          "wordCount": 8692,
          "title": "The Nuggets Are In A Standoff With Jonas Valanciunas And It Somehow Matters",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2203667914.jpg"
        },
        {
          "id": "https://defector.com/?p=194571",
          "author": "Samer Kalaf",
          "description": "On Thursday night, right before a long summer holiday weekend, the New York Times published a triple-bylined bombshell: 16 years ago, in an application form for a college that ultimately did not accept him, New York City Democratic nominee Zohran Mamdani checked the boxes for both \"Asian\" and \"African-American.\" Since the widespread negative reaction toward that article, the newspaper has scrambled to revise its original intent.\nThe scoop itself could not have been possible without a hack of Columbia University's computers, the purpose of this breach being to find any evidence that the school was still using affirmative action in admissions after the Supreme Court's reversal in 2023. Among the data was Mamdani's 2009 application. The Ugandan-born politician explained why he filled it out in that way to the Times:",
          "link": "https://defector.com/the-new-york-times-had-to-work-with-a-eugenicist-so-they-didnt-get-scooped-by-a-bigot",
          "publishedOn": "2025-07-08T19:59:13.000Z",
          "wordCount": 9062,
          "title": "The New York Times Had To Work With A Eugenicist So They Didn’t Get Scooped By A Bigot",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2021/12/GettyImages-94123770.jpg"
        },
        {
          "id": "https://defector.com/?p=194673",
          "author": "Patrick Redford",
          "description": "Tadej Pogacar's 100th win as a professional rider was a perfect synecdoche of the other 99, partially in how he won it and partially because of who finished second and third on the day. In an interview just after crossing the line, he characterized Tuesday's Stage 4 of the 2025 Tour de France as \"pure racing,\" a correct assessment and unintentional self-endorsement. The race is on, and the purest racer of his generation has struck first.\nStage 4 was a roiling affair, with five small categorized climbs and several more uncategorized hills in the finale. The terrain alone would have made it difficult for anyone to stay in contact with the peloton without riding hard, and the character of that peloton made the task extra onerous. Once poor woebegone Lenny Martinez was scooped up with around 20 kilometers left in the race, Alpecin, then Visma, then UAE each took turns drilling it at the front in order to shear as many hangers-on from the group as possible. It worked, and once UAE's Jhonatan Narvaez led the group onto the Ramp Saint-Hellaire at a furious pace, everyone in the peloton and the world knew what was coming. Who needs stagecraft when you have strength? Narvaez gave way to Joao Almeida, who cranked up the pace until the steepest part of the ramp, when Pogacar took off flying.",
          "link": "https://defector.com/tadej-pogacar-strikes-the-first-blow-with-some-pure-racing",
          "publishedOn": "2025-07-08T19:13:59.000Z",
          "wordCount": 8352,
          "title": "Tadej Pogacar Strikes The First Blow With Some “Pure Racing”",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2223525764.jpg"
        },
        {
          "id": "https://defector.com/?p=194659",
          "author": "Billy Haisley",
          "description": "The peerless superiority of the Spain women's national soccer team is primarily a matter of technique. There's no national team in the world that can put so many exquisite technical players on the field at the same time. When the Spaniards have the ball—and they always have the ball—the effect of even just watching them cut capers around the pitch with astonishing touches that zip the ball through unseen gaps is something like seeing 10 sleight-of-hand experts execute an elaborate card trick, where the answer to \"Do you know where the ball is now?\" is always \"I didn't see anything, but I bet it's in the back of the net.\"\nAlong with the team's technical resplendence, Spain also dominates games by dominating opponents' minds. The impact of all that technique and the already imposing legacies of the players who wield it manifests not only on the scoreboard but also in the psychological realm. La Roja wants to, even needs to, break the opposition's spirit, stringing together long possessions and unrelenting waves of fearsome attacks and rabid counter-pressures and goal after goal after goal until the other team is tired, distressed, and demoralized, at which point they more or less concede defeat. It's at that very point of surrender that Spain is at its ruthless best. And nobody has more to do with bringing teams to that breaking point than Alexia Putellas.",
          "link": "https://defector.com/spain-is-untouchable-when-alexia-is-feeling-it",
          "publishedOn": "2025-07-08T18:51:26.000Z",
          "wordCount": 9648,
          "title": "Spain Is Untouchable When Alexia Is Feeling It",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2223371696.jpg"
        },
        {
          "id": "https://defector.com/?p=194649",
          "author": "Chris Thompson",
          "description": "In addition to being deeply bad, the Washington Nationals are also profoundly unserious. These traits tend to go together, but sometimes do not. A rebuilding team can be a serious one, so long as its actions follow a path of logic, and so long as that logic is bound to the general priority of becoming better, and so long as the path is reasonably direct. Sunday the Nationals gave a start to Shinnosuke Ogasawara, a 27-year-old rookie pitcher who'd thrown just nine total innings, all in the minors, since April 13. Ogasawara was needed because Trevor Williams, owner of a 6.21 earned run average and arguably the worst starting pitcher in all of baseball, has a kerploded elbow, and is on the injured list. Ogasawara got lit up by the Boston Red Sox—seven hits, four runs, and 55 pitches in exchan…",
          "link": "https://defector.com/the-nationals-should-quit-pretending",
          "publishedOn": "2025-07-08T18:22:24.000Z",
          "wordCount": 10540,
          "title": "The Nationals Should Quit Pretending",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2223749244.jpg"
        },
        {
          "id": "https://defector.com/?p=194672",
          "author": "Giri Nathan",
          "description": "Aryna Sabalenka eked out an ugly win in her Wimbledon quarterfinal Tuesday, 4-6, 6-2, 6-4. The top player on the WTA was taken to her limit by an unlikely figure: Laura Siegemund, the 37-year-old veteran known for a confounding style of play that proceeds at a lumbering pace. You might recall Siegemund from a memorable match at the 2023 U.S. Open, where Coco Gauff was openly pleading with the umpire to call time violations on her foe.\nOn paper, it's difficult to grasp why the WTA's most fearsome and in-form player would struggle with an opponent who was ranked outside the top 100 at the outset of Wimbledon. Sabalenka should be rolling right through players of Siegemund's stature, and she typically does. But Siegemund, still an excellent athlete in the twilight of her career, managed to infuriate Sabalenka by tracking down every single ball and dragging the rallies into the mud. She rattled the No. 1 seed with her arrhythmic mix of chips, slices, and drop shots. Junk, in other words.",
          "link": "https://defector.com/aryna-sabalenka-could-round-out-game-hiring-some-elderly-training-partners",
          "publishedOn": "2025-07-08T17:36:35.000Z",
          "wordCount": 7304,
          "title": "Aryna Sabalenka Could Round Out Her Game By Hiring Some Elderly Training Partners",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2224124779.jpg"
        },
        {
          "id": "https://defector.com/?p=194640",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about fear of flying, robot body parts, fancy parties, and more.\nBefore we get into today’s proceedings, I am officially opening up submissions for the 2025 edition of Why Your Team Sucks. Most of you already know the drill, but new contributors are not only welcome into the fold here, but actively desired. So here’s what you need to do:",
          "link": "https://defector.com/i-listen-to-music-wrong",
          "publishedOn": "2025-07-08T17:15:39.000Z",
          "wordCount": 18184,
          "title": "I Listen To Music Wrong",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-1241214365.jpg"
        },
        {
          "id": "https://defector.com/?p=194647",
          "author": "John Saward",
          "description": "This article was originally published on Flaming Hydra on July 2. If you like it, we encourage you to visit their site and subscribe.\nSix-foot-five, 245 pounds, a slugger from the age of behemoths and big-swingers, the real-deal furniture movers and bouncer-shaped designated hitters, the plodding old oafs running out of breath on stand-up doubles. But Dave Parker could move, was the thing; he could hit it all over, he could be pesky and patient and he could demolish you too, and all of this together was the great bounty that he gave to baseball. When he died last month he was 74 years old.",
          "link": "https://defector.com/dave-parkers-great-bounty",
          "publishedOn": "2025-07-08T15:13:38.000Z",
          "wordCount": 11052,
          "title": "Dave Parker’s Great Bounty",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-91285425.jpg"
        },
        {
          "id": "https://defector.com/?p=194608",
          "author": "Giri Nathan",
          "description": "What an unforgettably accursed end for Grigor Dimitrov at Wimbledon. His injury on Monday will haunt me not because of its visible gore, but its timing. Few players in men's tennis find themselves holding a 2-0 set lead over the top-ranked player in the world, Jannik Sinner, at a major tournament. In fact, it's been 17 months since anyone held such an advantage on Sinner, and he came back to win that one, anyway. But the No. 19 seed Dimitrov was in that rarefied position, fully in control of this fourth-round match, until he wasn't.\nWhile serving at 1-2 in the third set, Dimitrov missed a low backhand volley and touched the right side of his chest. It looked innocuous enough. On the very next point he hit an ace to win the game, then sat down on the grass, clutching his chest, gasping, and repeating, \"My pec.\"",
          "link": "https://defector.com/on-the-brink-of-a-defining-victory-grigor-dimitrovs-body-failed-him",
          "publishedOn": "2025-07-08T14:24:00.000Z",
          "wordCount": 8290,
          "title": "On The Brink Of A Defining Victory, Grigor Dimitrov’s Body Failed Him",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/dimitrov.jpg"
        },
        {
          "id": "https://defector.com/?p=194580",
          "author": "Ray Ratto",
          "description": "The Fourth of July is always there to remind us that we aren't the country we fancy ourselves being, but this year's national try-not-to-blow-your-hand-off munitions festival was even grimmer given that the current season of Taskmaster's final episode aired on Friday as well. As we all know from our reading, Taskmaster is the absolute zenith of humanity's artistic development, and creator and co-host Alex Horne is proof that the key to television greatness is simply giving a smart and funny person full license to be funny and smart, which includes trusting them to find other people with similar skills. True, I promised I would never rave about this show again, but there has never been a better time for prevaricating frauds with minimal cultural scope, so here we are.\nThat said, Taskmaster is what comes of not being fixated on someone \"winning\" a thing but rather the process that makes the winning worth the walk. Most British game/panel shows use points only as props, where the American versions slap a dollar sign in front of whatever number they find and encourage contestants to take part in a war of all against all, overseen by some host who fails to make up for in name recognition what he lacks in charm. Taskmaster is exactly the kind of show our own \"creatives\" could not produce at gunpoint because they would be too busy trying to turn it into a vehicle for Stephen A. Smith.",
          "link": "https://defector.com/sure-we-gained-our-independence-but-we-lost-the-ability-to-make-anything-as-good-as-taskmaster",
          "publishedOn": "2025-07-08T14:08:46.000Z",
          "wordCount": 9916,
          "title": "Sure, We Gained Our Independence, But We Lost The Ability To Make Anything As Good As ‘Taskmaster’",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/taskmasterSeries19.jpg"
        },
        {
          "id": "https://defector.com/?p=194526",
          "author": "Kelsey McKinney",
          "description": "It's easy to forget that God's covenant is limited. God makes a solemn promise to Noah that He will never flood the whole Earth again ... however. \"Never again will I let floodwaters destroy all life,\" the Bible says He said. But He never promised that He wouldn't let the floodwaters destroy someone's life, or your life. He only promised they wouldn't destroy everyone's at once.\nThis weekend, a mammoth amount of rain fell on the Texas Hill Country. Some experts estimate as much as 15 or even 20 inches of rain fell in just a few hours. More than a literal foot of rain dumped from the sky, with very little warning. I remember storms like these, where it feels as if sheets of rain are pouring down, as if someone reached up with a Bowie knife and sliced open the swollen clouds. But where I grew up in Northern Texas, there is no beautiful winding river for all that water to funnel into like it did this weekend. All of that water, immense and terrifying, poured into the Guadalupe River and its tributaries. In my memory, the Guadalupe River is emerald-green. It carves through limestone hills, and is dotted with cedar and oak and pecan trees. It is dotted with mountain laurel. This weekend it was wrathful. It took all of that rain, and expanded, took the land as its own, broke down trees, swept away people and cars and pets and homes.",
          "link": "https://defector.com/the-floodwaters-are-rising",
          "publishedOn": "2025-07-08T13:01:56.000Z",
          "wordCount": 10014,
          "title": "The Floodwaters Are Rising",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/07/GettyImages-2223865313.jpg"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=859366",
          "author": "Steve Adams",
          "description": "10:45am: The teams have announced the trade. Pittsburgh optioned Devanney to Triple-A Indianapolis. 9:27am: The Royals are set to acquire infielder/outfielder Adam Frazier from the Pirates, reports Robert Murray of FanSided. Kansas City will send infielder Cam Devanney back to Pittsburgh in the trade. Devanney was just selected to the major league roster by the…",
          "link": "https://www.mlbtraderumors.com/2025/07/pirates-trade-adam-frazier-royals.html",
          "publishedOn": "2025-07-16T15:45:41.000Z",
          "wordCount": 5694,
          "title": "Pirates Trade Adam Frazier To Royals",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/adam-frazier-pittsburgh-pirates-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=859167",
          "author": "Steve Adams",
          "description": "The Royals have placed right-hander Michael Lorenzen on the 15-day injured list due to a left oblique strain, per a team announcement. The move is retroactive to July 11, so he’ll be eligible to return no sooner than July 26. He joins fellow starters Cole Ragans (rotator cuff strain) and Alec Marsh (shoulder impingement) on…",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-michael-lorenzen-injured-list-oblique.html",
          "publishedOn": "2025-07-14T17:44:13.000Z",
          "wordCount": 2440,
          "title": "Royals Place Michael Lorenzen On Injured List",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/michael-lorenzen-royals-kansas-city-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=859001",
          "author": "Nick Deeds",
          "description": "The Royals have had a tough season. They’re 46-50, buried in their division by 13 games, and currently sit 4.5 games out of a Wild Card spot with a negative run differential and ace Cole Ragans on injured list. They don’t exactly look like the likeliest buyers with the trade deadline less than three weeks…",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-receiving-interest-in-catching-prospects.html",
          "publishedOn": "2025-07-13T04:10:33.000Z",
          "wordCount": 2795,
          "title": "Royals Receiving Interest In Catching Prospects",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2021/09/USATSI_16519653-1024x677.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=858811",
          "author": "Steve Adams",
          "description": "The Rays made an “early” strike in deadline season yesterday, shipping off their Competitive Balance Round A selection (No. 37 overall) in Sunday’s draft to acquire righty Bryan Baker from the division-rival Orioles. Baker, 30, has had his two worst outings of the season in his final Orioles appearance and last night’s Rays debut —…",
          "link": "https://www.mlbtraderumors.com/2025/07/which-other-draft-picks-are-eligible-to-be-traded-before-sunday.html",
          "publishedOn": "2025-07-11T16:42:53.000Z",
          "wordCount": 4406,
          "title": "Which Other Draft Picks Are Eligible To Be Traded Before Sunday?",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/mlb-draft-tigers-1024x606.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=858658",
          "author": "Nick Deeds",
          "description": "The Red Sox have fought their way back into playoff contention after their shocking trade of franchise face Rafael Devers last month. Boston has rattled off a seven-game win streak to put themselves at a 50-45 record entering play today and in a statistical tie with the Mariners for the final AL Wild Card spot.…",
          "link": "https://www.mlbtraderumors.com/2025/07/poll-which-teams-should-make-the-biggest-push-for-jarren-duran.html",
          "publishedOn": "2025-07-11T01:32:35.000Z",
          "wordCount": 3143,
          "title": "Poll: Which Teams Should Make The Biggest Push For Jarren Duran?",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/06/Jarren_Duran_Red_Sox-copy-1024x683.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=858521",
          "author": "Steve Adams",
          "description": "The Royals announced Wednesday that they’ve signed left-hander Dallas Keuchel to a minor league contract. ESPN’s Jeff Passan notes that Keuchel held a workout for clubs last week, which the Royals attended. He’ll earn a prorated $2MM salary for any time spent on the major league roster. Keuchel, 37, has pitched in parts of 13…",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-sign-dallas-keuchel-to-minor-league-deal.html",
          "publishedOn": "2025-07-09T14:22:28.000Z",
          "wordCount": 3528,
          "title": "Royals Sign Dallas Keuchel To Minor League Deal",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/07/dallas-keuchel-brewers-1024x705.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=858434",
          "author": "Steve Adams",
          "description": "The Royals announced today that they have selected the contract of infielder/outfielder Cam Devanney. In a corresponding active roster move, outfielder Mark Canha has been placed on the 10-day injured list due to left elbow epicondylitis. To open a 40-man spot, left-hander Cole Ragans was transferred to the 60-day IL. Devanney was a 2019 Brewers…",
          "link": "https://www.mlbtraderumors.com/2025/07/royals-select-cam-devanney-transfer-cole-ragans-to-60-day-il.html",
          "publishedOn": "2025-07-08T19:07:39.000Z",
          "wordCount": 2422,
          "title": "Royals Select Cam Devanney, Transfer Cole Ragans To 60-Day IL",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2025/07/Cam_Devanney_Royals-1024x683.jpg"
        }
      ]
    },
    {
      "title": "Flaming Hydra",
      "feedUrl": "https://flaminghydra.com/rss/",
      "siteUrl": "https://flaminghydra.com/",
      "articles": [
        {
          "id": "68781c5518410e00013582ae",
          "author": "The Editors",
          "description": "Jonathan M. Katz remembers the Hotel Oloffson, Port-au-Prince",
          "link": "https://flaminghydra.com/issue-361/",
          "publishedOn": "2025-07-17T00:20:18.000Z",
          "wordCount": 731,
          "title": "Fragile refuge",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/Hotel_Oloffson_2010.06.04_-_07-1.jpg"
        },
        {
          "id": "6877ef5418410e0001358148",
          "author": "Jonathan M. Katz",
          "description": "There was a place in Port-au-Prince called the Oloffson. It housed a nearly century-old hotel, but it was more than that. Earlier this year, amid the spiraling gang war that has seized almost all of Haiti’s capital, the hotel’s enigmatic last owners, Richard and Lunise Morse,",
          "link": "https://flaminghydra.com/a-lost-haven-in-haiti/",
          "publishedOn": "2025-07-17T00:18:47.000Z",
          "wordCount": 791,
          "title": "A Lost Haven in Haiti",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/Hotel_Oloffson_2010.06.04_-_07.jpg"
        },
        {
          "id": "68717277d2c01800010a185a",
          "author": "The Editors",
          "description": "Will California secede? asks Annalee Newitz; tour the inner worlds of Trevor Alixopulos",
          "link": "https://flaminghydra.com/issue-360/",
          "publishedOn": "2025-07-16T00:24:41.000Z",
          "wordCount": 2084,
          "title": "Quitting the Union / Shutting out the world",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/BEAR-Flag_of_California-1.png"
        },
        {
          "id": "68769abeefa3900001458a04",
          "author": "Trevor Alixopulos",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/entrance-exam/",
          "publishedOn": "2025-07-16T00:23:33.000Z",
          "wordCount": 318,
          "title": "Entrance Exam",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/entrancethumb.png"
        },
        {
          "id": "6876b701efa3900001458a62",
          "author": "Annalee Newitz",
          "description": "The Trans March in San Francisco is usually pretty chaotic—there are no fancy floats or formal activities—but this year a group had gotten their shit together to make an enormous, street-spanning trans flag. Its pink, white, and blue stripes stretched for nearly a quarter block. It",
          "link": "https://flaminghydra.com/the-fall-and-rise-of-the-california-republic/",
          "publishedOn": "2025-07-16T00:23:18.000Z",
          "wordCount": 735,
          "title": "The Fall and Rise of the California Republic",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/BEAR-Flag_of_California.png"
        },
        {
          "id": "6876c996efa3900001458b8d",
          "author": "The Editors",
          "description": "by The Editors\n\nSubscribe to Flaming Hydra to play HYDRANYM! And tell your friends who love WORD GAMES who might, for any number of reasons, be looking out for a new word game to play online. \n\n[countdown to 2025-07-17 12:00am PDT]\nENTER NOW... AND COME BACK\nTHURSDAY, JULY 17,",
          "link": "https://flaminghydra.com/hydranym-no-8/",
          "publishedOn": "2025-07-16T00:22:53.000Z",
          "wordCount": 557,
          "title": "HYDRANYM No. 8",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/HYDRANYM-4.jpg"
        },
        {
          "id": "6875703fd2c01800010a1c6e",
          "author": "The Editors",
          "description": "Julianne Escobedo Shepherd + Megan Greenwell talk money; a free-for-all podcast on SUPERMAN; Zach Rabiroff on the Man of Steel",
          "link": "https://flaminghydra.com/issue-359/",
          "publishedOn": "2025-07-14T23:16:13.000Z",
          "wordCount": 716,
          "title": "Almighty dollar / Popular powers",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/meg-2.jpg"
        },
        {
          "id": "68756e35d2c01800010a1c64",
          "author": "Julianne Escobedo Shepherd",
          "description": "A conversation with author Megan Greenwell",
          "link": "https://flaminghydra.com/the-public-is-catching-on-about-private-equity/",
          "publishedOn": "2025-07-14T23:15:54.000Z",
          "wordCount": 596,
          "title": "The Public Is Catching on About Private Equity",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/meg.jpg"
        },
        {
          "id": "687576dcd2c01800010a1d3b",
          "author": "Zach Rabiroff",
          "description": "It is the way of the world that Clark Kent must periodically stand in the dock before the nerds of the world to answer a single question: is Superman a fascist?\nThere are two schools of thought on this matter. The first is what we might call the Alan Moore",
          "link": "https://flaminghydra.com/superman-is-as-good-as-we-can-stand-him-being/",
          "publishedOn": "2025-07-14T23:15:33.000Z",
          "wordCount": 720,
          "title": "Superman Is as Good as We Can Stand Him Being",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/Screenshot-2025-07-14-at-6.51.22---PM.jpg"
        },
        {
          "id": "68757a9bd2c01800010a1d78",
          "author": "Zach Rabiroff",
          "description": "Sam Thielman, Josephine Riesman, Zach Rabiroff, and S.I. Rosenbaum discuss the new SUPERMAN movie. Joe MacLeod pressed the RECORD button.\nListen on Apple/Spotify/RSS/plus more options at pod.link \n\nEpisode 11: The Ultimate Truth of Superman\nJosephine Riesman, Zach Rabiroff, S.I. Rosenbaum, and Sam",
          "link": "https://flaminghydra.com/podcast-episode-11-the-ultimate-truth-of-superman/",
          "publishedOn": "2025-07-14T23:15:00.000Z",
          "wordCount": 530,
          "title": "PODCAST! Episode 11: The Ultimate Truth of Superman",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/superman-title-IMG_4732.png"
        },
        {
          "id": "68703719d2c01800010a025e",
          "author": "The Editors",
          "description": "Kim Kelly appreciates municipal services, and Arwa Mahdawi concludes her true crime investigation",
          "link": "https://flaminghydra.com/issue-358/",
          "publishedOn": "2025-07-11T01:02:47.000Z",
          "wordCount": 710,
          "title": "Waste land / Colder case",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/trassh.jpg"
        },
        {
          "id": "6870218fd2c01800010a0188",
          "author": "Kim Kelly",
          "description": "Like a lot of city things, municipal trash pickup still feels like a recent development to me. The first 18 years of my life were spent in silence and clean pine-scented air under velvety black skies riotous with stars. The next 20 unfolded in tour vans and dive bars and",
          "link": "https://flaminghydra.com/who-takes-out-your-garbage/",
          "publishedOn": "2025-07-11T01:01:33.000Z",
          "wordCount": 708,
          "title": "Who Takes Out Your Garbage?",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/trassh-1.jpg"
        },
        {
          "id": "687028efd2c01800010a01aa",
          "author": "Arwa Mahdawi",
          "description": "In July 1996, 36-year-old Susan Walsh supposedly left her house in New Jersey and never came back. She is presumed dead but a body has never been found. \nTo catch up on the story, here are Part One, Part Two, Part Three, Part Four , Part Five, and Part Six.",
          "link": "https://flaminghydra.com/how-to-solve-a-murder-part-seven/",
          "publishedOn": "2025-07-11T01:00:11.000Z",
          "wordCount": 818,
          "title": "How to Solve a Murder: Part Seven",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/image1.png"
        },
        {
          "id": "68703b61d2c01800010a0290",
          "author": "The Editors",
          "description": "It is time to attend to our solemn duty, and select from the following 21 entries on the theme: \nBIRTH \nto choose the victor of Hydranym No. 7. \nHYDRANYM is the Creative Writing word game especially for Flaming Hydra subscribers. Please join in! It’s fun, and you will",
          "link": "https://flaminghydra.com/hydranym-no-7-vote/",
          "publishedOn": "2025-07-11T00:45:28.000Z",
          "wordCount": 442,
          "title": "HYDRANYM No. 7: Vote!",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/HYDRANYM-3.jpg"
        },
        {
          "id": "686ec0b9bebdef0001f47fb5",
          "author": "The Editors",
          "description": "Misha Angrist talks fashion and neurology with Rick Bedlack; a valedictory sendoff for Linda Yaccarino by Joe MacLeod",
          "link": "https://flaminghydra.com/issue-357/",
          "publishedOn": "2025-07-09T23:40:19.000Z",
          "wordCount": 624,
          "title": "Listen to the suit / Talk to the hands",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/BedlackTurquoiseFashionably-crop-16x9-1.png"
        },
        {
          "id": "686eb3acbebdef0001f47f90",
          "author": "Misha Angrist",
          "description": "“There’s just a lot of despair in the world right now,” Rick Bedlack says. “There’s a lot of anger and negativity.” \nHe is 6’3” in cowboy boots, sporting large glasses, a full head of gray hair with a",
          "link": "https://flaminghydra.com/a-loud-suit-of-armor/",
          "publishedOn": "2025-07-09T23:40:08.000Z",
          "wordCount": 595,
          "title": "A Loud Suit of Armor",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/BedlackTurquoiseFashionably-crop-16x9.png"
        },
        {
          "id": "686ef257bebdef0001f48158",
          "author": "Joe MacLeod",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/remembering-linda-yaccarinos-career-at-x-dot-com-in-gestures/",
          "publishedOn": "2025-07-09T23:39:56.000Z",
          "wordCount": 364,
          "title": "Remembering Linda Yaccarino’s Career at X dot Com in Gestures",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/tiny-violin-hand.jpg"
        },
        {
          "id": "686d7244bebdef0001f46b05",
          "author": "The Editors",
          "description": "Miles Klee, naysayer; return to the road with Jack Pendarvis",
          "link": "https://flaminghydra.com/issue-356/",
          "publishedOn": "2025-07-09T00:39:50.000Z",
          "wordCount": 478,
          "title": "Not buying it / Suspending disbelief",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/No-sans-1.png"
        },
        {
          "id": "686d7728bebdef0001f46b27",
          "author": "Jack Pendarvis",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/ace-goes-to-hollywood-episode-8/",
          "publishedOn": "2025-07-09T00:39:04.000Z",
          "wordCount": 330,
          "title": "Ace Goes to Hollywood: Episode 8",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/manbun-16x9-edit.jpg"
        },
        {
          "id": "686698075fc5d20001174518",
          "author": "Miles Klee",
          "description": "Any headline that ends in a question mark can be answered by the word “No.”  \n                               —Betteridge's law of headlines\nQ. My neighbor’s dog often leaves solid waste on the tree lawn in front of his house. The piles are huge (the dog is",
          "link": "https://flaminghydra.com/betteridges-advice-column/",
          "publishedOn": "2025-07-09T00:38:38.000Z",
          "wordCount": 507,
          "title": "Betteridge's Advice Column",
          "imageUrl": "https://flaminghydra.com/content/images/2025/07/No-sans.png"
        },
        {
          "id": "686d7777bebdef0001f46b2c",
          "author": "The Editors",
          "description": "a fiery writer-owned cooperative",
          "link": "https://flaminghydra.com/hydranym-no-7/",
          "publishedOn": "2025-07-08T20:07:27.000Z",
          "wordCount": 321,
          "title": "HYDRANYM No. 7",
          "imageUrl": "https://flaminghydra.com/content/images/size/w1200/2025/07/HYDRANYM-2.jpg"
        }
      ]
    },
    {
      "title": "Today in Tabs",
      "feedUrl": "https://rss.beehiiv.com/feeds/ZRiesnGI0u.xml",
      "siteUrl": "https://www.todayintabs.com/",
      "articles": [
        {
          "id": "https://www.todayintabs.com/p/getting-my-concussy-slonked-silly-style-17b0",
          "author": "Rusty Foster",
          "description": "sqɐ┴ uʍop ǝpᴉsd∩",
          "link": "https://www.todayintabs.com/p/getting-my-concussy-slonked-silly-style-17b0",
          "publishedOn": "2025-07-14T20:36:03.000Z",
          "wordCount": 9765,
          "title": "Getting My Concussy Slonked Silly Style",
          "enclosure": {
            "url": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/c78cfbcc-1473-499b-a328-2edcb8b5b529/Screenshot_2025-07-14_at_4.27.40_PM.png",
            "length": "930537",
            "type": "image/png"
          },
          "imageUrl": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/c78cfbcc-1473-499b-a328-2edcb8b5b529/Screenshot_2025-07-14_at_4.27.40_PM.png"
        },
        {
          "id": "https://www.todayintabs.com/p/what-would-you-do-617f",
          "author": "Rusty Foster",
          "description": "It happened here.",
          "link": "https://www.todayintabs.com/p/what-would-you-do-617f",
          "publishedOn": "2025-07-08T20:56:11.000Z",
          "wordCount": 19135,
          "title": "What Would You Do?",
          "enclosure": {
            "url": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/454a405a-4367-4a4c-988a-950cb78dedc4/IMG_1819.PNG",
            "length": "651477",
            "type": "image/png"
          },
          "imageUrl": "https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/454a405a-4367-4a4c-988a-950cb78dedc4/IMG_1819.PNG"
        }
      ]
    },
    {
      "title": "Bad Faith Times",
      "feedUrl": "https://bad-faith-times.ghost.io/rss/",
      "siteUrl": "https://badfaithtimes.com/",
      "articles": [
        {
          "id": "68780216bc051b000154ec20",
          "author": "Denny Carter",
          "description": "What will it take for liberals to see there is no returning to political norms?",
          "link": "https://badfaithtimes.com/the-norms-respecters-have-to-be-stopped/",
          "publishedOn": "2025-07-17T12:18:00.000Z",
          "wordCount": 2405,
          "title": "The Norms Respecters Have To Be Stopped",
          "imageUrl": "https://badfaithtimes.com/content/images/size/w1200/2025/07/download.webp"
        },
        {
          "id": "687541afe989ff0001fb5e35",
          "author": "Denny Carter",
          "description": "The American right's bad-faith worldview and the entire MAGA project is threatened by Trump's inaction on the Epstein files.",
          "link": "https://badfaithtimes.com/why-the-epstein-thing-is-different/",
          "publishedOn": "2025-07-14T18:29:27.000Z",
          "wordCount": 2058,
          "title": "Why The Epstein Thing Is Different",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/07/unnamed--1-.jpg"
        },
        {
          "id": "687131b5fd1d790001c3137f",
          "author": "Denny Carter",
          "description": "The press is doing everything it can to delegitimize the platform of Zohran Mamdani",
          "link": "https://badfaithtimes.com/bft-video-pod-npr-wonders-if-rural-americans-like-affordable-groceries/",
          "publishedOn": "2025-07-11T16:16:22.000Z",
          "wordCount": 595,
          "title": "BFT Video Pod: NPR Wonders If Rural Americans Like Affordable Groceries",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/07/Screenshot-2025-07-11-at-12.15.02---PM.png"
        },
        {
          "id": "686eb872499d4500016cbc98",
          "author": "Denny Carter",
          "description": "No. 1 sucks too!",
          "link": "https://badfaithtimes.com/republicans-5-worst-bad-faith-arguments-democracy-enjoyers-hate-no-3/",
          "publishedOn": "2025-07-10T11:31:41.000Z",
          "wordCount": 3600,
          "title": "Republicans' 5 Worst Bad-Faith Arguments (Democracy Enjoyers HATE No. 3)",
          "imageUrl": "https://badfaithtimes.com/content/images/2025/07/Screenshot-2025-07-09-at-3.13.36---PM.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}