{
  "sources": [
    {
      "title": "Royals – FanGraphs Baseball",
      "feedUrl": "https://www.fangraphs.com/blogs/category/teams/royals/feed/",
      "siteUrl": "https://blogs.fangraphs.com",
      "articles": []
    },
    {
      "title": "The Pitch",
      "feedUrl": "https://www.thepitchkc.com/feed/",
      "siteUrl": "https://www.thepitchkc.com/",
      "articles": [
        {
          "id": "https://www.thepitchkc.com/?p=865392",
          "author": "Eli Ralls",
          "description": "Kansas City Mavericks versus Savannah Ghost Pirates on Wednesday, Dec. 11, 2024 at Cable Dahmer Arena. // Photo by Eli Ralls The Kansas City Mavericks continue to roll ECHL talent to the side, as they claim their fifth straight victory, taking a 3-1 match from the Savannah Ghost Pirates on Wednesday, Dec. 11 at Cable Dahmer Arena. Both teams got...",
          "link": "https://www.thepitchkc.com/photos-kc-mavericks-slide-to-five-straight-wins-after-a-3-1-victory-over-savannah/",
          "publishedOn": "2024-12-13T15:00:06.000Z",
          "wordCount": 1855,
          "title": "Photos: KC Mavericks slide to five straight wins after a 3-1 victory over Savannah",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/m/f/kc-mavericks-v-ghost-piriates-12-11-24-02.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864098",
          "author": "Beth Lipoff",
          "description": "Photo Courtesy of Rebel Song Academy Writing a song and performing it yourself in front of an audience can seem daunting, but the kids in Art as Mentorship’s Rebel Song Academy have plenty of stepping stones to help them strut to the stage. In the academy, it doesn’t matter if you’re 9 or 19—You’re getting guidance on the process of...",
          "link": "https://www.thepitchkc.com/kc-cares-rhyme-reason-rebel-song-academy-is-streamlining-students-to-the-center-stage/",
          "publishedOn": "2024-12-13T14:00:01.000Z",
          "wordCount": 2332,
          "title": "KC Cares: Rhyme & Reason: Rebel Song Academy is streamlining students to the center stage",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/j/l/rebel-song-1-scaled.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=865379",
          "author": "Abby Olcese",
          "description": "Courtesy A24 The main character of William S. Burroughs’ novels Junkie, Queer and Naked Lunch is a literary alter-ego for Burroughs himself. In film, the character first appeared in David Cronenberg’s adaptation of Naked Lunch, where he was played by Peter Weller. Now, in Luca Guadagnino and Justin Kuritzkes’s adaptation of Queer, he’s back again, played by Daniel Craig.  Lee,...",
          "link": "https://www.thepitchkc.com/queer-uses-daniel-craig-for-a-lonely-and-introspective-look-at-william-s-burroughs/",
          "publishedOn": "2024-12-13T03:32:11.000Z",
          "wordCount": 2162,
          "title": "Queer uses Daniel Craig for a lonely and introspective look at William S. Burroughs",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/12/h/u/screenshot-2024-12-12-at-83629pm.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=865326",
          "author": "Sarah Sipple",
          "description": "Art by Cassondra Jones Life in KC is pretty delicious. In fact, there is often so much going on that it can be hard to decide where to go and what to try. That’s where I come in.  I’ve curated this weekly list of events, openings, deals, and celebrations to keep you in-the-know. Cheers! Something New Cocktail Week: The Pitch...",
          "link": "https://www.thepitchkc.com/kc-sipps-half-price-cocktails-operation-meatball-and-more-restaurant-news/",
          "publishedOn": "2024-12-12T19:00:38.000Z",
          "wordCount": 2064,
          "title": "KC Sipps: Half-price cocktails, Operation Meatball, and more restaurant news",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2023/08/v/i/kc-sipps-1024x538-1.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864305",
          "author": "Nick Spacek",
          "description": "Illustrated by Katelyn Betz Christmas is in less than three weeks. You’ve already checked out from your job and are only pretending to work. Why not skip that Zoom webinar and instead watch these wonderful new music videos from some of the area’s most talented acts? We have a whole lot of angry music to keep you awake and energized,...",
          "link": "https://www.thepitchkc.com/hellevate-lone-stranger-flora-from-kansas-and-more-of-the-best-local-music-videos/",
          "publishedOn": "2024-12-12T17:00:50.000Z",
          "wordCount": 2223,
          "title": "Hellevate, Lone Stranger, Flora From Kansas, and more of the best local music videos",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/y/u/screenshot-2024-12-06-at-103151pm.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=865361",
          "author": "Adrian Torres",
          "description": "This has been a big (read: long) year for Sony Spider-Man offshoots. The year began with the meme-friendly Madame Web, and continued with a lackluster third entry in the Venom trilogy. The latest (and hopefully last) outing in this experiment in intellectual property ownership, director J.C. Chandor’s Kraven the Hunter, is one of the better entries, but that’s not saying...",
          "link": "https://www.thepitchkc.com/kraven-the-hunter-is-yet-another-forgettable-sony-superhero-misfire/",
          "publishedOn": "2024-12-12T00:51:36.000Z",
          "wordCount": 2039,
          "title": "Kraven the Hunter is yet another forgettable Sony superhero misfire",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/12/x/y/screenshot-2024-12-11-at-50805pm.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864086",
          "author": "Kristen Thomas",
          "description": "Illustration by Shelby Phelps As a friend daydreamed aloud during our walk, she said, “I would love to have a St. Andrew’s cross, but we can’t have that in our room with the kids around.” She trailed off disappointed, her bottom lip jutting out in a pout. “Why not?” I asked without hesitation, since challenging people’s notions is second nature...",
          "link": "https://www.thepitchkc.com/keep-them-coming-pleasure-by-design/",
          "publishedOn": "2024-12-11T17:00:23.000Z",
          "wordCount": 2512,
          "title": "Keep Them Coming: Pleasure by Design",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2021/12/m/v/text-banner-1-scaled-e1638915993401.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=865263",
          "author": "Tiffany Watts",
          "description": "Midtown Kava // Photo By Tiffany Watts Midtown Kava I’ve always loved discovering places that make me want to stay a little longer, and Midtown Kava is exactly that kind of spot. As a first-timer to the world of kava, I wasn’t quite sure what to expect, but this cozy Midtown lounge turned out to be a hidden gem. Walking...",
          "link": "https://www.thepitchkc.com/dish-drink-kc-neighborhood-favorites-at-midtown-kava-and-kittys-cafe/",
          "publishedOn": "2024-12-11T14:00:56.000Z",
          "wordCount": 2115,
          "title": "Dish & Drink KC: Neighborhood favorites at Midtown Kava and Kitty’s Cafe",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/z/k/kittys-cafe-photo-by-tiffany-watts-3-e1733856606480.jpeg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=865044",
          "author": "Sarah Sipple",
          "description": "Pink Pony Christmas at Vignettes // Photo by Sarah Sipple Vignettes, North KC’s rotating-theme bar, has donned all the gay apparel for a Chappell Roan-inspired pop-up. Pink Pony Christmas is open now and runs through January 11.  Though “Christmas” is in the pop-up’s title, this theme is 98% Chappell Roan and 2% Christmas. The only holiday elements I observed were...",
          "link": "https://www.thepitchkc.com/pink-pony-christmas-pop-up-at-vignettes-is-less-holiday-and-more-pop-glitz/",
          "publishedOn": "2024-12-10T22:00:56.000Z",
          "wordCount": 1936,
          "title": "Pink Pony Christmas pop-up at Vignettes is less holiday and more pop glitz",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/12/r/t/img-4836-1024x768.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864293",
          "author": "Sarah Sipple",
          "description": "Tortilla Soup at Ixtapa Fine Mexican Cuisine // Photo by Sarah Sipple Ixtapa is one of those restaurants that I stumbled upon one day in the Northland. After a simple dinner, I was ready to tell everyone I knew about it. Then I exited through the breezeway and noticed what was on the wall: Plaques and framed headlines covered the...",
          "link": "https://www.thepitchkc.com/eat-this-now-tortilla-soup-at-ixtapa-fine-mexican-cuisine/",
          "publishedOn": "2024-12-10T20:00:51.000Z",
          "wordCount": 1779,
          "title": "Eat This Now: Tortilla Soup at Ixtapa Fine Mexican Cuisine",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/b/s/img-2678-scaled.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=865062",
          "author": "Kelsey Webster",
          "description": "Nate Jackson // Photo by Kelsey Webster As a concert photographer, when we attended the Nate Jackson show at Uptown Theater on Friday, Dec. 6, we were expecting live music or at least a comedic musician. However, Nate Jackson and his four openers, Trenton Cotten, Nate Robinson, Soo Ra, and Kanisha Buss, delivered some of the best stand up that...",
          "link": "https://www.thepitchkc.com/comedian-nate-jackson-roasts-the-uptown-and-earns-a-new-fan-in-the-process/",
          "publishedOn": "2024-12-10T18:00:00.000Z",
          "wordCount": 2061,
          "title": "Comedian Nate Jackson roasts The Uptown and earns a new fan in the process",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/c/c/nate-jackson-3-scaled-e1733843116528.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=865232",
          "author": "Clara Bates",
          "description": "The Supreme Court of Missouri in Jefferson City, as photographed on May 24, 2023 (Annelise Hanshaw/Missouri Independent) Missouri’s new law boosting the minimum wage and providing paid sick leave for workers should be thrown out because it violated constitutional rules on ballot initiatives, a coalition of business advocacy groups argued in a lawsuit filed Friday. Proposition A, a ballot measure...",
          "link": "https://www.thepitchkc.com/business-groups-file-legal-challenge-to-voter-approved-minimum-wage-hike-sick-leave/",
          "publishedOn": "2024-12-10T17:01:14.000Z",
          "wordCount": 2456,
          "title": "Business groups file legal challenge to voter-approved minimum wage hike, sick leave",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/12/s/p/050124-wageip3-scaled-1.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864016",
          "author": "Nick Spacek",
          "description": "In an effort to keep you all abreast of the latest local music that’s not album or music video related, we present the latest installment of our irregular feature, Single Sentence Singles. We take a listen to the latest local singles to hit Soundcloud, Spotify, Bandcamp, et al, and sum them up in one sentence. Simple enough? Here we go....",
          "link": "https://www.thepitchkc.com/single-sentence-singles-the-best-kc-lfk-original-tracks-for-december-24/",
          "publishedOn": "2024-12-10T17:00:08.000Z",
          "wordCount": 2595,
          "title": "Single Sentence Singles: The best KC/LFK original tracks for December ’24",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/k/n/screenshot-2024-12-07-at-61551pm.png"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864129",
          "author": "Michael Mackie",
          "description": "Photo Courtesy of Janis Kliethermes In her 15-plus years as an etiquette expert, Janis Kliethermes has seen every awkward faux pas known to man. Undaunted, she’s been on a one-woman crusade to nip each and every one of ’em in the bud through her business, Etiquette Kansas City. (Loud chewers, we’re talking to you!) “I specialize in helping individuals and teams build...",
          "link": "https://www.thepitchkc.com/four-inane-questions-with-local-etiquette-expert-janis-kliethermes/",
          "publishedOn": "2024-12-10T14:00:19.000Z",
          "wordCount": 1889,
          "title": "Four Inane Questions with local etiquette expert Janis Kliethermes",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/i/i/440341254-835594155272083-4492938767249464571-n.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864403",
          "author": "Tarik Sykes",
          "description": "Gauge Young celebrating after defeating Eric Grant at FAC MMA 27 on Friday, Dec. 6, 2024 at Cable Dahmer Arena. // Photo by Tarik Sykes The Fighting Alliance Championship (FAC) MMA 27 took place at Cable Dahmer Arena this past Friday, Dec. 6. The main card consisted of four bouts—Austin Spangler versus Mauricio Rodriguez, Stefaan Jefferson versus Brian Sullivan, Zach...",
          "link": "https://www.thepitchkc.com/photos-midwests-own-gauge-young-finishes-eric-grant-at-fac-mma-27/",
          "publishedOn": "2024-12-09T18:06:39.000Z",
          "wordCount": 1661,
          "title": "Photos: Midwest’s own Gauge Young finishes Eric Grant at FAC MMA 27",
          "imageUrl": "https://www.thepitchkc.com/content/uploads/2024/12/v/u/tms7416-2-scaled.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864068",
          "author": "Kaylynn Mullins",
          "description": "Photo Courtesy of Unsplash Ladies, we don’t have to pretend anymore. We all know that the romance novel you’re devouring isn’t a Hallmark movie meet-cute; It’s 400 pages of smut. We’re finally embracing our degeneracy in the novel department, and the demand for our sexy stories is being met right here in Kansas City.  On Nov. 2, KARMA Community Market...",
          "link": "https://www.thepitchkc.com/smut-smitten-naughty-narratives-puts-kcs-spiciest-authors-on-top/",
          "publishedOn": "2024-12-09T17:00:34.000Z",
          "wordCount": 2506,
          "title": "Smut Smitten: Naughty Narratives puts KC’s spiciest authors on top",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/o/t/new-naughty-narratives-pic-1.jpg"
        },
        {
          "id": "https://www.thepitchkc.com/?p=864030",
          "author": "Jordan Baranowski",
          "description": "Photo by Anna Petrow Kansas City has no shortage of restaurants that showcase local products like meats, cheeses, produce, and beer. However, only a select few live on both sides of the “farm-to-table” equation.  That’s where Green Dirt on Oak comes in. On the longer-standing half of the family, you have the meats and cheeses of Weston’s Green Dirt Farm,...",
          "link": "https://www.thepitchkc.com/money-grows-on-cheese-green-dirt-on-oak-serves-up-the-shortest-path-from-farm-to-table/",
          "publishedOn": "2024-12-09T14:00:46.000Z",
          "wordCount": 2635,
          "title": "Money Grows on Cheese: Green Dirt on Oak serves up the shortest path from farm-to-table",
          "imageUrl": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.thepitchkc.com/content/uploads/2024/12/p/j/bigboardaboveangle-scaled.jpg"
        }
      ]
    },
    {
      "title": "Defector",
      "feedUrl": "https://defector.com/feed",
      "siteUrl": "https://defector.com/",
      "articles": [
        {
          "id": "https://defector.com/?p=176223",
          "author": "Maitreyi Anantharaman",
          "description": "Watch enough Hannah Hidalgo games on TV, and you’ll grow used to hearing that she plays with “joy.” Glee, I could see. Abandon, sure. But joy feels too clean and delicate a word to describe the way Hidalgo conducts herself on a basketball court: the mean mug, the wagged tongue, after a parabolic pull-up three. The screams. The screams! There is so much screaming: when she finds a teammate on the run, when she launches into someone’s shoulder at the rim, topples to the ground, and draws a foul. They convince me less of her “love for the game” than of her pure, uncut hatred for opponents.\nForget shoulder shrugs or sly smiles; Hidalgo exists on a higher plane of expression. Never has a player been so delighted to demoralize. (Perhaps I’m projecting this malevolence on account of her Instagram stories, which range from bland disavowals of same-sex marriage to the somewhat more intriguing claim that Britney Spears, Katy Perry, Beyoncé and Ariana Grande “ARE ALL WITCHES” whose music is “satanic inspired” and “designed to pull you away from the creator.” Give her credit for consistency: She’s a nut on and off the court.)",
          "link": "https://defector.com/hannah-hidalgo-plays-like-a-woman-possessed",
          "publishedOn": "2024-12-13T19:36:34.000Z",
          "wordCount": 6929,
          "title": "Hannah Hidalgo Plays Like A Woman Possessed",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2189667718.jpg"
        },
        {
          "id": "https://defector.com/?p=175531",
          "author": "Billy Haisley",
          "description": "One of the most surprising signings of the summer transfer window was also one of the quietest. Coming off of three unremarkable but respectable seasons in Spain, and at a crossroad of sorts in a career nearing but not yet in its final leg, Memphis Depay went left. Rather than join any of the usual suspects in one of Europe's major leagues, the Dutch forward opted instead to go to Brazil to play for Corinthians.\nIt is true that it wasn't exactly clear what the next logical step for Memphis's career would be. If redemption in the eyes of the greater soccer world was what he'd been after at Barcelona and Atlético Madrid, a chance to return to the elite and avenge himself for the lasting damage his Manchester United flameout did to his reputation, he didn't get it. So where to next? His fame, pedigree, age, status with the national team, and ambitions made for a peculiar mix, narrowing his potential options.",
          "link": "https://defector.com/memphis-depay-was-made-for-brazil",
          "publishedOn": "2024-12-13T19:19:28.000Z",
          "wordCount": 12094,
          "title": "Memphis Depay Was Made For Brazil",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2187555248.jpg"
        },
        {
          "id": "https://defector.com/?p=176238",
          "author": "Tom Ley",
          "description": "Yesterday, I ran into a problem. At around 4:00 p.m. ET, I poured myself a fresh cup of coffee. Then I had a brief video call with a colleague, for 15 or 20 minutes. Once the call was over, I went to take a sip of my coffee. It wasn't there. It wasn't anywhere. I couldn't find my coffee.",
          "link": "https://defector.com/i-lost-my-coffee",
          "publishedOn": "2024-12-13T18:43:46.000Z",
          "wordCount": 6847,
          "title": "I Lost My Coffee",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-1240717875.jpg"
        },
        {
          "id": "https://defector.com/?p=176180",
          "author": "Alan Kluegel",
          "description": "Gladiator II, Ridley Scott's sequel to Ridley Scott's Gladiator, is neither a good movie nor a bad movie—instead, it is easily one of the most movies in recent memory. Overstuffed and overacted (these are not complaints, mind you), Gladiator II has so much going on that the presence of (spoilers beyond this point) frickin' sharks in the frickin' Colosseum doesn't even make its Wikipedia summary. But look beyond the excesses of the film—easier said than done, given that a gladiator riding a rhinoceros like a surfboard appears not even halfway through—and there's another story here, one about how the politics of these films changed dramatically between the 2000 original and its 2024 sequel, and what that change says about the stories that America can still believe about itself.\nIn Gladiator, Rome is a civilizing force (the opening battle is a victory over barbarian tribes), and is on the verge of peacefully transitioning back to a republic. This version of Rome is a fundamentally virtuous nation that is threatened when Commodus, a vain and selfish degenerate, takes the reins of power instead of Maximus, the Cincinnatus-like humble general chosen by the dying emperor to return republicanism to the empire, who is subsequently exiled. It is essentially a late–Clinton-era narrative about America: A proud state has been brought low by the peccadillos of a flagrantly libertine leader who habitually disrespects the military, and the only way to return the nation to glory is for a morally upstanding political outsider (not one of those hated \"career politicians\") to defeat and remove this dishonorable interloper. And when Maximus completes his task and lays dying—term limited by Commodus's dagger—he demands that power be returned to the Senate. Even in death, Maximus was an institutionalist.",
          "link": "https://defector.com/ii-decadent-ii-decrepit-the-politics-of-gladiator-ii",
          "publishedOn": "2024-12-13T17:01:46.000Z",
          "wordCount": 8387,
          "title": "II Decadent II Decrepit: The Politics Of ‘Gladiator II’",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/gladiiator.jpg"
        },
        {
          "id": "https://defector.com/?p=176220",
          "author": "Tom Ley",
          "description": "Why is Bill Belichick the new head football coach for the University of North Carolina? Reporting done by The Athletic's Jeff Howe, combined with the fact that no professional team offered Belichick a job last offseason, would indicate that Belichick was forced into a college job because the NFL no longer wants him. But sources close to the man himself would like to tell a different story, and have done so through ESPN's Seth Wickersham. No, the NFL didn't turn its back on Belichick; he turned his back on it. \"This is a big fuck you to the NFL,\" is how one of Belichick's confidants described the decision to Wickersham.\nOK, sure. It doesn't really matter if any of us believe that a guy who is just 15 victories away from breaking Don Shula's all-time wins record willingly walked away from the NFL in order to coach football at a basketball school. What matters is that Belichick, and the people around him, seem to truly believe that.",
          "link": "https://defector.com/its-a-good-time-be-one-of-bill-belichicks-lackeys",
          "publishedOn": "2024-12-13T16:39:06.000Z",
          "wordCount": 6511,
          "title": "It’s A Good Time Be One Of Bill Belichick’s Lackeys",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2189629093.jpg"
        },
        {
          "id": "https://defector.com/?p=176191",
          "author": "Lauren Theisen",
          "description": "I want to tell you about Walt Whitman in denim cutoffs doing Lana Del Rey karaoke. I also want to tell you about the goldfish puppet who monologued about his existence for about three times as long as I was expecting. But first I should probably explain at least the basics.\nGive Me Carmelita Tropicana!, the final production for Soho Rep in its extremely intimate space on Walker Street, is a delirious supernatural caper written by Alina Troyano and Branden Jacobs-Jenkins. Troyano plays herself and Ugo Chukwu plays Jacobs-Jenkins as they chase the incorporeal title character—a real-life performance persona of Troyano's—through both New York City and a fantasy universe inhabited by Troyano's past characters. Both of the psychedelic experiences I mentioned appear before you in its intermission-free two hours (a good thing; you won't want to escape), along with so much more that can't be done justice as written words, and maybe shouldn't. The momentum and elements of surprise never falter. This is a kaleidoscopic celebration of freedom, of all you can do with craftsmanship, imagination, and an audience willing to join you on the journey.",
          "link": "https://defector.com/give-me-carmelita-tropicana-revels-in-the-full-potential-of-theater",
          "publishedOn": "2024-12-13T15:27:10.000Z",
          "wordCount": 6390,
          "title": "‘Give Me Carmelita Tropicana!’ Seizes The Full Potential Of The Theater",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/241107_CTropicana_SetUps-464_png.jpg"
        },
        {
          "id": "https://defector.com/?p=176201",
          "author": "Ray Ratto",
          "description": "You can tell a lot about people simply from watching how they experience schadenfreude. Actually, to be honest, there's only one thing you can tell about people based on their capacity for reveling in others' misery, and that's how much of a bastard they are. But it’s very good for that.\nWith that in mind, our tale. Our niece traveled from Oregon with her son so that they could take in Thursday's Rams-49ers game in Santa Clara, a sort of family treat gone amusingly wrong. That should explain the schadenfreude thing. Sure, being at that soggy and miserable slog was awful for them, but at least we stayed dry and warm and drank for free. You have to take your victories as they present themselves.",
          "link": "https://defector.com/that-was-just-awful",
          "publishedOn": "2024-12-13T14:53:34.000Z",
          "wordCount": 7031,
          "title": "That Was Just Awful",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2189681700.jpg"
        },
        {
          "id": "https://defector.com/?p=176162",
          "author": "Ben Tippett",
          "description": "Gukesh D is the 18th world chess champion at just 18 years of age. His heart-stopping title match against Ding Liren came down to an inexplicable endgame blunder in the 14th and final game. The challenger had taken the match lead in Game 11 only to lose in Game 12, as Ding looked set to once again come from behind to win in a world championship match. All tied up going into final classical game, we looked inevitably headed for the simplest of draws when Ding blundered a technical endgame win. Gukesh took advantage and now stands astride the chess world, $1.35 million richer, as its new king. \nLet’s recap Games 8-14, notating moves which actually occurred during the games in bold, and hypothetical variations which did not occur but could have in italics. If you missed out, check out our preview piece and recap of Games 1-7.",
          "link": "https://defector.com/gukesh-d-unleashed-the-zugzwang-to-become-the-youngest-world-chess-champion-in-history",
          "publishedOn": "2024-12-13T14:18:09.000Z",
          "wordCount": 20808,
          "title": "Gukesh D Unleashed The Zugzwang To Become The Youngest World Chess Champion In History",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2188905178.jpg"
        },
        {
          "id": "https://defector.com/?p=176014",
          "author": "David Roth",
          "description": "It is hard to know what middle age looks like for a podcast. The medium itself isn't that old, although the form in which it exists—people talking, about something, in some kind of shape and to some sort of end—is not merely ancient but one of the most fundamental aspects of what it means to be human. So if you consider the fact that this is the 100th episode of The Distraction with Multitude, and that we also recorded more than 100 episodes during our previous engagement with Stitcher, and also that we had a very similar podcast before that at the old site—hold on, I need to lie down for a minute. This'll just be a minute. Just give me a minute.",
          "link": "https://defector.com/one-hundred-distractions-deep-with-eric-silver",
          "publishedOn": "2024-12-12T20:29:08.000Z",
          "wordCount": 6724,
          "title": "One Hundred Distractions Deep, With Eric Silver",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2180005466.jpg"
        },
        {
          "id": "https://defector.com/?p=176127",
          "author": "Giri Nathan",
          "description": "The Knicks fans' fixation on Trae Young had become unseemly. Why were packs of feral bridge-and-tunnelers chanting the name of the Atlanta Hawks guard, unprompted, in regular-season blowouts of unrelated opponents? It had been three years since Young had humiliated their team in the postseason, and yet the phrase \"Fuck Trae Young\" had never left their lips. Sure, he held up his end of the bargain, telling visiting Knicks fans to \"take y'all ass home\" after a win in Atlanta last month, but their hatred still seemed disproportionate. Young seemed to have taken up residence in their heads without paying all that much in rent. At least the Hawks' 108-100 win over the Knicks in Wednesday's NBA Cup quarterfinal gave them something worth beefing about.\nThe Knicks seem to have specifically sought out that matchup, too. In the last game of the group stage, a front-to-back rout of the Orlando Magic, the specific point differential would determine their next opponent. If they won that game by at least 37 points—which they were capable of doing—the Knicks would have faced the Boston Celtics. So they sandbagged the last stretch of the game, letting the Magic outscore them by 16 points in the last six minutes, to line up a quarterfinal against the Hawks instead. The sarcasm from Knicks swingman Josh Hart indicated that the team knew what it was doing.",
          "link": "https://defector.com/trae-young-goes-for-cheap-heat-in-the-knicks-house",
          "publishedOn": "2024-12-12T20:07:37.000Z",
          "wordCount": 6797,
          "title": "Trae Young Goes For Cheap Heat In The Knicks’ House",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2189499275.jpg"
        },
        {
          "id": "https://defector.com/?p=176122",
          "author": "Patrick Redford",
          "description": "In the final NBA Cup quarterfinal, Houston hosted and beat Golden State in an objectively ugly, subjectively very fun 91-90 grindhouse win defined by incredible defense on both sides, yet another late-game Warriors meltdown, and Steve Kerr going totally ballistic after the loss. The game was a pretty illustrative example of a number of larger-order trends in the league this year, from both a gameplay level and broadcasting standpoint, especially at the end.\nWhat happened is the Warriors blew it. They ripped off a trademark third-quarter burst, the only frame in which either team scored more than 25, and nursed a small lead throughout the fourth. The dynamic when the Warriors had the ball involved Golden State desperately running around trying to use Steph Curry's gravity to unzip something somewhere else in the airtight Houston defense before the Rockets forced a shot-clock violation, which they did an incredible eight times on the night (they also forced an eight-second violation). Golden State only so much as hit the rim once in the final three minutes. Houston's offense, by contrast, centered around giving Alperen Sengun the ball and letting him operate in the post. It was honest, physically punishing stuff, old-school principles applied against and alongside hypermodern basketball. Both teams are winning this year with defense and depth, which to me are the two big league-wide stories this season.",
          "link": "https://defector.com/steve-kerr-flips-out-after-latest-warriors-meltdown",
          "publishedOn": "2024-12-12T18:42:38.000Z",
          "wordCount": 6942,
          "title": "Steve Kerr Flips Out After Latest Warriors Meltdown",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2189509705-1.jpg"
        },
        {
          "id": "https://defector.com/?p=176090",
          "author": "Lauren Theisen",
          "description": "While cheering for the Buffalo Sabres has been the bleakest of all possible NHL fan choices over the past 13 years, the experience hasn't been without a few recent glimmers. Despite the league-leading playoff drought, the Sabres have managed to avoid the absolute dregs of the East by putting together a few scrappy hot streaks here and there, inspiring a bit of hope that they can steal an eight seed soon. With big-shot draft picks in Rasmus Dahlin and Owen Power, a strong vet acquired for a former big-shot draft pick in Alex Tuch, the breakout stardom of tall center Tage Thompson, the arrival of yet another young and talented defender in Bowen Byram, and an apparent solution in goal named Ukko-Pekka Luukkonen, there was a scenario in which the Sabres could perhaps take advantage of the Atlantic Division's aging top half and underachieving bottom half.\nFor the first chunk of this season, Buffalo didn't disabuse anyone of that notion. The Sabres won most of their games against worse teams and got breaks in a few others, which, combined with a slow start from the Boston Bruins, had them top-eight by points percentage in the East at Thanksgiving. But ever since they returned from a perfect West Coast trip for eight straight games in the state of New York, they have dutifully undone all that good work. The Sabres have lost every one of these N.Y. games, including seven in Buffalo, with the chilly spell culminating in a 3-2 defeat to the Rangers on Wednesday.",
          "link": "https://defector.com/sabres-still-bad",
          "publishedOn": "2024-12-12T18:24:38.000Z",
          "wordCount": 7805,
          "title": "Sabres Still Bad",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2188843119.jpg"
        },
        {
          "id": "https://defector.com/?p=175974",
          "author": "Chris Thompson",
          "description": "The state of New Jersey requires that online gambling operators notify gamblers when their lifetime deposits have crossed a certain dollar threshold. Small bets add up: A user might think they are wagering reasonably and not fully appreciate that over too short a period of time they've pumped a few paychecks or more into their account. So New Jersey regulations require that gambling operators freeze a user's gambling activity until the user has been confronted with the option \"to self-impose responsible gaming limits\" or close their account, has once again been reminded of the existence of a problem-gambling hotline, and has clicked their way through an acknowledgment. The threshold is $2,500, which seems reasonable enough. Certainly I would want to know if I'd deposited more than two thousand of my own dollars into a DraftKings account, so that I could immediately hurl myself off of a skyscraper.\nA DraftKings user in New Jersey with the handle MDallo1990 hit the $2,500 deposit threshold on or about Feb. 1, 2020, according to attorney Matthew Litt, who represents the user's \"separated spouse\" and two children. MDallo had at that point been on DraftKings for about a month; though this would not have been his first encounter with the problem-gambling hotline number, this would've been the first time that the encounter came with a mandatory freeze on gambling, and a prompt. Unfortunately, MDallo did not immediately \"self-impose responsible gaming limits\" or close his account.",
          "link": "https://defector.com/how-much-protection-do-online-sportsbooks-owe-their-patrons",
          "publishedOn": "2024-12-12T17:12:20.000Z",
          "wordCount": 8259,
          "title": "How Much Protection Do Online Sportsbooks Owe Their Patrons?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/08/GettyImages-1433395204.jpg"
        },
        {
          "id": "https://defector.com/?p=176030",
          "author": "Annie Howard",
          "description": "If you’ve only ever listened to Godspeed You! Black Emperor’s recorded output, you’ve probably never heard “Hope Drone.” The song has no fixed form; instead, it is an evolving being, seemingly fated to live solely in the domain of live performance. You can find ample evidence of the track’s changing character online; fan-recorded bootlegs trace its many manifestations as the band’s opening number since 2010, when the Montreal-based collective reunited after a seven-year hiatus. Through those 15 years, with five recorded albums and countless live performances, “Hope Drone” has been, at once, the most consistent and ever-changing facet of the collective’s repertoire.\nThe word HOPE faded into view as a low bass hum emerged over the loudspeaker, announcing the imminent arrival of the band on stage at Chicago’s Salt Shed on the night of Nov. 8. Over the next dozen minutes, that one word flickered in and out on a piece of looping celluloid as the band began to shape the droning sound into something specific, imbuing the open concept with meaning. If hope is a discipline, as longtime abolitionist Mariame Kaba has taught us, then “Hope Drone” is a persistent exercise in renewing faith in a better world—the Sisyphean act of inching the boulder upwards, only to watch it fall into an abyss of violence that seems to expand each day.",
          "link": "https://defector.com/godspeed-you-black-emperor-works-hard-to-hope",
          "publishedOn": "2024-12-12T16:52:42.000Z",
          "wordCount": 8917,
          "title": "Godspeed You! Black Emperor Works Hard To Hope",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2175063883.jpg"
        },
        {
          "id": "https://defector.com/?p=176034",
          "author": "Drew Magary",
          "description": "Drew Magary’s Thursday Afternoon NFL Dick Joke Jamboroo runs every Thursday at Defector during the NFL season. Got something you wanna contribute? Email the Roo. And buy Drew’s book, The Night The Lights Went Out, through here.\nThe 2024 Minnesota Vikings are not going to win the Super Bowl. Mathematically speaking, they have a definitive chance (4.4 percent, according to FTN) of pulling the feat off, but they remain something of an afterthought among title contenders because of the teams above them (Detroit and Kansas City, most notably), because of their history of coming up short in big moments, and because of their current starting quarterback. This starting quarterback.",
          "link": "https://defector.com/sam-darnold-brought-me-to-football-nirvana",
          "publishedOn": "2024-12-12T16:13:08.000Z",
          "wordCount": 15006,
          "title": "Sam Darnold Brought Me To Football Nirvana",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2188893437.jpg"
        },
        {
          "id": "https://defector.com/?p=175735",
          "author": "Kelsey McKinney",
          "description": "Books take a long time. Writing, editing, and publishing one is slow, laborious work. A book that is sold today probably won’t come out until 2027 at the earliest. So it makes sense that money-grubbing innovator boys have taken aim at book publishing, which is an industry full of words, and decided that the way to disrupt it is by using AI. The dweebiest of these operations is a company called Spines, whose marketing materials feature four men wearing high V-neck branded T-shirts, looking like they are about to ask you if you’re ready for your massage. Spines is planning to disrupt the book industry by publishing—say it with me—EIGHT THOUSAND BOOKS in 2025 using artificial intelligence. \nTheir goal, they say, is to shrink the distance between a book being written and being published by using AI to \"automate proofreading, cover design, metadata optimization and limited translation services.\" For $5,000, Spines claims it can have a manuscript published in three weeks. They have secured $16 million in series A funding. “We want to publish up to 8,000 books next year. The goal is to help a million authors publish their books,” Yehuda Niv, the CEO of Spines, told The Bookseller.",
          "link": "https://defector.com/theres-no-shortcut-to-publishing-a-book",
          "publishedOn": "2024-12-12T14:17:29.000Z",
          "wordCount": 9817,
          "title": "There’s No Shortcut To Publishing A Book",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-1541008831.jpg"
        },
        {
          "id": "https://defector.com/?p=176052",
          "author": "Patrick Redford",
          "description": "City councilors are some of our most straightforwardly American politicians, capable of breathtaking feats of narcissism and corruption, often actively at war with their own constituents, and willing to jump through any hoop as long as the real-estate lobbies and cops tell them to. The relatively low status of the office does nothing to blunt anyone's kookier tendencies, and in fact, it makes them funnier. Someone as stupid as Tito Ortiz makes sense as a city councilor.\nAnyway, I learned about Minneapolis city council member LaTrisha Vetaw today because she pulled off a hell of a performance at a meeting Tuesday night when she tearily read into the record the names of nine police horses who had recently lost their jobs. A quick search yields three other Vetaw facts: she refused to put on the same T-shirt as every other person in the crowd at a Timberwolves playoff game last year; AIPAC wanted her to run against Ilhan Omar; and she had a meltdown this past January when she yelled at fellow city councilors and activists about how horrible unhoused people are.",
          "link": "https://defector.com/they-defunded-the-ponies",
          "publishedOn": "2024-12-11T22:51:26.000Z",
          "wordCount": 5048,
          "title": "They Defunded The Ponies",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-534288872.jpg"
        },
        {
          "id": "https://defector.com/?p=175899",
          "author": "Sabrina Imbler",
          "description": "Imagine, if you would, that a clam was a church. Most of the walls are thick and opaque, protecting the animal's soft insides. But in certain clams called heart cockles, pricks of sunlight stream through the top shell like stained glass, illuminating the tiny organisms dwelling inside the clam. When Dakota McCoy, a biophysicist at the University of Chicago, first shone a light through the upper shell of a heart cockle, she was struck by this comparison. \"Once I lit up that beautiful pinkish shell, I immediately thought, I've seen this before in the U Chicago chapel,\" McCoy wrote in an email.\nThe cockle Corculum cardissa is best known for its profile—the two shells come together to form a heart shape. But McCoy was most intrigued by the clam's celestial skylights, which let in sunlight to sustain the microscopic algae that live inside the mollusk's tissue. McCoy and colleagues recently published a paper in Nature Communications describing how these windows manage to act like fiber optic cables that beam in the good light and keep out the bad, long before any human engineer cracked the code.",
          "link": "https://defector.com/there-are-clam-cathedrals-everywhere-for-those-with-the-eyes-to-see",
          "publishedOn": "2024-12-11T20:59:27.000Z",
          "wordCount": 8379,
          "title": "There Are Clam Cathedrals Everywhere For Those With The Eyes To See",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/IMG_1962_RuiqiLi.jpg"
        },
        {
          "id": "https://defector.com/?p=175946",
          "author": "Giri Nathan",
          "description": "Many people conceive of a favorite restaurant as a place of comfort. You walk in and they remember your order. Maybe they make you feel “at home,” let you go off-menu, indulge you with a free glass of wine or piece of cake. Sounds nice, but I went to my favorite restaurant to be bullied—all my senses battered and burnt out, before I was handed the check and hustled unceremoniously out the door. That was the beauty of Ugly Baby.",
          "link": "https://defector.com/i-loved-how-much-ugly-baby-hated-me",
          "publishedOn": "2024-12-11T20:07:46.000Z",
          "wordCount": 11227,
          "title": "I Loved How Much Ugly Baby Hated Me",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/ugly-baby-salad.jpg"
        },
        {
          "id": "https://defector.com/?p=176006",
          "author": "Defector Staff",
          "description": "Defector is correctly recognized as an authority on hideously expensive holiday wares, but we are also a purveyor of sensible gifting options ourselves! Consider giving someone the gift of blogs this holiday season: Reader and Pal subscriptions can be purchased HERE, and Friend and Friend-of-a-Friend subscriptions to Normal Gossip can be purchased HERE. Like your […]",
          "link": "https://defector.com/give-some-blogs-get-a-calendar",
          "publishedOn": "2024-12-11T19:25:00.000Z",
          "wordCount": 5643,
          "title": "Give Some Blogs, Get A Calendar",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/them-you-defector-gift-guide.jpg"
        },
        {
          "id": "https://defector.com/?p=175987",
          "author": "Ray Ratto",
          "description": "Bill Walsh was the greatest coach in NFL history by public acclaim two decades before Bill Belichick became the greatest coach in NFL history by public acclaim, and Walsh did the post-NFL college turn at Stanford that Belichick is now apparently mulling at North Carolina. Educationally, it was spectacularly meh. Reputationally, it meant nothing. Nobody thinks about Bill Walsh and says, \"Yeah, but he was 17-17-1 the second time he was at Stanford.\" All memories are, after all, selective by definition.\nThat's the real kicker to the fevered Bill-to-UNC rumors, which currently seem more than rumor but something less than fact. The whole affair seems to be powered by one wealthy donor who wants to throw Belichick's resume and his own booster-brained dreams of a dynastic football empire back at Alabama, Notre Dame, Ohio State, and Texas. Belichick is, to nobody's surprise, listening. Nobody turns down money and power cavalierly, and it's always nice to be asked.",
          "link": "https://defector.com/bill-belichick-isnt-the-first-coaching-legend-who-doesnt-know-how-to-quit",
          "publishedOn": "2024-12-11T17:56:17.000Z",
          "wordCount": 6834,
          "title": "Bill Belichick Isn’t The First Coaching Legend Who Doesn’t Know How To Quit",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2177012266.jpg"
        },
        {
          "id": "https://defector.com/?p=175959",
          "author": "Luis Paez-Pumar",
          "description": "Perhaps it is not so impressive for a club that finished in the top four of the Premier League last season to barely beat a struggling RB Leipzig on a late and wickedly deflected goal from, of all people, Ross Barkley. Perhaps that doesn't matter, because while Aston Villa looked rickety at times, it went into Germany and came out 3-2 winners in a match that practically assures that the Lions of Birmingham will advance to the next stage of the Champions League, potentially with a direct spot in the round of 16 as one of the eight automatic qualifiers. It was another brick in the wall of competence Villa has been building since around the time I foolishly called them a mirage last season, and it's the type of win that is as important as it is ho-hum, and perhaps more because it is ho-hum.\n\nhttps://www.youtube.com/watch?v=UOW9sjWv1RA",
          "link": "https://defector.com/aston-villa-is-built-for-this",
          "publishedOn": "2024-12-11T16:56:39.000Z",
          "wordCount": 9445,
          "title": "Aston Villa Is Built For This",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2189257136.jpg"
        },
        {
          "id": "https://defector.com/?p=175730",
          "author": "Maitreyi Anantharaman",
          "description": "If the league’s top teams have offered instructions for building a contender, Valkyries ownership has followed them in the early going. Those instructions, broadly speaking, are to attract and retain top talent, and be well-coached and well-run.",
          "link": "https://defector.com/the-valkyries-expansion-draft-is-prep-for-next-years-free-for-all",
          "publishedOn": "2024-12-11T16:37:44.000Z",
          "wordCount": 7172,
          "title": "The Valkyries’ Expansion Draft Is Prep For Next Year’s Free-For-All",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2188003097.jpg"
        },
        {
          "id": "https://defector.com/?p=174999",
          "author": "Luis Paez-Pumar",
          "description": "This is the time of year when the best, biggest, and most ambitious movies come out. Not Oscar season, but rather that stretch when the halls of streaming services are decked with the brightly lit, thinly disguised advertisements that are the year's new Christmas movies. There are more than 100 new Christmas films to watch this holiday season, and whether that number horrifies or excites you depends upon how much of a freak you are for the festive. Sabrina is proud to say they are a real Christmas freak, and this year they asked some of their colleagues to watch some of the most, uh, available new holiday movies. The third movie in our lineup is Our Little Secret, Lindsay Lohan's triumphant return to a Netflix™ Christmas.\nSabrina Imbler: I hope we all enjoyed watching Our Little Secret over the Thanksgiving holiday. Before we dig into this film, I wanted to ask a broader cultural question. I feel like the festive films of the last few years were dominated by Vanessa Anne Hudgens: The Princess Switch, The Princess Switch: Switched Again, The Princess Switch 3: Romancing the Star, not to mention The Knight Before Christmas. But is there a new Netflix queen of Christmas? This year Lindsay Lohan follows her star turn as an amnesiac in last year’s Falling for Christmas, and I dare say, she might have nabbed the crown! What do y’all think? Is Vanessa’s reign over? Can there be multiple queens?",
          "link": "https://defector.com/defector-watches-a-christmas-movie-our-little-secret",
          "publishedOn": "2024-12-11T14:00:35.000Z",
          "wordCount": 16396,
          "title": "Defector Watches A Christmas Movie: ‘Our Little Secret’",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/Firefox_Screenshot_2024-12-02T23-02-49.101Z.png"
        },
        {
          "id": "https://defector.com/?p=175927",
          "author": "Samer Kalaf",
          "description": "Monday's episode of ESPN FC's Extra Time was briefly disrupted by a sound that very much resembled a fart. Dedicated readers of Defector will recall that this sort of thing happened about three years ago on the same show, although in this instance, the noise was a lot more audible.",
          "link": "https://defector.com/espn-soccer-show-once-again-derailed-by-fart-like-noise",
          "publishedOn": "2024-12-10T20:56:50.000Z",
          "wordCount": 5124,
          "title": "ESPN Soccer Show Once Again Derailed By Fart-Like Noise",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/espnfcfart-pt2.jpg"
        },
        {
          "id": "https://defector.com/?p=175910",
          "author": "Ray Ratto",
          "description": "Spare me your analytics, and your short-attention-span-theatre I-only-remember-what-I-stream clucks. Save your explanations of impact, comparisons with contemporary or historical players or comparative surveys of black ink and gray ink on Baseball Reference. Dick Allen is a Hall of Famer because of the picture. It appeared on the cover of Sports Illustrated in 1972, and shows Allen, resplendent in mutton-chop sideburns and a Nixon-era White Sox uniform, casually hanging an unfiltered heater off his lip while juggling three baseballs in the dugout. If he had Willie Montañez's numbers, he still enters Cooperstown for this alone.\nDick Allen, put simply, is exactly what baseball most craves today—a walking, talking, smoking, juggling, hitting, singing ziggurat of cool. He did stuff in the biggest, boldest ways, and it isn't really his fault that he did them when big and bold were less in fashion among ballplayers than it is now. Allen didn't get into the Hall in its yearly general elections not because of anything he didn’t do on the field but because he was marked with what oldey-timey-and-mostly-whitey sportswriters of the era liked to refer as \"attitude.\" At the time, \"attitude\" could mean anything not specifically Gary Cooper/silent type/modest sideburns/middle American; in Allen’s case, it meant more or less what you’d expect it to mean when applied to a black All-Star who knew his talent and his worth. Allen got the nod for Cooperstown yesterday, from the grandiosely yet redundantly named Classic Baseball Era Committee vote.",
          "link": "https://defector.com/dick-allen-and-dave-parkers-hall-of-fame-election-is-a-victory-for-baseballs-cool-guys",
          "publishedOn": "2024-12-10T20:28:47.000Z",
          "wordCount": 6914,
          "title": "Dick Allen And Dave Parker’s Hall Of Fame Election Is A Victory For Baseball’s Cool Guys",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2057082438.jpg"
        },
        {
          "id": "https://defector.com/?p=175867",
          "author": "Tom Ley",
          "description": "I've been rewatching Lost, which is streaming on Netflix. When I first started this undertaking, I was able to enjoy each episode without commercial interruption. Since then, however, Netflix has started subjecting paying subscribers to its base package to commercials, so now I have to watch Lost with commercials. Whatever. I did that the first time.\nBut here's something that's been driving me crazy: Netflix doesn't put the commercials in the right spot. Lost originally aired on network television, which means each episode was edited specifically to allow for natural transitions into and out of commercial breaks. We all remember how this worked, right? A few times during every episode of Lost, a scene would end on a particularly dramatic note before cutting to the ads. Sawyer is traipsing through the jungle when he hears something rustling the bushes, he raises his gun and waits in fear, suddenly Kate comes bursting out of the bushes! \"What are you doing here?\" he asks. She stares at him for a moment, that signature Lost whooosh noise revs up, and then a commercial for Scrubbing Bubbles starts playing. When the commercial break is over, the show has moved on to a different scene, probably featuring Jack doing something annoying.",
          "link": "https://defector.com/netflix-cant-even-do-commercials-right",
          "publishedOn": "2024-12-10T18:04:04.000Z",
          "wordCount": 5655,
          "title": "Netflix Can’t Even Do Commercials Right",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-1968720532.jpg"
        },
        {
          "id": "https://defector.com/?p=175872",
          "author": "Lauren Theisen",
          "description": "Welcome to Defector Music Club, where a number of our writers get together to dish about an album. Today, Giri Nathan, Patrick Redford, David Roth, and Lauren Theisen explore TV On The Radio's 2004 debut Desperate Youth, Blood Thirsty Babes.\nGiri Nathan: My god, Desperate Youth, Blood Thirsty Babes is 20 years old. And I think it was just now, composing this sentence, that I realized that “blood thirsty” was two words. What was everyone’s first encounter with this album?",
          "link": "https://defector.com/defector-music-club-talks-tv-on-the-radio-on-the-internet",
          "publishedOn": "2024-12-10T17:26:39.000Z",
          "wordCount": 15717,
          "title": "Defector Music Club Talks TV On The Radio On The Internet",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-5464864091.jpg"
        },
        {
          "id": "https://defector.com/?p=175782",
          "author": "Kelsey McKinney",
          "description": "It's a pretty big day for Normal Gossip and Defector! We know everyone loves treats, and today you’re getting three big ones: unhinged cruise ship gossip, our own Kelsey McKinney in the role of guest, and Rachelle Hampton as your brand-new host! What does this all mean? What exactly is changing? Well, you should probably go ahead and listen to the episode! But just to be super helpful we thought we would answer a few more questions about this peaceful transfer of power!",
          "link": "https://defector.com/welcome-to-the-new-era-of-normal-gossip",
          "publishedOn": "2024-12-10T17:02:16.000Z",
          "wordCount": 11352,
          "title": "Welcome To The New Era Of Normal Gossip",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/Normal_Gossip_2024_Portraits_35_jpg.jpg"
        },
        {
          "id": "https://defector.com/?p=175641",
          "author": "Patrick Redford",
          "description": "I can't ease you into this one, so: Haliey Welch, colloquially known as the \"Hawk Tuah girl,\" launched a bespoke cryptocurrency token called HAWK last Wednesday, the same day she told Fortune it was \"not just a cash grab\" and her manager cut off a question in the same interview about its legality (because, he said, \"We don’t want to break securities laws\"), and hours before before the vast majority of HAWK tokens were sold off in what appears to be a textbook example of a pump-and-dump scheme. This reads, on first glance, as a story about some fundamentally ephemeral viral bullshit; it isn't not about viral bullshit, though I'd argue it's worth taking seriously as an extreme yet representative example of the new paradigm of online fame, social media, and a certain irradiated, newly relevant segment of culture.\nConsider how Welch got into this position. This past summer, she answered a man-on-the-street question (\"What's one move in bed that makes a man go crazy every time?\") with an inspired onomatopoeic rendition of \"[spitting] on that thing.\" The speed at which the interview saturated the social internet was only matched by thoroughness with which Welch capitalized on it. Within a month, she'd begun selling t-shirts, signed an agent and a manager, launched herself as a public figure in an interview with a Barstool Sports host named Brianna Chickenfry, and sang on stage with country star Zach Bryan. The following month, she threw out the first pitch at a Mets game.",
          "link": "https://defector.com/the-hawk-tuah-memecoin-rug-pull-is-the-apotheosis-of-bag-culture",
          "publishedOn": "2024-12-10T16:15:39.000Z",
          "wordCount": 9713,
          "title": "The Hawk Tuah Memecoin Rug Pull Is The Apotheosis Of Bag Culture",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/Screenshot-2024-12-08-at-12.46.55 PM-e1733847416397.jpg"
        },
        {
          "id": "https://defector.com/?p=175863",
          "author": "Drew Magary",
          "description": "Time for your weekly edition of the Defector Funbag. Got something on your mind? Email the Funbag. And buy Drew’s book, The Night The Lights Went Out, while you’re at it. Today, we're talking about procrastination, toilet paper art, three-point dunks, and more.\nYour letters:",
          "link": "https://defector.com/aaron-rodgers-is-the-last-glory-boy-standing",
          "publishedOn": "2024-12-10T15:56:04.000Z",
          "wordCount": 16514,
          "title": "Aaron Rodgers Is The Last Glory Boy Standing",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2189056018.jpg"
        },
        {
          "id": "https://defector.com/?p=175541",
          "author": "Dan McQuade",
          "description": "Did you hear about the $3.1 million bet that was placed on the Philadelphia Eagles for Sunday's game against Carolina? You probably did, and if you didn't it sure wasn't for a lack of effort from the sports media. The story made the aggregation rounds extensively. ESPN, itself a casino operator, wrote about the money-line bet last week. Thanks to the Eagles' closer-than-expected 22-16 win over the Panthers, the unidentified gambler made more than $442,000 on the -700 wager.\nThese kinds of stories are pretty common: The Large Floyd Mayweather Sports Bet is enough of a story there is a history of his wagers on the website Legal Sports Betting dot com. These predate the mass legalization of sports gambling that began when the Supreme Court tossed out a federal law banning such bets in 2018. This particular $3.1 million bet was mostly notable for being exceptionally large, and I guess also for involving the Eagles. Risking $3.1 million on a thing having to do with Philadelphia, huh? Good luck!",
          "link": "https://defector.com/sports-gambling-thrives-on-clicks-not-community",
          "publishedOn": "2024-12-10T14:09:26.000Z",
          "wordCount": 9116,
          "title": "Sports Gambling Thrives On Clicks, Not Community",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/xavier-legette-dropped-pass-panthers-eagles-bet.jpg"
        },
        {
          "id": "https://defector.com/?p=175755",
          "author": "Albert Burneko",
          "description": "Everybody I know has had theories and/or lurid fantasies about the masked individual who shot and killed United Healthcare CEO Brian Thompson on a Manhattan street on Dec. 4, hopped on a getaway bicycle, and then eluded quick capture for (at least) four days. Mine was that anybody who had their shit together enough to anticipate Thompson's walking route to an early-morning shareholders meeting, to calmly gun the executive down in front of onlookers, and to make a clean escape from the scene before anyone could apprehend or recognize or even follow him, would also have their shit together enough to have pre-booked a quick and frictionless exit from the United States, taking advantage of New York City's numerous, uh, points of egress or whatever. Assuming a tight schedule and reasonable but not desperate haste, I thought the assassin could fairly straightforwardly chuck the gun and (reported) fake ID and board an international flight out of the city under his own real name within a couple hours of the shooting. In that case he'd be gone long before the police had anything more to search for than \"a person, possibly blurry, possibly wearing a coat.\" I am not too ashamed to admit that I kind of hoped for this: Then we would never have to go through the exhausting and familiar ritual of trying to unpack the killer's politics.\nAs for the NYPD, the nation's largest and most extravagantly funded police force apparently had its own theory. Namely, that the masked assassin, having gunned down a public figure in the middle of a city of millions, at the nexus of innumerable flight networks, rail lines, and highways, was now crouching under or possibly directly behind a bush adjacent to a walking path in Central Park, perhaps while chanting \"I am the assassin.\"",
          "link": "https://defector.com/i-would-not-take-my-post-assassination-meal-at-an-altoona-mcdonalds-but-i-guess-im-built-different",
          "publishedOn": "2024-12-09T21:29:25.000Z",
          "wordCount": 8811,
          "title": "I Would Not Take My Post-Assassination Meal At An Altoona McDonald’s, But I Guess I’m Built Different",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/hamburglar.jpeg"
        },
        {
          "id": "https://defector.com/?p=175732",
          "author": "Samer Kalaf",
          "description": "It feels like each week, as part of Roger Goodell's new world order, the nation is required to watch the Kansas City Chiefs play down to their competition and squeak out a win. That feeling is based in some reality: Kansas City is 10-0 in one-score games this season, and many of those have been nationally broadcast affairs. But it might be useful to create a distinction between closing and underachieving.\nEven if there is a requisite amount of luck to these razor-thin wins, the Chiefs are talented, well-coached, and deeply familiar with crunch time. Mostly, they excel at error-free football when it matters, and they are good on pouncing on opponents' mistakes. These are the back-to-back Super Bowl champions, after all. So why does a team of this caliber need a field goal at the gun to beat the lowly Carolina Panthers, as they did a couple of weeks ago?",
          "link": "https://defector.com/the-chiefs-can-make-a-last-second-win-less-exciting-than-filing-taxes",
          "publishedOn": "2024-12-09T20:09:08.000Z",
          "wordCount": 6231,
          "title": "The Chiefs Can Make A Last-Second Win Less Exciting Than Filing Taxes",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2188416415.jpg"
        },
        {
          "id": "https://defector.com/?p=175739",
          "author": "Israel Daramola",
          "description": "Ladies and gentlemen, we have ourselves a playoff.\n\nhttps://youtu.be/Pgy-FQLfr7M?feature=shared",
          "link": "https://defector.com/we-finally-have-our-college-football-playoff",
          "publishedOn": "2024-12-09T19:47:30.000Z",
          "wordCount": 6297,
          "title": "We Finally Have Our College Football Playoff",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-1893311804.jpg"
        },
        {
          "id": "https://defector.com/?p=175734",
          "author": "Chris Thompson",
          "description": "Juan Soto is a Met. He deserves this enormous raise, for being one of the best players of this or any other generation. He also deserves this spotlight, for being insanely cool and charismatic, and also young enough to be the face of baseball for a length of time that will take many of the bloggers for this website into eligibility for full membership in AARP. This is a real planting-an-oak-seedling type of deal for Mets owner Steve Cohen, who is 68 years old: There's a very solid chance Cohen will be dead before Soto collects the final paycheck of this contract, which will arrive sometime in 2039. The deal does more than increase the chances of Cohen owning a world champion: It changes the meaning of the word \"Mets.\" The Mets have been made.\nSoto played the first four years of his career for a cheapskate middle-class baseball team, and then was dealt to a nouveau riche big-spending club. He spent last season playing for a true blue-blood, and now, like boats and private planes and beachfront property, he is finally relegated to the very most exclusive asset class, permanently out of reach for fans of teams whose owners refuse to spend the market rate for top players. It doesn't much matter what happens next: If the Mets bomb and Soto becomes expendable a third of the way into this deal, he will never ever ever play for the cheapies. Even if the Mets decided that some package of young hotshot prospects was worth a swap, they could not ever convince, say, the Lerners to pay Soto's salary.",
          "link": "https://defector.com/juan-sotos-megadeal-ends-a-long-goodbye",
          "publishedOn": "2024-12-09T18:12:42.000Z",
          "wordCount": 7884,
          "title": "Juan Soto’s Megadeal Ends A Long Goodbye",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-989688230.jpg"
        },
        {
          "id": "https://defector.com/?p=175366",
          "author": "Sabrina Imbler",
          "description": "Researchers wondered how a bag with a mouth but no anus could have moved around its environment or managed to eat.",
          "link": "https://defector.com/was-this-half-billion-year-old-wrinkled-sack-with-no-anus-previously-believed-to-be-our-earliest-ancestor-actually-a-baby-penis-worm",
          "publishedOn": "2024-12-09T16:42:58.000Z",
          "wordCount": 11798,
          "title": "Was This Half-Billion-Year-Old Wrinkled Sack With No Anus, Previously Believed To Be Our Earliest Ancestor, Actually A Baby Penis Worm?",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/anterior.png"
        },
        {
          "id": "https://defector.com/?p=175098",
          "author": "Maitreyi Anantharaman",
          "description": "This week’s puzzle was constructed by Daniel Hrynick and edited by Hoang-Kim Vu. Dan lives in Winnipeg, where he works as a laborer for Public Works. When he was a teenager, he played a version of Scrabble that came in a box of some General Mills cereal (he wants to say Honey Nut Cheerios). He used to set the computer opponent to the hardest difficulty and use the in-game cheats every turn. He has a suspicion that learning Scrabble that way and seeing words like UMIAQ, CWM and CRWTH is what eventually turned him on to crossword solving and eventually construction.\nDefector crosswords, launched in partnership with our friends at AVCX, run every Monday. If you’re interested in submitting a puzzle to us, you can read our guidelines HERE.",
          "link": "https://defector.com/the-crossword-dec-9-added-dimension",
          "publishedOn": "2024-12-09T16:01:08.000Z",
          "wordCount": 5051,
          "title": "The Crossword, Dec. 9: Added Dimension",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-1496735246.jpg"
        },
        {
          "id": "https://defector.com/?p=175697",
          "author": "Barry Petchesky",
          "description": "It is the day after Juan Soto agreed to join the New York Mets in free agency rather than rejoin the Yankees, and as such you are likely to hear or read Yankees fans' reactions to this development, if you have not already. This is not necessarily because there are a lot of them, but rather because they are very loud and have a baseline assumption that you are interested in what they have to say. There is not much you can do about that. What you can do is prepare with this helpful guide to the various flavors of Yankees fan cope. Once you are educated, you will be able to look beyond the cockiness and bargaining and see the huffing, puffing, and weeping beneath.\n(Full disclosure: I am a Yankees fan and I'm trying to convince myself of all of these, and it's not working.)",
          "link": "https://defector.com/a-guide-to-yankees-fans-juan-soto-cope",
          "publishedOn": "2024-12-09T15:39:17.000Z",
          "wordCount": 6585,
          "title": "A Guide To Yankees Fans’ Juan Soto Cope",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2181633119.jpg"
        },
        {
          "id": "https://defector.com/?p=175705",
          "author": "Tom Scocca",
          "description": "Welcome to Margin of Error, a politics column from Tom Scocca, editor of the Indignity newsletter, examining the apocalyptic politics, coverage, and consequences of Campaign 2024.\nIs Pete Hegseth in trouble? Midway through the week, the major newspapers were reporting that Donald Trump was considering replacing the Fox News personality with Ron DeSantis as his nominee for secretary of defense. When a leak like that comes out about someone, as a rule, it's over. But then Friday morning, Trump posted \"Pete is a WINNER, and there is nothing that can be done to change that!!!\" and Hegseth made it through the weekend with his nomination intact.",
          "link": "https://defector.com/what-makes-a-scandal",
          "publishedOn": "2024-12-09T15:19:03.000Z",
          "wordCount": 8699,
          "title": "What Makes A Scandal",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/hegseth1.jpeg"
        },
        {
          "id": "https://defector.com/?p=175665",
          "author": "David Roth",
          "description": "There were a number of factors that went some way toward explaining the record-setting $700 million contract that Shohei Ohtani signed with the Los Angeles Dodgers last winter. There's the inescapably abstract fact of Ohtani, a player whose only adequate scouting comparison has always been literally Babe Ruth and who as a result has always seemed more like an unusually good-natured demigod than he was like even the most elite of his peers. And there is also the contract itself, the deferral-laden format of which was either clever or cynical depending upon your perspective, but which was undeniably and utterly unlike any other free-agent contract. The deferrals in the deal were not new—the Dodgers have been pioneers in this space; they had signed Mookie Betts and Freddie Freeman to deals with significant deferred money before that, and signed Blake Snell to another just last week. But the extent to which Ohtani's money was deferred was unprecedented and, again, worked to mystify the deal in ways that went beyond those inherent to the sunny-sided godhead that signed the dotted line. The deal was awe-inspiring in all the ways you'd expect a record deal to be, but it was also complicated.\nThis is all worth mentioning here, in a story about the record-setting free-agent contract that Juan Soto and the New York Mets announced on Sunday night, because Soto's deal is so uncomplicated by comparison. There were some extenuating circumstances here, too—Soto's young age and broad-ranging excellence, the presence of New York's two rich and self-conscious franchises as the 26-year-old slugger's foremost suitors—but the contract itself is relatively straightforward where Ohtani's was elaborate. Which, I should note before we finally get to the paragraph with the numbers in it, does not make any of it any easier to process.",
          "link": "https://defector.com/juan-soto-got-super-duper-mega-paid",
          "publishedOn": "2024-12-09T14:00:34.000Z",
          "wordCount": 9367,
          "title": "Juan Soto Got Super-Duper-Mega Paid",
          "imageUrl": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/12/GettyImages-2113291690.jpg"
        }
      ]
    },
    {
      "title": "Joe's Weather Blog | In-depth Kansas City forecasts | FOX4KC",
      "feedUrl": "http://fox4kc.com/category/weather/weather-blog/feed/",
      "siteUrl": "https://fox4kc.com",
      "articles": [
        {
          "id": "https://fox4kc.com/?p=3758740",
          "author": "Joe Lauria",
          "description": "A mix of clouds and some sunshine is starting our cold morning here in KC as temperatures expectedly tanked overnight into the teens again are greeting our Friday morning. The good news is that temperatures, especially this afternoon and overnight will warm nicely into the 40° range (or warmer overnight), so milder air to the [...]",
          "link": "https://fox4kc.com/email-alerts/joes-weather-blog-email-alerts/joes-blog-ice-for-some-rain-for-others-fri-12-13/",
          "publishedOn": "2024-12-13T15:37:32.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Ice for some...rain for others (FRI-12/13)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/12135.png?w=900",
            "type": "image/png",
            "length": "2229470"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/12135.png?w=900"
        },
        {
          "id": "https://fox4kc.com/?p=3757660",
          "author": "Joe Lauria",
          "description": "It's a chilly grayish start to the day in the region but hopefully we'll see more sunshine to bring temperatures above freezing later today. These colder air masses that have been moving through the area are somewhat impressive considering no snow is on the ground anywhere around the region. IF there would've been snow cover, [...]",
          "link": "https://fox4kc.com/email-alerts/joes-weather-blog-email-alerts/joes-blog-active-pattern-but-still-no-snow-12-12/",
          "publishedOn": "2024-12-12T15:43:59.000Z",
          "wordCount": null,
          "title": "Joe's Blog: Active pattern but still no snow (12/12)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/12128.png?w=900",
            "type": "image/png",
            "length": "671249"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/12128.png?w=900"
        },
        {
          "id": "https://fox4kc.com/?p=3756323",
          "author": "Joe Lauria",
          "description": "A chilly start to the after a few patches of flurries and some light snow briefly moved through the area overnight. Temperatures are dropping a bit this morning as well as colder air from the north and northwest invades that area and despite sunshine today it's going to be a colder day overall lingering into [...]",
          "link": "https://fox4kc.com/email-alerts/joes-weather-blog-email-alerts/joes-blog-a-bit-more-wintry-before-a-warm-up-wed-12-11/",
          "publishedOn": "2024-12-11T15:31:15.000Z",
          "wordCount": null,
          "title": "Joe's Blog: A bit more wintry before a warm up (WED-12/11)",
          "enclosure": {
            "url": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/12114.png?w=558",
            "type": "image/png",
            "length": "872098"
          },
          "imageUrl": "https://fox4kc.com/wp-content/uploads/sites/16/2024/12/12114.png?w=558"
        }
      ]
    },
    {
      "title": "Kansas City Royals – MLB Trade Rumors",
      "feedUrl": "https://www.mlbtraderumors.com/kansas-city-royals/feed",
      "siteUrl": "https://www.mlbtraderumors.com",
      "articles": [
        {
          "id": "https://www.mlbtraderumors.com/?p=834094",
          "author": "Darragh McDonald",
          "description": "The 2024 Rule 5 draft took place this afternoon at the Winter Meetings in Dallas. The results of the draft are below. As a refresher, the Rule 5 draft is a way for players potentially talented enough for the big leagues but blocked by their current clubs to find opportunities elsewhere. Any players that were…",
          "link": "https://www.mlbtraderumors.com/2024/12/2024-rule-5-draft-results.html",
          "publishedOn": "2024-12-11T19:35:13.000Z",
          "wordCount": 7622,
          "title": "2024 Rule 5 Draft Results",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/12/Shane_Smith_Brewers-1024x720.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=834076",
          "author": "Mark Polishuk",
          "description": "After a solid season in the Royals’ bullpen, left-hander Angel Zerpa is drawing trade attention from rival teams, MLB.com’s Anne Rogers writes.  There is no sense a deal is close or even if Kansas City is open to moving Zerpa, but Rogers notes that the Royals could deal from what seems to be a surplus…",
          "link": "https://www.mlbtraderumors.com/2024/12/royals-receiving-trade-interest-in-angel-zerpa.html",
          "publishedOn": "2024-12-11T13:26:32.000Z",
          "wordCount": 3463,
          "title": "Royals Receiving Trade Interest In Angel Zerpa",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/12/AngelZerpa-2024-1024x730.jpg"
        },
        {
          "id": "https://www.mlbtraderumors.com/?p=833549",
          "author": "Leo Morgenstern",
          "description": "Jonathan India spent the vast majority of his tenure with the Reds playing second base. Michael Massey has also been a primary second baseman throughout his first three seasons with the Royals. Now that India and Massey both play for Kansas City, Royals manager Matt Quatraro will have to be creative to get them both…",
          "link": "https://www.mlbtraderumors.com/2024/12/jonathan-india-michael-massey-willing-to-play-left-field-for-royals.html",
          "publishedOn": "2024-12-09T22:10:37.000Z",
          "wordCount": 3547,
          "title": "Jonathan India, Michael Massey Willing To Play Left Field For Royals",
          "imageUrl": "https://cdn.mlbtraderumors.com/files/2024/12/USATSI_24569274-1024x679.jpg"
        }
      ]
    },
    {
      "title": "local food",
      "feedUrl": "https://www.kcur.org/tags/local-food.rss",
      "siteUrl": "https://www.kcur.org/tags/local-food",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}